[
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：マイケル、ゾーイ、そしてイーサン。マイケルは「イーサンは騎士であるのは、マイケルが騎士である場合に限る」と言っているのが聞かれました。ゾーイは「ゾーイは騎士であるか、イーサンは騎士である」と述べました。イーサンは「マイケルはならず者であるのは、ゾーイがならず者である場合に限る」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルは騎士です  \n(2) ゾーイは騎士です  \n(3) イーサンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：マイケル、メイソン、そしてジェイコブ。マイケルは「メイソンは騎士ではない」とコメントしました。メイソンは「マイケルは騎士で、ジェイコブはならず者だ」とコメントしました。ジェイコブは「もしマイケルが騎士なら、ジェイコブは騎士だ」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルは騎士です  \n(2) メイソンはならず者です  \n(3) ジェイコブは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ルーカス、ハーパー、そしてアメリア。ルーカスはハーパーがならず者ではないと表現しました。ハーパーの発言によれば、「ハーパーはアメリアがならず者である場合に限り騎士です」。アメリアは「ハーパーは騎士ではない」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスは騎士です  \n(2) ハーパーは騎士です  \n(3) アメリアはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：オーウェン、ジョセフ、そしてソフィア。オーウェンは「ジョセフは騎士か、ソフィアは騎士だ」と述べました。「オーウェンはならず者である場合、ソフィアは騎士である」とジョセフは宣言しました。「もしジョセフがならず者なら、ジョセフは騎士だ」とソフィアは主張しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンはならず者です  \n(2) ジョセフはならず者です  \n(3) ソフィアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：アビゲイル、スカーレット、そしてイヴリン。アビゲイルの言葉によれば、「アビゲイルは騎士である場合に限り、イヴリンは騎士である」。スカーレットは「アビゲイルは騎士だ」と言いました。イヴリンによると、「スカーレットは騎士ではない」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アビゲイルはならず者です  \n(2) スカーレットはならず者です  \n(3) イヴリンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ペネロペ、マシュー、ビクトリア。「ペネロペは騎士で、マシューは騎士です」とペネロペは主張しました。マシューは「ビクトリアはならず者で、ビクトリアは騎士です」と言っているのが聞かれました。ビクトリアは「もしマシューが騎士なら、マシューはならず者です」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペはならず者です  \n(2) マシューはならず者です  \n(3) ビクトリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エミリー、リアム、そしてエリザベス。エミリーによると、「エリザベスは騎士か、エリザベスはならず者です」。リアムは、エリザベスがならず者であればエミリーは騎士だと言いました。エリザベスは「リアムはならず者です」と言いました。では、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) エミリーは騎士です  \n(2) リアムは騎士です  \n(3) エリザベスはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：マイケル、エイヴァ、そしてヘンリー。マイケルの言葉によれば、「エイヴァはならず者か、エイヴァは騎士です」。エイヴァは「マイケルはならず者ではありません」と言いました。ヘンリーの言葉では、「マイケルは騎士です」。では、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) マイケルは騎士です  \n(2) エイヴァは騎士です  \n(3) ヘンリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：オリバー、アレクサンダー、そしてメイソン。「アレクサンダーはならず者か、アレクサンダーは騎士です」とオリバーが言いました。「メイソンはならず者ではありません」とアレクサンダーが言いました。メイソンは「メイソンは騎士か、オリバーは騎士です」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリバーは騎士です  \n(2) アレクサンダーは騎士です  \n(3) メイソンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：リリー、サミュエル、そしてソフィア。リリーの発言はこうです：「ソフィアは騎士か、サミュエルは騎士です」。サミュエルはこう言いました：「ソフィアは騎士か、リリーはならず者です」。ソフィアはこう述べました：「もしサミュエルがならず者なら、サミュエルは騎士です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーは騎士です  \n(2) サミュエルは騎士です  \n(3) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：シャーロット、ルーク、そしてリアム。シャーロットは、ルークがならず者であるのはリアムがならず者である場合に限ると述べました。ルークの言葉では、「シャーロットは騎士ではない」と言いました。「シャーロットはならず者だ」とリアムは宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットは騎士です  \n(2) ルークはならず者です  \n(3) リアムはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：セバスチャン、マシュー、そしてローガン。セバスチャンは「ローガンはならず者か、セバスチャンは騎士だ」と言っているのが聞かれました。マシューは「もしローガンが騎士なら、セバスチャンはならず者だ」と言いました。ローガンは「マシューはならず者ではない」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) セバスチャンはならず者です  \n(2) マシューは騎士です  \n(3) ローガンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：リリー、ハーパー、そしてルーク。リリーは「ハーパーはならず者か、ルークは騎士です」と言っているのが聞かれました。ハーパーによれば、「もしリリーがならず者なら、ルークはならず者です」とのことです。ルークは「リリーは騎士であり、リリーはならず者です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーはならず者です  \n(2) ハーパーは騎士です  \n(3) ルークはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ジェームズ、アビゲイル、そしてエイヴァ。ジェームズは「アビゲイルは騎士だ」と言いました。「アビゲイルは騎士であるのは、ジェームズが騎士である場合に限る」とアビゲイルは主張しました。エイヴァはアビゲイルが騎士ではないと表現しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズは騎士です  \n(2) アビゲイルは騎士です  \n(3) エイヴァはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ビクトリア、ウィリアム、そしてアリア。ビクトリアは「アリアはならず者か、アリアは騎士です」と述べました。ウィリアムは「ビクトリアはならず者か、アリアはならず者です」と表現しました。「ウィリアムは騎士か、ウィリアムはならず者です」とアリアは宣言しました。さて、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ビクトリアは騎士です  \n(2) ウィリアムはならず者です  \n(3) アリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：セバスチャン、シャーロット、そしてライリー。セバスチャンは「ライリーはならず者か、セバスチャンは騎士だ」と述べました。「もしセバスチャンが騎士なら、シャーロットは騎士だ」とシャーロットが言いました。ライリーの言葉では、「セバスチャンはならず者であるのは、ライリーが騎士である場合に限る」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) セバスチャンはならず者です  \n(2) シャーロットは騎士です  \n(3) ライリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：オーウェン、ジェイコブ、そしてアメリア。オーウェンは、ジェイコブは騎士ではないと言いました。ジェイコブは、「アメリアがならず者なら、オーウェンは騎士だ」と言いました。アメリアは、「オーウェンが騎士なら、オーウェンはならず者だ」とコメントしました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンはならず者です  \n(2) ジェイコブは騎士です  \n(3) アメリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：アレクサンダー、ルーカス、そしてダニエル。「ルーカスはならず者ではない」 - アレクサンダー。ルーカスはあなたにダニエルがならず者ではないと言いました。「ルーカスはダニエルが騎士である場合に限り騎士である」 - ダニエル。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アレクサンダーは騎士です  \n(2) ルーカスは騎士です  \n(3) ダニエルは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：セバスチャン、アリア、そしてベンジャミン。セバスチャンは「アリアはならず者か、セバスチャンは騎士だ」と主張しました。アリアは「セバスチャンはならず者ではない」と言いました。「セバスチャンは騎士か、ベンジャミンは騎士だ」とベンジャミンは宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) セバスチャンは騎士です  \n(2) アリアは騎士です  \n(3) ベンジャミンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ダニエル、イーサン、そしてライリー。ダニエルは、イーサンがならず者であるか、ライリーがならず者であると言いました。イーサンは、ダニエルが騎士であると言いました。「ダニエルは騎士である場合に限り、ダニエルはならず者である」 - ライリー。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルは騎士です  \n(2) イーサンは騎士です  \n(3) ライリーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エリザベス、ゾーイ、そしてメイソン。エリザベスは言いました。「メイソンは騎士か、ゾーイは騎士です。」ゾーイは指摘しました。「メイソンはならず者である場合、メイソンは騎士です。」メイソンは宣言しました。「エリザベスはならず者か、エリザベスは騎士です。」さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスは騎士です  \n(2) ゾーイはならず者です  \n(3) メイソンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ハーパー、エミリー、そしてアビゲイル。ハーパーは「アビゲイルは騎士で、エミリーはならず者だ」とコメントしました。エミリーは「アビゲイルは騎士だ」と述べました。アビゲイルは「ハーパーはならず者か、アビゲイルは騎士だ」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーはならず者です  \n(2) エミリーは騎士です  \n(3) アビゲイルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ローガン、ルーカス、そしてソフィア。ローガンは「ソフィアは騎士だ」と言いました。ルーカスは「もしソフィアがならず者なら、ローガンは騎士だ」と言いました。ソフィアは「ローガンはルーカスが騎士である場合に限りならず者だ」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンはならず者です  \n(2) ルーカスはならず者です  \n(3) ソフィアはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：シャーロット、ミア、そしてイヴリン。シャーロットは「イヴリンは騎士か、ミアはならず者だ」と言いました。ミアによれば「シャーロットは騎士です」とのことです。イヴリンは「シャーロットはならず者である場合、ミアもならず者である」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットは騎士です  \n(2) ミアは騎士です  \n(3) イヴリンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：グレース、ペネロペ、シャーロット。「もしペネロペが騎士なら、ペネロペはならず者だ」とグレースは主張しました。ペネロペの言葉では、「グレースはならず者か、グレースは騎士です」。シャーロットは「ペネロペはならず者です」と主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) グレースはならず者です  \n(2) ペネロペは騎士です  \n(3) シャーロットはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エリザベス、スカーレット、そしてシャーロット。エリザベスの発言は、「シャーロットは騎士です」。スカーレットは、「シャーロットはならず者です」と述べました。シャーロットは、「エリザベスは騎士であるか、スカーレットは騎士です」とコメントしました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスは騎士です  \n(2) スカーレットはならず者です  \n(3) シャーロットは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：オリビア、ハーパー、そしてイーサン。オリビアは「オリビアは騎士であるか、ハーパーはならず者である」と言いました。ハーパーは「イーサンはならず者であるのは、オリビアが騎士である場合に限る」と述べました。イーサンの発言は「ハーパーは騎士である」です。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアはならず者です  \n(2) ハーパーは騎士です  \n(3) イーサンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：イヴリン、ジョセフ、そしてエミリー。「ジョセフは騎士であるのは、エミリーがならず者である場合に限る」とイヴリンが言いました。ジョセフは、エミリーが騎士であると言いました。エミリーによれば、「ジョセフは騎士であるか、イヴリンはならず者である」。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンはならず者です  \n(2) ジョセフは騎士です  \n(3) エミリーは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：スカーレット、エイヴァ、そしてベンジャミン。スカーレットは「ベンジャミンは騎士だ」と言っているのが聞かれました。エイヴァはスカーレットがならず者であり、スカーレットが騎士であると表現しました。ベンジャミンの言葉では、「ベンジャミンは騎士であるのは、スカーレットがならず者である場合に限る」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) スカーレットはならず者です  \n(2) エイヴァはならず者です  \n(3) ベンジャミンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ダニエル、イザベラ、そしてビクトリア。「ダニエルはイザベラが騎士である場合に限り、騎士です」とダニエルは宣言しました。「ダニエルは騎士です」 - イザベラ。ビクトリアは、イザベラがならず者であり、イザベラが騎士であると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルは騎士です  \n(2) イザベラは騎士です  \n(3) ビクトリアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：リアム、ルーク、そしてマシュー。リアムは言いました。「マシューはならず者であるのは、ルークがならず者である場合に限る。」ルークは言いました。「もしマシューが騎士なら、マシューはならず者です。」マシューは宣言しました。「ルークは騎士であるか、ルークはならず者である。」では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムはならず者です  \n(2) ルークはならず者です  \n(3) マシューは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ノア、アメリア、そしてイザベラ。ノアは「イザベラは騎士である場合に限り、イザベラはならず者である」と述べました。アメリアは「ノアはならず者ではない」と述べました。イザベラは「アメリアはならず者であるか、イザベラは騎士である」と述べました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアはならず者です  \n(2) アメリアはならず者です  \n(3) イザベラは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ライリー、ミア、そしてマシュー。ライリーは言いました。「ミアはならず者か、マシューはならず者です。」ミアは主張しました。「マシューは騎士です。」マシューは宣言しました。「マシューは騎士で、ライリーも騎士です。」では、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) ライリーは騎士です  \n(2) ミアはならず者です  \n(3) マシューはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：オーロラ、シャーロット、そしてジャック。オーロラは「ジャックは騎士か、シャーロットはならず者です」と述べました。シャーロットによれば、「オーロラは騎士ではありません」。ジャックは「オーロラは騎士ではありません」とコメントしました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーロラは騎士です  \n(2) シャーロットはならず者です  \n(3) ジャックはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：スカーレット、ジェイコブ、そしてエイデン。スカーレットは言いました。「エイデンは騎士か、スカーレットは騎士です」。ジェイコブは言いました。「エイデンは騎士か、スカーレットは騎士です」。エイデンは言いました。「スカーレットはならず者か、ジェイコブは騎士です」。さて、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) スカーレットは騎士です  \n(2) ジェイコブは騎士です  \n(3) エイデンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ダニエル、ソフィア、そしてリアム。ダニエルの発言はこうです：「もしリアムが騎士なら、ソフィアも騎士です」。ソフィアは言いました：「リアムはならず者か、リアムは騎士です」。リアムは主張しました：「ソフィアはならず者です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルは騎士です  \n(2) ソフィアは騎士です  \n(3) リアムはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エイブリー、ビクトリア、そしてイザベラ。エイブリーは「イザベラはならず者ではない」と言いました。「エイブリーはならず者ではない」とビクトリアが宣言しました。イザベラは「ビクトリアは騎士であるか、エイブリーはならず者である」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーは騎士です  \n(2) ビクトリアは騎士です  \n(3) イザベラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ベンジャミン、オリビア、そしてジョセフ。ベンジャミンは「オリビアが騎士なら、オリビアはならず者だ」と言いました。オリビアは「ジョセフは騎士か、ベンジャミンは騎士だ」と宣言しました。ジョセフは「ジョセフは騎士か、ベンジャミンは騎士だ」と主張しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンはならず者です  \n(2) オリビアは騎士です  \n(3) ジョセフは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：デイビッド、メイソン、そしてハーパー。「もしデイビッドが騎士なら、メイソンも騎士だ」とデイビッドは言いました。メイソンは「デイビッドは騎士だ」と述べました。ハーパーは「デイビッドは騎士か、ハーパーは騎士だ」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドは騎士です  \n(2) メイソンは騎士です  \n(3) ハーパーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ジェームズ、ソフィア、そしてイヴリン。「イヴリンは騎士か、イヴリンはならず者です」とジェームズが言いました。ソフィアは、「ソフィアは騎士で、ジェームズはならず者です」と指摘しました。イヴリンの発言では、「ソフィアは騎士で、ジェームズはならず者です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズは騎士です  \n(2) ソフィアはならず者です  \n(3) イヴリンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：オーウェン、ウィリアム、そしてオーロラ。オーウェンは「オーロラは騎士か、ウィリアムは騎士です」と述べました。ウィリアムは「オーウェンが騎士なら、オーウェンはならず者です」と述べました。オーロラは「ウィリアムが騎士なら、オーウェンは騎士です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンは騎士です  \n(2) ウィリアムはならず者です  \n(3) オーロラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ノア、ジェイコブ、そしてソフィア。ノアの発言はこうです：「もしソフィアが騎士なら、ジェイコブは騎士です」。ジェイコブは、もしソフィアがならず者なら、ノアは騎士だと表現しました。ソフィアは、ノアが騎士であるか、ソフィアが騎士であると言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアは騎士です  \n(2) ジェイコブは騎士です  \n(3) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：シャーロット、ヘンリー、そしてライリー。シャーロットは「ヘンリーは騎士です」と言いました。ヘンリーは「シャーロットはならず者であるのは、ヘンリーが騎士である場合に限る」と主張しました。ライリーは「ヘンリーがならず者であれば、シャーロットは騎士です」とコメントしました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットはならず者です  \n(2) ヘンリーはならず者です  \n(3) ライリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ジャック、メイソン、そしてダニエル。ジャックは、「ダニエルはならず者であるのは、ダニエルが騎士である場合に限る」と言いました。メイソンは、「ダニエルは騎士であるのは、メイソンが騎士である場合に限る」と述べました。ダニエルは、「ジャックは騎士であるのは、メイソンがならず者である場合に限る」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャックはならず者です  \n(2) メイソンは騎士です  \n(3) ダニエルは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ルーカス、イヴリン、そしてジャック。ルーカスは、イヴリンが騎士であるのはジャックが騎士である場合に限るとあなたに言いました。イヴリンの言葉では、「イヴリンは騎士であるか、ジャックは騎士である」と言っています。「もしイヴリンが騎士であれば、イヴリンはならず者である」とジャックは宣言しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスはならず者です  \n(2) イヴリンは騎士です  \n(3) ジャックはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ローガン、マイケル、そしてアレクサンダー。ローガンは「アレクサンダーはならず者であるのは、ローガンが騎士である場合に限る」と述べました。マイケルは「ローガンはならず者だ」と言いました。「ローガンはならず者で、マイケルは騎士だ」とアレクサンダーは宣言しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンは騎士です  \n(2) マイケルはならず者です  \n(3) アレクサンダーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ルーク、ゾーイ、そしてエリザベス。ルークは「エリザベスはならず者ではない」と言いました。ゾーイは「もしエリザベスが騎士なら、ルークはならず者だ」と主張しました。エリザベスによれば、「エリザベスはゾーイがならず者であるときに限り騎士である」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) ゾーイはならず者です  \n(3) エリザベスは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ベンジャミン、ソフィア、そしてサミュエル。ベンジャミンは「サミュエルは騎士であるのは、サミュエルがならず者である場合に限る」とコメントしました。ソフィアは「サミュエルがならず者であるのは、ベンジャミンがならず者である場合に限る」と言いました。サミュエルは「ソフィアは騎士であり、ベンジャミンは騎士である」と述べました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンはならず者です  \n(2) ソフィアは騎士です  \n(3) サミュエルはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ミア、オリバー、そしてゾーイ。ミアは「ゾーイはならず者であるのは、ミアが騎士である場合に限る」と述べました。「ミアはならず者だ」とオリバーは主張しました。ゾーイは「オリバーは騎士であるか、ゾーイは騎士である」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアは騎士です  \n(2) オリバーはならず者です  \n(3) ゾーイはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：マイケル、ミア、そしてエイデン。マイケルは「エイデンは騎士だ」と主張しました。ミアは「マイケルがならず者であるのは、ミアが騎士である場合に限る」と言いました。「ミアはならず者か、エイデンは騎士だ」とエイデンが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルはならず者です  \n(2) ミアは騎士です  \n(3) エイデンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：オーロラ、ハーパー、そしてアメリア。オーロラは「アメリアはならず者で、ハーパーはならず者です」と述べました。ハーパーは「もしアメリアがならず者なら、アメリアは騎士です」と指摘しました。アメリアは「ハーパーは騎士で、オーロラは騎士です」とコメントしました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーロラは騎士です  \n(2) ハーパーはならず者です  \n(3) アメリアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：デイビッド、ダニエル、そしてイヴリン。デイビッドの言葉では、「ダニエルは騎士で、イヴリンは騎士です」と言っています。ダニエルは「イヴリンは騎士であるのは、デイビッドが騎士である場合に限る」とコメントしました。イヴリンはダニエルがならず者ではないと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドは騎士です  \n(2) ダニエルは騎士です  \n(3) イヴリンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ジャクソン、エイブリー、そしてダニエル。ジャクソンの発言はこうです：「もしダニエルが騎士なら、エイブリーは騎士です。」エイブリーは宣言しました。「ダニエルはならず者か、エイブリーは騎士です。」ダニエルはあなたにこう言いました：「もしダニエルが騎士なら、エイブリーはならず者です。」では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンはならず者です  \n(2) エイブリーはならず者です  \n(3) ダニエルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ジョセフ、エマ、そしてグレース。ジョセフは、エマがならず者だと言いました。「グレースはならず者か、グレースは騎士です」とエマは主張しました。グレースは、「もしエマがならず者なら、ジョセフは騎士です」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフはならず者です  \n(2) エマは騎士です  \n(3) グレースは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エイヴァ、エラ、そしてセバスチャン。「エラは騎士であり、エラはならず者です」とエイヴァが言いました。エラは「エイヴァは騎士であり、エイヴァはならず者です」と言いました。セバスチャンはエイヴァがならず者だと言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァはならず者です  \n(2) エラはならず者です  \n(3) セバスチャンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ゾーイ、ジェームズ、そしてジョセフ。ゾーイは「もしゾーイが騎士なら、ジェームズは騎士だ」と主張しました。ジェームズは「ジョセフは騎士だ」と主張しました。ジョセフは「ジェームズはならず者か、ジョセフは騎士だ」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ゾーイは騎士です  \n(2) ジェームズは騎士です  \n(3) ジョセフは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ライリー、サミュエル、そしてペネロペ。ライリーは言いました。「ペネロペは騎士で、サミュエルは騎士です。」サミュエルは「ペネロペは騎士である場合、サミュエルも騎士である」と言いました。ペネロペは「もしペネロペが騎士なら、ライリーは騎士です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ライリーは騎士です  \n(2) サミュエルは騎士です  \n(3) ペネロペは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：サミュエル、アビゲイル、そしてジャクソン。サミュエルは「ジャクソンは騎士か、ジャクソンはならず者だ」と言いました。アビゲイルは「サミュエルは騎士である場合に限り、サミュエルはならず者である」と言いました。ジャクソンは「サミュエルはならず者ではない」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルは騎士です  \n(2) アビゲイルはならず者です  \n(3) ジャクソンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：オリバー、ソフィア、そしてアレクサンダー。オリバーは「ソフィアは騎士で、アレクサンダーはならず者だ」とコメントしました。ソフィアによれば、「オリバーは騎士か、アレクサンダーはならず者です」。アレクサンダーは「オリバーはならず者で、オリバーは騎士です」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリバーは騎士です  \n(2) ソフィアは騎士です  \n(3) アレクサンダーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：マシュー、ノア、そしてシャーロット。マシューは「ノアがならず者なら、マシューは騎士だ」と言いました。ノアは「マシューは騎士である場合に限り、マシューはならず者だ」とコメントしました。シャーロットは「マシューは騎士だ」とコメントしました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マシューはならず者です  \n(2) ノアはならず者です  \n(3) シャーロットはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エイブリー、オーロラ、そしてノアです。「ノアはならず者であるのは、オーロラが騎士である場合に限る」とエイブリーが言いました。「オーロラが騎士であるのは、ノアが騎士である場合に限る」とオーロラが言いました。ノアはオーロラがならず者であり、エイブリーが騎士であると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーは騎士です  \n(2) オーロラはならず者です  \n(3) ノアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：イーサン、エイヴァ、そしてペネロペ。イーサンの言葉では、「ペネロペは騎士です」。エイヴァは、ペネロペはならず者で、イーサンもならず者だと表現しました。ペネロペはこう言いました、「イーサンはならず者であるのは、エイヴァが騎士である場合に限ります」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンは騎士です  \n(2) エイヴァはならず者です  \n(3) ペネロペは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ビクトリア、アレクサンダー、そしてエマ。ビクトリアは「アレクサンダーは騎士であり、エマも騎士である」と言っているのが聞かれました。「ビクトリアはならず者で、エマは騎士です」とアレクサンダーが言いました。エマは「エマは騎士で、アレクサンダーも騎士です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ビクトリアは騎士です  \n(2) アレクサンダーはならず者です  \n(3) エマはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：アリア、ジェイコブ、そしてジャクソン。アリアはジェイコブがならず者だと主張しました。ジェイコブはジャクソンが騎士であるか、ジャクソンがならず者であると言いました。ジャクソンの発言では、「アリアはジェイコブが騎士である場合に限りならず者です」と言っています。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アリアはならず者です  \n(2) ジェイコブは騎士です  \n(3) ジャクソンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ノア、ヘンリー、シャーロット。ノアは「シャーロットはならず者で、ヘンリーもならず者だ」と言いました。「ヘンリーは騎士であるのは、ノアがならず者である場合に限る」とヘンリーが言いました。シャーロットは「ヘンリーは騎士で、ヘンリーはならず者だ」とコメントしました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアはならず者です  \n(2) ヘンリーは騎士です  \n(3) シャーロットはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：オリビア、ローガン、そしてエイデン。オリビアは「もしオリビアが騎士なら、ローガンは騎士です」と述べました。ローガンによれば、「オリビアがならず者であるのは、エイデンが騎士である場合に限ります」。エイデンは「もしローガンが騎士なら、オリビアはならず者です」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアは騎士です  \n(2) ローガンは騎士です  \n(3) エイデンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ヘンリー、エイヴァ、そしてウィリアム。ヘンリーは「ウィリアムは騎士であり、ウィリアムはならず者だ」と言いました。エイヴァは「ウィリアムは騎士である場合に限り、ウィリアムはならず者だ」とコメントしました。「ヘンリーは騎士であり、エイヴァはならず者だ」とウィリアムは主張しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ヘンリーはならず者です  \n(2) エイヴァはならず者です  \n(3) ウィリアムはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：オーウェン、ビクトリア、そしてライリー。オーウェンは「ライリーは騎士で、ビクトリアは騎士です」と述べました。ビクトリアは「オーウェンはならず者で、ライリーは騎士です」と主張しました。ライリーは「ライリーは騎士で、ビクトリアはならず者です」とコメントしました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンはならず者です  \n(2) ビクトリアはならず者です  \n(3) ライリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ウィリアム、ミア、そしてエミリー。ウィリアムは「もしエミリーがならず者なら、エミリーは騎士だ」とコメントしました。ミアは「ウィリアムはならず者だ」と言いました。エミリーによれば、「ミアはウィリアムが騎士である場合に限り騎士です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムはならず者です  \n(2) ミアは騎士です  \n(3) エミリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：アレクサンダー、ソフィア、そしてリリー。アレクサンダーによれば、「リリーはならず者である場合に限り、ソフィアはならず者である」とのことです。ソフィアによれば、「アレクサンダーはならず者であるか、リリーは騎士である」とのことです。「アレクサンダーは騎士であるか、ソフィアは騎士である」とリリーは宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アレクサンダーは騎士です  \n(2) ソフィアは騎士です  \n(3) リリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ビクトリア、ウィリアム、そしてミア。ビクトリアは、ミアが騎士であり、ウィリアムも騎士であると言いました。ウィリアムは、「ビクトリアが騎士である場合に限り、ビクトリアはならず者である」と述べました。ミアは、「ウィリアムはならず者である」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ビクトリアはならず者です  \n(2) ウィリアムはならず者です  \n(3) ミアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ヘンリー、ローガン、リアム。ヘンリーは「もしローガンがならず者なら、リアムはならず者だ」と主張しました。ローガンはヘンリーが騎士であるか、ヘンリーがならず者であると言いました。リアムによれば、「もしローガンが騎士なら、ヘンリーは騎士です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ヘンリーは騎士です  \n(2) ローガンは騎士です  \n(3) リアムは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：アリア、エイヴァ、そしてオリビア。アリアは「もしエイヴァが騎士なら、オリビアはならず者だ」と述べました。「オリビアはならず者だ」 - エイヴァ。オリビアは「エイヴァはならず者であるのは、オリビアが騎士である場合に限る」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アリアは騎士です  \n(2) エイヴァはならず者です  \n(3) オリビアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エイブリー、スカーレット、そしてオリバー。エイブリーの発言はこうです：「もしエイブリーが騎士なら、オリバーはならず者です」。スカーレットは、「エイブリーは騎士ではありません」と指摘しました。オリバーは、「エイブリーはならず者であり、エイブリーは騎士です」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーは騎士です  \n(2) スカーレットはならず者です  \n(3) オリバーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エイヴァ、イヴリン、アメリア。「もしエイヴァが騎士なら、イヴリンはならず者だ」とエイヴァは宣言しました。イヴリンは「エイヴァは騎士ではない」と言いました。アメリアは、エイヴァはならず者で、イヴリンもならず者だと言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァは騎士です  \n(2) イヴリンはならず者です  \n(3) アメリアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エイブリー、ルーク、そしてヘンリー。エイブリーは「エイブリーは騎士であるのは、ヘンリーが騎士である場合に限る」と言いました。ルークはヘンリーがならず者であるとあなたに告げました。「もしルークがならず者なら、エイブリーはならず者だ」とヘンリーは宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーはならず者です  \n(2) ルークはならず者です  \n(3) ヘンリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：メイソン、ヘンリー、そしてハーパー。メイソンは「ハーパーは騎士である場合に限り、メイソンは騎士である」とコメントしました。ヘンリーによれば、「ハーパーが騎士であれば、メイソンはならず者である」とのことです。ハーパーは「メイソンはならず者である」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) メイソンはならず者です  \n(2) ヘンリーは騎士です  \n(3) ハーパーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エマ、スカーレット、そしてビクトリア。「ビクトリアは騎士ではない」とエマは主張しました。スカーレットは、エマがならず者であり、スカーレットが騎士であるとあなたに言いました。ビクトリアの発言では、「スカーレットは騎士ではない」と言っています。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エマはならず者です  \n(2) スカーレットはならず者です  \n(3) ビクトリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：サミュエル、シャーロット、そしてジェームズ。サミュエルは、「シャーロットはならず者である場合に限り、騎士である」と言いました。シャーロットは「サミュエルはならず者ではない」と主張しました。ジェームズは「シャーロットは騎士ではない」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルはならず者です  \n(2) シャーロットはならず者です  \n(3) ジェームズは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ゾーイ、ハーパー、そしてクロエ。ゾーイが言ったように、「ハーパーは騎士で、クロエはならず者です」。ハーパーが言ったように、「クロエは騎士ではありません」。クロエは宣言しました。「ゾーイは騎士である場合に限り、ハーパーは騎士です」。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ゾーイはならず者です  \n(2) ハーパーはならず者です  \n(3) クロエは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：サミュエル、アメリア、そしてエリザベス。サミュエルは「アメリアは騎士ではない」とコメントしました。アメリアは「エリザベスはならず者ではない」とコメントしました。「アメリアは騎士であるのは、サミュエルがならず者である場合に限る」とエリザベスは主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルはならず者です  \n(2) アメリアは騎士です  \n(3) エリザベスは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ベンジャミン、ダニエル、そしてハーパー。ベンジャミンによれば、「ハーパーはならず者で、ダニエルはならず者です」。ダニエルは「ベンジャミンはならず者か、ハーパーはならず者です」と述べました。ハーパーは「ダニエルは騎士ではありません」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンはならず者です  \n(2) ダニエルは騎士です  \n(3) ハーパーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：イーサン、エイブリー、そしてリアム。「リアムはならず者である場合に限り、リアムは騎士である」とイーサンは宣言しました。エイブリーは「リアムはならず者であるか、イーサンはならず者である」と言いました。リアムはイーサンがならず者であると言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンはならず者です  \n(2) エイブリーは騎士です  \n(3) リアムは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ソフィア、ミア、そしてエミリー。ソフィアの言葉では、「ミアはならず者か、ミアは騎士です」。ミアは「ミアは騎士か、ソフィアは騎士です」と言いました。エミリーの言葉では、「ソフィアはならず者か、ソフィアは騎士です」。では、誰が騎士で誰がならず者ですか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) ミアは騎士です  \n(3) エミリーは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ジェイコブ、エリザベス、そしてジャクソン。ジェイコブは、「ジャクソンが騎士であるならば、ジェイコブは騎士である」と言いました。「ジャクソンがならず者であるならば、ジャクソンは騎士である」とエリザベスは主張しました。「エリザベスは騎士であるならば、ジェイコブはならず者である」とジャクソンは主張しました。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブはならず者です  \n(2) エリザベスは騎士です  \n(3) ジャクソンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ペネロペ、スカーレット、そしてマシュー。ペネロペは「スカーレットはマシューがならず者である場合に限り、ならず者です」と述べました。スカーレットは「マシューは騎士であるか、ペネロペは騎士です」と言いました。マシューはスカーレットがならず者ではないと表現しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペは騎士です  \n(2) スカーレットは騎士です  \n(3) マシューは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ハーパー、エイヴァ、そしてルーカス。ハーパーは「エイヴァはならず者であるのは、ルーカスが騎士である場合に限る」と言っているのが聞かれました。エイヴァはルーカスがならず者であり、ハーパーがならず者であると言いました。ルーカスの発言では「エイヴァはならず者であるか、ハーパーは騎士である」と言っています。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーは騎士です  \n(2) エイヴァはならず者です  \n(3) ルーカスは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ゾーイ、メイソン、そしてライリー。ゾーイは「メイソンがならず者であるのは、ライリーがならず者である場合に限る」と述べました。メイソンは「メイソンは騎士であり、ライリーも騎士である」と言いました。ライリーは「ゾーイはならず者であるか、メイソンはならず者である」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ゾーイはならず者です  \n(2) メイソンはならず者です  \n(3) ライリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：アメリア、ルーク、そしてアビゲイル。「アビゲイルはならず者か、ルークはならず者です」とアメリアが言いました。「アメリアはならず者か、ルークは騎士です」とルークが主張しました。アビゲイルは「もしアビゲイルが騎士なら、ルークはならず者です」と述べました。では、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) アメリアは騎士です  \n(2) ルークはならず者です  \n(3) アビゲイルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：アメリア、ローガン、そしてジェイコブ。「もしローガンがならず者なら、ジェイコブは騎士です」とアメリアは宣言しました。ローガンは「もしアメリアがならず者なら、ジェイコブはならず者です」と言いました。ジェイコブは「アメリアはならず者です」とコメントしました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアは騎士です  \n(2) ローガンは騎士です  \n(3) ジェイコブはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ウィリアム、マシュー、そしてスカーレット。ウィリアムは「マシューはならず者であるのはスカーレットがならず者である場合に限る」と主張しました。マシューは「スカーレットはならず者であり、ウィリアムは騎士である」と主張しました。スカーレットは「スカーレットは騎士であるのはマシューがならず者である場合に限る」とあなたに言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムはならず者です  \n(2) マシューはならず者です  \n(3) スカーレットは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ハーパー、メイソン、そしてライリー。ハーパーは「メイソンは騎士か、メイソンはならず者だ」と言っているのが聞かれました。メイソンによれば、「ライリーは騎士で、ハーパーはならず者だ」とのことです。「もしライリーが騎士なら、ハーパーは騎士だ」とライリーは宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーは騎士です  \n(2) メイソンはならず者です  \n(3) ライリーは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エミリー、ルーク、そしてジャック。エミリーによれば、「ルークは騎士か、ルークはならず者です」。ルークによれば、「エミリーは騎士であり、エミリーはならず者です」。ジャックはこう言いました、「ルークはならず者ではありません」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーは騎士です  \n(2) ルークはならず者です  \n(3) ジャックはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ジェームズ、オーウェン、そしてローガン。ジェームズの言葉によれば、「オーウェンは騎士である場合に限り、ローガンはならず者である」。オーウェンはこう言いました、「ジェームズはならず者である場合に限り、オーウェンは騎士である」。ローガンの言葉では、「オーウェンは騎士であるか、オーウェンはならず者である」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズはならず者です  \n(2) オーウェンは騎士です  \n(3) ローガンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ペネロペ、エイブリー、そしてジョセフ。ペネロペは、ジョセフが騎士だと言いました。「エイブリーは騎士か、ジョセフはならず者だ」とエイブリーは宣言しました。「もしジョセフが騎士なら、エイブリーはならず者だ」とジョセフは宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペは騎士です  \n(2) エイブリーはならず者です  \n(3) ジョセフは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：シャーロット、スカーレット、そしてクロエ。シャーロットは「スカーレットはならず者である場合に限り、騎士である」と言いました。スカーレットは「シャーロットはクロエが騎士である場合に限り、騎士である」と言っているのが聞かれました。クロエによれば、「クロエは騎士であるか、スカーレットは騎士である」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットはならず者です  \n(2) スカーレットはならず者です  \n(3) クロエは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エマ、ヘンリー、そしてイザベラ。「ヘンリーは騎士です」とエマが言いました。ヘンリーは「エマはならず者か、エマは騎士です」と述べました。「ヘンリーはならず者です」とイザベラが宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エマは騎士です  \n(2) ヘンリーは騎士です  \n(3) イザベラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ノア、ライリー、そしてオーロラ。ノアはライリーがならず者であり、ライリーが騎士であると述べました。ライリーはオーロラが騎士であり、ノアが騎士であると述べました。オーロラはあなたにノアがならず者であると言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアはならず者です  \n(2) ライリーはならず者です  \n(3) オーロラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ペネロペ、オーロラ、そしてリアム。「リアムはならず者です」 - ペネロペ。オーロラはリアムが騎士ではないと表現しました。「ペネロペはならず者であり、ペネロペは騎士です」 - リアム。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペは騎士です  \n(2) オーロラは騎士です  \n(3) リアムはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ゾーイ、ノア、そしてダニエル。ゾーイは「ゾーイは騎士だ」と主張しました。ノアの言葉では「ゾーイはならず者か、ダニエルは騎士だ」と言いました。「ノアはならず者だ」とダニエルは宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ゾーイはならず者です  \n(2) ノアは騎士です  \n(3) ダニエルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：オリビア、スカーレット、そしてダニエル。オリビアは「ダニエルは騎士ではない」と言いました。スカーレットによれば、「もしスカーレットが騎士なら、オリビアはならず者です」。ダニエルは「ダニエルは騎士です」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアはならず者です  \n(2) スカーレットは騎士です  \n(3) ダニエルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：オリバー、イーサン、そしてダニエル。「もしオリバーが騎士なら、ダニエルは騎士だ」とオリバーが言いました。イーサンは「イーサンは騎士だ」と主張しました。ダニエルは「オリバーはならず者か、イーサンは騎士だ」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリバーは騎士です  \n(2) イーサンは騎士です  \n(3) ダニエルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ノア、マイケル、そしてリアム。ノアは「もしマイケルがならず者なら、リアムはならず者だ」と述べました。マイケルは「マイケルは騎士であるのは、リアムが騎士である場合に限る」とコメントしました。リアムは「ノアはならず者だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアはならず者です  \n(2) マイケルはならず者です  \n(3) リアムは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エマ、イザベラ、そしてオーロラ。エマによれば、「もしエマが騎士なら、イザベラはならず者です」。イザベラは自分が騎士であると表現しました。オーロラの発言では、「オーロラは騎士で、エマはならず者です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エマは騎士です  \n(2) イザベラはならず者です  \n(3) オーロラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エイヴァ、ウィリアム、そしてオーロラ。エイヴァは「ウィリアムは騎士である場合に限り、ウィリアムはならず者である」と述べました。「エイヴァはならず者だ」とウィリアムは言いました。オーロラはウィリアムがならず者であるか、エイヴァがならず者であると表現しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァはならず者です  \n(2) ウィリアムは騎士です  \n(3) オーロラは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エラ、ソフィア、そしてデイビッド。「ソフィアは騎士です」とエラが言いました。ソフィアは「もしデイビッドがならず者なら、デイビッドは騎士です」と述べました。デイビッドの言葉では、「エラはならず者か、エラは騎士です」と言っています。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラは騎士です  \n(2) ソフィアは騎士です  \n(3) デイビッドは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：マシュー、スカーレット、そしてイーサン。マシューは「マシューは騎士で、スカーレットも騎士だ」と言いました。スカーレットは「マシューはならず者で、イーサンは騎士だ」と言いました。イーサンは「マシューは騎士だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マシューはならず者です  \n(2) スカーレットはならず者です  \n(3) イーサンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ルーカス、エイヴァ、そしてセバスチャン。「エイヴァは騎士ではない」とルーカスが言いました。エイヴァは「エイヴァはセバスチャンがならず者である場合に限り、騎士である」と言っているのが聞かれました。セバスチャンは「ルーカスは騎士だ」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスはならず者です  \n(2) エイヴァは騎士です  \n(3) セバスチャンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ジェイコブ、セバスチャン、そしてルーカス。ジェイコブはセバスチャンがならず者ではないと言いました。「ジェイコブは騎士であり、ジェイコブはならず者です」とセバスチャンは言いました。ルーカスは「セバスチャンはならず者か、ジェイコブはならず者です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブはならず者です  \n(2) セバスチャンはならず者です  \n(3) ルーカスは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ライリー、ウィリアム、そしてダニエル。ライリーは「ライリーはダニエルが騎士である限り騎士である」とコメントしました。「ライリーはならず者ではない」とウィリアムが宣言しました。「ウィリアムはならず者ではない」とダニエルが宣言しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ライリーは騎士です  \n(2) ウィリアムは騎士です  \n(3) ダニエルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：イザベラ、ビクトリア、そしてジャクソン。イザベラは「ビクトリアはならず者ではない」と述べました。「ジャクソンはイザベラがならず者である場合に限り騎士です」とビクトリアが言いました。ジャクソンは「ジャクソンはビクトリアがならず者である場合に限り騎士です」と主張しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イザベラはならず者です  \n(2) ビクトリアはならず者です  \n(3) ジャクソンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：イザベラ、アビゲイル、そしてマシュー。「アビゲイルは騎士で、マシューはならず者だ」とイザベラが宣言しました。「イザベラが騎士であるならば、イザベラはならず者だ」とアビゲイルが宣言しました。マシューは「イザベラがならず者であれば、アビゲイルもならず者だ」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イザベラはならず者です  \n(2) アビゲイルはならず者です  \n(3) マシューは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：グレース、オーウェン、そしてジャック。グレースはオーウェンがならず者だと言いました。オーウェンは「ジャックは騎士だ」と言いました。ジャックは「オーウェンはならず者であるのは、グレースが騎士である場合に限る」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) グレースはならず者です  \n(2) オーウェンは騎士です  \n(3) ジャックは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ジョセフ、アメリア、そしてオリビア。ジョセフは「オリビアは騎士である場合に限り、オリビアはならず者である」と言いました。アメリアは「ジョセフは騎士です」と述べました。オリビアは「アメリアは騎士ではない」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフはならず者です  \n(2) アメリアはならず者です  \n(3) オリビアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：オリビア、ヘンリー、そしてアメリア。「オリビアは騎士です」とオリビアが言いました。ヘンリーは、「オリビアがならず者であるならば、アメリアはならず者です」と述べました。アメリアは、「ヘンリーがならず者であるならば、オリビアは騎士です」とコメントしました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアは騎士です  \n(2) ヘンリーは騎士です  \n(3) アメリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：イーサン、ルーカス、そしてウィリアム。イーサンは「ルーカスは騎士で、ウィリアムも騎士です」と述べました。ルーカスの発言では「イーサンはならず者で、ウィリアムもならず者です」と言いました。「もしイーサンが騎士なら、ルーカスはならず者です」とウィリアムは主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンはならず者です  \n(2) ルーカスはならず者です  \n(3) ウィリアムは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：リアム、イザベラ、そしてイヴリン。リアムは「イザベラはならず者で、リアムは騎士だ」と言いました。イザベラによれば、「イヴリンは騎士ではない」とのことです。「リアムはならず者だ」とイヴリンは宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムはならず者です  \n(2) イザベラはならず者です  \n(3) イヴリンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：オーウェン、アレクサンダー、そしてノア。オーウェンは「アレクサンダーは騎士だ」と宣言しました。アレクサンダーは「もしオーウェンがならず者なら、ノアはならず者だ」と言いました。ノアは「アレクサンダーは騎士だ」と表現しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンは騎士です  \n(2) アレクサンダーは騎士です  \n(3) ノアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ウィリアム、シャーロット、そしてジョセフ。ウィリアムの言葉では、「シャーロットは騎士であり、シャーロットはならず者です」と言っています。シャーロットは、「ジョセフは騎士であり、ウィリアムは騎士です」と述べました。「シャーロットは騎士ではない」とジョセフが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムはならず者です  \n(2) シャーロットはならず者です  \n(3) ジョセフは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ジャクソン、リリー、そしてセバスチャン。ジャクソンは「セバスチャンは騎士であり、ジャクソンは騎士だ」とコメントしました。「ジャクソンが騎士である場合に限り、ジャクソンはならず者だ」とリリーは主張しました。セバスチャンは「ジャクソンはならず者だ」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンはならず者です  \n(2) リリーはならず者です  \n(3) セバスチャンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：クロエ、アレクサンダー、そしてイーサン。クロエによると、「アレクサンダーはならず者であり、アレクサンダーは騎士です」。アレクサンダーは、「アレクサンダーは騎士であるか、クロエはならず者です」と述べました。イーサンは、「クロエはならず者であり、アレクサンダーは騎士です」と主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) クロエはならず者です  \n(2) アレクサンダーは騎士です  \n(3) イーサンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エミリー、エラ、そしてオリビア。エミリーは「エラは騎士です」と言いました。エラの言葉では「エミリーはならず者で、オリビアはならず者です」と言っています。オリビアは「エラはならず者で、オリビアは騎士です」と言っているのが聞かれました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーはならず者です  \n(2) エラはならず者です  \n(3) オリビアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ベンジャミン、シャーロット、そしてオーウェン。ベンジャミンは「シャーロットは騎士か、シャーロットはならず者です」と言いました。「ベンジャミンはならず者であるのは、オーウェンがならず者である場合に限ります」 - シャーロット。「シャーロットはならず者か、オーウェンは騎士です」 - オーウェン。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンは騎士です  \n(2) シャーロットは騎士です  \n(3) オーウェンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：リアム、ベンジャミン、そしてヘンリー。リアムは「もしベンジャミンが騎士なら、ヘンリーはならず者だ」と述べました。ベンジャミンは「ヘンリーはならず者であり、ヘンリーは騎士だ」と言っているのが聞かれました。ヘンリーは「リアムは騎士であるのは、ベンジャミンがならず者である場合に限る」と指摘しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムは騎士です  \n(2) ベンジャミンはならず者です  \n(3) ヘンリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：デイビッド、ノア、そしてオーロラ。「ノアはならず者であるのは、オーロラがならず者である場合に限る」 - デイビッド。ノアによれば、「デイビッドはならず者であるのは、ノアが騎士である場合に限る」。オーロラは、「デイビッドが騎士であれば、オーロラも騎士である」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドはならず者です  \n(2) ノアはならず者です  \n(3) オーロラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エイデン、ジェイコブ、そしてベンジャミン。エイデンは「ジェイコブはならず者だ」と主張しました。ジェイコブはあなたに、エイデンが騎士であるか、ジェイコブが騎士であると言いました。ベンジャミンの言葉では、「エイデンはならず者であるか、ベンジャミンは騎士である」と言っています。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンはならず者です  \n(2) ジェイコブは騎士です  \n(3) ベンジャミンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：サミュエル、ダニエル、そしてオーウェン。「オーウェンが騎士であるならば、サミュエルも騎士である」とサミュエルが言いました。ダニエルは「オーウェンはならず者だ」と主張しました。オーウェンは「ダニエルは騎士であるか、サミュエルはならず者である」と述べました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルはならず者です  \n(2) ダニエルはならず者です  \n(3) オーウェンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：イーサン、ソフィア、そしてデイビッド。イーサンによると、「ソフィアが騎士なら、デイビッドも騎士です」。ソフィアはこう言いました、「デイビッドはイーサンがならず者であるときに限り騎士です」。デイビッドの言葉では、「ソフィアはならず者であるか、ソフィアは騎士です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンは騎士です  \n(2) ソフィアはならず者です  \n(3) デイビッドは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：シャーロット、ローガン、そしてデイビッド。シャーロットは「シャーロットは騎士であり、ローガンは騎士です」と言いました。ローガンによれば、「シャーロットは騎士であるか、デイビッドは騎士です」。デイビッドは「シャーロットは騎士である場合に限り、ローガンは騎士です」と主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットは騎士です  \n(2) ローガンは騎士です  \n(3) デイビッドは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ウィリアム、オリバー、そしてアリア。ウィリアムによれば、「ウィリアムが騎士なら、アリアは騎士である」とのことです。オリバーの発言では、「ウィリアムはならず者であるか、アリアはならず者である」と言っています。アリアは、ウィリアムがならず者であればウィリアムは騎士であると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムは騎士です  \n(2) オリバーはならず者です  \n(3) アリアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ソフィア、アメリア、そしてハーパー。ソフィアは「ハーパーがならず者なら、アメリアはならず者です」と述べました。アメリアは「ハーパーはならず者です」と言いました。ハーパーは「ソフィアが騎士なら、アメリアは騎士です」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアはならず者です  \n(2) アメリアは騎士です  \n(3) ハーパーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ローガン、ジェームズ、そしてルーカス。ローガンは「ローガンは騎士で、ルーカスはならず者だ」と主張しました。ジェームズの言葉では、「ローガンはならず者ではない」と言いました。ルーカスは「ローガンは騎士だ」と指摘しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンはならず者です  \n(2) ジェームズはならず者です  \n(3) ルーカスはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：イザベラ、ゾーイ、そしてアメリア。イザベラは「もしアメリアがならず者なら、イザベラは騎士だ」と言いました。ゾーイはあなたにイザベラが騎士ではないと言いました。アメリアは「ゾーイは騎士か、ゾーイはならず者だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イザベラは騎士です  \n(2) ゾーイはならず者です  \n(3) アメリアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ハーパー、ジャクソン、そしてグレース。ハーパーによれば、「ハーパーはジャクソンが騎士である場合に限り騎士です」。ジャクソンはこう言いました。「もしハーパーが騎士なら、ハーパーはならず者です」。グレースは「ジャクソンはならず者であり、ジャクソンは騎士です」と主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーはならず者です  \n(2) ジャクソンは騎士です  \n(3) グレースはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：グレース、セバスチャン、そしてマイケル。グレースの言葉では、「もしマイケルがならず者なら、マイケルは騎士です」。セバスチャンはこう言いました、「グレースはならず者ではありません」。マイケルは、「マイケルは騎士であるのは、グレースが騎士である場合に限ります」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) グレースは騎士です  \n(2) セバスチャンは騎士です  \n(3) マイケルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ソフィア、メイソン、そしてエイヴァ。ソフィアは、メイソンは騎士ではないと言いました。メイソンは「ソフィアはならず者で、エイヴァは騎士だ」と主張しました。「ソフィアは騎士で、メイソンはならず者だ」とエイヴァは主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) メイソンはならず者です  \n(3) エイヴァは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ジャック、アメリア、そしてオリビア。ジャックによれば、「オリビアはならず者で、ジャックは騎士です」。アメリアは「ジャックは騎士ではありません」と主張しました。オリビアは「もしジャックがならず者なら、アメリアは騎士です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャックはならず者です  \n(2) アメリアは騎士です  \n(3) オリビアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：クロエ、オリバー、そしてジャック。クロエはオリバーがならず者ではないと言いました。オリバーの発言では、「クロエはならず者ではない」と言っています。ジャックは「もしジャックが騎士なら、オリバーは騎士だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) クロエは騎士です  \n(2) オリバーは騎士です  \n(3) ジャックは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エマ、ルーク、そしてエラ。エマは「ルークは騎士か、ルークはならず者です」と主張しました。ルークによれば、「もしエマが騎士なら、エラは騎士です」。エラは「もしエマがならず者なら、ルークは騎士です」とコメントしました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エマは騎士です  \n(2) ルークは騎士です  \n(3) エラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ルーク、マイケル、そしてエリザベス。ルークは「エリザベスは騎士だ」と言いました。マイケルは「ルークは騎士だ」とコメントしました。エリザベスは「マイケルはならず者であるのは、ルークがならず者である場合に限る」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) マイケルは騎士です  \n(3) エリザベスは騎士です"
    },
    
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エイヴァ、デイビッド、そしてアメリア。エイヴァは「デイビッドはならず者か、デイビッドは騎士です」と述べました。デイビッドはエイヴァが騎士であり、アメリアが騎士であると言いました。アメリアは「デイビッドは騎士であり、デイビッドはならず者です」とコメントしました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァは騎士です  \n(2) デイビッドはならず者です  \n(3) アメリアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ベンジャミン、ミア、そしてジェイコブ。ベンジャミンの発言はこうです：「ミアはならず者で、ミアは騎士です」。ミアはこう主張しました：「ベンジャミンは騎士で、ジェイコブはならず者です」。ジェイコブの言葉では：「ベンジャミンは騎士ではありません」。さて、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) ベンジャミンはならず者です  \n(2) ミアはならず者です  \n(3) ジェイコブは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エイブリー、リリー、そしてペネロペ。「リリーは騎士ではない」とエイブリーが宣言しました。リリーはペネロペがならず者で、エイブリーがならず者だと言いました。ペネロペは「もしリリーがならず者なら、エイブリーはならず者だ」と表現しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーは騎士です  \n(2) リリーはならず者です  \n(3) ペネロペはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ジェイコブ、メイソン、そしてエラ。ジェイコブは「メイソンは騎士である場合に限り、ジェイコブは騎士である」と述べました。メイソンは「エラはならず者ではない」と言いました。エラによれば「ジェイコブは騎士であり、エラは騎士である」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブは騎士です  \n(2) メイソンは騎士です  \n(3) エラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ローガン、ヘンリー、そしてグレース。ローガンは言いました、「もしヘンリーが騎士なら、グレースはならず者です」。ヘンリーの発言では、「ローガンはならず者です」。グレースは言いました、「もしヘンリーが騎士なら、ローガンは騎士です」。では、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) ローガンは騎士です  \n(2) ヘンリーはならず者です  \n(3) グレースは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ミア、リリー、そしてクロエ。ミアによれば、「ミアは騎士である場合に限り、リリーはならず者である」。リリーによれば、「もしクロエがならず者であれば、ミアはならず者である」。クロエは「ミアは騎士ではない」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアは騎士です  \n(2) リリーはならず者です  \n(3) クロエはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ルーカス、ルーク、そしてオーロラ。ルーカスは「ルーカスは騎士か、オーロラは騎士だ」と主張しました。ルークは「オーロラは騎士で、ルーカスは騎士だ」と述べました。オーロラは「もしルーカスがならず者なら、ルークはならず者だ」と指摘しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスは騎士です  \n(2) ルークは騎士です  \n(3) オーロラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：クロエ、セバスチャン、そしてマシュー。クロエは、セバスチャンがならず者であり、クロエが騎士であると主張しました。セバスチャンは、「マシューはならず者であるのは、セバスチャンが騎士である場合に限る」と言いました。マシューは、クロエがならず者であるとあなたに言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) クロエは騎士です  \n(2) セバスチャンはならず者です  \n(3) マシューはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ヘンリー、デイビッド、そしてオーロラ。ヘンリーは「オーロラは騎士か、ヘンリーは騎士だ」と言いました。「ヘンリーは騎士ではない」とデイビッドが言いました。オーロラの言葉では「オーロラは騎士であるのは、ヘンリーがならず者である場合に限る」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ヘンリーはならず者です  \n(2) デイビッドは騎士です  \n(3) オーロラはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：スカーレット、ベンジャミン、そしてエミリー。スカーレットは「ベンジャミンは騎士です」と言いました。「もしスカーレットが騎士なら、エミリーはならず者です」とベンジャミンが言いました。エミリーは「もしベンジャミンが騎士なら、エミリーは騎士です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) スカーレットは騎士です  \n(2) ベンジャミンは騎士です  \n(3) エミリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ノア、ジョセフ、そしてソフィア。ノアは、ソフィアが騎士であり、ノア自身も騎士であると表現しました。ジョセフは「もしジョセフが騎士なら、ソフィアはならず者だ」と言っているのが聞かれました。「ソフィアはノアがならず者であるときに限り騎士である」とソフィアは宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアはならず者です  \n(2) ジョセフは騎士です  \n(3) ソフィアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ローガン、イーサン、そしてジャック。ローガンはこう言いました。「もしジャックがならず者なら、イーサンはならず者です。」イーサンは主張しました。「ジャックはならず者で、イーサンは騎士です。」ジャックはあなたにイーサンが騎士だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンは騎士です  \n(2) イーサンはならず者です  \n(3) ジャックはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：アメリア、リアム、そしてイザベラ。アメリアは「イザベラはならず者ではない」と述べました。リアムは「イザベラはならず者であるか、アメリアは騎士である」と主張しました。イザベラは「リアムはならず者ではない」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアは騎士です  \n(2) リアムは騎士です  \n(3) イザベラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ベンジャミン、オーウェン、そしてジャクソン。ベンジャミンは、ジャクソンが騎士であるか、ジャクソンがならず者であると言いました。オーウェンは、ジャクソンは騎士ではないと表現しました。ジャクソンは「ベンジャミンは騎士だ」とコメントしました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンは騎士です  \n(2) オーウェンはならず者です  \n(3) ジャクソンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ジェイコブ、アメリア、そしてベンジャミン。ジェイコブによれば、「アメリアがならず者なら、ベンジャミンはならず者です」。アメリアは、「ジェイコブはならず者か、ジェイコブは騎士です」とコメントしました。ベンジャミンは、「アメリアは騎士である場合、アメリアはならず者です」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブは騎士です  \n(2) アメリアは騎士です  \n(3) ベンジャミンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ソフィア、シャーロット、そしてエイデン。「エイデンはならず者で、エイデンは騎士です」とソフィアが言いました。シャーロットは「ソフィアは騎士ではありません」とコメントしました。「エイデンは騎士で、シャーロットはならず者です」とエイデンが宣言しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアはならず者です  \n(2) シャーロットは騎士です  \n(3) エイデンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ミア、ルーカス、そしてグレース。ミアは「ミアは騎士であるのは、ルーカスが騎士である場合に限る」と述べました。「ミアは騎士ではない」とルーカスは主張しました。グレースはルーカスがならず者であると表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアはならず者です  \n(2) ルーカスは騎士です  \n(3) グレースはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ローガン、リアム、そしてセバスチャン。ローガンの言葉では、「もしセバスチャンが騎士なら、リアムはならず者です。」と述べました。「ローガンは騎士である場合に限り、セバスチャンはならず者です」とリアムが言いました。「ローガンは騎士です」とセバスチャンが宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンは騎士です  \n(2) リアムはならず者です  \n(3) セバスチャンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エリザベス、サミュエル、そしてリリー。エリザベスは「もしサミュエルがならず者なら、サミュエルは騎士です」とコメントしました。サミュエルは「エリザベスは騎士か、エリザベスはならず者です」と述べました。リリーによれば「エリザベスはならず者ではありません」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスは騎士です  \n(2) サミュエルは騎士です  \n(3) リリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ジェイコブ、ジェームズ、そしてソフィア。ジェイコブは「ジェームズは騎士だ」と言いました。ジェームズの発言は「ソフィアは騎士だ」です。そしてソフィアは「ジェームズはならず者か、ジェームズは騎士だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブは騎士です  \n(2) ジェームズは騎士です  \n(3) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エイヴァ、グレース、そしてダニエル。「エイヴァは騎士である場合に限り、グレースは騎士です」とエイヴァが言いました。「エイヴァは騎士ではありません」とグレースが宣言しました。「エイヴァは騎士であるか、エイヴァはならず者です」とダニエルが言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァはならず者です  \n(2) グレースは騎士です  \n(3) ダニエルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：アビゲイル、セバスチャン、そしてビクトリア。「もしアビゲイルが騎士なら、セバスチャンは騎士です」とアビゲイルが言いました。「もしセバスチャンが騎士なら、ビクトリアは騎士です」とセバスチャンが言いました。ビクトリアはアビゲイルが騎士だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アビゲイルは騎士です  \n(2) セバスチャンは騎士です  \n(3) ビクトリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：イヴリン、アレクサンダー、そしてジャクソン。イヴリンは「ジャクソンは騎士か、イヴリンは騎士です」と言っているのが聞かれました。「イヴリンはならず者で、イヴリンは騎士です」とアレクサンダーが言いました。ジャクソンの発言では「アレクサンダーは騎士か、イヴリンはならず者です」と言っています。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンは騎士です  \n(2) アレクサンダーはならず者です  \n(3) ジャクソンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：アメリア、マシュー、そしてクロエ。アメリアは「マシューはクロエが騎士である場合に限りならず者です」と言いました。マシューは「クロエは騎士であるか、アメリアはならず者です」と述べました。「もしマシューが騎士なら、クロエは騎士です」とクロエは宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアはならず者です  \n(2) マシューは騎士です  \n(3) クロエは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ダニエル、イザベラ、そしてオリビア。ダニエルは「イザベラは騎士である場合に限り、イザベラはならず者である」と言いました。イザベラは「ダニエルが騎士であれば、オリビアはならず者である」と言いました。オリビアは「イザベラはならず者である場合に限り、ダニエルは騎士である」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルはならず者です  \n(2) イザベラは騎士です  \n(3) オリビアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ダニエル、イザベラ、そしてマシュー。ダニエルによれば、「イザベラは騎士である場合に限り、イザベラはならず者である」とのことです。イザベラはこう言いました。「ダニエルはならず者で、マシューは騎士です」。マシューの言葉では、「ダニエルはならず者ではありません」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルはならず者です  \n(2) イザベラはならず者です  \n(3) マシューはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：マシュー、オリビア、そしてイーサン。マシューは「もしイーサンが騎士なら、オリビアはならず者だ」と言っているのが聞かれました。オリビアは「イーサンは騎士ではない」と述べました。「マシューはならず者で、イーサンは騎士だ」とイーサンが言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マシューは騎士です  \n(2) オリビアは騎士です  \n(3) イーサンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：デイビッド、イザベラ、そしてマイケル。デイビッドは言いました、「もしマイケルが騎士なら、マイケルはならず者です」。イザベラは言いました、「マイケルはならず者か、マイケルは騎士です」。マイケルは言いました、「マイケルは騎士であるのは、デイビッドがならず者である場合に限ります」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドはならず者です  \n(2) イザベラは騎士です  \n(3) マイケルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：イーサン、ジャクソン、そしてスカーレット。イーサンの発言はこうです：「スカーレットは騎士です」。ジャクソンは「もしイーサンが騎士なら、スカーレットはならず者です」と述べました。スカーレットはあなたに、ジャクソンはならず者でイーサンもならず者だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンはならず者です  \n(2) ジャクソンは騎士です  \n(3) スカーレットはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ダニエル、ミア、そしてオーロラ。ダニエルによれば、「オーロラは騎士で、ミアはならず者です」。ミアは「オーロラは騎士であるか、ダニエルはならず者です」と主張しました。「ミアは騎士である場合に限り、ミアはならず者です」とオーロラは言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルはならず者です  \n(2) ミアは騎士です  \n(3) オーロラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：オーウェン、ジャック、そしてジャクソン。オーウェンは「ジャクソンは騎士か、オーウェンは騎士だ」と言っているのが聞かれました。ジャックは「ジャクソンは騎士か、ジャクソンはならず者だ」と述べました。ジャクソンは「もしジャックがならず者なら、オーウェンはならず者だ」と指摘しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンは騎士です  \n(2) ジャックは騎士です  \n(3) ジャクソンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ハーパー、エラ、そしてデイビッド。「エラはならず者である場合、ハーパーは騎士である」とハーパーは言いました。エラの発言では、「ハーパーは騎士です」と言いました。「もしデイビッドが騎士なら、エラはならず者です」とデイビッドは言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーはならず者です  \n(2) エラはならず者です  \n(3) デイビッドは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エイヴァ、ハーパー、そしてベンジャミン。「ハーパーはならず者か、ベンジャミンはならず者です」 - エイヴァ。「ハーパーは騎士である場合に限り、ベンジャミンは騎士です」 - ハーパー。「エイヴァは騎士です」とベンジャミンが宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァは騎士です  \n(2) ハーパーはならず者です  \n(3) ベンジャミンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ジャクソン、エイブリー、マシュー。ジャクソンが言ったように、「マシューは騎士か、ジャクソンは騎士です」。エイブリーは、ジャクソンはならず者ではないと言いました。マシューは「エイブリーは騎士か、ジャクソンはならず者です」と主張しました。では、誰が騎士で誰がならず者ですか？",
        "solution_text_format": "(1) ジャクソンは騎士です  \n(2) エイブリーは騎士です  \n(3) マシューは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エマ、ハーパー、そしてウィリアム。エマはウィリアムが騎士ではないと言いました。ハーパーは「もしハーパーが騎士なら、ウィリアムは騎士です」と指摘しました。「ハーパーは騎士です」とウィリアムが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エマはならず者です  \n(2) ハーパーは騎士です  \n(3) ウィリアムは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エイヴァ、アメリア、そしてウィリアム。エイヴァは「アメリアがならず者なら、ウィリアムもならず者だ」と主張しました。「ウィリアムはならず者で、エイヴァはならず者だ」とアメリアは宣言しました。ウィリアムは「アメリアは騎士ではない」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァはならず者です  \n(2) アメリアはならず者です  \n(3) ウィリアムは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ジェイコブ、ゾーイ、そしてセバスチャン。ジェイコブは「セバスチャンはならず者ではない」と主張しました。「セバスチャンは騎士で、ジェイコブはならず者だ」とゾーイは主張しました。セバスチャンは「ゾーイはならず者で、ゾーイは騎士だ」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブはならず者です  \n(2) ゾーイはならず者です  \n(3) セバスチャンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ソフィア、ウィリアム、そしてメイソン。「ウィリアムがならず者なら、ウィリアムは騎士です」とソフィアが言いました。ウィリアムはこう主張しました：「ソフィアが騎士なら、メイソンはならず者です」。メイソンはこう言いました：「メイソンは騎士です」。では、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) ウィリアムは騎士です  \n(3) メイソンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：アメリア、ルーク、そしてマシュー。アメリアの発言では、「ルークはならず者ではない」と言いました。「アメリアは騎士であり、アメリアはならず者だ」とルークは宣言しました。マシューは、「もしアメリアが騎士なら、ルークはならず者だ」と指摘しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアはならず者です  \n(2) ルークはならず者です  \n(3) マシューは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：スカーレット、イヴリン、そしてゾーイ。スカーレットは言いました。「イヴリンはならず者で、ゾーイはならず者です。」イヴリンの言葉では、「ゾーイはならず者です。」ゾーイは言いました。「もしスカーレットが騎士なら、スカーレットはならず者です。」では、誰が騎士で誰がならず者ですか？",
        "solution_text_format": "(1) スカーレットはならず者です  \n(2) イヴリンはならず者です  \n(3) ゾーイは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：イヴリン、ベンジャミン、そしてソフィア。イヴリンは「ベンジャミンはならず者ではない」と述べました。ベンジャミンは「ソフィアはイヴリンがならず者である場合に限り騎士である」と表現しました。ソフィアは「ソフィアはイヴリンが騎士である場合に限り騎士である」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンは騎士です  \n(2) ベンジャミンは騎士です  \n(3) ソフィアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エマ、エイブリー、そしてエリザベス。エマは言いました。「もしエイブリーがならず者なら、エイブリーは騎士です。」エイブリーの発言：「もしエイブリーが騎士なら、エマは騎士です。」エリザベスは言いました。「エリザベスは騎士で、エイブリーはならず者です。」では、誰が騎士で誰がならず者ですか？",
        "solution_text_format": "(1) エマは騎士です  \n(2) エイブリーは騎士です  \n(3) エリザベスはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：マイケル、ライリー、そしてソフィア。マイケルの発言はこうです：「ソフィアはならず者か、ライリーはならず者です」。ライリーはこう言いました：「ソフィアはならず者です」。ソフィアはこう言いました：「もしライリーがならず者なら、ソフィアは騎士です」。では、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) マイケルは騎士です  \n(2) ライリーはならず者です  \n(3) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ソフィア、スカーレット、シャーロット。ソフィアは「もしソフィアが騎士なら、シャーロットは騎士です」と言いました。スカーレットは「ソフィアは騎士です」と言いました。シャーロットはあなたにソフィアが騎士だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) スカーレットは騎士です  \n(3) シャーロットは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ミア、ハーパー、そしてオリバー。「ミアは騎士です」とミアは宣言しました。ハーパーは、「もしハーパーが騎士なら、オリバーはならず者です」と言いました。オリバーは、「ハーパーは騎士で、ミアは騎士です」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアはならず者です  \n(2) ハーパーは騎士です  \n(3) オリバーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：マイケル、エマ、そしてイヴリン。マイケルは、イヴリンはならず者ではないと言いました。「イヴリンは騎士で、マイケルは騎士です」とエマが言いました。イヴリンは、「エマは騎士である場合、エマはならず者である場合に限る」と述べました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルはならず者です  \n(2) エマはならず者です  \n(3) イヴリンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エイデン、アメリア、そしてイーサン。「イーサンは騎士で、アメリアはならず者だ」とエイデンが言いました。アメリアの発言では、「アメリアは騎士であるのは、イーサンがならず者である場合に限る」と言いました。イーサンは、「アメリアは騎士で、エイデンはならず者だ」と述べました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンはならず者です  \n(2) アメリアはならず者です  \n(3) イーサンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ヘンリー、ダニエル、そしてアビゲイル。ヘンリーは「ダニエルは騎士ではない」と言いました。ダニエルは「もしアビゲイルが騎士なら、ヘンリーは騎士だ」と述べました。アビゲイルは「ダニエルはならず者だ」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ヘンリーはならず者です  \n(2) ダニエルは騎士です  \n(3) アビゲイルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ジャック、エミリー、そしてエイデン。ジャックは「エミリーはならず者ではない」と主張しました。「エミリーは騎士であるか、エイデンはならず者である」とエミリーが言いました。エイデンは、エイデンが騎士であるのはエミリーがならず者である場合に限るとあなたに言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャックはならず者です  \n(2) エミリーはならず者です  \n(3) エイデンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：イーサン、マイケル、そしてローガン。イーサンは「もしローガンが騎士なら、イーサンは騎士だ」と言いました。マイケルの発言では「イーサンは騎士だ」と言っています。ローガンの発言では「イーサンはならず者である場合、かつマイケルが騎士である場合」と言っています。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンは騎士です  \n(2) マイケルは騎士です  \n(3) ローガンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ソフィア、ジャクソン、そしてルーク。ソフィアはルークが騎士であると表現しました。ジャクソンは、もしソフィアがならず者であればルークもならず者であると言いました。ルークの発言では、「ソフィアは騎士である場合に限りソフィアはならず者である」と言っています。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアはならず者です  \n(2) ジャクソンは騎士です  \n(3) ルークはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ジャクソン、ゾーイ、そしてソフィア。「ゾーイは騎士だ」とジャクソンは主張しました。ゾーイは、ジャクソンがならず者であるか、ゾーイが騎士であると表現しました。ソフィアは、ゾーイが騎士であり、ジャクソンも騎士であると言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンは騎士です  \n(2) ゾーイは騎士です  \n(3) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エイヴァ、ノア、そしてセバスチャン。エイヴァの言葉では、「エイヴァは騎士です」。ノアは、「エイヴァはならず者か、セバスチャンはならず者です」と述べました。セバスチャンは、「ノアは騎士です」と主張しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァはならず者です  \n(2) ノアは騎士です  \n(3) セバスチャンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：メイソン、マシュー、そしてエマ。メイソンは「エマはならず者か、マシューは騎士だ」と言いました。マシューは「もしエマがならず者なら、メイソンは騎士だ」と言いました。「マシューは騎士だ」とエマは宣言しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) メイソンは騎士です  \n(2) マシューは騎士です  \n(3) エマは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：サミュエル、イーサン、そしてスカーレット。サミュエルは、イーサンがならず者である場合に限り、スカーレットがならず者であると表現しました。イーサンは、「サミュエルはならず者だ」と述べました。スカーレットは、イーサンがならず者である場合に限り、スカーレットが騎士であると表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルは騎士です  \n(2) イーサンはならず者です  \n(3) スカーレットはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：エリザベス、スカーレット、そしてジェームズ。エリザベスの言葉では、「ジェームズは騎士ではありません」。スカーレットは宣言しました。「もしジェームズが騎士なら、エリザベスはならず者です」。ジェームズは言いました。「スカーレットは騎士であり、スカーレットはならず者です」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスは騎士です  \n(2) スカーレットは騎士です  \n(3) ジェームズはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ルーカス、エマ、そしてゾーイ。ルーカスの言葉では、「ゾーイはならず者ではない」と言っています。エマは、ゾーイは騎士ではないと表現しました。ゾーイは、「エマはならず者で、ルーカスもならず者だ」と主張しました。それでは、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) ルーカスはならず者です  \n(2) エマは騎士です  \n(3) ゾーイはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：ジャクソン、エマ、そしてサミュエル。ジャクソンは「サミュエルは騎士か、ジャクソンは騎士だ」と言いました。エマの発言では「エマは騎士である場合に限り、ジャクソンはならず者である」と言っています。サミュエルの言葉では「ジャクソンはならず者で、エマはならず者だ」と言っています。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンはならず者です  \n(2) エマは騎士です  \n(3) サミュエルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：オーウェン、ビクトリア、そしてリアム。オーウェンの発言はこうです：「ビクトリアはならず者で、ビクトリアは騎士です」。ビクトリアはこう言いました：「オーウェンはならず者で、リアムはならず者です」。リアムはビクトリアがならず者で、ビクトリアが騎士だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンはならず者です  \n(2) ビクトリアは騎士です  \n(3) リアムはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは3人の住人に出会います：オリビア、ジャック、そしてジェイコブ。オリビアは言いました。「もしジャックがならず者なら、ジェイコブはならず者です。」ジャックの発言はこうです。「ジェイコブは騎士であり、ジェイコブはならず者です。」ジェイコブはコメントしました。「もしジャックが騎士なら、オリビアは騎士です。」では、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) オリビアはならず者です  \n(2) ジャックはならず者です  \n(3) ジェイコブは騎士です"
    }
]