[
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：オーロラ、イーサン、ノア、アリア、そしてアビゲイル。「アビゲイルはならず者ではない」とオーロラが言いました。イーサンは「アビゲイルはならず者か、アリアはならず者だ」と述べました。ノアによれば、「アリアはならず者です」。アリアは、ノアが騎士である場合に限り、オーロラがならず者であると言いました。アビゲイルはノアが騎士であると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーロラは騎士です  \n(2) イーサンは騎士です  \n(3) ノアは騎士です  \n(4) アリアはならず者です  \n(5) アビゲイルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：アビゲイル、メイソン、エリザベス、エミリー、そしてソフィア。「ソフィアはならず者か、エリザベスは騎士だ」とアビゲイルが宣言しました。「ソフィアは騎士だ」とメイソンが言いました。「アビゲイルは騎士ではない」とエリザベスが主張しました。エミリーの発言では、「アビゲイルは騎士か、エリザベスは騎士だ」と言いました。ソフィアは「もしエミリーが騎士なら、エミリーはならず者だ」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アビゲイルは騎士です  \n(2) メイソンはならず者です  \n(3) エリザベスはならず者です  \n(4) エミリーは騎士です  \n(5) ソフィアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ペネロペ、ルーカス、アメリア、エミリー、そしてゾーイ。ペネロペは「ルーカスは騎士か、アメリアは騎士です」と主張しました。ルーカスの発言では「ルーカスが騎士なら、ゾーイはならず者です」と言いました。アメリアは「エミリーはならず者です」と述べました。エミリーは「ペネロペはならず者で、ゾーイはならず者です」と指摘しました。ゾーイは「エミリーは騎士で、エミリーはならず者です」とあなたに言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペは騎士です  \n(2) ルーカスは騎士です  \n(3) アメリアは騎士です  \n(4) エミリーはならず者です  \n(5) ゾーイはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ウィリアム、ジェイコブ、エイデン、アリア、そしてローガン。ウィリアムの発言はこうです：「もしエイデンが騎士なら、アリアはならず者です」。ジェイコブは「ローガンはならず者で、ジェイコブは騎士です」と言っているのが聞かれました。エイデンは「アリアはならず者か、ウィリアムは騎士です」と言いました。アリアはウィリアムがならず者だと言いました。ローガンは「ジェイコブは騎士です」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムは騎士です  \n(2) ジェイコブはならず者です  \n(3) エイデンは騎士です  \n(4) アリアはならず者です  \n(5) ローガンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ルーカス、アレクサンダー、ヘンリー、エイデン、そしてセバスチャン。ルーカスは「ヘンリーは騎士だ」とコメントしました。アレクサンダーは「エイデンは騎士だ」と言いました。ヘンリーは「セバスチャンは騎士で、ヘンリーは騎士だ」と述べました。エイデンは「ルーカスは騎士ではない」と宣言しました。セバスチャンは「ルーカスはならず者か、エイデンは騎士だ」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスはならず者です  \n(2) アレクサンダーは騎士です  \n(3) ヘンリーはならず者です  \n(4) エイデンは騎士です  \n(5) セバスチャンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：アメリア、ゾーイ、オーウェン、サミュエル、そしてアリア。アメリアはこう言いました。「ゾーイはならず者で、オーウェンはならず者です」。ゾーイはアメリアが騎士で、アリアが騎士だと表現しました。オーウェンは「サミュエルは騎士で、アメリアはならず者です」と言っているのが聞かれました。「もしアリアが騎士なら、ゾーイは騎士です」とサミュエルは宣言しました。アリアは「ゾーイはオーウェンがならず者である場合に限り騎士です」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアは騎士です  \n(2) ゾーイはならず者です  \n(3) オーウェンはならず者です  \n(4) サミュエルは騎士です  \n(5) アリアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ダニエル、メイソン、アリア、リアム、そしてマイケル。ダニエルは「マイケルはならず者だ」と言いました。メイソンは「リアムはならず者だ」と主張しました。「もしメイソンがならず者なら、マイケルはならず者だ」とアリアが言いました。リアムは「メイソンが騎士である限り、メイソンはならず者だ」と言いました。「アリアは騎士ではない」とマイケルが言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルは騎士です  \n(2) メイソンは騎士です  \n(3) アリアは騎士です  \n(4) リアムはならず者です  \n(5) マイケルはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エイヴァ、アビゲイル、ハーパー、ペネロペ、そしてイーサン。エイヴァは、イーサンが騎士でアビゲイルがならず者だと言いました。アビゲイルは「アビゲイルは騎士か、ペネロペはならず者だ」と言っているのが聞かれました。ハーパーによれば、「ハーパーが騎士ならアビゲイルは騎士だ」とのことです。「アビゲイルはならず者ではない」とペネロペは主張しました。イーサンは、もしエイヴァが騎士ならアビゲイルはならず者だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァはならず者です  \n(2) アビゲイルは騎士です  \n(3) ハーパーは騎士です  \n(4) ペネロペは騎士です  \n(5) イーサンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：デイビッド、イヴリン、ジェームズ、グレース、そしてメイソン。デイビッドは「イヴリンはならず者か、イヴリンは騎士だ」と述べました。イヴリンはグレースがならず者で、メイソンが騎士だと表現しました。ジェームズはデイビッドが騎士ではないと述べました。グレースの言葉では、「もしデイビッドがならず者なら、ジェームズはならず者だ」と言いました。メイソンは「グレースは騎士だ」とコメントしました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドは騎士です  \n(2) イヴリンはならず者です  \n(3) ジェームズはならず者です  \n(4) グレースは騎士です  \n(5) メイソンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：アリア、ジャクソン、イーサン、オーウェン、そしてヘンリー。アリアは「オーウェンは騎士か、アリアは騎士です」とコメントしました。ジャクソンは「もしイーサンが騎士なら、アリアは騎士です」とコメントしました。「アリアはならず者である場合、オーウェンはならず者です」とイーサンは宣言しました。オーウェンは「もしヘンリーが騎士なら、ヘンリーはならず者です」と言っているのが聞かれました。「ジャクソンはならず者である場合、オーウェンはならず者です」とヘンリーは言及しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アリアはならず者です  \n(2) ジャクソンはならず者です  \n(3) イーサンは騎士です  \n(4) オーウェンはならず者です  \n(5) ヘンリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：リアム、アビゲイル、オリバー、シャーロット、そしてジョセフ。リアムによれば、「シャーロットは騎士で、ジョセフはならず者です」。アビゲイルは「シャーロットはならず者か、リアムは騎士です」と言いました。オリバーによれば、「シャーロットは騎士です」。シャーロットはあなたに、リアムはならず者だと言いました。ジョセフの言葉では、「リアムは騎士ではありません」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムはならず者です  \n(2) アビゲイルはならず者です  \n(3) オリバーは騎士です  \n(4) シャーロットは騎士です  \n(5) ジョセフは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エラ、ビクトリア、ライリー、エイブリー、そしてソフィア。エラは「エラは騎士であるか、ビクトリアはならず者である」と主張しました。ビクトリアは「もしビクトリアが騎士であれば、ライリーは騎士である」と主張しました。ライリーは「エラは騎士ではない」と主張しました。「ソフィアは騎士であるか、エラはならず者である」とエイブリーが宣言しました。ソフィアは「もしビクトリアがならず者であれば、ライリーはならず者である」と表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラはならず者です  \n(2) ビクトリアは騎士です  \n(3) ライリーは騎士です  \n(4) エイブリーは騎士です  \n(5) ソフィアは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジョセフ、マイケル、エリザベス、ルーカス、そしてアリア。ジョセフは「ルーカスはならず者で、エリザベスはならず者だ」と言いました。マイケルは「エリザベスはならず者で、エリザベスは騎士だ」と言いました。エリザベスの言葉では「マイケルはならず者ではない」と言っています。ルーカスは「マイケルは騎士ではない」と述べました。アリアは「アリアは騎士で、ジョセフは騎士だ」と主張しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフはならず者です  \n(2) マイケルはならず者です  \n(3) エリザベスはならず者です  \n(4) ルーカスは騎士です  \n(5) アリアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：アレクサンダー、ジェームズ、エイヴァ、ローガン、そしてグレース。アレクサンダーは「グレースが騎士なら、ローガンは騎士だ」と言いました。ジェームズは「エイヴァはならず者か、ローガンは騎士だ」と述べました。エイヴァによれば、「アレクサンダーが騎士である限り、ジェームズはならず者だ」とのことです。「アレクサンダーがならず者である限り、ジェームズは騎士だ」とローガンが宣言しました。「エイヴァはならず者であり、エイヴァは騎士だ」とグレースが宣言しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アレクサンダーは騎士です  \n(2) ジェームズは騎士です  \n(3) エイヴァはならず者です  \n(4) ローガンはならず者です  \n(5) グレースはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：イヴリン、クロエ、マシュー、ウィリアム、そしてソフィア。イヴリンは、クロエがならず者であるか、ウィリアムが騎士であると表現しました。クロエは「マシューは騎士であるか、マシューはならず者である」と主張しました。「ウィリアムは騎士ではない」とマシューは主張しました。ウィリアムによれば、「マシューはならず者であるのは、イヴリンがならず者である場合に限る」とのことです。ソフィアの言葉では、「マシューは騎士であるのは、マシューがならず者である場合に限る」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンはならず者です  \n(2) クロエは騎士です  \n(3) マシューは騎士です  \n(4) ウィリアムはならず者です  \n(5) ソフィアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：デイビッド、シャーロット、ジャクソン、サミュエル、そしてエイブリー。デイビッドは「もしサミュエルが騎士なら、シャーロットはならず者だ」と言っているのが聞かれました。シャーロットは「デイビッドがならず者であるのは、エイブリーがならず者である場合に限る」と言いました。ジャクソンは「シャーロットはならず者か、エイブリーはならず者だ」と述べました。「もしジャクソンがならず者なら、デイビッドは騎士だ」とサミュエルが言いました。エイブリーによれば「シャーロットはならず者だ」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドはならず者です  \n(2) シャーロットは騎士です  \n(3) ジャクソンは騎士です  \n(4) サミュエルは騎士です  \n(5) エイブリーはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：リアム、エリザベス、エイデン、マシュー、そしてベンジャミン。リアムの言葉では、「エイデンは騎士で、ベンジャミンはならず者です」。エリザベスの言葉では、「マシューは騎士である場合に限り、マシューはならず者です」。エイデンの発言では、「もしリアムがならず者なら、リアムは騎士です」。マシューは「リアムは騎士ではありません」と宣言しました。ベンジャミンによれば、「エイデンは騎士です」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムはならず者です  \n(2) エリザベスはならず者です  \n(3) エイデンはならず者です  \n(4) マシューは騎士です  \n(5) ベンジャミンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エイデン、シャーロット、アレクサンダー、ルーカス、そしてエミリー。「アレクサンダーはならず者か、エミリーは騎士です」 - エイデン。シャーロットは、エイデンは騎士ではないと言いました。アレクサンダーは「エイデンはならず者です」と述べました。「もしエミリーが騎士なら、シャーロットは騎士です」とルーカスは主張しました。エミリーは、もしシャーロットがならず者なら、エイデンはならず者だと表現しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンは騎士です  \n(2) シャーロットはならず者です  \n(3) アレクサンダーはならず者です  \n(4) ルーカスは騎士です  \n(5) エミリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：シャーロット、オリバー、エラ、ライリー、そしてダニエル。シャーロットは「オリバーはならず者だ」とコメントしました。オリバーは「ダニエルは騎士ではない」と言いました。「シャーロットはならず者であり、シャーロットは騎士だ」とエラが言いました。ライリーは「エラはならず者か、シャーロットはならず者だ」と主張しました。ダニエルによれば、「オリバーはシャーロットが騎士である場合に限りならず者だ」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットは騎士です  \n(2) オリバーはならず者です  \n(3) エラはならず者です  \n(4) ライリーは騎士です  \n(5) ダニエルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：イーサン、ジェームズ、エミリー、マイケル、そしてビクトリア。イーサンは「エミリーはならず者か、マイケルは騎士だ」と述べました。ジェームズは「イーサンは騎士で、イーサンはならず者だ」と言っているのが聞かれました。エミリーは「ジェームズはならず者だ」と言いました。マイケルは「もしエミリーが騎士なら、エミリーはならず者だ」と主張しました。ビクトリアによれば「イーサンはならず者か、マイケルはならず者だ」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンはならず者です  \n(2) ジェームズはならず者です  \n(3) エミリーは騎士です  \n(4) マイケルはならず者です  \n(5) ビクトリアは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：メイソン、オーロラ、ヘンリー、ビクトリア、そしてダニエル。メイソンは「ビクトリアが騎士なら、オーロラも騎士だ」とコメントしました。オーロラはダニエルが騎士だと表現しました。ヘンリーの言葉では「メイソンがならず者なら、オーロラは騎士だ」と言っています。「オーロラは騎士で、ダニエルも騎士だ」とビクトリアが言いました。ダニエルは「ヘンリーは騎士ではない」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) メイソンは騎士です  \n(2) オーロラはならず者です  \n(3) ヘンリーは騎士です  \n(4) ビクトリアはならず者です  \n(5) ダニエルはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジェームズ、ルーカス、マイケル、アレクサンダー、そしてオーロラ。ジェームズは「ルーカスは騎士で、オーロラも騎士だ」と言いました。「アレクサンダーはならず者か、ルーカスは騎士だ」とルーカスが言いました。「ルーカスはならず者か、ジェームズは騎士だ」とマイケルが主張しました。アレクサンダーの言葉では「もしルーカスが騎士なら、マイケルはならず者だ」と言いました。オーロラは「もしオーロラが騎士なら、ルーカスは騎士だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズは騎士です  \n(2) ルーカスは騎士です  \n(3) マイケルは騎士です  \n(4) アレクサンダーはならず者です  \n(5) オーロラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：アメリア、ゾーイ、アビゲイル、ジェイコブ、そしてソフィア。「ジェイコブはならず者であるのは、ソフィアが騎士である場合に限る」とアメリアは主張しました。ゾーイは「ジェイコブはならず者だ」と言いました。アビゲイルは「ゾーイは騎士であるのは、アメリアがならず者である場合に限る」と述べました。ジェイコブは「ゾーイがならず者であれば、ジェイコブは騎士だ」と言いました。ソフィアによれば、「ゾーイは騎士ではない」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアはならず者です  \n(2) ゾーイはならず者です  \n(3) アビゲイルはならず者です  \n(4) ジェイコブは騎士です  \n(5) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ソフィア、ミア、エミリー、イヴリン、そしてシャーロット。ソフィアの発言では、「イヴリンはならず者である場合、ミアもならず者である」と言っています。ミアは、「イヴリンはならず者であるか、ソフィアは騎士である」と言いました。エミリーの発言では、「ミアは騎士であるか、イヴリンはならず者である」と言っています。イヴリンの言葉では、「シャーロットがならず者であれば、ミアは騎士である」と言っています。シャーロットは、ソフィアが騎士であると表現しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) ミアは騎士です  \n(3) エミリーは騎士です  \n(4) イヴリンは騎士です  \n(5) シャーロットは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：シャーロット、ノア、ゾーイ、ジャック、そしてミア。シャーロットは「ミアはならず者で、ノアは騎士です」と言いました。ノアは「シャーロットはならず者で、ゾーイは騎士です」と述べました。ゾーイは「ノアはならず者で、シャーロットは騎士です」と言いました。「ミアは騎士ではありません」とジャックが言いました。「シャーロットはならず者で、ゾーイは騎士です」とミアが言いました。では、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) シャーロットはならず者です  \n(2) ノアはならず者です  \n(3) ゾーイはならず者です  \n(4) ジャックは騎士です  \n(5) ミアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エイブリー、ジェームズ、ダニエル、エラ、そしてウィリアム。エイブリーは「ウィリアムはならず者だ」と言いました。ジェームズは「エラは騎士か、ウィリアムはならず者だ」と言っているのが聞かれました。ダニエルは「もしエイブリーが騎士なら、エラは騎士だ」とコメントしました。エラの発言では「ダニエルはならず者だ」と言いました。ウィリアムによれば「エイブリーはならず者か、ダニエルはならず者だ」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーはならず者です  \n(2) ジェームズはならず者です  \n(3) ダニエルは騎士です  \n(4) エラはならず者です  \n(5) ウィリアムは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジャック、リアム、イーサン、アメリア、そしてハーパーです。ジャックの言葉によれば、「イーサンはならず者か、アメリアはならず者です」。リアムによると、「イーサンは騎士か、ハーパーは騎士です」。イーサンの発言では、「ジャックはならず者ではありません」。アメリアの発言では、「もしリアムが騎士なら、アメリアは騎士です」。ハーパーの言葉では、「もしリアムがならず者なら、アメリアは騎士です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャックは騎士です  \n(2) リアムは騎士です  \n(3) イーサンは騎士です  \n(4) アメリアはならず者です  \n(5) ハーパーは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ペネロペ、マイケル、ダニエル、マシュー、そしてイヴリン。ペネロペは「ペネロペは騎士で、マイケルはならず者です」と宣言しました。マイケルは「ダニエルはならず者か、ダニエルは騎士です」と宣言しました。ダニエルは「ペネロペはならず者か、イヴリンはならず者です」とコメントしました。マシューは「ペネロペは騎士である場合に限り、ダニエルは騎士です」と言っているのが聞かれました。イヴリンは「ペネロペは騎士です」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペはならず者です  \n(2) マイケルは騎士です  \n(3) ダニエルは騎士です  \n(4) マシューはならず者です  \n(5) イヴリンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：セバスチャン、ノア、ベンジャミン、ヘンリー、そしてエイヴァ。セバスチャンは「エイヴァが騎士である場合に限り、エイヴァはならず者である」と言いました。ノアは「エイヴァはならず者だ」とコメントしました。ベンジャミンは「エイヴァはならず者であるか、ノアは騎士である」と言っているのが聞かれました。「エイヴァはならず者だ」とヘンリーが言いました。「セバスチャンはならず者ではない」とエイヴァが主張しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) セバスチャンはならず者です  \n(2) ノアは騎士です  \n(3) ベンジャミンは騎士です  \n(4) ヘンリーは騎士です  \n(5) エイヴァはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：メイソン、リアム、オーウェン、イザベラ、そしてエミリー。メイソンは「リアムはならず者で、エミリーはならず者だ」と言いました。リアムは「エミリーはならず者か、メイソンは騎士だ」と言いました。オーウェンは「リアムは騎士ではない」と言いました。イザベラによれば「オーウェンが騎士なら、リアムは騎士だ」とのことです。エミリーは「メイソンは騎士か、メイソンはならず者だ」と主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) メイソンはならず者です  \n(2) リアムはならず者です  \n(3) オーウェンは騎士です  \n(4) イザベラはならず者です  \n(5) エミリーは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：リリー、リアム、エラ、エイデン、そしてサミュエル。リリーによれば、「リアムは騎士であるか、サミュエルはならず者です」。リアムによれば、「エラがならず者なら、リリーはならず者です」。エラは「リアムはならず者ではない」と主張しました。エイデンは「リリーはならず者ではない」と指摘しました。サミュエルは「リリーはならず者ではない」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーは騎士です  \n(2) リアムは騎士です  \n(3) エラは騎士です  \n(4) エイデンは騎士です  \n(5) サミュエルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ソフィア、ベンジャミン、オリビア、ジョセフ、そしてイザベラ。「ソフィアは騎士であるのは、ベンジャミンがならず者である場合に限る」とソフィアは言いました。「オリビアはならず者だ」とベンジャミンは宣言しました。オリビアの言葉では、「オリビアは騎士であるのは、イザベラが騎士である場合に限る」とのことです。「もしオリビアが騎士なら、ベンジャミンはならず者だ」とジョセフは言いました。「ソフィアは騎士ではない」とイザベラは言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアはならず者です  \n(2) ベンジャミンはならず者です  \n(3) オリビアは騎士です  \n(4) ジョセフは騎士です  \n(5) イザベラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：マイケル、ウィリアム、ソフィア、サミュエル、そしてライリー。「サミュエルはならず者で、ソフィアはならず者だ」とマイケルは主張しました。ウィリアムは「サミュエルは騎士だ」と言っているのが聞かれました。ソフィアは「マイケルはならず者だ」とコメントしました。サミュエルは「マイケルはソフィアが騎士である場合に限りならず者だ」と主張しました。ライリーはマイケルがならず者だと表現しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルはならず者です  \n(2) ウィリアムは騎士です  \n(3) ソフィアは騎士です  \n(4) サミュエルは騎士です  \n(5) ライリーは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会いました：リリー、ルーク、スカーレット、ジェームズ、そしてペネロペ。リリーはスカーレットが騎士ではないと言いました。ルークもスカーレットが騎士ではないと言いました。「ジェームズはルークがならず者である場合に限り騎士です」とスカーレットが言いました。ジェームズはリリーがならず者であり、ルークがならず者であると表現しました。ペネロペは「ルークはならず者ではない」とコメントしました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーはならず者です  \n(2) ルークはならず者です  \n(3) スカーレットは騎士です  \n(4) ジェームズは騎士です  \n(5) ペネロペはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：グレース、ミア、エイデン、セバスチャン、そしてエリザベス。グレースは「もしミアがならず者なら、エイデンはならず者だ」と言っているのが聞かれました。ミアは「セバスチャンは騎士か、グレースはならず者だ」と言っているのが聞かれました。エイデンは、グレースがならず者で、セバスチャンもならず者だとあなたに言いました。「ミアは騎士か、エリザベスはならず者だ」とセバスチャンは主張しました。エリザベスは「セバスチャンはならず者ではない」と指摘しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) グレースは騎士です  \n(2) ミアは騎士です  \n(3) エイデンはならず者です  \n(4) セバスチャンは騎士です  \n(5) エリザベスは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：リアム、ジェイコブ、エミリー、エリザベス、そしてメイソン。リアムは「エミリーが騎士なら、リアムは騎士だ」と言いました。「エリザベスは騎士だ」とジェイコブが宣言しました。エミリーは「エリザベスは騎士だ」と述べました。「リアムはならず者である場合に限り、ジェイコブは騎士だ」とエリザベスが主張しました。メイソンは「リアムはならず者か、ジェイコブは騎士だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムはならず者です  \n(2) ジェイコブは騎士です  \n(3) エミリーは騎士です  \n(4) エリザベスは騎士です  \n(5) メイソンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ローガン、ジャクソン、クロエ、リアム、そしてイザベラ。ローガンは「ジャクソンは騎士か、クロエは騎士だ」と言っているのが聞かれました。ジャクソンは「リアムはならず者か、クロエは騎士だ」と述べました。クロエはイザベラがならず者だと表現しました。リアムは「クロエは騎士か、イザベラは騎士だ」と言いました。イザベラは「ローガンは騎士で、クロエはならず者だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンは騎士です  \n(2) ジャクソンは騎士です  \n(3) クロエは騎士です  \n(4) リアムは騎士です  \n(5) イザベラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ルーカス、アビゲイル、オリビア、シャーロット、そしてマシュー。ルーカスは「マシューは騎士で、シャーロットは騎士だ」と主張しました。アビゲイルは「もしオリビアが騎士なら、マシューは騎士だ」と述べました。オリビアによれば「もしルーカスが騎士なら、ルーカスはならず者だ」とのことです。シャーロットは「シャーロットは騎士であるのは、マシューがならず者であるときだけだ」と主張しました。マシューは「アビゲイルは騎士か、シャーロットは騎士だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスはならず者です  \n(2) アビゲイルはならず者です  \n(3) オリビアは騎士です  \n(4) シャーロットはならず者です  \n(5) マシューはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ルーカス、グレース、ソフィア、ルーク、そしてオリバー。ルーカスは「ルークは騎士だ」と言いました。グレースは「ルークはならず者ではない」と述べました。「ルーカスはならず者で、グレースは騎士だ」とソフィアは宣言しました。ルークは「ルーカスはならず者で、ルーカスは騎士だ」とコメントしました。オリバーの言葉では「ソフィアはならず者だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスはならず者です  \n(2) グレースはならず者です  \n(3) ソフィアはならず者です  \n(4) ルークはならず者です  \n(5) オリバーは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジェームズ、ソフィア、エラ、ライリー、そしてヘンリー。ジェームズは「ヘンリーはならず者で、エラはならず者だ」と主張しました。ソフィアの言葉では「もしソフィアが騎士なら、エラはならず者だ」と言っています。エラの言葉では「ヘンリーはエラが騎士である場合に限り騎士だ」と言っています。「もしジェームズが騎士なら、エラは騎士だ」とライリーが言いました。「ジェームズはならず者だ」とヘンリーが主張しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズはならず者です  \n(2) ソフィアは騎士です  \n(3) エラはならず者です  \n(4) ライリーは騎士です  \n(5) ヘンリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：クロエ、ジャック、リリー、アレクサンダー、そしてウィリアム。クロエは「ウィリアムはならず者だ」とコメントしました。ジャックは「アレクサンダーはならず者だ」と言いました。リリーの言葉では、「もしウィリアムが騎士なら、ウィリアムはならず者だ」とのことです。「リリーはならず者である場合、ジャックはならず者である」とアレクサンダーが言いました。「アレクサンダーは騎士であるか、リリーは騎士である」とウィリアムが主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) クロエはならず者です  \n(2) ジャックはならず者です  \n(3) リリーはならず者です  \n(4) アレクサンダーは騎士です  \n(5) ウィリアムは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ソフィア、ジャクソン、ノア、エリザベス、そしてオーロラ。「オーロラはならず者ではない」とソフィアが言いました。ジャクソンは「ノアはならず者で、オーロラはならず者だ」と言っているのが聞かれました。ノアの発言では、「もしジャクソンがならず者なら、オーロラはならず者だ」と言っています。「ノアは騎士であり、ノアはならず者だ」とエリザベスが宣言しました。オーロラは、ジャクソンが騎士である場合に限り、エリザベスは騎士であると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) ジャクソンはならず者です  \n(3) ノアはならず者です  \n(4) エリザベスはならず者です  \n(5) オーロラは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会いました：ルーク、ジェームズ、リリー、サミュエル、そしてヘンリー。ルークは「もしルークが騎士なら、ヘンリーはならず者だ」と言いました。ジェームズは「ヘンリーはならず者ではない」と言いました。リリーは「ルークは騎士であり、ルークはならず者だ」と述べました。サミュエルによれば、「サミュエルは騎士であるのは、ジェームズがならず者である場合に限る」とのことです。ヘンリーは「サミュエルはならず者であるのは、ヘンリーが騎士である場合に限る」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) ジェームズはならず者です  \n(3) リリーはならず者です  \n(4) サミュエルはならず者です  \n(5) ヘンリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ソフィア、メイソン、オーウェン、エミリー、そしてセバスチャン。ソフィアは「メイソンは騎士か、セバスチャンは騎士です」と言っているのが聞かれました。メイソンは「セバスチャンはならず者で、エミリーはならず者です」と言いました。オーウェンの言葉では「エミリーがならず者なら、ソフィアはならず者です」と言っています。エミリーの言葉では「セバスチャンはならず者か、ソフィアは騎士です」と言っています。セバスチャンによれば「ソフィアはならず者か、セバスチャンは騎士です」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) メイソンはならず者です  \n(3) オーウェンは騎士です  \n(4) エミリーは騎士です  \n(5) セバスチャンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：アメリア、スカーレット、ビクトリア、ルーカス、そしてヘンリー。アメリアはこう言いました。「スカーレットは騎士である場合に限り、スカーレットはならず者です。」スカーレットによれば、「アメリアはならず者ではありません。」ビクトリアの発言では、「スカーレットはならず者であるか、ビクトリアは騎士です。」ルーカスは、ヘンリーが騎士であれば、ヘンリーはならず者であると表現しました。「スカーレットは騎士であり、アメリアは騎士です」とヘンリーは言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアはならず者です  \n(2) スカーレットはならず者です  \n(3) ビクトリアは騎士です  \n(4) ルーカスは騎士です  \n(5) ヘンリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：イヴリン、クロエ、ソフィア、アビゲイル、そしてエミリー。イヴリンは「クロエは騎士で、ソフィアも騎士です」と述べました。クロエは「エミリーは騎士であるのは、ソフィアがならず者である場合に限ります」と言いました。ソフィアは「アビゲイルは騎士であるか、ソフィアは騎士である」と述べました。アビゲイルは「もしイヴリンがならず者なら、エミリーは騎士です」と言いました。エミリーは「クロエはならず者で、アビゲイルはならず者です」とコメントしました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンは騎士です  \n(2) クロエは騎士です  \n(3) ソフィアは騎士です  \n(4) アビゲイルは騎士です  \n(5) エミリーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ベンジャミン、アレクサンダー、ダニエル、オーロラ、そしてジョセフです。ベンジャミンは「オーロラは騎士だ」と言いました。アレクサンダーは「もしジョセフがならず者なら、ジョセフは騎士だ」と言いました。ダニエルの発言では「ベンジャミンはならず者か、ダニエルは騎士だ」と言っています。オーロラは「ジョセフはベンジャミンが騎士であるときに限り騎士だ」と言っているのが聞かれました。「ダニエルはオーロラがならず者であるときに限りならず者だ」とジョセフが言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンは騎士です  \n(2) アレクサンダーは騎士です  \n(3) ダニエルは騎士です  \n(4) オーロラは騎士です  \n(5) ジョセフは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ソフィア、エラ、オーウェン、シャーロット、そしてクロエ。ソフィアはこう言いました。「シャーロットは騎士か、オーウェンは騎士です」。エラは「シャーロットはならず者で、ソフィアはならず者です」と言っているのが聞かれました。オーウェンは「シャーロットはならず者であるのは、クロエが騎士である場合に限ります」と述べました。シャーロットは「エラが騎士であれば、シャーロットは騎士です」と言っているのが聞かれました。クロエは「クロエは騎士であるのは、エラが騎士である場合に限ります」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアはならず者です  \n(2) エラは騎士です  \n(3) オーウェンはならず者です  \n(4) シャーロットはならず者です  \n(5) クロエはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会いました：デイビッド、ウィリアム、オーロラ、リアム、そしてローガン。デイビッドは、ウィリアムがならず者であるか、オーロラがならず者であると言いました。ウィリアムは、「デイビッドがならず者であれば、リアムは騎士である」と言いました。「デイビッドはオーロラが騎士である場合に限り騎士です」とオーロラは主張しました。リアムは、ローガンがならず者であると言いました。ローガンは、「ウィリアムは騎士である場合に限り、ウィリアムはならず者です」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドは騎士です  \n(2) ウィリアムは騎士です  \n(3) オーロラはならず者です  \n(4) リアムは騎士です  \n(5) ローガンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：シャーロット、アビゲイル、グレース、ミア、そしてスカーレット。「もしグレースがならず者なら、ミアは騎士だ」 - シャーロット。「スカーレットはミアが騎士である場合に限りならず者だ」 - アビゲイル。グレースの発言では、「スカーレットはならず者だ」。ミアは「グレースはスカーレットが騎士である場合に限り騎士だ」と言いました。スカーレットは「ミアは騎士ではない」と指摘しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットはならず者です  \n(2) アビゲイルは騎士です  \n(3) グレースはならず者です  \n(4) ミアはならず者です  \n(5) スカーレットは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジョセフ、リリー、ベンジャミン、クロエ、そしてハーパーです。「ジョセフは騎士で、クロエはならず者だ」とジョセフは宣言しました。「もしリリーが騎士なら、ジョセフはならず者だ」とリリーは主張しました。ベンジャミンは、「ジョセフはならず者であるのは、クロエが騎士である場合に限る」と述べました。クロエは、「もしハーパーがならず者なら、ベンジャミンは騎士だ」と言いました。ハーパーは、「ベンジャミンは騎士ではない」と指摘しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフはならず者です  \n(2) リリーは騎士です  \n(3) ベンジャミンは騎士です  \n(4) クロエは騎士です  \n(5) ハーパーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：セバスチャン、オーロラ、ヘンリー、エイヴァ、そしてエミリー。「ヘンリーはならず者で、セバスチャンは騎士だ」とセバスチャンが言いました。オーロラは「もしヘンリーが騎士なら、エイヴァはならず者だ」とコメントしました。ヘンリーの言葉では、「エミリーは騎士ではない」。エイヴァは「ヘンリーは騎士である場合、オーロラはならず者である」と述べました。エミリーは「ヘンリーは騎士である場合、オーロラは騎士である」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) セバスチャンはならず者です  \n(2) オーロラはならず者です  \n(3) ヘンリーは騎士です  \n(4) エイヴァは騎士です  \n(5) エミリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エラ、ゾーイ、ローガン、エミリー、そしてマイケル。エラは「ゾーイはならず者で、ゾーイは騎士です」と言いました。ゾーイは「エラは騎士で、ゾーイは騎士です」と表現しました。ローガンは「もしエラがならず者なら、ゾーイはならず者です」と述べました。エミリーは「エラはならず者で、マイケルは騎士です」と表現しました。「もしエミリーがならず者なら、ゾーイはならず者です」とマイケルは主張しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラはならず者です  \n(2) ゾーイはならず者です  \n(3) ローガンは騎士です  \n(4) エミリーは騎士です  \n(5) マイケルは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：マシュー、エマ、ジャクソン、ウィリアム、そしてジャックです。「ジャクソンはウィリアムがならず者である場合に限り騎士です」とマシューが言いました。エマは「マシューは騎士です」と言っているのが聞かれました。ジャクソンは「エマは騎士であり、エマはならず者です」とコメントしました。ウィリアムは「ジャックがならず者ならエマはならず者です」と言いました。ジャックは「ジャックは騎士であり、ウィリアムは騎士です」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マシューは騎士です  \n(2) エマは騎士です  \n(3) ジャクソンはならず者です  \n(4) ウィリアムは騎士です  \n(5) ジャックは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ノア、アリア、ジャクソン、アビゲイル、そしてゾーイ。ノアは「ゾーイは騎士で、ノアは騎士だ」と言っているのが聞かれました。アリアは「もしノアが騎士なら、ジャクソンは騎士だ」とあなたに言いました。ジャクソンは「ノアはならず者で、アリアはならず者だ」と言いました。アビゲイルは「ノアは騎士か、アリアは騎士だ」と述べました。「アリアは騎士で、ノアはならず者だ」とゾーイは宣言しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアはならず者です  \n(2) アリアは騎士です  \n(3) ジャクソンはならず者です  \n(4) アビゲイルは騎士です  \n(5) ゾーイは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジャック、ミア、オーロラ、マシュー、そしてノア。ジャックは「もしマシューがならず者なら、ノアはならず者だ」と主張しました。ミアは「ミアは騎士であり、オーロラは騎士だ」と言いました。オーロラは「ミアは騎士だ」と言いました。マシューは「もしマシューが騎士なら、ミアは騎士だ」と言いました。ノアは「もしジャックがならず者なら、マシューは騎士だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャックは騎士です  \n(2) ミアは騎士です  \n(3) オーロラは騎士です  \n(4) マシューは騎士です  \n(5) ノアは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ビクトリア、オリバー、ヘンリー、ゾーイ、そしてオーウェン。ビクトリアは「ヘンリーはならず者だ」とコメントしました。オリバーは「ゾーイはならず者か、オーウェンはならず者だ」と表現しました。ヘンリーは「もしオーウェンが騎士なら、ゾーイはならず者だ」と述べました。ゾーイは「オリバーはならず者で、ビクトリアは騎士だ」と言いました。オーウェンは「もしオリバーがならず者なら、オリバーは騎士だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ビクトリアはならず者です  \n(2) オリバーは騎士です  \n(3) ヘンリーは騎士です  \n(4) ゾーイはならず者です  \n(5) オーウェンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：メイソン、ビクトリア、デイビッド、ローガン、そしてアレクサンダー。メイソンの発言はこうです：「アレクサンダーは騎士で、ビクトリアは騎士です」。ビクトリアはこう言いました：「ビクトリアは騎士で、アレクサンダーはならず者です」。デイビッドはこう主張しました：「ビクトリアは騎士か、ローガンはならず者です」。ローガンはこう主張しました：「もしビクトリアがならず者なら、ビクトリアは騎士です」。アレクサンダーはあなたに、メイソンは騎士ではないと言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) メイソンはならず者です  \n(2) ビクトリアはならず者です  \n(3) デイビッドは騎士です  \n(4) ローガンはならず者です  \n(5) アレクサンダーは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：イーサン、ソフィア、デイビッド、イヴリン、そしてマイケル。イーサンは「ソフィアはならず者ではない」と言いました。ソフィアは「イヴリンは騎士ではない」とコメントしました。「イーサンは騎士で、マイケルはならず者だ」とデイビッドが言いました。イヴリンの発言では「イーサンはならず者であるのは、デイビッドが騎士である場合に限る」と言いました。マイケルは「イーサンは騎士ではない」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンは騎士です  \n(2) ソフィアは騎士です  \n(3) デイビッドは騎士です  \n(4) イヴリンはならず者です  \n(5) マイケルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会いました：ライリー、アビゲイル、ジェームズ、オーウェン、そしてノア。ライリーは「ジェームズは騎士か、アビゲイルは騎士です」と言いました。アビゲイルは「ライリーは騎士か、ライリーはならず者です」と述べました。ジェームズは「ノアはならず者ではありません」と言いました。「アビゲイルは騎士です」とオーウェンが宣言しました。ノアは「アビゲイルは騎士で、ライリーは騎士です」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ライリーは騎士です  \n(2) アビゲイルは騎士です  \n(3) ジェームズは騎士です  \n(4) オーウェンは騎士です  \n(5) ノアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：オリビア、ローガン、ノア、リリー、そしてミア。オリビアは「リリーが騎士であるならば、ミアはならず者である」と言っているのが聞かれました。ローガンは「ミアが騎士であるか、リリーがならず者である」と述べました。ノアは「オリビアが騎士であるか、ミアが騎士である」とコメントしました。リリーによれば「オリビアがならず者であるならば、ノアは騎士である」とのことです。ミアはリリーがならず者であると表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアは騎士です  \n(2) ローガンはならず者です  \n(3) ノアは騎士です  \n(4) リリーは騎士です  \n(5) ミアはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジャック、エイヴァ、ソフィア、ゾーイ、そしてデイビッド。ジャックは「デイビッドはならず者であるのは、ソフィアが騎士である場合に限る」と言いました。エイヴァは「デイビッドはならず者であるか、ソフィアが騎士である」と述べました。ソフィアは「ジャックがならず者なら、エイヴァは騎士だ」と言いました。ゾーイは「デイビッドがならず者なら、デイビッドは騎士だ」と表現しました。デイビッドは「エイヴァはならず者ではない」と言っているのが聞かれました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャックはならず者です  \n(2) エイヴァは騎士です  \n(3) ソフィアは騎士です  \n(4) ゾーイは騎士です  \n(5) デイビッドは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：イヴリン、ルーク、クロエ、リリー、そしてエマ。イヴリンは、ルークが騎士である場合に限り、ルークはならず者であると言いました。ルークは、イヴリンがならず者である場合に限り、エマがならず者であると言いました。クロエは「リリーはならず者だ」と述べました。リリーは「エマはならず者か、クロエはならず者だ」と言いました。エマは、クロエがならず者であり、リリーが騎士であると表現しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンはならず者です  \n(2) ルークはならず者です  \n(3) クロエはならず者です  \n(4) リリーは騎士です  \n(5) エマは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジャクソン、エイブリー、オリバー、ライリー、そしてエリザベス。ジャクソンによれば、「エリザベスは騎士である場合に限り、エリザベスはならず者である」。エイブリーは、オリバーが騎士であるのはジャクソンが騎士である場合に限ると述べました。オリバーは、「ライリーはならず者であり、エリザベスは騎士である」と言いました。ライリーは、「エリザベスは騎士であるか、エイブリーは騎士である」と言っているのが聞かれました。エリザベスは、「ジャクソンはならず者であり、オリバーはならず者である」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンはならず者です  \n(2) エイブリーは騎士です  \n(3) オリバーはならず者です  \n(4) ライリーは騎士です  \n(5) エリザベスは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エミリー、ノア、エイヴァ、ヘンリー、そしてジェームズ。エミリーは「ノアは騎士で、ジェームズはならず者です」と言いました。ノアは「ヘンリーはならず者です」と主張しました。「エイヴァは騎士であるか、エミリーはならず者です」とエイヴァは主張しました。ヘンリーの言葉では「ヘンリーは騎士であるか、ノアは騎士です」と言いました。ジェームズによれば「エミリーはならず者ではありません」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーはならず者です  \n(2) ノアはならず者です  \n(3) エイヴァは騎士です  \n(4) ヘンリーは騎士です  \n(5) ジェームズはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エマ、オリビア、サミュエル、グレース、そしてソフィア。エマは「グレースはならず者か、グレースは騎士です」と主張しました。オリビアはソフィアが騎士ではないと言いました。サミュエルは「グレースは騎士で、サミュエルは騎士です」と述べました。グレースは「ソフィアは騎士です」と言いました。ソフィアの発言は「サミュエルは騎士ではありません」です。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エマは騎士です  \n(2) オリビアはならず者です  \n(3) サミュエルはならず者です  \n(4) グレースは騎士です  \n(5) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：イーサン、ヘンリー、ウィリアム、オリバー、そしてエイヴァ。イーサンは「エイヴァは騎士であるか、オリバーは騎士である」と述べました。ヘンリーは「オリバーはならず者ではない」と言いました。ウィリアムは「イーサンは騎士である場合に限り、エイヴァは騎士である」と主張しました。オリバーは「エイヴァは騎士であるか、ヘンリーはならず者である」と言いました。エイヴァによれば「ヘンリーはならず者ではない」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンは騎士です  \n(2) ヘンリーは騎士です  \n(3) ウィリアムは騎士です  \n(4) オリバーは騎士です  \n(5) エイヴァは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：サミュエル、ハーパー、ルーカス、オーウェン、そしてクロエ。「ハーパーは騎士だ」とサミュエルが言いました。ハーパーは「サミュエルはならず者か、ルーカスはならず者だ」とコメントしました。「サミュエルはならず者で、クロエは騎士だ」とルーカスが宣言しました。「ハーパーがならず者である場合に限り、サミュエルはならず者だ」とオーウェンが宣言しました。クロエは「ルーカスはならず者か、オーウェンは騎士だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルは騎士です  \n(2) ハーパーは騎士です  \n(3) ルーカスはならず者です  \n(4) オーウェンは騎士です  \n(5) クロエは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ローガン、ミア、イザベラ、マイケル、そしてオリバー。ローガンは「イザベラはならず者で、マイケルは騎士だ」と言いました。ミアは「オリバーは騎士ではない」と言いました。イザベラは「オリバーは騎士である場合に限り、オリバーはならず者だ」と述べました。マイケルは「ミアは騎士で、イザベラはならず者だ」とあなたに言いました。オリバーの発言では「ローガンはならず者である場合に限り、ミアはならず者だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンはならず者です  \n(2) ミアはならず者です  \n(3) イザベラはならず者です  \n(4) マイケルはならず者です  \n(5) オリバーは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：アリア、ジェイコブ、メイソン、イザベラ、そしてイヴリン。アリアはこう言いました。「ジェイコブは騎士で、イヴリンはならず者です」。ジェイコブはコメントしました。「メイソンはならず者で、イヴリンは騎士です」。メイソンは主張しました。「もしイザベラが騎士なら、イヴリンはならず者です」。イザベラは言いました。「イヴリンは騎士か、イザベラは騎士です」。イヴリンは述べました。「メイソンは騎士であるのは、ジェイコブがならず者である場合に限ります」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アリアはならず者です  \n(2) ジェイコブは騎士です  \n(3) メイソンはならず者です  \n(4) イザベラは騎士です  \n(5) イヴリンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ソフィア、ウィリアム、ペネロペ、ミア、そしてオーウェン。ソフィアは「オーウェンはペネロペが騎士である場合に限り騎士です」と言いました。ウィリアムによれば、「ソフィアがならず者なら、ペネロペもならず者です」。ペネロペはウィリアムがならず者ではないと表現しました。ミアは「ソフィアはならず者か、ウィリアムは騎士です」と主張しました。オーウェンは「ウィリアムはならず者ではありません」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) ウィリアムは騎士です  \n(3) ペネロペは騎士です  \n(4) ミアは騎士です  \n(5) オーウェンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ハーパー、ソフィア、シャーロット、リアム、そしてメイソンです。「メイソンは騎士であるのはリアムが騎士である場合に限る」とハーパーが言いました。ソフィアの発言では、「ハーパーは騎士であるのはメイソンがならず者である場合に限る」と言いました。シャーロットは、「ハーパーはならず者であるか、メイソンは騎士である」とコメントしました。リアムの言葉では、「メイソンはならず者であり、ハーパーはならず者である」と言いました。メイソンはあなたにハーパーが騎士であると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーはならず者です  \n(2) ソフィアはならず者です  \n(3) シャーロットは騎士です  \n(4) リアムは騎士です  \n(5) メイソンはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：マシュー、エラ、ライリー、エイヴァ、そしてオリビア。マシューの発言によれば、「エラはならず者である場合に限り、エイヴァはならず者である」。エラは「ライリーはならず者ではない」と述べました。ライリーの言葉では、「オリビアは騎士である」。エイヴァによると、「エイヴァは騎士である場合に限り、マシューは騎士である」。オリビアによると、「エラはならず者であるか、エラは騎士である」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マシューは騎士です  \n(2) エラは騎士です  \n(3) ライリーは騎士です  \n(4) エイヴァは騎士です  \n(5) オリビアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：デイビッド、セバスチャン、ローガン、ゾーイ、そしてエイヴァ。デイビッドは「ゾーイは騎士で、ローガンも騎士だ」とコメントしました。セバスチャンは「ゾーイは騎士である場合、ローガンも騎士である」とコメントしました。ローガンはあなたに、エイヴァは騎士であり、セバスチャンも騎士だと言いました。「もしゾーイが騎士なら、セバスチャンは騎士だ」とゾーイは言いました。エイヴァは、ゾーイは騎士である場合、エイヴァも騎士であると表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドは騎士です  \n(2) セバスチャンは騎士です  \n(3) ローガンは騎士です  \n(4) ゾーイは騎士です  \n(5) エイヴァは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会いました：ジョセフ、ベンジャミン、エイヴァ、スカーレット、そしてヘンリー。ジョセフは、エイヴァがならず者であり、エイヴァが騎士であると言いました。ベンジャミンはこう主張しました：「もしヘンリーが騎士なら、エイヴァはならず者です」。エイヴァは「ヘンリーは騎士か、スカーレットはならず者です」と言いました。スカーレットは、ジョセフがならず者ではないと言いました。「ベンジャミンは、ヘンリーが騎士である場合に限りならず者です」とヘンリーは宣言しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフはならず者です  \n(2) ベンジャミンはならず者です  \n(3) エイヴァは騎士です  \n(4) スカーレットはならず者です  \n(5) ヘンリーは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ハーパー、ライリー、ローガン、ベンジャミン、そしてジョセフ。ハーパーは「ベンジャミンはならず者か、ジョセフはならず者だ」と主張しました。ライリーの言葉では「もしローガンがならず者なら、ベンジャミンは騎士だ」と言いました。ローガンは「ベンジャミンはならず者で、ローガンは騎士だ」と述べました。ベンジャミンは「ハーパーは騎士だ」と言いました。ジョセフによれば「ローガンは騎士だ」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーは騎士です  \n(2) ライリーは騎士です  \n(3) ローガンはならず者です  \n(4) ベンジャミンは騎士です  \n(5) ジョセフはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ルーカス、ウィリアム、メイソン、ヘンリー、そしてジョセフです。ルーカスは「ジョセフはならず者か、メイソンはならず者だ」と言っているのが聞かれました。ウィリアムは「ジョセフはならず者か、メイソンは騎士だ」と指摘しました。メイソンは「ヘンリーは騎士ではない」と言いました。ヘンリーはジョセフが騎士だと言いました。ジョセフは「もしヘンリーが騎士なら、メイソンはならず者だ」と表現しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスは騎士です  \n(2) ウィリアムはならず者です  \n(3) メイソンはならず者です  \n(4) ヘンリーは騎士です  \n(5) ジョセフは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：クロエ、マイケル、エマ、エラ、そしてアレクサンダー。クロエは「エラは騎士か、クロエが騎士である」と表現しました。「アレクサンダーがならず者なら、クロエはならず者だ」とマイケルが言いました。エマの発言では、「アレクサンダーは騎士か、アレクサンダーはならず者です」。エラは「マイケルが騎士なら、アレクサンダーは騎士です」と指摘しました。アレクサンダーはあなたにエマが騎士だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) クロエは騎士です  \n(2) マイケルは騎士です  \n(3) エマは騎士です  \n(4) エラは騎士です  \n(5) アレクサンダーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ゾーイ、シャーロット、ミア、ジェイコブ、そしてオーウェン。「もしミアがならず者なら、シャーロットは騎士だ」とゾーイは主張しました。シャーロットによれば、「ジェイコブはミアがならず者である場合に限り騎士です」。ミアは「オーウェンは騎士です」と述べました。ジェイコブは、自分が騎士であり、ゾーイも騎士だと言いました。オーウェンは「ゾーイはならず者です」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ゾーイは騎士です  \n(2) シャーロットは騎士です  \n(3) ミアはならず者です  \n(4) ジェイコブは騎士です  \n(5) オーウェンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ルーカス、エリザベス、オーロラ、エイデン、そしてサミュエルです。「エリザベスは騎士ではない」とルーカスが言いました。エリザベスの言葉では、「オーロラは騎士ではない」とのことです。オーロラによれば、「もしオーロラが騎士なら、エリザベスはならず者です」とのことです。エイデンは「ルーカスはならず者か、エリザベスは騎士です」と主張しました。サミュエルは「エリザベスはならず者ではないと言っているのが聞こえました」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスは騎士です  \n(2) エリザベスはならず者です  \n(3) オーロラは騎士です  \n(4) エイデンはならず者です  \n(5) サミュエルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ダニエル、ビクトリア、ベンジャミン、ミア、そしてウィリアム。ダニエルは「ミアは騎士で、ベンジャミンも騎士だ」と主張しました。「もしベンジャミンが騎士なら、ベンジャミンはならず者だ」とビクトリアは主張しました。ベンジャミンは「ダニエルはならず者ではない」と言いました。ミアは「ビクトリアはダニエルが騎士である場合に限り騎士だ」とコメントしました。「もしビクトリアがならず者なら、ミアはならず者だ」とウィリアムは主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルはならず者です  \n(2) ビクトリアは騎士です  \n(3) ベンジャミンはならず者です  \n(4) ミアはならず者です  \n(5) ウィリアムは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ベンジャミン、エミリー、ジェームズ、イヴリン、そしてルーカス。「エミリーはならず者か、イヴリンは騎士です」とベンジャミンが言いました。エミリーの発言では、「イヴリンはならず者か、エミリーは騎士です」。ジェームズによると、「エミリーはならず者か、ルーカスは騎士です」。イヴリンは「もしエミリーがならず者なら、エミリーは騎士です」と主張しました。ルーカスの言葉では、「エミリーはならず者です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンは騎士です  \n(2) エミリーは騎士です  \n(3) ジェームズはならず者です  \n(4) イヴリンは騎士です  \n(5) ルーカスはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：リリー、ローガン、アメリア、リアム、そしてエイヴァ。リリーは「エイヴァが騎士なら、アメリアも騎士です」と主張しました。ローガンは「アメリアはエイヴァがならず者である場合に限り騎士です」と言いました。アメリアの言葉では「ローガンはリアムがならず者である場合に限り騎士です」と述べました。リアムはリリーが騎士であり、エイヴァも騎士であると表現しました。エイヴァは「ローガンが騎士なら、リリーも騎士です」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーは騎士です  \n(2) ローガンはならず者です  \n(3) アメリアは騎士です  \n(4) リアムは騎士です  \n(5) エイヴァは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ミア、ペネロペ、ハーパー、マイケル、そしてソフィア。ミアは「ミアは騎士か、ソフィアは騎士です」と述べました。「もしミアが騎士なら、ハーパーは騎士です」とペネロペが宣言しました。ハーパーによれば、「もしマイケルが騎士なら、ミアは騎士です」。マイケルは「もしハーパーがならず者なら、ペネロペは騎士です」と言いました。ソフィアは「マイケルはならず者ではありません」と主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアは騎士です  \n(2) ペネロペは騎士です  \n(3) ハーパーは騎士です  \n(4) マイケルは騎士です  \n(5) ソフィアは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エイブリー、クロエ、ダニエル、アビゲイル、エリザベス。「クロエがならず者なら、ダニエルは騎士だ」とエイブリーが宣言しました。「エイブリーはならず者で、ダニエルは騎士だ」とクロエが主張しました。「エリザベスがならず者なら、クロエは騎士だ」とダニエルが主張しました。アビゲイルは「ダニエルはエイブリーがならず者である場合に限りならず者だ」と述べました。「エイブリーはエリザベスが騎士である場合に限りならず者だ」とエリザベスが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーはならず者です  \n(2) クロエはならず者です  \n(3) ダニエルはならず者です  \n(4) アビゲイルは騎士です  \n(5) エリザベスはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：セバスチャン、ゾーイ、アレクサンダー、ライリー、そしてノア。セバスチャンはこう言いました。「アレクサンダーがならず者なら、ゾーイはならず者です」。ゾーイは主張しました。「ノアは騎士か、セバスチャンは騎士です」。アレクサンダーは言いました。「セバスチャンがならず者なら、セバスチャンは騎士です」。ライリーはコメントしました。「セバスチャンは騎士です」。ノアは言いました。「ゾーイはならず者です」。さて、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) セバスチャンは騎士です  \n(2) ゾーイは騎士です  \n(3) アレクサンダーは騎士です  \n(4) ライリーは騎士です  \n(5) ノアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エイヴァ、オリバー、ビクトリア、アメリア、そしてルーカス。エイヴァは「オリバーは騎士で、ビクトリアはならず者です」と述べました。オリバーは「ルーカスはビクトリアが騎士である場合に限り、騎士です」と言いました。ビクトリアは「アメリアは騎士ではありません」と言いました。アメリアはあなたに、エイヴァは騎士で、ビクトリアはならず者だと言いました。ルーカスの言葉では「もしルーカスが騎士なら、ビクトリアは騎士です」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァはならず者です  \n(2) オリバーは騎士です  \n(3) ビクトリアは騎士です  \n(4) アメリアはならず者です  \n(5) ルーカスは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ビクトリア、メイソン、アビゲイル、サミュエル、そしてオーロラ。ビクトリアはこう主張しました：「ビクトリアは騎士である場合、アビゲイルも騎士である」。メイソンは「サミュエルはならず者である場合、ビクトリアもならず者である」と言いました。アビゲイルの発言では、「サミュエルは騎士である」と言いました。サミュエルは「ビクトリアは騎士であり、アビゲイルも騎士である」と述べました。オーロラはサミュエルがならず者であると表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ビクトリアは騎士です  \n(2) メイソンは騎士です  \n(3) アビゲイルは騎士です  \n(4) サミュエルは騎士です  \n(5) オーロラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ソフィア、ベンジャミン、ジョセフ、ビクトリア、そしてアレクサンダー。ソフィアは「ジョセフは騎士ではない」と主張しました。ベンジャミンは「ジョセフはならず者だ」と言いました。ジョセフは「アレクサンダーがならず者なら、ソフィアはならず者だ」とあなたに言いました。ビクトリアの言葉では「ジョセフはならず者で、ベンジャミンはならず者だ」と言っています。アレクサンダーは「ビクトリアは騎士ではない」と指摘しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアはならず者です  \n(2) ベンジャミンはならず者です  \n(3) ジョセフは騎士です  \n(4) ビクトリアはならず者です  \n(5) アレクサンダーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：アビゲイル、エリザベス、ジョセフ、ベンジャミン、そしてソフィア。アビゲイルは「アビゲイルは騎士であり、ソフィアは騎士です」と言いました。エリザベスは「アビゲイルは騎士である場合に限り、アビゲイルはならず者です」と述べました。ジョセフは「ベンジャミンはならず者であるか、アビゲイルは騎士です」と言いました。「ソフィアはならず者であり、ソフィアは騎士です」とベンジャミンは宣言しました。ソフィアは「ジョセフはならず者である場合に限り、アビゲイルは騎士です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アビゲイルはならず者です  \n(2) エリザベスはならず者です  \n(3) ジョセフは騎士です  \n(4) ベンジャミンはならず者です  \n(5) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：イザベラ、エミリー、エラ、サミュエル、そしてアメリア。イザベラは「サミュエルは騎士か、サミュエルはならず者です」と述べました。「アメリアはならず者か、エラは騎士です」とエミリーが宣言しました。エラは「エミリーはならず者ではありません」と述べました。サミュエルは「エラはならず者ではありません」と言っているのが聞かれました。「サミュエルはならず者で、エラは騎士です」とアメリアが宣言しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イザベラは騎士です  \n(2) エミリーは騎士です  \n(3) エラは騎士です  \n(4) サミュエルは騎士です  \n(5) アメリアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ウィリアム、メイソン、ジョセフ、ルーカス、そしてビクトリア。ウィリアムは言いました、「ルーカスはならず者か、メイソンは騎士です」。メイソンは主張しました：「ビクトリアは騎士です」。ジョセフは言いました、「もしメイソンがならず者なら、メイソンは騎士です」。ルーカスは宣言しました、「ビクトリアは騎士で、ウィリアムは騎士です」。ビクトリアはコメントしました、「もしルーカスが騎士なら、ウィリアムは騎士です」。さて、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムは騎士です  \n(2) メイソンは騎士です  \n(3) ジョセフは騎士です  \n(4) ルーカスは騎士です  \n(5) ビクトリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：スカーレット、マイケル、イーサン、グレース、そしてジョセフ。スカーレットによると、「ジョセフはイーサンが騎士である場合に限り、騎士です」。マイケルは「イーサンは騎士であるか、ジョセフはならず者です」と言いました。イーサンは「スカーレットは騎士ではない」と主張しました。グレースは「マイケルは騎士ではない」と述べました。「もしスカーレットが騎士なら、マイケルはならず者です」とジョセフが言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) スカーレットは騎士です  \n(2) マイケルは騎士です  \n(3) イーサンはならず者です  \n(4) グレースはならず者です  \n(5) ジョセフはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：アレクサンダー、ジェームズ、ソフィア、クロエ、そしてミア。アレクサンダーは「ミアは騎士だ」と言いました。ジェームズは「クロエはならず者か、アレクサンダーはならず者だ」と述べました。「クロエはならず者だ」とソフィアは宣言しました。クロエは「ジェームズは騎士で、アレクサンダーは騎士だ」と言いました。ミアは「ソフィアが騎士である限り、クロエは騎士だ」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アレクサンダーはならず者です  \n(2) ジェームズは騎士です  \n(3) ソフィアは騎士です  \n(4) クロエはならず者です  \n(5) ミアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ゾーイ、ソフィア、マイケル、マシュー、そしてローガン。ゾーイの言葉では、「ローガンは騎士です」。ソフィアの言葉では、「ローガンは騎士か、ローガンはならず者です」。マイケルは「マシューは騎士です」と主張しました。「もしゾーイが騎士なら、ソフィアは騎士です」とマシューは言いました。ローガンは、マシューがならず者か、マイケルがならず者だと言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ゾーイはならず者です  \n(2) ソフィアは騎士です  \n(3) マイケルは騎士です  \n(4) マシューは騎士です  \n(5) ローガンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジェームズ、ソフィア、リアム、エイデン、そしてエラ。ジェームズはこう言いました。「ソフィアは騎士である場合に限り、ソフィアはならず者です。」ソフィアは「エラは騎士ではない」と主張しました。リアムは「エイデンは騎士だ」と宣言しました。エイデンは、ソフィアが騎士であるか、エラがならず者であると言いました。エラは「リアムはならず者で、ソフィアは騎士だ」とコメントしました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズはならず者です  \n(2) ソフィアは騎士です  \n(3) リアムは騎士です  \n(4) エイデンは騎士です  \n(5) エラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ハーパー、イザベラ、ミア、エマ、そしてジェームズ。ハーパーが言ったように、「イザベラはならず者か、イザベラは騎士です」。イザベラは「ハーパーは騎士か、ジェームズは騎士です」と述べました。「エマはならず者ではありません」とミアが言いました。「もしミアがならず者なら、ハーパーは騎士です」とエマが主張しました。ジェームズは「もしイザベラが騎士なら、ミアは騎士です」と断言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーは騎士です  \n(2) イザベラは騎士です  \n(3) ミアは騎士です  \n(4) エマは騎士です  \n(5) ジェームズは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：オーウェン、ビクトリア、ノア、ライリー、そしてリリー。オーウェンは「ビクトリアが騎士であるならば、オーウェンも騎士である」と言いました。ビクトリアは「ノアが騎士であるならば、ノアはならず者である」と言いました。ノアによれば、「オーウェンがならず者であるならば、ライリーもならず者である」とのことです。ライリーは「ライリーは騎士であり、ノアも騎士である」と言いました。リリーは「ノアが騎士であるならば、オーウェンも騎士である」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンは騎士です  \n(2) ビクトリアは騎士です  \n(3) ノアはならず者です  \n(4) ライリーはならず者です  \n(5) リリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エマ、リアム、リリー、クロエ、そしてゾーイ。エマの言葉によれば、「リアムはならず者で、クロエはならず者です」。リアムはゾーイが騎士だと言いました。リリーは「ゾーイはならず者ではありません」とコメントしました。クロエによれば、「リアムはならず者ではありません」。ゾーイは「もしゾーイが騎士なら、リアムは騎士です」と主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エマはならず者です  \n(2) リアムは騎士です  \n(3) リリーは騎士です  \n(4) クロエは騎士です  \n(5) ゾーイは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エミリー、オーロラ、ゾーイ、オリビア、そしてノア。エミリーは「もしオーロラがならず者なら、オリビアは騎士だ」と言っているのが聞かれました。オーロラはオリビアが騎士ではないと言いました。ゾーイの発言では「オーロラはならず者である場合、オリビアは騎士である」と言っています。オリビアは「エミリーは騎士である場合、ノアはならず者である」と言いました。ノアは「オーロラは騎士であるか、ゾーイは騎士である」と述べました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーは騎士です  \n(2) オーロラは騎士です  \n(3) ゾーイは騎士です  \n(4) オリビアはならず者です  \n(5) ノアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エミリー、オリバー、イザベラ、オリビア、そしてセバスチャン。エミリーの発言では、「オリビアはならず者です」。オリバーは「イザベラはならず者です」と言いました。イザベラは、エミリーが騎士であるのはオリバーがならず者である場合に限ると表現しました。オリビアは「オリバーは騎士です」と指摘しました。「もしセバスチャンが騎士なら、オリバーはならず者です」とセバスチャンは言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーは騎士です  \n(2) オリバーはならず者です  \n(3) イザベラは騎士です  \n(4) オリビアはならず者です  \n(5) セバスチャンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ソフィア、エミリー、エイヴァ、デイビッド、そしてジャクソン。ソフィアは「エイヴァは騎士であり、ソフィアは騎士です」と主張しました。エミリーは「ソフィアがならず者であるのは、エイヴァがならず者である場合に限る」と述べました。エイヴァによれば、「エミリーは騎士であるか、ソフィアは騎士である」とのことです。デイビッドは、ソフィアがならず者であり、ジャクソンが騎士であると表現しました。ジャクソンは「エミリーが騎士であるのは、ソフィアがならず者である場合に限る」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) エミリーは騎士です  \n(3) エイヴァは騎士です  \n(4) デイビッドはならず者です  \n(5) ジャクソンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ローガン、アビゲイル、リアム、ヘンリー、そしてノア。ローガンは「ノアはならず者ではない」と述べました。アビゲイルは「もしローガンが騎士なら、ヘンリーも騎士です」とコメントしました。リアムは「もしヘンリーが騎士なら、アビゲイルも騎士です」と表現しました。ヘンリーの言葉では「リアムはアビゲイルがならず者である場合に限り騎士です」。ノアは「もしリアムが騎士なら、ノアは騎士です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンはならず者です  \n(2) アビゲイルは騎士です  \n(3) リアムは騎士です  \n(4) ヘンリーはならず者です  \n(5) ノアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エイヴァ、イザベラ、ゾーイ、リリー、そしてエマ。「エイヴァは騎士か、リリーは騎士です」とエイヴァは言いました。「リリーはならず者です」とイザベラは宣言しました。ゾーイは、イザベラが騎士であるのはエイヴァがならず者である場合に限るとあなたに言いました。リリーは「エイヴァは騎士か、エマは騎士です」と言っているのが聞かれました。「ゾーイは騎士です」とエマは言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァは騎士です  \n(2) イザベラはならず者です  \n(3) ゾーイは騎士です  \n(4) リリーは騎士です  \n(5) エマは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ウィリアム、エイヴァ、エイデン、アレクサンダー、そしてルーク。ウィリアムは「アレクサンダーがならず者なら、ウィリアムは騎士だ」と述べました。エイヴァは「アレクサンダーが騎士なら、アレクサンダーはならず者だ」と言いました。エイデンは「エイヴァはならず者か、ウィリアムは騎士だ」とコメントしました。アレクサンダーは「エイデンはならず者だ」と言いました。「エイデンは騎士だ」とルークが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムは騎士です  \n(2) エイヴァは騎士です  \n(3) エイデンは騎士です  \n(4) アレクサンダーはならず者です  \n(5) ルークは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジャクソン、ルーク、エミリー、ジェイコブ、そしてオーロラ。ジャクソンは「エミリーは騎士か、ルークはならず者だ」と言いました。ルークは「オーロラは騎士であり、オーロラはならず者だ」と言っているのが聞かれました。エミリーの発言では「もしジェイコブが騎士なら、ルークはならず者だ」と言いました。ジェイコブは「もしエミリーが騎士なら、ジャクソンは騎士だ」と述べました。オーロラは「ジャクソンは騎士か、エミリーは騎士だ」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンは騎士です  \n(2) ルークはならず者です  \n(3) エミリーは騎士です  \n(4) ジェイコブは騎士です  \n(5) オーロラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を話し、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ルーカス、セバスチャン、サミュエル、アメリア、そしてイーサン。ルーカスは「イーサンはならず者ではない」と言っているのが聞かれました。セバスチャンは、イーサンは騎士であり、セバスチャンも騎士であるとあなたに言いました。サミュエルは「もしサミュエルが騎士なら、セバスチャンはならず者だ」と述べました。アメリアの言葉では「イーサンはならず者ではない」と言いました。「セバスチャンはならず者だ」とイーサンが言及しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスは騎士です  \n(2) セバスチャンはならず者です  \n(3) サミュエルは騎士です  \n(4) アメリアは騎士です  \n(5) イーサンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：アメリア、エイヴァ、シャーロット、エラ、そしてセバスチャン。アメリアは「シャーロットがならず者であるならば、セバスチャンもならず者である」と言っているのが聞かれました。エイヴァは「エイヴァは騎士であるか、シャーロットはならず者である」と指摘しました。シャーロットは「セバスチャンは騎士ではない」と述べました。「アメリアはならず者で、エイヴァは騎士だ」とエラは主張しました。セバスチャンは「もしエラが騎士ならば、エイヴァは騎士だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアはならず者です  \n(2) エイヴァは騎士です  \n(3) シャーロットはならず者です  \n(4) エラは騎士です  \n(5) セバスチャンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジャクソン、エリザベス、セバスチャン、ウィリアム、そしてルーカス。ジャクソンはウィリアムがならず者ではないと表現しました。エリザベスは「ウィリアムは騎士か、ジャクソンは騎士です」と述べました。セバスチャンは「ジャクソンは騎士である場合、エリザベスはならず者です」と表現しました。ウィリアムの言葉では「ルーカスはならず者で、ジャクソンは騎士です」と言いました。ルーカスの言葉では「ウィリアムは騎士で、エリザベスは騎士です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンはならず者です  \n(2) エリザベスはならず者です  \n(3) セバスチャンはならず者です  \n(4) ウィリアムはならず者です  \n(5) ルーカスはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エミリー、イザベラ、ソフィア、サミュエル、そしてアメリア。エミリーはこう言いました。「サミュエルはならず者か、イザベラはならず者です」。イザベラは「サミュエルはならず者ではありません」と言いました。ソフィアはエミリーがならず者で、アメリアがならず者だと言いました。サミュエルの発言によれば、「もしサミュエルが騎士なら、アメリアはならず者です」。アメリアは「もしエミリーがならず者なら、エミリーは騎士です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーはならず者です  \n(2) イザベラは騎士です  \n(3) ソフィアは騎士です  \n(4) サミュエルは騎士です  \n(5) アメリアはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：オリビア、イザベラ、ノア、クロエ、そしてエイブリー。オリビアは「クロエはならず者だ」と言いました。イザベラの発言では、「ノアは騎士である場合に限り、エイブリーはならず者である」と言っています。ノアは「エイブリーはならず者ではない」と言いました。クロエは「イザベラはならず者で、ノアはならず者だ」と言いました。エイブリーの言葉では、「オリビアはならず者であるか、クロエはならず者である」と言っています。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアは騎士です  \n(2) イザベラはならず者です  \n(3) ノアは騎士です  \n(4) クロエはならず者です  \n(5) エイブリーは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：オリバー、メイソン、アレクサンダー、イザベラ、そしてライリー。オリバーは「ライリーはならず者だ」と言いました。メイソンは「アレクサンダーは騎士ではない」と述べました。アレクサンダーは「ライリーはイザベラがならず者である場合に限りならず者だ」と主張しました。イザベラは「オリバーはならず者だ」と断言しました。ライリーの発言は「オリバーは騎士であり、オリバーはならず者だ」となります。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリバーは騎士です  \n(2) メイソンはならず者です  \n(3) アレクサンダーは騎士です  \n(4) イザベラはならず者です  \n(5) ライリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：スカーレット、ルーク、クロエ、グレース、そしてジャック。スカーレットは「クロエはならず者である場合に限り、クロエは騎士である」と言いました。ルークは「もしルークが騎士なら、グレースは騎士である」と言いました。クロエは「ルークは騎士であるか、グレースは騎士である」と述べました。グレースの発言は「ジャックは騎士であるか、グレースは騎士である」となっています。ジャックは「ルークはならず者であり、グレースはならず者である」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) スカーレットはならず者です  \n(2) ルークは騎士です  \n(3) クロエは騎士です  \n(4) グレースは騎士です  \n(5) ジャックはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：セバスチャン、マシュー、オリビア、メイソン、そしてベンジャミン。セバスチャンは「もしマシューが騎士なら、オリビアも騎士だ」と言いました。マシューは「メイソンはならず者か、ベンジャミンはならず者だ」と主張しました。オリビアの発言では「セバスチャンは騎士か、ベンジャミンはならず者だ」と言いました。メイソンは「セバスチャンはならず者だ」とコメントしました。「オリビアは騎士か、オリビアはならず者だ」とベンジャミンが言及しました。さて、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) セバスチャンは騎士です  \n(2) マシューは騎士です  \n(3) オリビアは騎士です  \n(4) メイソンはならず者です  \n(5) ベンジャミンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ルーク、オリビア、アリア、ヘンリー、そしてアメリア。ルークは「ヘンリーは騎士で、オリビアも騎士だ」と主張しました。「アメリアはアリアがならず者である場合に限り、ならず者です」とオリビアが言いました。アリアの言葉では、「ルークはヘンリーがならず者である場合に限り、ならず者です」と言いました。ヘンリーは「もしルークが騎士なら、アリアは騎士です」とあなたに言いました。アメリアは「アリアは騎士です」と指摘しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) オリビアは騎士です  \n(3) アリアは騎士です  \n(4) ヘンリーは騎士です  \n(5) アメリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：イーサン、メイソン、ウィリアム、ジョセフ、そしてアメリア。イーサンはこう言いました。「もしジョセフがならず者なら、メイソンはならず者です。」メイソンは言及しました。「イーサンは騎士である場合に限り、イーサンはならず者です。」ウィリアムは宣言しました。「ウィリアムはならず者ではありません。」ジョセフは言及しました。アメリアの言葉では、「イーサンは騎士で、ジョセフはならず者です。」では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンは騎士です  \n(2) メイソンはならず者です  \n(3) ウィリアムはならず者です  \n(4) ジョセフはならず者です  \n(5) アメリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：メイソン、オリバー、ヘンリー、リリー、そしてリアム。メイソンの言葉によれば、「リリーはならず者ではない」。オリバーの言葉では、「リリーはならず者か、リアムは騎士である」。ヘンリーは「リアムは騎士であり、メイソンは騎士である」と主張しました。リリーの発言では、「オリバーはならず者である」。リアムの言葉によれば、「ヘンリーはならず者か、オリバーはならず者である」。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) メイソンはならず者です  \n(2) オリバーは騎士です  \n(3) ヘンリーはならず者です  \n(4) リリーはならず者です  \n(5) リアムは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エイデン、マイケル、クロエ、アレクサンダー、そしてノア。エイデンによれば、「エイデンは騎士であるか、アレクサンダーはならず者である」。マイケルは「クロエが騎士であるときに限り、エイデンは騎士である」と宣言しました。クロエは「ノアがならず者であるときに限り、マイケルは騎士である」と言いました。アレクサンダーの発言では、「クロエは騎士であり、クロエはならず者である」と述べています。ノアによれば、「マイケルはならず者である」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンは騎士です  \n(2) マイケルは騎士です  \n(3) クロエは騎士です  \n(4) アレクサンダーはならず者です  \n(5) ノアはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：サミュエル、リリー、マシュー、イザベラ、シャーロット。サミュエルは「マシューは騎士ではない」と主張しました。リリーの発言では「マシューは騎士であり、サミュエルは騎士です」と言いました。マシューは「もしサミュエルが騎士なら、イザベラは騎士です」とあなたに言いました。イザベラは「もしシャーロットがならず者なら、マシューはならず者です」と言っているのが聞かれました。シャーロットはリリーがならず者だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルはならず者です  \n(2) リリーはならず者です  \n(3) マシューは騎士です  \n(4) イザベラは騎士です  \n(5) シャーロットは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジョセフ、エイブリー、エラ、ビクトリア、そしてエミリー。「もしエミリーが騎士なら、エラは騎士だ」とジョセフが言いました。エイブリーは「エラは騎士で、エミリーも騎士だ」と述べました。エラは「エイブリーはならず者である場合、エイブリーは騎士である」と言いました。「もしエミリーが騎士なら、エイブリーはならず者だ」とビクトリアが主張しました。エミリーの発言は「エイブリーは騎士だ」となります。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフは騎士です  \n(2) エイブリーはならず者です  \n(3) エラはならず者です  \n(4) ビクトリアは騎士です  \n(5) エミリーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：グレース、ソフィア、イヴリン、オリバー、そしてイーサン。グレースは「ソフィアはならず者だ」と言いました。ソフィアは「イーサンは騎士だ」と述べました。イヴリンは「イーサンは騎士だ」と主張しました。オリバーは「ソフィアは騎士で、オリバーは騎士だ」と指摘しました。「イヴリンはならず者であるのは、オリバーがならず者である場合に限る」とイーサンは宣言しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) グレースはならず者です  \n(2) ソフィアは騎士です  \n(3) イヴリンは騎士です  \n(4) オリバーは騎士です  \n(5) イーサンは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：マイケル、ジャクソン、エリザベス、ペネロペ、そしてオリビア。マイケルは「オリビアは騎士ではない」と言いました。ジャクソンは「エリザベスは騎士であるか、オリビアは騎士である」と言いました。エリザベスは「エリザベスは騎士であり、ジャクソンはならず者である」と述べました。ペネロペは「もしマイケルがならず者なら、オリビアは騎士である」と言いました。オリビアは「ペネロペはならず者であるか、ペネロペは騎士である」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルはならず者です  \n(2) ジャクソンは騎士です  \n(3) エリザベスはならず者です  \n(4) ペネロペは騎士です  \n(5) オリビアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：オーロラ、ノア、デイビッド、エイデン、そしてシャーロット。オーロラによれば、「シャーロットはならず者か、エイデンは騎士です」。ノアはこう言いました、「もしデイビッドがならず者なら、シャーロットはならず者です」。デイビッドは、オーロラがならず者なら、エイデンは騎士だと表現しました。「エイデンは騎士か、シャーロットは騎士です」とエイデンは宣言しました。「エイデンがならず者であるのは、デイビッドが騎士である場合に限る」とシャーロットは主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーロラは騎士です  \n(2) ノアは騎士です  \n(3) デイビッドは騎士です  \n(4) エイデンは騎士です  \n(5) シャーロットはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ソフィア、アメリア、リアム、ハーパー、シャーロット。ソフィアの発言では、「アメリアがならず者であるとき、ソフィアは騎士である」。アメリアは「ハーパーが騎士であるとき、リアムは騎士である」と言いました。リアムの発言では、「もしソフィアがならず者であれば、ソフィアは騎士である」。ハーパーは「リアムが騎士であるとき、シャーロットは騎士である」と言いました。シャーロットは「もしリアムが騎士であれば、ハーパーは騎士である」と表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) アメリアはならず者です  \n(3) リアムは騎士です  \n(4) ハーパーはならず者です  \n(5) シャーロットはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：リリー、ローガン、ルーク、ノア、そしてオリバー。リリーは「ローガンはならず者です」と言いました。ローガンは「リリーは騎士であるのはノアがならず者である場合に限る」と述べました。ルークは「ローガンは騎士であるのはノアがならず者である場合に限る」と言いました。ノアによれば、「もしノアが騎士なら、ルークも騎士です」。オリバーは「もしローガンがならず者なら、ルークは騎士です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーは騎士です  \n(2) ローガンはならず者です  \n(3) ルークは騎士です  \n(4) ノアは騎士です  \n(5) オリバーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：グレース、エリザベス、ルーク、シャーロット、そしてエマ。グレースは言いました。「もしエマが騎士なら、エマはならず者です」。エリザベスの発言では、「ルークはエマが騎士である場合に限り、ならず者です」。ルークはコメントしました。「エマは騎士ではありません」。シャーロットは主張しました。「シャーロットは騎士であり、エリザベスはならず者です」。エマは言いました。「シャーロットは騎士です」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) グレースは騎士です  \n(2) エリザベスは騎士です  \n(3) ルークは騎士です  \n(4) シャーロットはならず者です  \n(5) エマはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エイデン、ベンジャミン、エミリー、デイビッド、そしてオーウェン。エイデンは「オーウェンはデイビッドが騎士である場合に限り騎士です」と言いました。ベンジャミンは「エミリーはオーウェンが騎士である場合に限り騎士です」と指摘しました。エミリーは「ベンジャミンは騎士ではありません」と言いました。デイビッドは「オーウェンは騎士です」と言っているのが聞かれました。「エミリーは騎士であるか、オーウェンは騎士である」とオーウェンは主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンは騎士です  \n(2) ベンジャミンは騎士です  \n(3) エミリーはならず者です  \n(4) デイビッドはならず者です  \n(5) オーウェンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ローガン、イザベラ、ルーク、イーサン、そしてソフィア。ローガンは「イザベラは騎士で、ルークはならず者だ」と述べました。イザベラは「ルークはならず者だ」と言いました。ルークは「もしルークが騎士なら、イーサンも騎士だ」と言いました。「ルークは騎士で、ソフィアも騎士だ」とイーサンは主張しました。ソフィアは「イザベラは騎士ではない」と述べました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンはならず者です  \n(2) イザベラはならず者です  \n(3) ルークは騎士です  \n(4) イーサンは騎士です  \n(5) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：イヴリン、ジョセフ、ソフィア、ルーク、そしてジェームズ。イヴリンは「ジョセフはならず者か、イヴリンは騎士です」と言いました。ジョセフは「もしルークがならず者なら、ジェームズは騎士です」とコメントしました。「ソフィアは騎士か、ルークは騎士です」とソフィアは宣言しました。ルークは「イヴリンはならず者で、ソフィアはならず者です」と主張しました。ジェームズは「もしイヴリンが騎士なら、ジョセフはならず者です」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンはならず者です  \n(2) ジョセフは騎士です  \n(3) ソフィアは騎士です  \n(4) ルークはならず者です  \n(5) ジェームズは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：リリー、ライリー、ウィリアム、アリア、そしてデイビッド。「ライリーは騎士ではない」とリリーが言いました。ライリーの言葉では、「デイビッドは騎士です」。ウィリアムは「リリーは騎士です」と言っているのが聞かれました。アリアの言葉では、「リリーはウィリアムが騎士である場合に限り騎士です」。デイビッドはアリアがならず者ではないと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーはならず者です  \n(2) ライリーは騎士です  \n(3) ウィリアムはならず者です  \n(4) アリアは騎士です  \n(5) デイビッドは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジェイコブ、メイソン、ルーカス、ベンジャミン、そしてセバスチャン。ジェイコブは言いました。「ルーカスは騎士であるのは、セバスチャンがならず者である場合に限る。」メイソンは主張しました。「メイソンは騎士であるか、ジェイコブはならず者である。」ルーカスによれば、「セバスチャンはならず者であり、ジェイコブはならず者である。」ベンジャミンはコメントしました。「セバスチャンは騎士ではない。」セバスチャンは、メイソンが騎士であるのは、ジェイコブが騎士である場合に限ると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブは騎士です  \n(2) メイソンは騎士です  \n(3) ルーカスはならず者です  \n(4) ベンジャミンはならず者です  \n(5) セバスチャンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ミア、サミュエル、アメリア、ソフィア、そしてヘンリー。ミアは「サミュエルはならず者であるのは、ソフィアがならず者である場合に限る」と述べました。サミュエルは「アメリアは騎士であるか、アメリアはならず者である」と言いました。アメリアの発言では「ヘンリーはならず者です」と言っています。ソフィアは「アメリアはならず者であり、サミュエルは騎士です」と述べました。ヘンリーは「ソフィアは騎士であり、ミアはならず者です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアはならず者です  \n(2) サミュエルは騎士です  \n(3) アメリアは騎士です  \n(4) ソフィアはならず者です  \n(5) ヘンリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：オーロラ、ダニエル、ベンジャミン、イザベラ、そしてエイデン。「エイデンはならず者ではない」とオーロラは主張しました。ダニエルは「イザベラはならず者であるのは、イザベラが騎士である場合に限る」と言っているのが聞かれました。ベンジャミンによれば、「もしエイデンが騎士なら、ダニエルは騎士である」。イザベラは「もしダニエルがならず者なら、ベンジャミンは騎士である」と表現しました。エイデンは「ダニエルはならず者であるのは、ダニエルが騎士である場合に限る」と指摘しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーロラはならず者です  \n(2) ダニエルはならず者です  \n(3) ベンジャミンは騎士です  \n(4) イザベラは騎士です  \n(5) エイデンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エマ、ローガン、ルーク、スカーレット、そしてルーカス。「ルーカスはならず者で、スカーレットもならず者だ」とエマは主張しました。ローガンは「エマが騎士であるのは、エマがならず者である場合に限る」と言いました。「ローガンはならず者であるのは、スカーレットが騎士である場合に限る」とルークが言いました。スカーレットは「もしエマが騎士なら、ローガンは騎士だ」と言っているのが聞かれました。ルーカスは「エマは騎士で、スカーレットはならず者だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エマはならず者です  \n(2) ローガンはならず者です  \n(3) ルークは騎士です  \n(4) スカーレットは騎士です  \n(5) ルーカスはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：マイケル、エラ、エリザベス、ジャック、そしてアビゲイル。マイケルは「エリザベスはならず者ではない」と言いました。エラの言葉では「ジャックはエラが騎士である場合に限り騎士です」。エリザベスは「エリザベスは騎士であるか、ジャックは騎士です」と述べました。ジャックは「エラはならず者ではない」と言いました。アビゲイルの言葉では「マイケルは騎士です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルは騎士です  \n(2) エラは騎士です  \n(3) エリザベスは騎士です  \n(4) ジャックは騎士です  \n(5) アビゲイルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ウィリアム、デイビッド、ゾーイ、エイヴァ、そしてソフィア。ウィリアムは「ソフィアはならず者で、ソフィアは騎士だ」と言いました。「ゾーイは騎士だ」とデイビッドが言いました。ゾーイは「ソフィアは騎士である場合、エイヴァも騎士である」と述べました。エイヴァは「デイビッドはならず者か、ゾーイは騎士だ」と言いました。ソフィアは「もしエイヴァが騎士なら、エイヴァはならず者だ」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムはならず者です  \n(2) デイビッドはならず者です  \n(3) ゾーイはならず者です  \n(4) エイヴァは騎士です  \n(5) ソフィアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：オリビア、エイヴァ、ベンジャミン、ジョセフ、そしてスカーレット。オリビアは「ベンジャミンは騎士か、オリビアは騎士です」と述べました。エイヴァは「もしスカーレットがならず者なら、エイヴァは騎士です」と言いました。ベンジャミンは「もしジョセフが騎士なら、スカーレットは騎士です」と言いました。ジョセフは「エイヴァは騎士であるのは、オリビアがならず者である場合に限る」と表現しました。スカーレットは「オリビアは騎士であるのは、エイヴァがならず者である場合に限る」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアは騎士です  \n(2) エイヴァは騎士です  \n(3) ベンジャミンは騎士です  \n(4) ジョセフはならず者です  \n(5) スカーレットはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エイデン、デイビッド、ペネロペ、ソフィア、そしてスカーレット。エイデンはペネロペがならず者であり、スカーレットもならず者であると述べました。デイビッドは「もしスカーレットがならず者なら、デイビッドは騎士である」と言いました。ペネロペによれば、「もしスカーレットが騎士なら、エイデンはならず者です」。ソフィアは「ペネロペはならず者であり、ソフィアは騎士です」と言いました。スカーレットは「もしデイビッドが騎士なら、デイビッドはならず者です」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンはならず者です  \n(2) デイビッドは騎士です  \n(3) ペネロペは騎士です  \n(4) ソフィアはならず者です  \n(5) スカーレットはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：メイソン、ジョセフ、エマ、ジャクソン、そしてアレクサンダー。メイソンは「ジャクソンはアレクサンダーが騎士である場合に限り騎士です」と述べました。「エマは騎士で、メイソンはならず者です」とジョセフが言いました。エマは「アレクサンダーは騎士ではありません」と言っているのが聞かれました。「アレクサンダーはジョセフが騎士である場合に限り騎士です」とジャクソンが主張しました。アレクサンダーはメイソンがならず者であると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) メイソンはならず者です  \n(2) ジョセフはならず者です  \n(3) エマはならず者です  \n(4) ジャクソンはならず者です  \n(5) アレクサンダーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ダニエル、アビゲイル、ジョセフ、アメリア、そしてイーサン。ダニエルは「ジョセフは騎士ではない」と述べました。「アメリアは騎士で、アビゲイルも騎士です」とアビゲイルが言いました。ジョセフは「アメリアはならず者であるのは、アビゲイルが騎士である場合に限る」と述べました。アメリアは「ジョセフはならず者で、ダニエルもならず者です」と言いました。イーサンの言葉では「アメリアは騎士であるのは、ダニエルがならず者である場合に限る」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルは騎士です  \n(2) アビゲイルはならず者です  \n(3) ジョセフはならず者です  \n(4) アメリアはならず者です  \n(5) イーサンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：マシュー、エイヴァ、ベンジャミン、ルーカス、そしてルーク。マシューによれば、「エイヴァはルーカスが騎士である場合に限り騎士です」。エイヴァは「ベンジャミンは騎士です」と言いました。ベンジャミンは「エイヴァは騎士であるか、マシューは騎士です」と言っているのが聞かれました。ルーカスの言葉では、「ベンジャミンは騎士であるか、マシューは騎士です」。ルークは「ベンジャミンはエイヴァが騎士である場合に限りならず者です」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マシューは騎士です  \n(2) エイヴァは騎士です  \n(3) ベンジャミンは騎士です  \n(4) ルーカスは騎士です  \n(5) ルークはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：シャーロット、ハーパー、エリザベス、ウィリアム、そしてペネロペ。シャーロットは「エリザベスはペネロペが騎士である場合に限り、騎士である」と言いました。「シャーロットは騎士ではない」 - ハーパー。エリザベスは「ペネロペは騎士であり、エリザベスも騎士である」とあなたに言いました。ウィリアムは「もしシャーロットがならず者なら、エリザベスは騎士である」と言っているのが聞かれました。ペネロペは「シャーロットは騎士である場合に限り、シャーロットはならず者である」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットは騎士です  \n(2) ハーパーはならず者です  \n(3) エリザベスはならず者です  \n(4) ウィリアムは騎士です  \n(5) ペネロペはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エイデン、エミリー、ローガン、ジョセフ、そしてゾーイ。エイデンは「ゾーイはならず者か、ローガンはならず者だ」と言いました。「もしエミリーが騎士なら、ゾーイはならず者だ」とエミリーは宣言しました。ローガンの発言では「エミリーは騎士ではない」と言いました。ジョセフは「ローガンはならず者か、ローガンは騎士だ」と述べました。ゾーイはあなたに、ジョセフはならず者で、ゾーイは騎士だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンは騎士です  \n(2) エミリーは騎士です  \n(3) ローガンはならず者です  \n(4) ジョセフは騎士です  \n(5) ゾーイはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エイブリー、メイソン、イヴリン、エリザベス、そしてローガン。エイブリーは「エリザベスが騎士なら、メイソンも騎士だ」と言いました。メイソンは「ローガンが騎士なら、イヴリンはならず者だ」と言いました。「メイソンは騎士で、エリザベスはならず者だ」とイヴリンが言いました。エリザベスの言葉では、「メイソンは騎士で、メイソンはならず者だ」と言いました。ローガンによれば、「イヴリンはならず者で、メイソンは騎士だ」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーは騎士です  \n(2) メイソンは騎士です  \n(3) イヴリンは騎士です  \n(4) エリザベスはならず者です  \n(5) ローガンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ソフィア、ハーパー、アビゲイル、オリバー、そしてジャック。ソフィアは「ジャックはならず者ではない」と言いました。ハーパーは「オリバーは騎士で、ソフィアも騎士だ」とコメントしました。アビゲイルによれば、「ハーパーは騎士で、ソフィアはならず者だ」とのことです。オリバーは「アビゲイルは騎士ではない」と言いました。ジャックは「ジャックは騎士で、アビゲイルは騎士だ」とあなたに言いました。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアはならず者です  \n(2) ハーパーはならず者です  \n(3) アビゲイルはならず者です  \n(4) オリバーは騎士です  \n(5) ジャックはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：アリア、ミア、エイブリー、ウィリアム、そしてエイデン。アリアは「ミアはならず者か、エイブリーはならず者です」と言いました。「エイデンはならず者ではありません」とミアが主張しました。エイブリーは「アリアはならず者ではありません」とコメントしました。「ミアはならず者で、エイブリーはならず者です」とウィリアムが宣言しました。エイデンは「もしアリアが騎士なら、ウィリアムは騎士です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アリアは騎士です  \n(2) ミアはならず者です  \n(3) エイブリーは騎士です  \n(4) ウィリアムはならず者です  \n(5) エイデンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：リリー、ヘンリー、ジョセフ、アメリア、そしてソフィア。「アメリアは騎士ではない」とリリーが宣言しました。「アメリアはリリーがならず者である場合に限り、ならず者です」とヘンリーが主張しました。ジョセフは「ヘンリーは騎士ではない」と述べました。アメリアは「ヘンリーがならず者であれば、ソフィアは騎士です」と言いました。ソフィアは「ジョセフはならず者です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーは騎士です  \n(2) ヘンリーはならず者です  \n(3) ジョセフは騎士です  \n(4) アメリアはならず者です  \n(5) ソフィアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジャクソン、ライリー、エイデン、ソフィア、そしてサミュエル。「ソフィアはならず者であるのは、サミュエルがならず者である場合に限る」とジャクソンが言いました。ライリーは、ジャクソンが騎士ではないと言いました。エイデンは、もしソフィアがならず者であれば、ライリーもならず者であると言いました。ソフィアは、ライリーが騎士ではないと表現しました。サミュエルは、もしジャクソンが騎士であれば、ジャクソンはならず者であると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンはならず者です  \n(2) ライリーは騎士です  \n(3) エイデンはならず者です  \n(4) ソフィアはならず者です  \n(5) サミュエルは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ハーパー、オリバー、エマ、ゾーイ、そしてルーク。ハーパーはゾーイが騎士であり、ルークも騎士であると述べました。オリバーは「ゾーイは騎士か、ルークは騎士だ」と言いました。エマはルークが騎士であり、エマ自身も騎士であるとあなたに伝えました。ゾーイは「ハーパーは騎士ではない」と言いました。ルークはハーパーが騎士であり、エマがならず者であると言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーはならず者です  \n(2) オリバーは騎士です  \n(3) エマはならず者です  \n(4) ゾーイは騎士です  \n(5) ルークはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：デイビッド、イザベラ、マイケル、セバスチャン、そしてシャーロット。デイビッドは「マイケルは騎士だ」と主張しました。イザベラは「デイビッドはならず者で、シャーロットはならず者だ」と言いました。マイケルによれば、「セバスチャンはマイケルが騎士である場合に限り騎士だ」とのことです。セバスチャンは「マイケルはならず者ではない」と指摘しました。シャーロットは「もしシャーロットが騎士なら、セバスチャンは騎士だ」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドは騎士です  \n(2) イザベラはならず者です  \n(3) マイケルは騎士です  \n(4) セバスチャンは騎士です  \n(5) シャーロットは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジェイコブ、ペネロペ、イーサン、マシュー、そしてノア。ジェイコブは「イーサンはならず者だ」とコメントしました。ペネロペは「ジェイコブは騎士で、イーサンはならず者だ」と主張しました。イーサンは「もしペネロペがならず者なら、マシューはならず者だ」と言っているのが聞かれました。マシューは「ジェイコブは騎士か、ノアは騎士だ」と言っているのが聞かれました。ノアの言葉では「ジェイコブは騎士で、イーサンは騎士だ」と言っています。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブはならず者です  \n(2) ペネロペはならず者です  \n(3) イーサンは騎士です  \n(4) マシューはならず者です  \n(5) ノアはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：イーサン、オーロラ、ソフィア、スカーレット、そしてジャック。イーサンは「スカーレットは騎士ではない」と言いました。オーロラはイーサンが騎士であり、ソフィアも騎士であると言いました。ソフィアの発言では「ジャックは騎士である場合、オーロラはならず者である」と言いました。「スカーレットは騎士であるか、ジャックはならず者である」とスカーレットは宣言しました。ジャックは「イーサンが騎士であれば、スカーレットはならず者である」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンはならず者です  \n(2) オーロラはならず者です  \n(3) ソフィアは騎士です  \n(4) スカーレットは騎士です  \n(5) ジャックは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ウィリアム、エマ、イザベラ、イーサン、そしてアメリア。ウィリアムは「エマが騎士ならイーサンはならず者だ」と主張しました。エマは「アメリアが騎士ならウィリアムは騎士だ」と宣言しました。イザベラは「ウィリアムはならず者で、アメリアは騎士だ」と述べました。イーサンは「イーサンは騎士だ」と主張しました。「イーサンは騎士であるのは、エマが騎士である場合に限る」とアメリアは言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムは騎士です  \n(2) エマは騎士です  \n(3) イザベラはならず者です  \n(4) イーサンはならず者です  \n(5) アメリアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：クロエ、ソフィア、オリバー、エイブリー、そしてシャーロット。「シャーロットはならず者か、エイブリーは騎士だ」とクロエは宣言しました。ソフィアは「エイブリーはならず者で、オリバーはならず者だ」と述べました。オリバーは「クロエは騎士か、ソフィアは騎士だ」と言いました。エイブリーは「オリバーはならず者ではない」と指摘しました。「オリバーは騎士だ」とシャーロットが言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) クロエは騎士です  \n(2) ソフィアはならず者です  \n(3) オリバーは騎士です  \n(4) エイブリーは騎士です  \n(5) シャーロットは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ベンジャミン、ミア、エリザベス、セバスチャン、そしてデイビッド。ベンジャミンは「エリザベスはならず者か、エリザベスは騎士です」と述べました。ミアは「ベンジャミンは騎士で、ベンジャミンはならず者です」と言いました。「セバスチャンはならず者か、デイビッドは騎士です」とエリザベスは宣言しました。セバスチャンは「ミアはならず者か、セバスチャンは騎士です」と主張しました。デイビッドは「ミアはならず者です」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンは騎士です  \n(2) ミアはならず者です  \n(3) エリザベスは騎士です  \n(4) セバスチャンは騎士です  \n(5) デイビッドは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジェームズ、ベンジャミン、ソフィア、マシュー、そしてジャック。「ジャックは騎士か、マシューは騎士だ」とジェームズは主張しました。「マシューはならず者か、ジャックはならず者だ」とベンジャミンが言いました。ソフィアは、ジャックがならず者だとあなたに伝えました。マシューはこう言いました。「ソフィアは騎士である場合に限り、ソフィアはならず者だ」。ジャックの発言では、「マシューは騎士ではない」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズは騎士です  \n(2) ベンジャミンは騎士です  \n(3) ソフィアはならず者です  \n(4) マシューはならず者です  \n(5) ジャックは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：アメリア、スカーレット、ミア、エイデン、そしてマイケル。アメリアは「もしミアがならず者なら、スカーレットはならず者です」と言いました。スカーレットは「ミアは騎士で、スカーレットは騎士です」と言いました。ミアは「エイデンは騎士ではありません」と言いました。エイデンは「もしスカーレットが騎士なら、ミアは騎士です」と言いました。マイケルは「もしスカーレットがならず者なら、エイデンはならず者です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアは騎士です  \n(2) スカーレットはならず者です  \n(3) ミアはならず者です  \n(4) エイデンは騎士です  \n(5) マイケルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エラ、ソフィア、ジャック、マシュー、そしてリアム。エラは「ジャックは騎士ではない」と主張しました。「ジャックは騎士です」とソフィアが言いました。「ソフィアは騎士か、マシューはならず者です」とジャックが言いました。「エラはならず者です」とマシューが宣言しました。リアムはソフィアがならず者で、ジャックがならず者だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラはならず者です  \n(2) ソフィアは騎士です  \n(3) ジャックは騎士です  \n(4) マシューは騎士です  \n(5) リアムはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジョセフ、ダニエル、オーウェン、ジェイコブ、そしてエイヴァ。ジョセフは「もしエイヴァが騎士なら、ジェイコブはならず者だ」と言いました。ダニエルは「もしジョセフが騎士なら、オーウェンはならず者だ」と述べました。オーウェンは「ジョセフは騎士か、ダニエルは騎士だ」とコメントしました。ジェイコブは「ダニエルは騎士で、ジョセフはならず者だ」と言っているのが聞かれました。エイヴァは「ジェイコブは騎士で、ダニエルはならず者だ」と言っているのが聞かれました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフは騎士です  \n(2) ダニエルはならず者です  \n(3) オーウェンは騎士です  \n(4) ジェイコブはならず者です  \n(5) エイヴァはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジェイコブ、グレース、ジェームズ、オリバー、そしてエリザベス。ジェイコブによると、「オリバーはジェームズが騎士である場合に限り騎士です」。グレースの発言では、「ジェイコブが騎士であれば、オリバーはならず者です」。ジェームズは、「オリバーはならず者であるか、エリザベスはならず者です」と述べました。オリバーは「グレースはならず者ではありません」と言っているのが聞かれました。「ジェームズはならず者であるか、オリバーは騎士です」とエリザベスは主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブはならず者です  \n(2) グレースは騎士です  \n(3) ジェームズはならず者です  \n(4) オリバーは騎士です  \n(5) エリザベスは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エミリー、ペネロペ、ウィリアム、スカーレット、そしてエイヴァ。エミリーはウィリアムが騎士ではないと表現しました。ペネロペはウィリアムが騎士であるか、スカーレットがならず者であると表現しました。「ペネロペはならず者であるのは、ウィリアムが騎士である場合に限る」とウィリアムは主張しました。スカーレットは「エイヴァはならず者だ」と言いました。エイヴァは「スカーレットが騎士であるのは、スカーレットがならず者である場合に限る」と指摘しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーは騎士です  \n(2) ペネロペはならず者です  \n(3) ウィリアムはならず者です  \n(4) スカーレットは騎士です  \n(5) エイヴァはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：シャーロット、アレクサンダー、エラ、クロエ、そしてリリー。「エラはならず者であるのは、クロエがならず者である場合に限る」とシャーロットは宣言しました。「クロエは騎士ではない」とアレクサンダーは主張しました。エラは「リリーは騎士であるか、シャーロットは騎士である」と断言しました。クロエは「アレクサンダーがならず者なら、シャーロットはならず者だ」と言いました。リリーは「クロエは騎士ではない」とコメントしました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットはならず者です  \n(2) アレクサンダーはならず者です  \n(3) エラはならず者です  \n(4) クロエは騎士です  \n(5) リリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ヘンリー、エイブリー、クロエ、オリバー、そしてイヴリン。ヘンリーは「クロエは騎士だ」と言っているのが聞かれました。エイブリーは、イヴリンが騎士である場合に限り、イヴリンはならず者だと言いました。クロエはエイブリーがならず者だと言いました。オリバーは、クロエがならず者であるか、エイブリーが騎士であると言いました。「クロエは騎士だ」とイヴリンは主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ヘンリーは騎士です  \n(2) エイブリーはならず者です  \n(3) クロエは騎士です  \n(4) オリバーはならず者です  \n(5) イヴリンは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会いました：ウィリアム、アメリア、ジェイコブ、エイデン、そしてサミュエル。ウィリアムは「もしサミュエルがならず者なら、ジェイコブはならず者だ」と言いました。アメリアは「サミュエルはならず者か、ウィリアムはならず者だ」と指摘しました。ジェイコブは「サミュエルは騎士か、サミュエルはならず者だ」と主張しました。エイデンの言葉では「もしアメリアがならず者なら、エイデンは騎士だ」と言いました。「エイデンは騎士だ」とサミュエルが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムは騎士です  \n(2) アメリアはならず者です  \n(3) ジェイコブは騎士です  \n(4) エイデンは騎士です  \n(5) サミュエルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：リアム、オリビア、エミリー、イザベラ、そしてイヴリン。リアムによれば、「オリビアはならず者です」。オリビアはエミリーが騎士であると表現しました。エミリーは、オリビアが騎士であり、イヴリンも騎士であると言いました。イザベラは、「オリビアはならず者で、エミリーもならず者です」と言いました。「エミリーは騎士であるのは、エミリーがならず者である場合に限る」とイヴリンは主張しました。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムは騎士です  \n(2) オリビアはならず者です  \n(3) エミリーはならず者です  \n(4) イザベラは騎士です  \n(5) イヴリンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ヘンリー、ライリー、エミリー、メイソン、そしてサミュエル。ヘンリーは「メイソンは騎士か、サミュエルはならず者だ」と言いました。ライリーの発言では、「ヘンリーはならず者か、エミリーはならず者だ」と言っています。エミリーは「ヘンリーはならず者ではない」と主張しました。メイソンは「エミリーは騎士である場合、サミュエルはならず者である」と言いました。「ライリーはならず者ではない」とサミュエルが言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ヘンリーは騎士です  \n(2) ライリーはならず者です  \n(3) エミリーは騎士です  \n(4) メイソンは騎士です  \n(5) サミュエルはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：オリバー、ペネロペ、オリビア、エイヴァ、そしてサミュエル。オリバーによれば、「ペネロペは騎士ではない」とのことです。ペネロペは、オリビアが騎士ではないと言いました。オリビアは「エイヴァはならず者だ」と主張しました。エイヴァは「オリバーはならず者で、オリビアは騎士だ」とコメントしました。サミュエルは「ペネロペはならず者か、ペネロペは騎士だ」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリバーは騎士です  \n(2) ペネロペはならず者です  \n(3) オリビアは騎士です  \n(4) エイヴァはならず者です  \n(5) サミュエルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：オーロラ、オリバー、アビゲイル、ルーク、そしてメイソン。オーロラは「オリバーは騎士ではない」と述べました。オリバーは「もしルークがならず者なら、メイソンもならず者だ」とコメントしました。アビゲイルによれば「オーロラは騎士ではない」とのことです。ルークは「もしオリバーが騎士なら、アビゲイルはならず者だ」と言いました。「オーロラは騎士だ」とメイソンは主張しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーロラはならず者です  \n(2) オリバーは騎士です  \n(3) アビゲイルは騎士です  \n(4) ルークはならず者です  \n(5) メイソンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エイブリー、セバスチャン、ローガン、イーサン、そしてペネロペ。エイブリーはこう言いました。「セバスチャンは騎士であるのは、イーサンが騎士である場合に限る。」セバスチャンは、イーサンが騎士であると表現しました。「ローガンは騎士であり、セバスチャンは騎士です」とローガンは主張しました。イーサンは、ローガンが騎士である場合に限り、ローガンはならず者であると言いました。ペネロペはこう述べました。「もしローガンが騎士なら、ローガンはならず者です。」では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーは騎士です  \n(2) セバスチャンはならず者です  \n(3) ローガンはならず者です  \n(4) イーサンはならず者です  \n(5) ペネロペは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ミア、エイヴァ、スカーレット、エミリー、そしてリリー。ミアは「エミリーが騎士なら、エイヴァはならず者だ」と言いました。エイヴァは「ミアがならず者であるのは、エミリーがならず者である場合に限る」と主張しました。スカーレットは「リリーはならず者ではない」と言っているのが聞かれました。エミリーは「リリーはならず者ではない」と言いました。リリーは「エイヴァはならず者ではない」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアは騎士です  \n(2) エイヴァはならず者です  \n(3) スカーレットはならず者です  \n(4) エミリーはならず者です  \n(5) リリーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジェイコブ、クロエ、ペネロペ、エイブリー、そしてスカーレット。ジェイコブは「ペネロペはならず者だ」とコメントしました。クロエは「スカーレットは騎士か、エイブリーはならず者だ」と述べました。ペネロペは「エイブリーは騎士であるのは、クロエが騎士である場合に限る」と主張しました。エイブリーは「もしジェイコブがならず者なら、ペネロペはならず者だ」と言っているのが聞かれました。スカーレットは「クロエはならず者ではない」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブは騎士です  \n(2) クロエはならず者です  \n(3) ペネロペはならず者です  \n(4) エイブリーは騎士です  \n(5) スカーレットはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ルーク、ジャクソン、ルーカス、シャーロット、そしてローガン。ルークは「シャーロットは騎士か、ルークは騎士だ」と言いました。ジャクソンは「ローガンはならず者か、ローガンは騎士だ」と言いました。ルーカスは「ローガンは騎士である場合、シャーロットはならず者である」と言いました。シャーロットは「ジャクソンは騎士で、ルークはならず者だ」と言っているのが聞かれました。「シャーロットは騎士だ」とローガンは言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) ジャクソンは騎士です  \n(3) ルーカスはならず者です  \n(4) シャーロットはならず者です  \n(5) ローガンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ルーカス、オーロラ、ノア、ペネロペ、そしてベンジャミン。「オーロラは騎士である場合に限り、ペネロペも騎士である」とルーカスが言いました。オーロラの発言では、「オーロラは騎士であり、ペネロペも騎士である」と述べています。ノアは「ルーカスは騎士であるか、ペネロペは騎士である」と言いました。ペネロペの発言では、「ルーカスはならず者である場合に限り、ルーカスは騎士である」と述べています。ベンジャミンは「ルーカスは騎士であり、ノアはならず者である」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスは騎士です  \n(2) オーロラはならず者です  \n(3) ノアは騎士です  \n(4) ペネロペはならず者です  \n(5) ベンジャミンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：クロエ、ライリー、ローガン、エイブリー、そしてイヴリン。クロエの言葉によれば、「イヴリンは騎士であるのはライリーが騎士である場合に限る」とのことです。ライリーは「ローガンは騎士であるか、イヴリンはならず者である」と言いました。ローガンの言葉では、「ローガンは騎士であるのはエイブリーがならず者である場合に限る」と述べています。エイブリーは「ライリーは騎士であり、ローガンは騎士である」とコメントしました。イヴリンは「もしローガンが騎士であれば、エイブリーは騎士である」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) クロエはならず者です  \n(2) ライリーはならず者です  \n(3) ローガンはならず者です  \n(4) エイブリーはならず者です  \n(5) イヴリンは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エリザベス、エマ、ウィリアム、セバスチャン、そしてハーパー。エリザベスは「エマはならず者で、ハーパーはならず者です」と主張しました。エマは「エリザベスは騎士で、ウィリアムはならず者です」と言いました。ウィリアムはエリザベスが騎士であると表現しました。セバスチャンは「エマは騎士ではありません」と述べました。ハーパーは「もしエリザベスがならず者なら、セバスチャンは騎士です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスはならず者です  \n(2) エマはならず者です  \n(3) ウィリアムはならず者です  \n(4) セバスチャンは騎士です  \n(5) ハーパーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジャクソン、アメリア、エイヴァ、ウィリアム、そしてジャック。ジャクソンは言いました。「エイヴァがならず者なら、ジャックは騎士です。」アメリアは宣言しました。「ジャックはならず者ではありません。」エイヴァは指摘しました。「ジャックが騎士なら、エイヴァは騎士です。」ウィリアムは、ジャックがならず者か、ジャクソンが騎士であると表現しました。ジャックの発言はこうです。「ウィリアムが騎士なら、ウィリアムはならず者です。」では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンは騎士です  \n(2) アメリアはならず者です  \n(3) エイヴァは騎士です  \n(4) ウィリアムは騎士です  \n(5) ジャックはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エラ、オーロラ、エリザベス、イヴリン、そしてライリー。「エリザベスは騎士ではない」とエラが宣言しました。「ライリーはならず者か、エラはならず者だ」とオーロラが宣言しました。「オーロラはならず者で、ライリーは騎士だ」とエリザベスが言いました。イヴリンは「エリザベスはならず者ではない」と指摘しました。ライリーは「もしオーロラが騎士なら、エラはならず者だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラは騎士です  \n(2) オーロラは騎士です  \n(3) エリザベスはならず者です  \n(4) イヴリンはならず者です  \n(5) ライリーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：メイソン、エイヴァ、ウィリアム、ルーク、そしてジェイコブ。メイソンは「ウィリアムはならず者ではない」と言いました。エイヴァによれば、「ジェイコブはならず者です」。ウィリアムの発言では、「ジェイコブは騎士であるのはウィリアムが騎士である場合に限る」と言っています。ルークによると、「ウィリアムは騎士です」。ジェイコブは「メイソンはならず者です」と主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) メイソンはならず者です  \n(2) エイヴァはならず者です  \n(3) ウィリアムはならず者です  \n(4) ルークはならず者です  \n(5) ジェイコブは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジョセフ、ジャクソン、ベンジャミン、サミュエル、そしてアビゲイル。ジョセフの言葉によれば、「サミュエルはならず者で、ジャクソンは騎士です」。ジャクソンによると、「ジャクソンは騎士であるのは、ジョセフがならず者である場合に限ります」。ベンジャミンは、「もしサミュエルが騎士なら、ジャクソンも騎士です」と述べました。サミュエルは、「ジャクソンは騎士で、ベンジャミンはならず者です」と言いました。アビゲイルは、ベンジャミンは騎士ではないとあなたに伝えました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフはならず者です  \n(2) ジャクソンはならず者です  \n(3) ベンジャミンは騎士です  \n(4) サミュエルはならず者です  \n(5) アビゲイルはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ウィリアム、エラ、ジャクソン、ヘンリー、そしてオーロラ。ウィリアムは「ジャクソンはならず者だ」と主張しました。エラの発言では「ヘンリーは騎士ではない」と言いました。ジャクソンは「オーロラは騎士で、エラも騎士だ」と述べました。ヘンリーは「ウィリアムはエラが騎士である場合に限り騎士だ」と指摘しました。オーロラは「ヘンリーはならず者か、ジャクソンはならず者だ」とコメントしました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムはならず者です  \n(2) エラは騎士です  \n(3) ジャクソンは騎士です  \n(4) ヘンリーはならず者です  \n(5) オーロラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ヘンリー、ジェイコブ、ジャクソン、シャーロット、そしてリリー。ヘンリーは、ジェイコブが騎士であると表現しました。ジェイコブの言葉では、「リリーが騎士であれば、ジャクソンはならず者です」。ジャクソンの言葉では、「シャーロットはならず者である場合、ジャクソンは騎士です」。シャーロットによれば、「ジャクソンがならず者であれば、ジェイコブはならず者です」。リリーは、ヘンリーがならず者であるとあなたに言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ヘンリーは騎士です  \n(2) ジェイコブは騎士です  \n(3) ジャクソンはならず者です  \n(4) シャーロットはならず者です  \n(5) リリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エマ、ダニエル、エラ、ジョセフ、そしてローガン。エマは「もしエラが騎士なら、エラはならず者です」と言いました。ダニエルは「エラは騎士であり、エラはならず者です」と主張しました。エラは「エマはならず者であり、エマは騎士です」と宣言しました。ジョセフは「もしエマが騎士なら、ローガンは騎士です」とあなたに言いました。ローガンによれば「エマは騎士ではありません」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エマは騎士です  \n(2) ダニエルはならず者です  \n(3) エラはならず者です  \n(4) ジョセフはならず者です  \n(5) ローガンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ソフィア、アビゲイル、サミュエル、ジェイコブ、そしてグレース。ソフィアの発言では、「アビゲイルがならず者であるのは、アビゲイルが騎士である場合に限る」と言っています。アビゲイルは、「サミュエルが騎士なら、グレースは騎士だ」と述べました。「アビゲイルはならず者で、ソフィアは騎士だ」とサミュエルが言いました。ジェイコブは、「アビゲイルが騎士なら、ソフィアは騎士だ」と言いました。グレースは、「アビゲイルがならず者であるのは、ソフィアが騎士である場合に限る」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアはならず者です  \n(2) アビゲイルは騎士です  \n(3) サミュエルはならず者です  \n(4) ジェイコブはならず者です  \n(5) グレースは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジェームズ、スカーレット、ルーク、エラ、そしてジェイコブ。ジェームズは「スカーレットはならず者だ」と主張しました。スカーレットは「ルークはならず者だ」と言いました。ルークは「エラはならず者で、スカーレットは騎士だ」と言いました。エラは「もしジェームズがならず者なら、ジェイコブは騎士だ」と述べました。ジェイコブは「ルークはならず者であるのは、ジェームズがならず者である場合に限る」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズはならず者です  \n(2) スカーレットは騎士です  \n(3) ルークはならず者です  \n(4) エラは騎士です  \n(5) ジェイコブは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：イーサン、ルーカス、エイブリー、ハーパー、そしてミア。イーサンは「ルーカスは騎士で、ハーパーは騎士だ」と言いました。ルーカスは「エイブリーはならず者で、ミアは騎士だ」と言っているのが聞かれました。エイブリーは「イーサンは騎士である場合に限り、ルーカスは騎士だ」と主張しました。ハーパーは「ミアは騎士か、エイブリーは騎士だ」と言いました。ミアの発言は「イーサンはならず者か、ルーカスはならず者だ」となります。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンはならず者です  \n(2) ルーカスはならず者です  \n(3) エイブリーは騎士です  \n(4) ハーパーは騎士です  \n(5) ミアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：マシュー、イザベラ、エマ、アビゲイル、そしてヘンリー。マシューは「イザベラがならず者なら、エマもならず者だ」と言いました。イザベラは「ヘンリーはアビゲイルがならず者である場合に限り騎士だ」と言いました。エマは「アビゲイルがならず者である場合に限りイザベラがならず者だ」と言いました。アビゲイルは「マシューはならず者ではない」と主張しました。ヘンリーによれば「ヘンリーが騎士なら、アビゲイルも騎士だ」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マシューは騎士です  \n(2) イザベラはならず者です  \n(3) エマはならず者です  \n(4) アビゲイルは騎士です  \n(5) ヘンリーは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ペネロペ、エイヴァ、グレース、オリビア、そしてアメリア。ペネロペは「エイヴァはグレースが騎士である場合に限り騎士です」と宣言しました。エイヴァは「アメリアは騎士である場合に限りアメリアはならず者です」と言いました。グレースは「オリビアが騎士であれば、アメリアは騎士です」と言及しました。オリビアの言葉では、「グレースは騎士であるか、オリビアは騎士です」。アメリアは「オリビアはならず者である場合に限りエイヴァはならず者です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペは騎士です  \n(2) エイヴァはならず者です  \n(3) グレースはならず者です  \n(4) オリビアは騎士です  \n(5) アメリアはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エイヴァ、ハーパー、エミリー、アビゲイル、そしてセバスチャン。エイヴァは「ハーパーはならず者で、アビゲイルは騎士だ」と言っているのが聞かれました。ハーパーは「ハーパーは騎士だ」と言いました。エミリーは「アビゲイルはならず者であるのは、ハーパーが騎士である場合に限る」と主張しました。「もしエミリーがならず者なら、ハーパーはならず者だ」とアビゲイルが宣言しました。セバスチャンはエミリーが騎士だと言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァは騎士です  \n(2) ハーパーはならず者です  \n(3) エミリーは騎士です  \n(4) アビゲイルは騎士です  \n(5) セバスチャンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エイブリー、グレース、スカーレット、マイケル、そしてエリザベス。エイブリーの言葉によれば、「グレースはエリザベスがならず者である場合に限り騎士です」。グレースはこう言いました、「マイケルはスカーレットがならず者である場合に限りならず者です」。スカーレットは「スカーレットは騎士であるか、エリザベスはならず者です」と述べました。マイケルは「グレースはならず者で、スカーレットは騎士です」と言いました。エリザベスは「エイブリーはならず者です」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーはならず者です  \n(2) グレースは騎士です  \n(3) スカーレットはならず者です  \n(4) マイケルはならず者です  \n(5) エリザベスは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：イヴリン、アビゲイル、イーサン、ローガン、そしてソフィア。イヴリンは「ローガンは騎士です」と言いました。アビゲイルは「ソフィアは騎士で、イヴリンはならず者です」と言いました。「ローガンはならず者か、イヴリンはならず者です」とイーサンが宣言しました。ローガンは「ソフィアは騎士である場合、イーサンも騎士です」と言いました。ソフィアはあなたにアビゲイルは騎士か、ローガンはならず者だと言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンは騎士です  \n(2) アビゲイルはならず者です  \n(3) イーサンはならず者です  \n(4) ローガンは騎士です  \n(5) ソフィアはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ジェイコブ、ジャック、ルーカス、エイブリー、そしてリリー。ジェイコブは「ルーカスは騎士か、エイブリーは騎士だ」と言いました。ジャックは「ジャックは騎士で、ジェイコブも騎士だ」と主張しました。ルーカスによれば、「ジャックは騎士ではない」とのことです。エイブリーは「ルーカスはならず者であるのは、ジェイコブがならず者である場合に限る」と言っているのが聞かれました。リリーは「エイブリーは騎士であるのは、ルーカスが騎士である場合に限る」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブは騎士です  \n(2) ジャックはならず者です  \n(3) ルーカスは騎士です  \n(4) エイブリーは騎士です  \n(5) リリーは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：アメリア、エイブリー、ソフィア、オーロラ、そしてノアです。アメリアは「もしアメリアが騎士なら、オーロラはならず者だ」と言いました。エイブリーは「ノアは騎士か、オーロラは騎士だ」と言いました。ソフィアは「ソフィアは騎士か、オーロラはならず者だ」と言っているのが聞かれました。オーロラによれば、「エイブリーはならず者ではない」とのことです。ノアの発言は「アエイブリーは騎士であるのは、アメリアが騎士である場合に限る」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアは騎士です  \n(2) エイブリーはならず者です  \n(3) ソフィアは騎士です  \n(4) オーロラはならず者です  \n(5) ノアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ライリー、ノア、エラ、イザベラ、そしてエイヴァ。「ノアは騎士であり、ノアはならず者です」とライリーが言いました。ノアは「イザベラが騎士なら、ライリーは騎士です」と言っているのが聞かれました。「ライリーは騎士ではありません」とエラが言いました。イザベラは「エラは騎士ではありません」と言いました。エイヴァは「イザベラはならず者です」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ライリーはならず者です  \n(2) ノアは騎士です  \n(3) エラは騎士です  \n(4) イザベラはならず者です  \n(5) エイヴァは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エリザベス、ルーク、エマ、ライリー、そしてソフィア。エリザベスは「ライリーは騎士で、エマはならず者です」と述べました。ルークは「ルークはエリザベスがならず者である場合に限り騎士です」と言いました。エマは「ライリーはソフィアがならず者である場合に限りならず者です」と述べました。「ソフィアは騎士ではありません」とライリーは宣言しました。ソフィアは「ルークはならず者であるか、エリザベスは騎士です」とコメントしました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスはならず者です  \n(2) ルークはならず者です  \n(3) エマはならず者です  \n(4) ライリーはならず者です  \n(5) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：ビクトリア、ペネロペ、イーサン、オーロラ、そしてセバスチャン。ビクトリアは「オーロラは騎士です」と言いました。ペネロペは「イーサンは騎士であるか、セバスチャンはならず者です」と言いました。イーサンの発言は「ビクトリアが騎士なら、ペネロペはならず者です」となります。オーロラは「ペネロペはならず者で、イーサンもならず者です」と言いました。「ペネロペは騎士であるか、イーサンはならず者です」とセバスチャンは主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ビクトリアはならず者です  \n(2) ペネロペは騎士です  \n(3) イーサンは騎士です  \n(4) オーロラはならず者です  \n(5) セバスチャンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エラ、ダニエル、ハーパー、ベンジャミン、そしてミア。「ハーパーはならず者であり、ハーパーは騎士です」とエラが言いました。ダニエルは「もしエラが騎士なら、ダニエルも騎士です」とコメントしました。「もしベンジャミンがならず者なら、ダニエルは騎士です」とハーパーが言いました。「ベンジャミンは騎士か、ハーパーは騎士です」とベンジャミンが主張しました。ミアは「ベンジャミンはならず者である場合、エラもならず者です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラはならず者です  \n(2) ダニエルは騎士です  \n(3) ハーパーは騎士です  \n(4) ベンジャミンは騎士です  \n(5) ミアはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エミリー、エマ、スカーレット、アメリア、そしてオーロラ。エミリーは言いました。「オーロラはならず者であるのは、エマが騎士である場合に限る。」エマは言いました。「オーロラは騎士です。」スカーレットはコメントしました。「アメリアはならず者であるか、アメリアは騎士です。」アメリアの言葉では、「オーロラはならず者であるのは、エミリーが騎士である場合に限る。」オーロラの発言では、「もしスカーレットがならず者なら、エマはならず者です。」では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーはならず者です  \n(2) エマは騎士です  \n(3) スカーレットは騎士です  \n(4) アメリアは騎士です  \n(5) オーロラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：エイブリー、ビクトリア、エマ、ハーパー、そしてイーサン。エイブリーは「ビクトリアは騎士です」と述べました。ビクトリアは「ハーパーは騎士で、イーサンも騎士です」と主張しました。エマによれば「ハーパーは騎士か、ハーパーはならず者です」。ハーパーの発言では「ビクトリアはならず者か、ビクトリアは騎士です」。イーサンは「ビクトリアは騎士か、エマは騎士です」と主張しました。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーは騎士です  \n(2) ビクトリアは騎士です  \n(3) エマは騎士です  \n(4) ハーパーは騎士です  \n(5) イーサンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：クロエ、オーウェン、リアム、メイソン、そしてペネロペ。クロエはこう言いました。「もしメイソンが騎士なら、メイソンはならず者です」。オーウェンによれば、「リアムはならず者である場合、メイソンもならず者である」。リアムは「メイソンは騎士です」と主張しました。メイソンは「もしクロエがならず者なら、オーウェンは騎士です」と述べました。ペネロペは、メイソンが騎士であるのは、リアムが騎士である場合に限ると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) クロエはならず者です  \n(2) オーウェンは騎士です  \n(3) リアムは騎士です  \n(4) メイソンは騎士です  \n(5) ペネロペは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは5人の住人に出会います：オリビア、シャーロット、セバスチャン、メイソン、そしてエリザベス。オリビアは、「メイソンは騎士であるのはセバスチャンが騎士である場合に限る」と言いました。シャーロットの発言では、「メイソンはならず者であるか、セバスチャンはならず者である」と述べています。「もしシャーロットが騎士なら、オリビアはならず者だ」とセバスチャンが言いました。メイソンは、「シャーロットはエリザベスが騎士である場合に限りならず者である」と表現しました。エリザベスは、「メイソンはならず者であるのはオリビアが騎士である場合に限る」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアは騎士です  \n(2) シャーロットは騎士です  \n(3) セバスチャンはならず者です  \n(4) メイソンはならず者です  \n(5) エリザベスは騎士です"
    }
]