[
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：イーサン、アビゲイル、デイビッド、そしてノア。イーサンは「デイビッドはならず者か、アビゲイルはならず者だ」と主張しました。アビゲイルは「もしアビゲイルが騎士なら、デイビッドは騎士だ」と言っているのが聞かれました。「ノアは騎士で、イーサンはならず者だ」とデイビッドが言いました。ノアは「アビゲイルはならず者であるのは、イーサンが騎士である場合に限る」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンはならず者です  \n(2) アビゲイルは騎士です  \n(3) デイビッドは騎士です  \n(4) ノアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エリザベス、ソフィア、メイソン、そしてアビゲイル。エリザベスは「アビゲイルはならず者で、メイソンはならず者です」と述べました。ソフィアの言葉では、「もしアビゲイルがならず者なら、アビゲイルは騎士です」。メイソンは「メイソンは騎士で、アビゲイルは騎士です」と宣言しました。「メイソンは騎士で、アビゲイルは騎士です」とアビゲイルは言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスは騎士です  \n(2) ソフィアはならず者です  \n(3) メイソンはならず者です  \n(4) アビゲイルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ルーカス、ハーパー、アメリア、そしてエミリー。ルーカスはこう言いました。「ルーカスは騎士か、ハーパーは騎士です」。ハーパーは宣言しました。「ルーカスは騎士か、ルーカスはならず者です」。アメリアは主張しました。「ルーカスは騎士で、ハーパーはならず者です」。エミリーの発言では、「ハーパーがならず者なら、アメリアは騎士です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスは騎士です  \n(2) ハーパーは騎士です  \n(3) アメリアはならず者です  \n(4) エミリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ジョセフ、ソフィア、ウィリアム、そしてクロエ。「もしジョセフが騎士なら、ウィリアムは騎士だ」とジョセフは主張しました。ソフィアの言葉では、「ジョセフは騎士か、クロエは騎士です」。ウィリアムの発言では、「ジョセフはならず者ではない」。クロエは「ウィリアムはならず者ではない」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフは騎士です  \n(2) ソフィアは騎士です  \n(3) ウィリアムは騎士です  \n(4) クロエは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：スカーレット、ハーパー、ヘンリー、そしてアレクサンダー。スカーレットによれば、「アレクサンダーは騎士である場合に限り、アレクサンダーはならず者である」。ハーパーは「もしスカーレットが騎士なら、ハーパーは騎士である」と言っているのが聞かれました。ヘンリーは「ハーパーは騎士であるか、アレクサンダーはならず者である」とコメントしました。「ヘンリーはならず者ではない」とアレクサンダーが言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) スカーレットはならず者です  \n(2) ハーパーは騎士です  \n(3) ヘンリーは騎士です  \n(4) アレクサンダーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ライリー、オーウェン、オリバー、そしてアメリア。ライリーはアメリアがならず者ではないと言いました。オーウェンはオリバーがならず者であるか、アメリアがならず者であると言いました。オリバーは「ライリーは騎士で、アメリアはならず者だ」と言いました。アメリアはオリバーが騎士で、アメリアも騎士だと表現しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ライリーはならず者です  \n(2) オーウェンは騎士です  \n(3) オリバーはならず者です  \n(4) アメリアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エミリー、エリザベス、ジョセフ、そしてリアム。エミリーは「リアムはならず者ではない」と言いました。エリザベスは「もしエミリーがならず者なら、ジョセフは騎士だ」とコメントしました。ジョセフは「もしリアムがならず者なら、エリザベスはならず者だ」と言いました。リアムは「ジョセフは騎士だ」と主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーは騎士です  \n(2) エリザベスは騎士です  \n(3) ジョセフは騎士です  \n(4) リアムは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ハーパー、アビゲイル、エイヴァ、そしてイーサン。ハーパーの言葉では、「エイヴァがならず者なら、アビゲイルは騎士です」。アビゲイルは、「エイヴァはならず者です」と言いました。エイヴァは、エイヴァが騎士ならハーパーは騎士だと言いました。イーサンは、「エイヴァは騎士ではありません」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーは騎士です  \n(2) アビゲイルはならず者です  \n(3) エイヴァは騎士です  \n(4) イーサンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エイデン、メイソン、ゾーイ、そしてアレクサンダー。エイデンは「アレクサンダーは騎士ではない」と述べました。メイソンは「エイデンは騎士であるか、アレクサンダーは騎士である」と言いました。ゾーイは「エイデンは騎士であるか、メイソンは騎士である」と述べました。アレクサンダーは「ゾーイはならず者であるか、ゾーイは騎士である」と表現しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンはならず者です  \n(2) メイソンは騎士です  \n(3) ゾーイは騎士です  \n(4) アレクサンダーは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ジャクソン、ビクトリア、ジョセフ、そしてイーサン。ジャクソンは「イーサンは騎士だ」と言いました。ビクトリアは「イーサンはならず者で、ジャクソンはならず者だ」と言いました。ジョセフは「ジャクソンはならず者であるのは、イーサンがならず者である場合に限る」とコメントしました。イーサンは「ビクトリアは騎士か、ジョセフは騎士だ」とコメントしました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンは騎士です  \n(2) ビクトリアはならず者です  \n(3) ジョセフは騎士です  \n(4) イーサンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：リリー、リアム、ペネロペ、そしてシャーロット。「リアムはならず者であり、リアムは騎士です」とリリーは宣言しました。リアムは、「もしリアムが騎士なら、シャーロットはならず者です」と述べました。ペネロペによれば、「リアムはならず者です」。シャーロットは、「リアムはならず者であるか、シャーロットは騎士です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーはならず者です  \n(2) リアムは騎士です  \n(3) ペネロペはならず者です  \n(4) シャーロットはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：セバスチャン、サミュエル、ライリー、そしてローガン。セバスチャンはこう言いました。「サミュエルは騎士で、ローガンはならず者です」。サミュエルの発言では、「セバスチャンは騎士である場合、サミュエルも騎士です」。ライリーはこう主張しました。「もしローガンが騎士なら、ライリーも騎士です」。ローガンはこう主張しました。「ライリーはならず者か、セバスチャンはならず者です」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) セバスチャンは騎士です  \n(2) サミュエルは騎士です  \n(3) ライリーは騎士です  \n(4) ローガンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ジョセフ、ハーパー、ジェイコブ、そしてリリー。ジョセフは「リリーはならず者だ」と言いました。ハーパーは「リリーはならず者だ」と言っているのが聞かれました。「リリーはならず者で、ジェイコブは騎士だ」とジェイコブが言いました。リリーは「ハーパーは騎士か、ジェイコブはならず者だ」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフはならず者です  \n(2) ハーパーはならず者です  \n(3) ジェイコブはならず者です  \n(4) リリーは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ジェームズ、エイヴァ、ローガン、そしてアレクサンダー。ジェームズは、アレクサンダーが騎士であるのはエイヴァがならず者である場合に限ると述べました。エイヴァは、「ローガンが騎士であるのはアレクサンダーが騎士である場合に限る」と言っているのが聞かれました。ローガンは、ローガンが騎士であるのはジェームズがならず者である場合に限るとあなたに言いました。アレクサンダーは、「もしローガンがならず者であれば、アレクサンダーは騎士である」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズはならず者です  \n(2) エイヴァは騎士です  \n(3) ローガンは騎士です  \n(4) アレクサンダーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：オーウェン、マシュー、イヴリン、そしてウィリアム。「マシューは騎士だ」とオーウェンは宣言しました。マシューはウィリアムがならず者で、イヴリンもならず者だと言いました。イヴリンは、「もしイヴリンが騎士なら、オーウェンはならず者だ」と表現しました。ウィリアムは「マシューは騎士であるのは、イヴリンが騎士である場合に限る」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンはならず者です  \n(2) マシューはならず者です  \n(3) イヴリンは騎士です  \n(4) ウィリアムはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エラ、シャーロット、ゾーイ、そしてサミュエル。エラの言葉では、「ゾーイは騎士で、サミュエルも騎士です」と言いました。シャーロットは「エラはならず者か、ゾーイは騎士です」と主張しました。ゾーイは「シャーロットがならず者なら、エラは騎士です」と言っているのが聞かれました。サミュエルはゾーイがならず者だと言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラはならず者です  \n(2) シャーロットは騎士です  \n(3) ゾーイは騎士です  \n(4) サミュエルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エリザベス、クロエ、ベンジャミン、そしてリアム。エリザベスは「クロエはならず者で、ベンジャミンは騎士です」とコメントしました。クロエは「エリザベスは騎士であるのは、リアムがならず者である場合に限ります」と述べました。ベンジャミンの言葉では「リアムはならず者であるか、クロエはならず者です」と言いました。リアムの言葉では「リアムは騎士であり、ベンジャミンはならず者です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスはならず者です  \n(2) クロエは騎士です  \n(3) ベンジャミンはならず者です  \n(4) リアムは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ダニエル、ルーカス、クロエ、そしてアレクサンダー。ダニエルは「アレクサンダーは騎士だ」と言いました。ルーカスは「アレクサンダーは騎士だ」と指摘しました。「ダニエルは騎士で、アレクサンダーはならず者だ」とクロエが言いました。アレクサンダーは、クロエは騎士であり、アレクサンダーも騎士だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルはならず者です  \n(2) ルーカスはならず者です  \n(3) クロエはならず者です  \n(4) アレクサンダーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ペネロペ、マシュー、ベンジャミン、そしてセバスチャン。ペネロペは「もしセバスチャンがならず者なら、ペネロペは騎士です」と宣言しました。マシューは「もしマシューが騎士なら、ベンジャミンはならず者です」と言いました。ベンジャミンは「ペネロペはセバスチャンが騎士である場合に限りならず者です」とコメントしました。セバスチャンは「ペネロペは騎士であるか、マシューは騎士です」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペは騎士です  \n(2) マシューは騎士です  \n(3) ベンジャミンはならず者です  \n(4) セバスチャンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ジェームズ、イーサン、サミュエル、そしてエミリー。「エミリーは騎士ではない」とジェームズが言いました。イーサンはエミリーがならず者だと言いました。サミュエルは「イーサンは騎士で、エミリーは騎士だ」と述べました。エミリーは「サミュエルは騎士か、サミュエルはならず者だ」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズはならず者です  \n(2) イーサンはならず者です  \n(3) サミュエルはならず者です  \n(4) エミリーは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：デイビッド、メイソン、サミュエル、そしてダニエル。「もしメイソンが騎士なら、サミュエルはならず者だ」とデイビッドが宣言しました。「メイソンはデイビッドがならず者である場合に限り騎士だ」とメイソンが宣言しました。サミュエルは「ダニエルは騎士か、デイビッドはならず者だ」とコメントしました。ダニエルはデイビッドが騎士であり、サミュエルがならず者であると表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドはならず者です  \n(2) メイソンは騎士です  \n(3) サミュエルは騎士です  \n(4) ダニエルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エミリー、アビゲイル、ハーパー、そしてジェームズ。エミリーは「もしジェームズが騎士なら、ジェームズはならず者です」と言っているのが聞かれました。アビゲイルは「ジェームズはならず者です」とコメントしました。ハーパーは「ハーパーが騎士であるならば、エミリーはならず者です」と言いました。「ハーパーが騎士なら、アビゲイルは騎士です」とジェームズが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーはならず者です  \n(2) アビゲイルはならず者です  \n(3) ハーパーはならず者です  \n(4) ジェームズは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ルーカス、ソフィア、ソフィア、そしてマイケル。ルーカスは「もしソフィアが騎士なら、ソフィアはならず者だ」と述べました。ソフィアは「ルーカスは騎士で、ソフィアは騎士だ」と主張しました。「もしソフィアがならず者なら、マイケルはならず者だ」とソフィアは言いました。マイケルは「もしソフィアがならず者なら、ソフィアはならず者だ」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスは騎士です  \n(2) ソフィアはならず者です  \n(3) ソフィアはならず者です  \n(4) マイケルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ミア、イヴリン、ソフィア、そしてシャーロット。ミアは「ソフィアはならず者か、シャーロットはならず者だ」と言いました。イヴリンは「ミアはならず者か、ミアは騎士だ」とコメントしました。ソフィアの発言は「もしイヴリンが騎士なら、シャーロットはならず者だ」と言いました。シャーロットは「ミアは騎士ではない」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアは騎士です  \n(2) イヴリンは騎士です  \n(3) ソフィアは騎士です  \n(4) シャーロットはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：グレース、ノア、オリバー、そしてシャーロット。グレースは「オリバーはならず者で、シャーロットは騎士です」と主張しました。ノアは「オリバーは騎士です」とコメントしました。オリバーは、シャーロットが騎士である場合に限り、シャーロットはならず者であると言いました。シャーロットは「オリバーはならず者か、グレースはならず者です」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) グレースは騎士です  \n(2) ノアはならず者です  \n(3) オリバーはならず者です  \n(4) シャーロットは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ジェームズ、エイブリー、エリザベス、そしてセバスチャン。ジェームズは「セバスチャンはならず者ではない」とコメントしました。「ジェームズは騎士であるか、エリザベスは騎士である」 - エイブリー。エリザベスは「エリザベスは騎士です」と言いました。セバスチャンは「もしエリザベスが騎士なら、ジェームズはならず者です」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズは騎士です  \n(2) エイブリーは騎士です  \n(3) エリザベスはならず者です  \n(4) セバスチャンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：グレース、イーサン、ハーパー、そしてリアム。グレースの発言によれば、「イーサンはならず者か、リアムはならず者です」。イーサンは「グレースはならず者ではありません」と言いました。ハーパーは「もしグレースがならず者なら、ハーパーは騎士です」と言いました。リアムによれば、「リアムは騎士で、ハーパーは騎士です」。さて、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) グレースは騎士です  \n(2) イーサンは騎士です  \n(3) ハーパーは騎士です  \n(4) リアムはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：イヴリン、アリア、エリザベス、そしてエミリー。イヴリンによれば、「エリザベスは騎士ではありません」。アリアは「エミリーは騎士ではありません」と主張しました。「アリアはならず者であり、アリアは騎士です」とエリザベスは宣言しました。「エリザベスはならず者です」とエミリーは宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンは騎士です  \n(2) アリアはならず者です  \n(3) エリザベスはならず者です  \n(4) エミリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ベンジャミン、エイヴァ、ノア、そしてスカーレット。ベンジャミンの言葉では、「スカーレットはならず者です」。エイヴァは、「スカーレットはならず者で、ベンジャミンは騎士です」と述べました。ノアは、「ノアは騎士であるのは、スカーレットが騎士である場合に限る」と言いました。スカーレットは、「ノアはならず者か、エイヴァは騎士です」とコメントしました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンはならず者です  \n(2) エイヴァはならず者です  \n(3) ノアはならず者です  \n(4) スカーレットは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：メイソン、イザベラ、エミリー、そしてビクトリア。メイソンは、イザベラは騎士ではないと言いました。イザベラの発言は、「もしビクトリアがならず者なら、ビクトリアは騎士です。」エミリーは、「メイソンはならず者ではない」と言いました。ビクトリアは、「イザベラはならず者か、エミリーはならず者です。」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) メイソンはならず者です  \n(2) イザベラは騎士です  \n(3) エミリーはならず者です  \n(4) ビクトリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エラ、リアム、ライリー、そしてリリー。「リアムはならず者だ」とエラは宣言しました。リアムは、エラが騎士であり、ライリーがならず者だと言いました。ライリーによれば、「リアムは騎士であるか、エラは騎士である」。リリーによれば、「エラは騎士である場合に限り、リアムはならず者である」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラは騎士です  \n(2) リアムはならず者です  \n(3) ライリーは騎士です  \n(4) リリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ベンジャミン、ノア、イザベラ、そしてソフィア。ベンジャミンは「もしソフィアが騎士なら、イザベラは騎士だ」と述べました。ノアは「ソフィアはならず者ではない」と言っているのが聞かれました。「ベンジャミンはならず者だ」とイザベラが言いました。「イザベラは騎士だ」とソフィアが宣言しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンは騎士です  \n(2) ノアはならず者です  \n(3) イザベラはならず者です  \n(4) ソフィアはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：マイケル、ライリー、マシュー、そしてミア。「もしライリーが騎士なら、マイケルは騎士だ」とマイケルは宣言しました。ライリーの言葉では、「マシューは騎士で、ライリーは騎士だ」と言いました。「もしライリーが騎士なら、ライリーはならず者だ」とマシューは主張しました。ミアは「マシューは騎士か、ミアは騎士だ」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルは騎士です  \n(2) ライリーはならず者です  \n(3) マシューは騎士です  \n(4) ミアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ジェームズ、ルーク、オーロラ、そしてスカーレット。ジェームズは「ルークはならず者で、オーロラはならず者だ」とコメントしました。ルークは「ジェームズはならず者ではない」と述べました。オーロラは「ジェームズはルークがならず者である場合に限り、ならず者だ」とあなたに言いました。スカーレットは「ルークはならず者であるか、スカーレットは騎士である」とあなたに言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズはならず者です  \n(2) ルークはならず者です  \n(3) オーロラは騎士です  \n(4) スカーレットは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エイデン、ミア、エリザベス、そしてセバスチャン。エイデンは「ミアは騎士だ」と言いました。ミアは「エイデンは騎士か、セバスチャンはならず者だ」と主張しました。エリザベスは「エイデンはミアが騎士である場合に限り騎士だ」と言っているのが聞かれました。セバスチャンは「ミアは騎士だ」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンは騎士です  \n(2) ミアは騎士です  \n(3) エリザベスは騎士です  \n(4) セバスチャンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ジェイコブ、リアム、エミリー、そしてソフィア。ジェイコブは「ソフィアはならず者か、リアムは騎士です」と主張しました。リアムは「エミリーは騎士か、ジェイコブは騎士です」と言いました。エミリーは「ソフィアは騎士か、ソフィアはならず者です」と述べました。「エミリーは騎士か、エミリーはならず者です」とソフィアは宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブは騎士です  \n(2) リアムは騎士です  \n(3) エミリーは騎士です  \n(4) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ローガン、エラ、イザベラ、そしてオーウェン。ローガンは「オーウェンはならず者で、イザベラは騎士だ」と述べました。エラは「イザベラはならず者だ」と指摘しました。イザベラは「ローガンはならず者か、エラは騎士だ」と言っているのが聞かれました。オーウェンは「オーウェンは騎士だ」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンはならず者です  \n(2) エラはならず者です  \n(3) イザベラは騎士です  \n(4) オーウェンは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ルーカス、オリビア、アリア、そしてシャーロット。ルーカスは「オリビアはアリアがならず者である場合に限り騎士である」と主張しました。オリビアの言葉では「シャーロットはアリアが騎士である場合に限り騎士である」と言いました。「ルーカスはならず者で、オリビアはならず者だ」とアリアは主張しました。シャーロットは「オリビアはならず者であるか、ルーカスはならず者である」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスは騎士です  \n(2) オリビアは騎士です  \n(3) アリアはならず者です  \n(4) シャーロットはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：メイソン、オーロラ、ペネロペ、そしてルーカス。メイソンは「ルーカスは騎士だ」と言っているのが聞かれました。オーロラは「もしペネロペが騎士なら、ペネロペはならず者だ」と言いました。ペネロペは「メイソンはならず者か、ルーカスは騎士だ」と述べました。ルーカスは「ペネロペは騎士で、オーロラは騎士だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) メイソンはならず者です  \n(2) オーロラはならず者です  \n(3) ペネロペは騎士です  \n(4) ルーカスはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ジェームズ、マシュー、ソフィア、そしてイヴリン。ジェームズの発言では、「マシューはならず者か、イヴリンはならず者です」。マシューはソフィアがならず者ではないと表現しました。ソフィアは「イヴリンはならず者ではない」と主張しました。イヴリンの発言では、「ソフィアは騎士である場合に限り、ジェームズは騎士です」。では、誰が騎士で誰がならず者ですか？",
        "solution_text_format": "(1) ジェームズは騎士です  \n(2) マシューはならず者です  \n(3) ソフィアはならず者です  \n(4) イヴリンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ジャック、クロエ、ウィリアム、そしてルーク。ジャックは「ルークは騎士だ」と言いました。クロエは「ジャックはならず者か、ウィリアムは騎士だ」と言いました。ウィリアムは「もしルークが騎士なら、ジャックは騎士だ」とコメントしました。ルークは「ジャックは騎士であり、ジャックはならず者だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャックはならず者です  \n(2) クロエは騎士です  \n(3) ウィリアムは騎士です  \n(4) ルークはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ノア、ソフィア、エリザベス、そしてエラ。ノアはソフィアが騎士だと言いました。ソフィアは「ノアはならず者か、エリザベスは騎士です」と言いました。「もしエラがならず者なら、ソフィアはならず者です」とエリザベスが言いました。エラは「エラは騎士で、エリザベスは騎士です」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアは騎士です  \n(2) ソフィアは騎士です  \n(3) エリザベスは騎士です  \n(4) エラは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ジェームズ、サミュエル、ヘンリー、そしてルーク。ジェームズは「ヘンリーは騎士だ」とコメントしました。サミュエルはルークがならず者だと言いました。ヘンリーはあなたにサミュエルが騎士でルークも騎士だと言いました。ルークは「ジェームズは騎士だ」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズはならず者です  \n(2) サミュエルは騎士です  \n(3) ヘンリーはならず者です  \n(4) ルークはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エミリー、ローガン、スカーレット、そしてメイソン。エミリーは「ローガンはならず者ではない」と言いました。ローガンは「エミリーは騎士であるか、メイソンは騎士である」と言っているのが聞かれました。スカーレットは「エミリーは騎士である場合に限り、メイソンは騎士である」と言っているのが聞かれました。メイソンは「スカーレットは騎士であるか、ローガンは騎士である」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーは騎士です  \n(2) ローガンは騎士です  \n(3) スカーレットは騎士です  \n(4) メイソンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ビクトリア、スカーレット、イヴリン、そしてルーカス。「ルーカスは騎士で、スカーレットはならず者だ」とビクトリアが宣言しました。スカーレットは「スカーレットは騎士で、イヴリンはならず者だ」とコメントしました。イヴリンは「ビクトリアは騎士だ」と言いました。ルーカスによれば、「もしルーカスが騎士なら、イヴリンも騎士だ」とのことです。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ビクトリアは騎士です  \n(2) スカーレットはならず者です  \n(3) イヴリンは騎士です  \n(4) ルーカスは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：オーウェン、マイケル、アレクサンダー、そしてローガン。「マイケルはならず者ではない」とオーウェンが宣言しました。マイケルは「オーウェンは騎士であり、オーウェンはならず者だ」と言っているのが聞かれました。アレクサンダーは「マイケルはならず者か、オーウェンは騎士だ」と指摘しました。ローガンは「マイケルはならず者だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンはならず者です  \n(2) マイケルはならず者です  \n(3) アレクサンダーは騎士です  \n(4) ローガンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ダニエル、デイビッド、ベンジャミン、そしてリリー。ダニエルによれば、「もしベンジャミンがならず者なら、リリーは騎士です」。デイビッドは「デイビッドは騎士か、リリーはならず者です」と主張しました。ベンジャミンは「ダニエルは騎士ではありません」と言いました。リリーはあなたに、デイビッドはならず者ではないと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルは騎士です  \n(2) デイビッドは騎士です  \n(3) ベンジャミンはならず者です  \n(4) リリーは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ビクトリア、ベンジャミン、セバスチャン、そしてソフィア。ビクトリアは「セバスチャンは騎士である場合に限り、セバスチャンはならず者である」と言いました。ベンジャミンはソフィアが騎士であり、ソフィアがならず者であると言いました。セバスチャンは「もしベンジャミンがならず者なら、ビクトリアは騎士だ」と言いました。ソフィアは「ベンジャミンは騎士か、ビクトリアは騎士だ」と言っているのが聞かれました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ビクトリアはならず者です  \n(2) ベンジャミンはならず者です  \n(3) セバスチャンはならず者です  \n(4) ソフィアはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：デイビッド、ゾーイ、リアム、そしてウィリアム。デイビッドは「ウィリアムはならず者であるのは、リアムがならず者である場合に限る」と言いました。ゾーイは「ウィリアムはならず者で、デイビッドは騎士だ」と述べました。リアムは「ウィリアムは騎士であるのは、ウィリアムがならず者である場合に限る」と言いました。ウィリアムは「リアムはならず者であるのは、リアムが騎士である場合に限る」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドは騎士です  \n(2) ゾーイは騎士です  \n(3) リアムはならず者です  \n(4) ウィリアムはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エイデン、スカーレット、マイケル、そしてミア。「もしミアが騎士なら、ミアはならず者だ」 - エイデン。スカーレットは「ミアは騎士か、スカーレットは騎士だ」とコメントしました。「エイデンは騎士か、スカーレットは騎士だ」 - マイケル。「マイケルはならず者ではない」 - ミア。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンはならず者です  \n(2) スカーレットは騎士です  \n(3) マイケルは騎士です  \n(4) ミアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ベンジャミン、ハーパー、ルーク、そしてオーウェン。ベンジャミンは「ルークがならず者であるとき、ベンジャミンは騎士である」とコメントしました。ハーパーは「オーウェンはならず者ではない」と言いました。「ベンジャミンはならず者で、オーウェンは騎士だ」とルークは宣言しました。「ベンジャミンは騎士ではない」とオーウェンは主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンは騎士です  \n(2) ハーパーはならず者です  \n(3) ルークはならず者です  \n(4) オーウェンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エイヴァ、ダニエル、ヘンリー、そしてデイビッド。エイヴァは、「ヘンリーはならず者であるのは、ヘンリーが騎士である場合に限る」と言いました。ダニエルは、「エイヴァは騎士であるか、エイヴァはならず者である」と言いました。「もしデイビッドがならず者なら、ダニエルは騎士だ」とヘンリーが言及しました。デイビッドは、「ヘンリーは騎士ではない」とコメントしました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァはならず者です  \n(2) ダニエルは騎士です  \n(3) ヘンリーは騎士です  \n(4) デイビッドはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：セバスチャン、ローガン、エイブリー、そしてダニエル。セバスチャンは「セバスチャンは騎士だ」と言いました。ローガンは「エイブリーはならず者であるのは、セバスチャンがならず者である場合に限る」と言っているのが聞かれました。エイブリーは「ローガンがならず者なら、セバスチャンは騎士だ」と述べました。ダニエルは「セバスチャンはならず者で、ダニエルは騎士だ」と表現しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) セバスチャンは騎士です  \n(2) ローガンは騎士です  \n(3) エイブリーは騎士です  \n(4) ダニエルはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ウィリアム、エマ、グレース、そしてアリア。ウィリアムは「ウィリアムは騎士であり、アリアは騎士です」と述べました。エマは「グレースはならず者です」と言いました。「もしウィリアムがならず者なら、アリアは騎士です」とグレースが言いました。アリアは「もしグレースが騎士なら、ウィリアムはならず者です」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムはならず者です  \n(2) エマはならず者です  \n(3) グレースは騎士です  \n(4) アリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エラ、オリバー、ジョセフ、そしてエイヴァ。エラは「エラは騎士で、オリバーはならず者だ」と言いました。オリバーは「もしオリバーが騎士なら、ジョセフは騎士だ」と宣言しました。ジョセフは「エラは騎士ではない」と言っているのが聞かれました。エイヴァは「エイヴァは騎士であるか、エラはならず者である」とあなたに言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラはならず者です  \n(2) オリバーは騎士です  \n(3) ジョセフは騎士です  \n(4) エイヴァは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：グレース、デイビッド、アリア、そしてミア。グレースは「もしミアがならず者なら、アリアは騎士です」と言っているのが聞かれました。デイビッドは「もしデイビッドが騎士なら、グレースはならず者です」とあなたに言いました。アリアは「ミアはデイビッドが騎士である場合に限り騎士です」と主張しました。ミアは「デイビッドは騎士ではありません」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) グレースはならず者です  \n(2) デイビッドは騎士です  \n(3) アリアはならず者です  \n(4) ミアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：オリバー、ペネロペ、ビクトリア、そしてサミュエル。オリバーは「もしペネロペが騎士なら、サミュエルはならず者だ」と言いました。ペネロペは「サミュエルはならず者か、ペネロペは騎士だ」と言っているのが聞かれました。ビクトリアは「ペネロペはならず者だ」とコメントしました。サミュエルは「ビクトリアはならず者で、ペネロペはならず者だ」と表現しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリバーは騎士です  \n(2) ペネロペは騎士です  \n(3) ビクトリアはならず者です  \n(4) サミュエルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ビクトリア、エイブリー、アビゲイル、そしてメイソン。ビクトリアはこう言いました。「アビゲイルは騎士です」。エイブリーは主張しました。「メイソンはならず者か、アビゲイルは騎士です」。アビゲイルの発言では、「アビゲイルは騎士か、ビクトリアはならず者です」。メイソンはこう言いました。「ビクトリアはならず者で、エイブリーは騎士です」。さて、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) ビクトリアは騎士です  \n(2) エイブリーは騎士です  \n(3) アビゲイルは騎士です  \n(4) メイソンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：イーサン、アレクサンダー、ソフィア、そしてゾーイ。「アレクサンダーはならず者か、ソフィアはならず者です」 - イーサン。アレクサンダーは、「ゾーイが騎士なら、アレクサンダーは騎士です」とコメントしました。ソフィアはイーサンがならず者ではないと言いました。ゾーイは「イーサンはならず者か、ソフィアは騎士です」とコメントしました。では、誰が騎士で誰がならず者ですか？",
        "solution_text_format": "(1) イーサンは騎士です  \n(2) アレクサンダーはならず者です  \n(3) ソフィアは騎士です  \n(4) ゾーイは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会いました：シャーロット、オーウェン、ノア、そしてライリー。シャーロットは「ノアはならず者だ」とコメントしました。オーウェンは「シャーロットが騎士である場合に限り、ライリーは騎士だ」と述べました。ノアはあなたにオーウェンが騎士だと言いました。ライリーは「ノアはならず者であるか、ライリーは騎士だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットはならず者です  \n(2) オーウェンは騎士です  \n(3) ノアは騎士です  \n(4) ライリーはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ミア、エイブリー、ルーク、そしてノア。ミアは「エイブリーはならず者であるときに限り、騎士である」と言いました。エイブリーは「ルークは騎士であるか、ルークはならず者である」と述べました。ルークは「ミアはならず者であるときに限り、騎士である」と言っているのが聞かれました。ノアは「ルークがならず者であれば、エイブリーはならず者である」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアはならず者です  \n(2) エイブリーは騎士です  \n(3) ルークは騎士です  \n(4) ノアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：オリバー、イーサン、グレース、そしてエイヴァ。オリバーはこう言いました。「イーサンはならず者か、グレースは騎士です」。イーサンは言いました。「グレースはならず者で、グレースは騎士です」。グレースは「グレースは騎士で、イーサンは騎士です」と言いました。エイヴァはこう言いました。「グレースはならず者です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリバーは騎士です  \n(2) イーサンはならず者です  \n(3) グレースはならず者です  \n(4) エイヴァは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：オーウェン、エマ、アレクサンダー、そしてオーロラ。オーウェンは「エマは騎士か、アレクサンダーはならず者だ」と言いました。エマは「アレクサンダーが騎士なら、オーウェンはならず者だ」と宣言しました。アレクサンダーはオーロラはならず者ではないと言いました。オーロラはエマはならず者で、アレクサンダーもならず者だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンは騎士です  \n(2) エマは騎士です  \n(3) アレクサンダーはならず者です  \n(4) オーロラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ジェイコブ、マシュー、エイブリー、そしてジャクソン。ジェイコブの発言によると、「マシューはならず者です」。マシューは「ジェイコブが騎士である場合に限り、マシューは騎士です」と述べました。エイブリーによれば、「ジェイコブは騎士であるか、ジェイコブはならず者です」。ジャクソンは、ジェイコブがならず者であり、エイブリーがならず者であると表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブは騎士です  \n(2) マシューはならず者です  \n(3) エイブリーは騎士です  \n(4) ジャクソンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ヘンリー、エイヴァ、シャーロット、そしてノア。ヘンリーは「エイヴァはならず者で、ヘンリーは騎士だ」とコメントしました。エイヴァの発言では「ノアはならず者ではない」と言いました。シャーロットは「エイヴァはならず者ではない」と言いました。ノアは「ヘンリーは騎士か、ヘンリーはならず者だ」と主張しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ヘンリーはならず者です  \n(2) エイヴァは騎士です  \n(3) シャーロットは騎士です  \n(4) ノアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ローガン、オリビア、エイデン、そしてエマ。ローガンはこう言いました。「オリビアはならず者で、エイデンはならず者です」。オリビアは主張しました。「もしローガンがならず者なら、ローガンは騎士です」。エイデンは主張しました。「もしローガンがならず者なら、オリビアはならず者です」。エマはオリビアがならず者だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンはならず者です  \n(2) オリビアはならず者です  \n(3) エイデンは騎士です  \n(4) エマは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ウィリアム、ヘンリー、ペネロペ、そしてエイヴァ。ウィリアムは「もしペネロペが騎士なら、ペネロペはならず者だ」と主張しました。ヘンリーは「ウィリアムは騎士ではない」と言いました。ペネロペは「エイヴァは騎士だ」と述べました。エイヴァは「ウィリアムはヘンリーが騎士である場合に限り騎士だ」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムは騎士です  \n(2) ヘンリーはならず者です  \n(3) ペネロペはならず者です  \n(4) エイヴァはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ビクトリア、ルーカス、ライリー、そしてクロエ。ビクトリアは「ライリーは騎士ではない」とコメントしました。ルーカスは「もしビクトリアが騎士なら、ライリーは騎士だ」と主張しました。「もしビクトリアがならず者なら、クロエはならず者だ」とライリーが言いました。クロエは「ルーカスは騎士ではない」とコメントしました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ビクトリアはならず者です  \n(2) ルーカスは騎士です  \n(3) ライリーは騎士です  \n(4) クロエはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エミリー、ウィリアム、マイケル、そしてミア。エミリーは「もしミアが騎士なら、ウィリアムはならず者です」と言いました。「ミアは騎士ではありません」とウィリアムが宣言しました。マイケルは「ウィリアムはならず者です」と言いました。「もしウィリアムが騎士なら、マイケルはならず者です」とミアが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーは騎士です  \n(2) ウィリアムはならず者です  \n(3) マイケルは騎士です  \n(4) ミアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：アレクサンダー、ソフィア、メイソン、そしてジョセフ。「ソフィアは騎士ではない」とアレクサンダーが宣言しました。ソフィアは「メイソンはならず者です」と言いました。メイソンは「もしソフィアがならず者なら、アレクサンダーは騎士です」と言いました。ジョセフは「アレクサンダーは騎士ではない」とコメントしました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アレクサンダーは騎士です  \n(2) ソフィアはならず者です  \n(3) メイソンは騎士です  \n(4) ジョセフはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ミア、ソフィア、ビクトリア、そしてウィリアム。ミアは「ソフィアは騎士か、ソフィアはならず者です」と言いました。ソフィアは「もしミアが騎士なら、ビクトリアはならず者です」と言っているのが聞かれました。ビクトリアは「ソフィアはならず者か、ミアは騎士です」と言いました。ウィリアムによれば「ビクトリアはならず者で、ソフィアはならず者です」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアは騎士です  \n(2) ソフィアはならず者です  \n(3) ビクトリアは騎士です  \n(4) ウィリアムはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ハーパー、シャーロット、ソフィア、そしてリアム。ハーパーによると、「シャーロットは騎士です」。シャーロットはソフィアが騎士だと言いました。「ソフィアは騎士で、リアムも騎士です」とソフィアが言及しました。リアムの発言では、「ソフィアは騎士であるのは、シャーロットがならず者である場合に限ります」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーはならず者です  \n(2) シャーロットはならず者です  \n(3) ソフィアはならず者です  \n(4) リアムはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エイヴァ、オリビア、マシュー、そしてエラ。エイヴァは「エイヴァは騎士で、マシューはならず者です」と言いました。オリビアは「エラは騎士か、エイヴァは騎士です」と言いました。マシューの発言では「オリビアはならず者であるのは、マシューが騎士である場合に限ります」と言いました。エラは「マシューは騎士です」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァはならず者です  \n(2) オリビアはならず者です  \n(3) マシューはならず者です  \n(4) エラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：オリバー、エイブリー、ゾーイ、そしてセバスチャン。オリバーは「エイブリーはならず者ではない」と言いました。エイブリーは「ゾーイはならず者で、セバスチャンもならず者だ」と言いました。ゾーイは「セバスチャンはならず者ではない」とコメントしました。セバスチャンは「エイブリーは騎士で、エイブリーはならず者だ」とコメントしました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリバーは騎士です  \n(2) エイブリーは騎士です  \n(3) ゾーイはならず者です  \n(4) セバスチャンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：リリー、エイヴァ、ヘンリー、そしてアメリア。リリーは「エイヴァはならず者で、リリーは騎士だ」と言いました。エイヴァは「ヘンリーはならず者である場合、エイヴァは騎士である」と言っているのが聞かれました。ヘンリーは「ヘンリーは騎士であるか、エイヴァはならず者である」とあなたに言いました。アメリアは「ヘンリーはならず者である場合、リリーは騎士である」と主張しました。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーはならず者です  \n(2) エイヴァは騎士です  \n(3) ヘンリーはならず者です  \n(4) アメリアはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：マシュー、ハーパー、リリー、そしてローガン。マシューは「リリーはならず者で、ハーパーは騎士だ」と宣言しました。ハーパーによれば、「リリーはならず者か、リリーは騎士だ」とのことです。リリーは「マシューは騎士で、ローガンは騎士だ」と主張しました。ローガンの言葉では、「ハーパーは騎士で、ハーパーはならず者だ」と言っています。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マシューは騎士です  \n(2) ハーパーは騎士です  \n(3) リリーはならず者です  \n(4) ローガンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：メイソン、リリー、ルーカス、そしてヘンリー。メイソンは「メイソンは騎士で、ルーカスはならず者だ」と言っているのが聞かれました。「もしメイソンがならず者なら、ルーカスはならず者だ」とリリーは宣言しました。ルーカスは「もしヘンリーがならず者なら、ヘンリーは騎士だ」と言っているのが聞かれました。ヘンリーは「メイソンは騎士だ」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) メイソンはならず者です  \n(2) リリーは騎士です  \n(3) ルーカスはならず者です  \n(4) ヘンリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：マイケル、セバスチャン、エマ、そしてオーウェン。マイケルの発言：「エマはならず者である場合に限り、オーウェンはならず者である。」セバスチャンは言いました、「マイケルはならず者だ。」エマは、マイケルが騎士ではないと表現しました。「マイケルはならず者である場合に限り、オーウェンは騎士である」 - オーウェン。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルはならず者です  \n(2) セバスチャンは騎士です  \n(3) エマは騎士です  \n(4) オーウェンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：シャーロット、ミア、ビクトリア、そしてジェイコブ。シャーロットはこう言いました。「ミアは騎士か、ジェイコブはならず者です」。ミアは主張しました。「シャーロットは騎士ではありません」。ビクトリアは「ジェイコブは騎士です」と言いました。ジェイコブによれば、「ジェイコブは騎士で、ミアは騎士です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットは騎士です  \n(2) ミアはならず者です  \n(3) ビクトリアはならず者です  \n(4) ジェイコブはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ルーカス、クロエ、ライリー、そしてデイビッド。ルーカスは「ライリーは騎士であるのは、クロエがならず者である場合に限る」と宣言しました。クロエは「ライリーは騎士で、ルーカスはならず者だ」とコメントしました。「ルーカスはならず者だ」とライリーが言いました。デイビッドの言葉では「ライリーは騎士で、クロエはならず者だ」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスはならず者です  \n(2) クロエは騎士です  \n(3) ライリーは騎士です  \n(4) デイビッドはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ミア、ビクトリア、アメリア、そしてダニエル。ミアは「ビクトリアがならず者である場合に限り、ミアは騎士です」と主張しました。ビクトリアは「ダニエルがならず者であれば、アメリアはならず者です」と言いました。アメリアは「ミアが騎士であれば、ビクトリアは騎士です」と主張しました。「ダニエルは騎士であり、ビクトリアはならず者です」とダニエルは言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアはならず者です  \n(2) ビクトリアはならず者です  \n(3) アメリアは騎士です  \n(4) ダニエルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ベンジャミン、ルーカス、アレクサンダー、そしてダニエル。ベンジャミンが言ったように、「もしルーカスが騎士なら、ダニエルは騎士です」。ルーカスの言葉では、「ダニエルはならず者ではありません」。アレクサンダーの言葉では、「ベンジャミンは騎士で、ルーカスはならず者です」。ダニエルの発言では、「ベンジャミンはならず者ではありません」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンは騎士です  \n(2) ルーカスは騎士です  \n(3) アレクサンダーはならず者です  \n(4) ダニエルは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エイヴァ、リアム、ローガン、そしてアメリア。エイヴァは「リアムはローガンが騎士である限りならず者だ」と言いました。「アメリアは騎士ではない」とリアムは主張しました。「もしリアムが騎士なら、アメリアはならず者だ」とローガンは主張しました。「リアムはエイヴァが騎士である限りならず者だ」とアメリアは言及しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァは騎士です  \n(2) リアムはならず者です  \n(3) ローガンは騎士です  \n(4) アメリアは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ソフィア、ミア、ハーパー、そしてエミリー。ソフィアの言葉では、「ハーパーは騎士で、ミアも騎士です」。ミアは「ハーパーが騎士なら、ハーパーはならず者です」と言いました。ハーパーは「エミリーはミアがならず者である場合に限り騎士です」と述べました。「ハーパーが騎士なら、ミアは騎士です」とエミリーは宣言しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアはならず者です  \n(2) ミアは騎士です  \n(3) ハーパーはならず者です  \n(4) エミリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：マイケル、ジャクソン、エリザベス、そしてダニエル。「エリザベスはならず者だ」とマイケルは主張しました。ジャクソンは、ダニエルがならず者であるのは、マイケルが騎士である場合に限ると言いました。「マイケルが騎士であるのは、ダニエルが騎士である場合に限る」とエリザベスは宣言しました。「ジャクソンはならず者か、マイケルはならず者だ」とダニエルは主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルは騎士です  \n(2) ジャクソンは騎士です  \n(3) エリザベスはならず者です  \n(4) ダニエルはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ライリー、アビゲイル、オリバー、そしてスカーレット。ライリーはスカーレットがならず者であり、ライリーが騎士であると主張しました。アビゲイルは「ライリーは騎士ではない」と言いました。オリバーは「アビゲイルはならず者であり、ライリーはならず者だ」と言いました。「もしオリバーが騎士なら、アビゲイルは騎士だ」とスカーレットは主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ライリーはならず者です  \n(2) アビゲイルは騎士です  \n(3) オリバーはならず者です  \n(4) スカーレットは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ペネロペ、アメリア、エイヴァ、そしてルーカス。ペネロペの発言：「エイヴァは騎士ではない」。アメリアは言いました、「ペネロペはならず者であるか、ルーカスは騎士である」。エイヴァは言いました、「もしアメリアがならず者なら、ペネロペはならず者である」。ルーカスは言いました、「ペネロペはならず者ではない」。さて、誰が騎士で、誰がならず者でしょうか？",
        "solution_text_format": "(1) ペネロペはならず者です  \n(2) アメリアは騎士です  \n(3) エイヴァは騎士です  \n(4) ルーカスはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：サミュエル、ペネロペ、メイソン、そしてデイビッド。サミュエルは「ペネロペはメイソンがならず者である場合に限り騎士である」と言っているのが聞かれました。ペネロペはデイビッドがならず者であり、ペネロペが騎士であると言いました。メイソンは「ペネロペはならず者だ」と主張しました。「メイソンはペネロペが騎士である場合に限りならず者である」とデイビッドが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルは騎士です  \n(2) ペネロペはならず者です  \n(3) メイソンは騎士です  \n(4) デイビッドは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：サミュエル、アレクサンダー、アメリア、そしてリリー。サミュエルは「サミュエルは騎士で、アレクサンダーも騎士です」と述べました。「サミュエルはならず者です」とアレクサンダーが言いました。アメリアは「サミュエルはならず者ではありません」と主張しました。リリーは「もしサミュエルが騎士なら、アメリアも騎士です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルはならず者です  \n(2) アレクサンダーは騎士です  \n(3) アメリアはならず者です  \n(4) リリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ソフィア、アメリア、エリザベス、そしてアビゲイル。ソフィアは「アメリアは騎士です」とコメントしました。アメリアは「ソフィアはならず者で、アメリアは騎士です」と主張しました。エリザベスは「エリザベスは騎士であるか、ソフィアはならず者です」と言いました。アビゲイルは「もしアメリアがならず者なら、エリザベスはならず者です」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアはならず者です  \n(2) アメリアはならず者です  \n(3) エリザベスは騎士です  \n(4) アビゲイルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：セバスチャン、アメリア、ライリー、そしてイザベラ。セバスチャンは、イザベラが騎士であるのはライリーが騎士である場合に限るとあなたに言いました。アメリアの言葉では、「セバスチャンは騎士ではない」と言いました。ライリーは、「もしイザベラが騎士なら、アメリアは騎士だ」と指摘しました。「イザベラは騎士で、セバスチャンはならず者だ」とイザベラは宣言しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) セバスチャンはならず者です  \n(2) アメリアは騎士です  \n(3) ライリーは騎士です  \n(4) イザベラはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：サミュエル、リリー、ハーパー、そしてメイソン。「サミュエルは騎士か、リリーはならず者だ」とサミュエルは宣言しました。リリーは言いました、「もしハーパーがならず者なら、メイソンは騎士です」。ハーパーは言いました、「もしメイソンがならず者なら、サミュエルはならず者です」。メイソンは主張しました：「もしハーパーが騎士なら、サミュエルはならず者です」。さて、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルはならず者です  \n(2) リリーは騎士です  \n(3) ハーパーは騎士です  \n(4) メイソンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：リリー、イーサン、ジャック、そしてエミリー。リリーはこう言いました。「ジャックはならず者ではありません」。イーサンは言いました。「もしリリーがならず者なら、リリーは騎士です」。ジャックによれば、「イーサンはならず者か、リリーは騎士です」。エミリーは「リリーはならず者です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーは騎士です  \n(2) イーサンは騎士です  \n(3) ジャックは騎士です  \n(4) エミリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：オーウェン、ジェームズ、ローガン、そしてミア。オーウェンの言葉では、「ローガンはならず者であるのは、ジェームズが騎士である場合に限る」と言っています。ジェームズは、「もしミアが騎士であれば、ジェームズは騎士である」と述べました。ローガンは、「もしジェームズがならず者であれば、ミアは騎士である」と言いました。ミアは、「オーウェンが騎士であるのは、ローガンがならず者である場合に限る」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンはならず者です  \n(2) ジェームズは騎士です  \n(3) ローガンは騎士です  \n(4) ミアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：アリア、オリバー、マイケル、そしてエイブリー。「オリバーがならず者なら、エイブリーは騎士だ」とアリアは宣言しました。オリバーは「アリアが騎士なら、エイブリーはならず者だ」と言っているのが聞かれました。マイケルの言葉では、「オリバーはならず者か、アリアはならず者だ」と言っています。エイブリーの言葉では、「マイケルが騎士なら、エイブリーは騎士だ」と言っています。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アリアは騎士です  \n(2) オリバーはならず者です  \n(3) マイケルは騎士です  \n(4) エイブリーは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エイデン、シャーロット、ソフィア、そしてセバスチャン。エイデンによれば、「シャーロットはならず者です」。シャーロットの発言では、「ソフィアは騎士である場合に限り、ソフィアはならず者です」。ソフィアは「エイデンは騎士で、セバスチャンも騎士です」と言いました。「シャーロットは騎士で、エイデンも騎士です」とセバスチャンは主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンは騎士です  \n(2) シャーロットはならず者です  \n(3) ソフィアはならず者です  \n(4) セバスチャンはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ヘンリー、ジェームズ、エマ、そしてイザベラ。ヘンリーは「もしヘンリーが騎士なら、ジェームズはならず者だ」と宣言しました。ジェームズは「エマが騎士であるとき、イザベラはならず者である」と述べました。エマは「ジェームズが騎士であるとき、ヘンリーはならず者である」と言いました。イザベラは「ヘンリーは騎士であり、ジェームズはならず者だ」と述べました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ヘンリーは騎士です  \n(2) ジェームズはならず者です  \n(3) エマは騎士です  \n(4) イザベラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会いました：ノア、ルーク、サミュエル、そしてビクトリア。ノアは「ビクトリアが騎士なら、ルークは騎士だ」と言いました。ルークは「サミュエルは騎士か、ノアは騎士だ」と述べました。「ビクトリアは騎士か、ビクトリアはならず者だ」とサミュエルが言いました。ビクトリアは「サミュエルがならず者なら、ルークはならず者だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアは騎士です  \n(2) ルークは騎士です  \n(3) サミュエルは騎士です  \n(4) ビクトリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：リアム、エマ、ルーク、そしてオリバー。「リアムは騎士か、エマは騎士です」 - リアム。エマの言葉では、「リアムはならず者か、リアムは騎士です」。ルークの言葉では、「リアムは騎士である場合、リアムはならず者です」。オリバーは、リアムが騎士であり、エマがならず者であると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムは騎士です  \n(2) エマは騎士です  \n(3) ルークはならず者です  \n(4) オリバーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ノア、ダニエル、デイビッド、そしてペネロペ。ノアは「デイビッドは騎士で、ダニエルはならず者だ」と宣言しました。ダニエルは「ダニエルは騎士で、デイビッドも騎士だ」と表現しました。デイビッドは「ダニエルは騎士ではない」と言っているのが聞かれました。ペネロペは「もしダニエルがならず者なら、ノアは騎士だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアは騎士です  \n(2) ダニエルはならず者です  \n(3) デイビッドは騎士です  \n(4) ペネロペは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：オリビア、ダニエル、ペネロペ、そしてセバスチャン。オリビアは「もしセバスチャンが騎士なら、ペネロペはならず者です」と述べました。ダニエルは「セバスチャンはならず者ではありません」と言いました。ペネロペの発言は「もしセバスチャンがならず者なら、ダニエルはならず者です」となります。セバスチャンは「もしオリビアが騎士なら、ダニエルはならず者です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアはならず者です  \n(2) ダニエルは騎士です  \n(3) ペネロペは騎士です  \n(4) セバスチャンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エラ、ゾーイ、ダニエル、そしてエイヴァ。エラは言いました、「もしゾーイがならず者なら、エイヴァはならず者です。」ゾーイは主張しました：「エイヴァはならず者で、ダニエルはならず者です。」ダニエルは主張しました：「もしエイヴァが騎士なら、ゾーイはならず者です。」エイヴァは指摘しました、「ダニエルはならず者か、ゾーイはならず者です。」では、誰が騎士で誰がならず者ですか？",
        "solution_text_format": "(1) エラはならず者です  \n(2) ゾーイはならず者です  \n(3) ダニエルは騎士です  \n(4) エイヴァは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：イヴリン、リアム、ノア、そしてマイケル。イヴリンはこう言いました。「ノアはならず者か、リアムは騎士です」。リアムは主張しました。「ノアはならず者ではありません」。ノアは述べました。「もしマイケルがならず者なら、ノアは騎士です」。マイケルはコメントしました。「ノアはならず者か、イヴリンは騎士です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンは騎士です  \n(2) リアムは騎士です  \n(3) ノアは騎士です  \n(4) マイケルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ルーク、エマ、オリバー、そしてイザベラ。ルークの発言：「エマはならず者ではない」。エマは言いました、「もしルークがならず者なら、オリバーはならず者です」。オリバーは言及しました、「もしイザベラが騎士なら、イザベラはならず者です」。イザベラは宣言しました、「エマは騎士か、オリバーは騎士です」。では、誰が騎士で誰がならず者ですか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) エマは騎士です  \n(3) オリバーはならず者です  \n(4) イザベラは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：アレクサンダー、ルーク、エイヴァ、そしてウィリアム。アレクサンダーはルークがならず者ではないと述べました。ルークはあなたにエイヴァがならず者であり、ウィリアムもならず者であると言いました。エイヴァはウィリアムがならず者であると述べました。ウィリアムは「もしアレクサンダーが騎士なら、ルークはならず者である」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アレクサンダーはならず者です  \n(2) ルークはならず者です  \n(3) エイヴァはならず者です  \n(4) ウィリアムは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：デイビッド、ソフィア、オーロラ、そしてジャクソン。デイビッドの言葉では、「オーロラは騎士か、デイビッドは騎士です」。ソフィアは、「もしソフィアが騎士なら、ジャクソンは騎士です」と述べました。オーロラは、「デイビッドは騎士ではありません」と言いました。ジャクソンは、「ソフィアはならず者ではありません」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドは騎士です  \n(2) ソフィアは騎士です  \n(3) オーロラはならず者です  \n(4) ジャクソンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ルーカス、セバスチャン、イーサン、そしてライリー。ルーカスはこう言いました。「セバスチャンはならず者であるのは、イーサンが騎士である場合に限る。」セバスチャンはルーカスが騎士であると表現しました。イーサンは「ルーカスが騎士であるのは、ライリーが騎士である場合に限る」と言っているのが聞かれました。ライリーはあなたに、セバスチャンが騎士であるか、イーサンがならず者であると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスはならず者です  \n(2) セバスチャンはならず者です  \n(3) イーサンはならず者です  \n(4) ライリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エラ、セバスチャン、ルーカス、そしてエイヴァ。エラは「エイヴァは騎士だ」と言っているのが聞かれました。セバスチャンは「もしエイヴァが騎士なら、エイヴァはならず者だ」と言っているのが聞かれました。ルーカスは「もしエラが騎士なら、エイヴァはならず者だ」と言っているのが聞かれました。エイヴァは「ルーカスはならず者か、ルーカスは騎士だ」と述べました。それでは、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) エラは騎士です  \n(2) セバスチャンはならず者です  \n(3) ルーカスはならず者です  \n(4) エイヴァは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ウィリアム、エラ、ルーカス、そしてジェイコブ。ウィリアムは「もしジェイコブがならず者なら、エラはならず者だ」と言いました。エラは「ウィリアムはならず者か、ルーカスはならず者だ」とあなたに言いました。ルーカスは「もしジェイコブが騎士なら、ウィリアムはならず者だ」と表現しました。ジェイコブは「エラは騎士で、ウィリアムはならず者だ」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムは騎士です  \n(2) エラはならず者です  \n(3) ルーカスは騎士です  \n(4) ジェイコブはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ライリー、アメリア、ウィリアム、そしてダニエル。「もしダニエルがならず者なら、ウィリアムはならず者だ」とライリーは宣言しました。「ダニエルはウィリアムが騎士である場合に限りならず者です」とアメリアが言いました。ウィリアムは「ダニエルはならず者ではない」と言いました。「ライリーは騎士ではない」とダニエルが言及しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ライリーは騎士です  \n(2) アメリアはならず者です  \n(3) ウィリアムはならず者です  \n(4) ダニエルはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：オーウェン、イザベラ、ノア、そしてジャクソン。オーウェンは「イザベラは騎士だ」と主張しました。イザベラは「もしノアが騎士なら、ジャクソンはならず者だ」と述べました。ノアはジャクソンがならず者であり、ノアが騎士であると言いました。ジャクソンの発言は「オーウェンは騎士か、ノアはならず者だ」となります。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンは騎士です  \n(2) イザベラは騎士です  \n(3) ノアはならず者です  \n(4) ジャクソンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ライリー、ペネロペ、イザベラ、そしてアレクサンダー。ライリーはアレクサンダーが騎士であり、ペネロペも騎士であると言いました。ペネロペはイザベラがならず者であるのは、イザベラが騎士である場合に限ると言いました。イザベラは「ライリーは騎士であるか、アレクサンダーは騎士である」と言いました。「ライリーは騎士であり、ライリーはならず者である」とアレクサンダーは言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ライリーはならず者です  \n(2) ペネロペはならず者です  \n(3) イザベラはならず者です  \n(4) アレクサンダーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：クロエ、オーロラ、ジャック、そしてオリバー。クロエが言ったように、「オリバーは騎士であるのは、ジャックがならず者である場合に限る」。オーロラは「もしオリバーが騎士なら、クロエは騎士である」と言っているのが聞かれました。ジャックはクロエが騎士であると言いました。オリバーは「クロエはならず者であるのは、オーロラが騎士である場合に限る」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) クロエは騎士です  \n(2) オーロラは騎士です  \n(3) ジャックは騎士です  \n(4) オリバーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：オリビア、アリア、スカーレット、そしてベンジャミン。オリビアは「スカーレットはならず者だ」と言っているのが聞かれました。アリアは「もしスカーレットが騎士なら、ベンジャミンも騎士だ」とコメントしました。スカーレットは「オリビアは騎士で、ベンジャミンも騎士だ」と言いました。「スカーレットはならず者ではない」とベンジャミンは主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアは騎士です  \n(2) アリアは騎士です  \n(3) スカーレットはならず者です  \n(4) ベンジャミンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：アメリア、オリビア、ヘンリー、そしてオーロラ。アメリアは「オーロラは騎士か、ヘンリーは騎士です」とコメントしました。オリビアは「ヘンリーはならず者です」と言いました。「オリビアはならず者か、オリビアは騎士です」とヘンリーは主張しました。「アメリアはならず者です」とオーロラが言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアは騎士です  \n(2) オリビアはならず者です  \n(3) ヘンリーは騎士です  \n(4) オーロラはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ウィリアム、イーサン、リリー、そしてアメリア。ウィリアムは「リリーは騎士だ」と主張しました。イーサンは「リリーはならず者か、アメリアはならず者だ」と述べました。リリーは「イーサンはアメリアがならず者である場合に限り、ならず者だ」と言いました。「イーサンは騎士である場合に限り、イーサンはならず者だ」とアメリアは言及しました。さて、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムはならず者です  \n(2) イーサンは騎士です  \n(3) リリーはならず者です  \n(4) アメリアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：イヴリン、メイソン、リアム、そしてペネロペ。「リアムはならず者ではない」とイヴリンは宣言しました。メイソンによれば、「リアムは騎士であるか、リアムはならず者である」。リアムはこう言いました。「メイソンはならず者で、イヴリンは騎士だ」。ペネロペの言葉では、「ペネロペは騎士で、イヴリンは騎士だ」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンはならず者です  \n(2) メイソンは騎士です  \n(3) リアムはならず者です  \n(4) ペネロペはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ノア、アレクサンダー、ペネロペ、そしてクロエ。ノアは、ペネロペが騎士であり、クロエがならず者であると表現しました。アレクサンダーは、「もしペネロペが騎士なら、クロエも騎士である」と表現しました。ペネロペによれば、「ペネロペは騎士であり、クロエはならず者です」。クロエは、「もしノアがならず者なら、アレクサンダーは騎士です」と宣言しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアはならず者です  \n(2) アレクサンダーは騎士です  \n(3) ペネロペはならず者です  \n(4) クロエは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：シャーロット、アリア、ウィリアム、そしてライリー。「アリアは騎士で、ライリーはならず者だ」とシャーロットが言いました。アリアは「ライリーは騎士か、ライリーはならず者だ」と表現しました。ウィリアムは「シャーロットはならず者であるのは、ライリーが騎士である場合に限る」と主張しました。ライリーの発言は「もしアリアが騎士なら、ウィリアムは騎士だ」です。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットはならず者です  \n(2) アリアは騎士です  \n(3) ウィリアムは騎士です  \n(4) ライリーは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ジャクソン、セバスチャン、ダニエル、そしてリリー。ジャクソンは「リリーがならず者なら、ジャクソンは騎士だ」と言っているのが聞かれました。セバスチャンは「ジャクソンは騎士であるのは、ダニエルがならず者である場合に限る」と言っているのが聞かれました。「ダニエルが騎士であるのは、セバスチャンがならず者である場合に限る」とダニエルが言いました。リリーは「ジャクソンは騎士ではない」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンは騎士です  \n(2) セバスチャンはならず者です  \n(3) ダニエルは騎士です  \n(4) リリーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ペネロペ、イーサン、エイデン、そしてイヴリン。ペネロペはこう主張しました：「エイデンはならず者か、イーサンはならず者です」。イーサンの発言では、「もしエイデンが騎士なら、イヴリンは騎士です」。エイデンは、もしエイデンが騎士なら、イヴリンはならず者だと言いました。イヴリンは、「イーサンは騎士である限り、イーサンはならず者です」と述べました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペは騎士です  \n(2) エイデンはならず者です  \n(3) エイデンは騎士です  \n(4) イヴリンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：オリビア、マイケル、エリザベス、そしてジャクソン。オリビアは「もしマイケルがならず者なら、ジャクソンは騎士だ」と言っているのが聞かれました。マイケルは「オリビアはジャクソンがならず者である限り、騎士だ」と言いました。「マイケルは騎士だ」とエリザベスが言いました。「オリビアは騎士ではない」とジャクソンが言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアは騎士です  \n(2) マイケルは騎士です  \n(3) エリザベスは騎士です  \n(4) ジャクソンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：クロエ、ゾーイ、デイビッド、そしてシャーロット。「ゾーイはならず者であるのは、シャーロットがならず者である場合に限る」とクロエが言いました。「クロエは騎士ではない」とゾーイが宣言しました。デイビッドによれば、「シャーロットはならず者ではない」とのことです。シャーロットは「ゾーイはならず者だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) クロエはならず者です  \n(2) ゾーイは騎士です  \n(3) デイビッドはならず者です  \n(4) シャーロットはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ローガン、リアム、シャーロット、そしてハーパー。ローガンは「ローガンは騎士か、ハーパーは騎士だ」と述べました。リアムによれば「シャーロットはならず者だ」とのことです。シャーロットの発言は「ローガンは騎士だ」です。ハーパーは「リアムは騎士だ」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンは騎士です  \n(2) リアムはならず者です  \n(3) シャーロットは騎士です  \n(4) ハーパーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ペネロペ、ルーク、ノア、そしてオーロラ。ペネロペは「ルークはならず者か、オーロラは騎士です」と述べました。「ノアは騎士か、ノアはならず者です」とルークが言いました。ノアは「ルークはならず者か、オーロラはならず者です」と言いました。「オーロラはノアがならず者である場合に限り騎士です」とオーロラが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペは騎士です  \n(2) ルークは騎士です  \n(3) ノアはならず者です  \n(4) オーロラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エリザベス、ベンジャミン、エイデン、そしてエマ。エリザベスの言葉では、「エマはならず者で、エイデンは騎士です」。ベンジャミンはこう言いました、「エリザベスはエマが騎士である場合に限り騎士です」。エイデンは、「エマはならず者ではありません」と述べました。エマの発言では、「エリザベスはならず者ではありません」と言っています。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスはならず者です  \n(2) ベンジャミンは騎士です  \n(3) エイデンはならず者です  \n(4) エマはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：クロエ、ビクトリア、ダニエル、そしてベンジャミン。クロエは「ビクトリアは騎士です」と言いました。ビクトリアは「ダニエルはならず者で、ビクトリアは騎士です」と述べました。ダニエルは「クロエはビクトリアがならず者である場合に限り騎士です」と言いました。ベンジャミンは「もしベンジャミンが騎士なら、ビクトリアは騎士です」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) クロエは騎士です  \n(2) ビクトリアは騎士です  \n(3) ダニエルはならず者です  \n(4) ベンジャミンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ウィリアム、ソフィア、オーロラ、そしてイーサン。ウィリアムの言葉では、「オーロラはイーサンがならず者である場合に限り騎士である」。ソフィアは宣言しました、「ウィリアムが騎士ならば、ウィリアムはならず者である」。オーロラは、「ウィリアムはならず者ではない」と指摘しました。イーサンは、「オーロラは騎士ではない」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムは騎士です  \n(2) ソフィアはならず者です  \n(3) オーロラは騎士です  \n(4) イーサンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：オーロラ、ローガン、シャーロット、そしてイヴリン。オーロラは「ローガンはならず者で、シャーロットは騎士です」と主張しました。ローガンは「オーロラはならず者で、イヴリンはならず者です」と言っているのが聞かれました。シャーロットは「もしシャーロットが騎士なら、イヴリンも騎士です」と述べました。イヴリンは「オーロラはならず者ではありません」とコメントしました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーロラは騎士です  \n(2) ローガンはならず者です  \n(3) シャーロットは騎士です  \n(4) イヴリンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会いました：マシュー、ゾーイ、ウィリアム、そしてジョセフ。マシューは、ジョセフは騎士ではないと言いました。ゾーイは、マシューが騎士である場合に限り、マシューはならず者であると言いました。「マシューはジョセフがならず者である場合に限り、ならず者である」とウィリアムが言いました。ジョセフの言葉では、「ゾーイはならず者ではない」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マシューは騎士です  \n(2) ゾーイはならず者です  \n(3) ウィリアムはならず者です  \n(4) ジョセフはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：アメリア、ルーカス、メイソン、そしてソフィア。アメリアは「ソフィアはならず者であるか、メイソンは騎士である」と言いました。ルーカスは「もしアメリアがならず者なら、ルーカスは騎士だ」と言いました。「もしソフィアがならず者なら、ソフィアは騎士だ」とメイソンが言いました。ソフィアは「ルーカスはならず者ではない」と主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアは騎士です  \n(2) ルーカスは騎士です  \n(3) メイソンは騎士です  \n(4) ソフィアは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：サミュエル、ジェームズ、ルーカス、そしてソフィア。サミュエルは「ルーカスはならず者で、ソフィアは騎士だ」と言いました。「ジェームズは騎士で、ソフィアはならず者だ」とジェームズが言いました。ルーカスは「もしサミュエルがならず者なら、ジェームズはならず者だ」と言いました。ソフィアは「もしルーカスがならず者なら、ジェームズは騎士だ」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルはならず者です  \n(2) ジェームズはならず者です  \n(3) ルーカスは騎士です  \n(4) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：アメリア、イザベラ、ダニエル、そしてデイビッド。アメリアはこう言いました。「イザベラは騎士である場合に限り、アメリアは騎士です。」イザベラはこう述べました。「アメリアは騎士である場合に限り、デイビッドはならず者です。」ダニエルはこう主張しました。「デイビッドはならず者である場合に限り、ダニエルは騎士です。」デイビッドはこう言っているのが聞かれました。「ダニエルはならず者である場合に限り、イザベラはならず者です。」では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアは騎士です  \n(2) イザベラは騎士です  \n(3) ダニエルはならず者です  \n(4) デイビッドはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ジャック、ルーカス、オーロラ、そしてエイブリー。「ジャックは騎士であり、オーロラも騎士だ」とジャックは主張しました。ルーカスの言葉では、「ジャックはならず者ではない」。オーロラは「もしジャックが騎士なら、ジャックはならず者だ」と主張しました。エイブリーは「ジャックはオーロラがならず者である場合に限り、ならず者だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャックはならず者です  \n(2) ルーカスはならず者です  \n(3) オーロラは騎士です  \n(4) エイブリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ジャック、エリザベス、エラ、そしてマイケル。ジャックは「マイケルは騎士であるのは、エリザベスがならず者である場合に限る」と述べました。エリザベスの言葉では、「エラは騎士であるか、エラはならず者である」と言いました。エラは「ジャックはならず者であるか、エリザベスはならず者である」と述べました。マイケルの言葉では、「もしエラが騎士であれば、マイケルは騎士である」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャックはならず者です  \n(2) エリザベスは騎士です  \n(3) エラは騎士です  \n(4) マイケルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エイヴァ、ソフィア、オリバー、そしてメイソン。「ソフィアはならず者だ」とエイヴァは主張しました。ソフィアは「メイソンはならず者ではない」とコメントしました。オリバーは「エイヴァは騎士か、メイソンはならず者だ」と指摘しました。「もしメイソンが騎士なら、ソフィアは騎士だ」とメイソンが言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァはならず者です  \n(2) ソフィアは騎士です  \n(3) オリバーはならず者です  \n(4) メイソンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：オリビア、ジャック、リリー、そしてベンジャミン。オリビアはリリーが騎士だと言いました。「オリビアはならず者だ」とジャックが言いました。リリーは「ジャックはならず者で、ベンジャミンはならず者だ」と述べました。ベンジャミンは「リリーはならず者ではない」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアはならず者です  \n(2) ジャックは騎士です  \n(3) リリーはならず者です  \n(4) ベンジャミンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：クロエ、ゾーイ、ジャック、そしてソフィア。クロエは「ジャックはならず者だ」と言いました。ゾーイは「ジャックは騎士だ」と指摘しました。ジャックはゾーイがならず者で、クロエもならず者だと表現しました。ソフィアはクロエが騎士だと言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) クロエは騎士です  \n(2) ゾーイはならず者です  \n(3) ジャックはならず者です  \n(4) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エラ、アレクサンダー、エマ、そしてリリー。エラは「エマはならず者で、エラは騎士です」とコメントしました。アレクサンダーは「エマは騎士で、リリーは騎士です」と言っているのが聞かれました。エマは「エラはならず者ではありません」と述べました。「エマは騎士で、アレクサンダーは騎士です」とリリーが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラはならず者です  \n(2) アレクサンダーはならず者です  \n(3) エマはならず者です  \n(4) リリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エリザベス、イーサン、アビゲイル、そしてリリー。エリザベスは「もしイーサンが騎士なら、アビゲイルは騎士です」と言っているのが聞かれました。イーサンは「リリーはならず者か、エリザベスはならず者です」と述べました。アビゲイルは「エリザベスは騎士である場合、イーサンも騎士です」と言いました。「イーサンはならず者である場合、リリーは騎士です」とリリーが言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスは騎士です  \n(2) イーサンはならず者です  \n(3) アビゲイルはならず者です  \n(4) リリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：アリア、アメリア、オーロラ、そしてエイヴァ。アリアは「アメリアはならず者であるのはオーロラがならず者である場合に限る」とコメントしました。「オーロラはならず者であるか、オーロラは騎士である」とアメリアは主張しました。オーロラによれば、「エイヴァはならず者です」。 「エイヴァは騎士であるか、オーロラは騎士である」とエイヴァが言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アリアはならず者です  \n(2) アメリアは騎士です  \n(3) オーロラはならず者です  \n(4) エイヴァは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エリザベス、ハーパー、ウィリアム、そしてベンジャミン。エリザベスの言葉では、「ウィリアムは騎士で、ハーパーは騎士です」。ハーパーは「ベンジャミンは騎士ではありません」と述べました。ウィリアムは「ベンジャミンは騎士です」と言いました。「ハーパーは騎士で、ベンジャミンは騎士です」とベンジャミンが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスはならず者です  \n(2) ハーパーは騎士です  \n(3) ウィリアムはならず者です  \n(4) ベンジャミンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：オリバー、ジョセフ、クロエ、そしてローガン。オリバーは、ローガンが騎士ではないと表現しました。ジョセフは、「ローガンは騎士であるか、オリバーは騎士である」と述べました。クロエは、「もしオリバーがならず者なら、ローガンもならず者である」と述べました。「オリバーは騎士で、クロエはならず者だ」とローガンは宣言しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリバーは騎士です  \n(2) ジョセフは騎士です  \n(3) クロエは騎士です  \n(4) ローガンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ジャクソン、エリザベス、イヴリン、そしてメイソン。ジャクソンによれば、「イヴリンはならず者です」。エリザベスの言葉では、「メイソンはイヴリンが騎士である場合に限り騎士です」。イヴリンは「もしジャクソンがならず者なら、メイソンは騎士です」と言いました。メイソンは「もしジャクソンがならず者なら、エリザベスは騎士です」とあなたに言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンはならず者です  \n(2) エリザベスは騎士です  \n(3) イヴリンは騎士です  \n(4) メイソンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ヘンリー、ローガン、ソフィア、そしてグレース。ヘンリーは「ローガンは騎士であるのはソフィアが騎士である場合に限る」と言いました。ローガンは「グレースは騎士であるのはソフィアが騎士である場合に限る」と言いました。ソフィアは「ヘンリーは騎士であるのはグレースがならず者である場合に限る」と言いました。グレースは「ヘンリーはならず者であるか、グレースは騎士である」とコメントしました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ヘンリーは騎士です  \n(2) ローガンはならず者です  \n(3) ソフィアはならず者です  \n(4) グレースは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：クロエ、ミア、エイブリー、そしてジョセフ。クロエは「ミアはならず者ではない」と言っているのが聞かれました。「ミアは騎士であるか、クロエはならず者である」 - ミア。エイブリーは、エイブリーが騎士であるか、ミアが騎士であるとあなたに言いました。「ミアは騎士であるのは、エイブリーがならず者である場合に限る」とジョセフは主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) クロエは騎士です  \n(2) ミアは騎士です  \n(3) エイブリーは騎士です  \n(4) ジョセフはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ルーク、アメリア、ヘンリー、そしてリリー。ルークは「ヘンリーはならず者であるのは、リリーがならず者である場合に限る」と述べました。「リリーは騎士であるか、ヘンリーは騎士である」とアメリアは宣言しました。「アメリアはならず者であるか、ルークは騎士である」とヘンリーは宣言しました。「ルークは騎士であるのは、アメリアが騎士である場合に限る」とリリーは主張しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) アメリアは騎士です  \n(3) ヘンリーは騎士です  \n(4) リリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エイデン、マシュー、エラ、そしてライリー。エイデンはエラがならず者だと言いました。マシューは「ライリーはならず者ではない」と言いました。「エイデンはならず者であるのは、ライリーが騎士である場合に限る」 - エラ。ライリーはエイデンが騎士であり、ライリーも騎士であると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンは騎士です  \n(2) マシューは騎士です  \n(3) エラはならず者です  \n(4) ライリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ルーク、ハーパー、ペネロペ、そしてオーロラ。ルークの言葉では、「ペネロペは騎士である場合に限り、ペネロペはならず者である」。ハーパーは、「オーロラはならず者であり、ハーパーは騎士である」と言いました。ペネロペは、ルークがならず者であると表現しました。オーロラは、「ハーパーは騎士である場合に限り、オーロラは騎士である」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークはならず者です  \n(2) ハーパーは騎士です  \n(3) ペネロペは騎士です  \n(4) オーロラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：マイケル、セバスチャン、ベンジャミン、そしてイザベラ。マイケルは「イザベラはならず者で、セバスチャンもならず者だ」と言いました。セバスチャンは「セバスチャンは騎士だ」と述べました。ベンジャミンは「もしイザベラが騎士なら、イザベラはならず者だ」と主張しました。イザベラは「セバスチャンはならず者で、マイケルは騎士だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルはならず者です  \n(2) セバスチャンは騎士です  \n(3) ベンジャミンは騎士です  \n(4) イザベラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ノア、ジェイコブ、アリア、そしてイーサン。「イーサンは騎士か、イーサンはならず者だ」とノアは宣言しました。ジェイコブは「アリアが騎士なら、イーサンはならず者だ」とコメントしました。アリアは「イーサンがならず者なら、ノアはならず者だ」とコメントしました。「ノアは騎士ではない」とイーサンは主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアは騎士です  \n(2) ジェイコブは騎士です  \n(3) アリアはならず者です  \n(4) イーサンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会いました：ローガン、スカーレット、イーサン、そしてグレース。ローガンは「もしグレースがならず者なら、スカーレットはならず者だ」と言いました。スカーレットは「もしローガンがならず者なら、グレースはならず者だ」と言いました。イーサンは「ローガンはならず者だ」と言いました。グレースはスカーレットが騎士だと言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンは騎士です  \n(2) スカーレットは騎士です  \n(3) イーサンはならず者です  \n(4) グレースは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エマ、アメリア、イーサン、そしてイザベラ。エマは「イザベラは騎士ではない」と述べました。アメリアは「イザベラはならず者だ」と言っているのが聞かれました。「イザベラはならず者ではない」とイーサンは主張しました。「エマは騎士であるのはイーサンが騎士である場合に限る」とイザベラは宣言しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エマは騎士です  \n(2) アメリアは騎士です  \n(3) イーサンはならず者です  \n(4) イザベラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ペネロペ、オーウェン、ベンジャミン、そしてジャクソン。ペネロペは「オーウェンはならず者か、ジャクソンはならず者です」とコメントしました。オーウェンによれば、「ペネロペは騎士か、ペネロペはならず者です」。ベンジャミンは「もしベンジャミンが騎士なら、オーウェンは騎士です」と宣言しました。ジャクソンは「オーウェンは騎士か、ベンジャミンは騎士です」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペはならず者です  \n(2) オーウェンは騎士です  \n(3) ベンジャミンは騎士です  \n(4) ジャクソンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エリザベス、ゾーイ、スカーレット、そしてベンジャミン。エリザベスは「スカーレットはならず者か、スカーレットは騎士です」と言いました。「ベンジャミンは騎士ではありません」とゾーイが言いました。スカーレットは「ゾーイはならず者である場合、エリザベスは騎士です」と言いました。ベンジャミンは「エリザベスは騎士か、エリザベスはならず者です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスは騎士です  \n(2) ゾーイはならず者です  \n(3) スカーレットは騎士です  \n(4) ベンジャミンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：シャーロット、グレース、アリア、そしてソフィア。「グレースは騎士である場合に限り、グレースはならず者です」とシャーロットが宣言しました。「アリアは騎士で、シャーロットはならず者です」とグレースが言いました。「もしアリアが騎士なら、グレースは騎士です」とアリアが主張しました。「シャーロットは騎士ではありません」とソフィアが言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットはならず者です  \n(2) グレースは騎士です  \n(3) アリアは騎士です  \n(4) ソフィアは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：アメリア、エイデン、ジャック、そしてミア。アメリアはジャックがならず者で、エイデンが騎士だと述べました。「アメリアは騎士だ」 - エイデン。ジャックは、もしアメリアがならず者ならエイデンもならず者だと言いました。ミアはこう言いました。「アメリアは騎士である場合、アメリアはならず者である場合に限る」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアはならず者です  \n(2) エイデンはならず者です  \n(3) ジャックは騎士です  \n(4) ミアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：マシュー、リアム、ローガン、そしてエラ。「ローガンはならず者であるのは、リアムが騎士である場合に限る」とマシューは宣言しました。リアムは「マシューはならず者であるか、エラは騎士である」と言っているのが聞かれました。ローガンは「もしマシューがならず者なら、リアムは騎士である」と主張しました。「リアムはならず者です」とエラは言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マシューはならず者です  \n(2) リアムは騎士です  \n(3) ローガンは騎士です  \n(4) エラはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ソフィア、リリー、ダニエル、そしてビクトリア。ソフィアによれば、「リリーはビクトリアがならず者である場合に限り騎士です」。リリーは「ソフィアはならず者であるか、ダニエルはならず者です」と宣言しました。ダニエルは「もしダニエルが騎士であれば、ソフィアは騎士です」と述べました。ビクトリアは「ソフィアは騎士であるか、ダニエルは騎士です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) リリーはならず者です  \n(3) ダニエルは騎士です  \n(4) ビクトリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ペネロペ、ジェームズ、ジェイコブ、そしてソフィア。ペネロペはこう言いました。「ソフィアはならず者です」。ジェームズは「ジェイコブはソフィアが騎士である限りならず者です」と言っているのが聞かれました。ジェイコブによれば、「もしジェームズがならず者なら、ジェームズは騎士です」。ソフィアの発言は「ジェイコブは騎士です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペは騎士です  \n(2) ジェームズはならず者です  \n(3) ジェイコブはならず者です  \n(4) ソフィアはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エイヴァ、ダニエル、ジャック、そしてウィリアム。「もしエイヴァが騎士なら、ダニエルは騎士です」とエイヴァが言いました。ダニエルは「もしジャックが騎士なら、エイヴァは騎士です」と表現しました。ジャックは「もしダニエルがならず者なら、ダニエルは騎士です」と表現しました。ウィリアムは「ジャックはならず者ではありません」と表現しました。さて、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァは騎士です  \n(2) ダニエルは騎士です  \n(3) ジャックは騎士です  \n(4) ウィリアムは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ルーク、オーウェン、アレクサンダー、そしてセバスチャン。ルークは「オーウェンがならず者なら、アレクサンダーは騎士だ」と言いました。「ルークはならず者で、アレクサンダーは騎士だ」とオーウェンが言いました。「もしセバスチャンがならず者なら、ルークは騎士だ」とアレクサンダーが宣言しました。「オーウェンはならず者であるのは、ルークがならず者である場合に限る」とセバスチャンが主張しました。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) オーウェンはならず者です  \n(3) アレクサンダーは騎士です  \n(4) セバスチャンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：イヴリン、ジャクソン、エイブリー、そしてアレクサンダー。イヴリンの発言では、「アレクサンダーは騎士であるのはジャクソンが騎士である場合に限る」と言いました。ジャクソンは、「エイブリーはならず者であるのはイヴリンがならず者である場合に限る」と述べました。エイブリーは「ジャクソンは騎士だ」と言っているのが聞かれました。アレクサンダーは、ジャクソンは騎士であり、エイブリーはならず者だと言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンは騎士です  \n(2) ジャクソンはならず者です  \n(3) エイブリーはならず者です  \n(4) アレクサンダーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エイデン、アメリア、ソフィア、そしてライリー。「アメリアは騎士か、ライリーはならず者だ」とエイデンは宣言しました。「エイデンはならず者か、エイデンは騎士だ」とアメリアが言いました。ソフィアは、ライリーがならず者であり、ライリーが騎士であると言いました。ライリーは「エイデンは騎士ではない」と指摘しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンは騎士です  \n(2) アメリアは騎士です  \n(3) ソフィアはならず者です  \n(4) ライリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：オリビア、イヴリン、ダニエル、そしてイザベラ。オリビアは「イヴリンは騎士か、イザベラは騎士です」と主張しました。「ダニエルはならず者です」とイヴリンは言いました。ダニエルによれば、「イヴリンは騎士である場合に限り、イヴリンはならず者です」とのことです。イザベラは、オリビアは騎士かイヴリンは騎士だと表現しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアは騎士です  \n(2) イヴリンは騎士です  \n(3) ダニエルはならず者です  \n(4) イザベラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：メイソン、ライリー、ダニエル、そしてヘンリー。メイソンの言葉では、「メイソンは騎士であり、ダニエルは騎士です」と言っています。ライリーは、「ヘンリーはならず者であるか、ダニエルは騎士です」とコメントしました。ダニエルは、ヘンリーがならず者であるのは、メイソンがならず者である場合に限ると言いました。ヘンリーの発言では、「ダニエルはならず者ではありません」と言っています。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) メイソンは騎士です  \n(2) ライリーは騎士です  \n(3) ダニエルは騎士です  \n(4) ヘンリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ライリー、エイヴァ、オリビア、そしてペネロペ。「オリビアは騎士であるのは、ペネロペがならず者である場合に限る」とライリーが言いました。エイヴァは、ライリーが騎士であるのはペネロペがならず者である場合に限ると表現しました。オリビアによれば、「ペネロペは騎士です」。ペネロペは、ライリーがならず者であるか、エイヴァがならず者であると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ライリーはならず者です  \n(2) エイヴァは騎士です  \n(3) オリビアは騎士です  \n(4) ペネロペは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：マイケル、オーロラ、メイソン、そしてペネロペ。マイケルは「メイソンが騎士である場合に限り、メイソンはならず者である」と述べました。オーロラは「ペネロペはならず者で、マイケルは騎士です」と言いました。メイソンは「ペネロペはならず者です」と主張しました。ペネロペは「マイケルはならず者で、オーロラは騎士です」とコメントしました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルはならず者です  \n(2) オーロラはならず者です  \n(3) メイソンは騎士です  \n(4) ペネロペはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：セバスチャン、イーサン、ペネロペ、そしてエイブリー。セバスチャンは「エイブリーはならず者ではない」と言いました。「セバスチャンはならず者か、ペネロペはならず者だ」とイーサンは主張しました。ペネロペは「セバスチャンはならず者で、イーサンは騎士だ」と言いました。エイブリーは「ペネロペは騎士で、エイブリーは騎士だ」と表現しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) セバスチャンはならず者です  \n(2) エイサンは騎士です  \n(3) ペネロペは騎士です  \n(4) エイブリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エミリー、ルーク、スカーレット、そしてミア。「スカーレットは騎士ではない」とエミリーが言いました。ルークは「もしエミリーがならず者なら、ミアは騎士だ」とコメントしました。スカーレットは「エミリーはならず者で、ミアは騎士だ」と述べました。ミアは「エミリーは騎士で、ルークは騎士だ」と主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーは騎士です  \n(2) ルークは騎士です  \n(3) スカーレットはならず者です  \n(4) ミアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ジェイコブ、クロエ、エイブリー、そしてスカーレット。ジェイコブは「もしスカーレットが騎士なら、クロエはならず者だ」と言いました。クロエは「もしジェイコブが騎士なら、エイブリーも騎士だ」と宣言しました。エイブリーは「ジェイコブは騎士ではない」とコメントしました。スカーレットは「ジェイコブは騎士だ」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブは騎士です  \n(2) クロエはならず者です  \n(3) エイブリーはならず者です  \n(4) スカーレットは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ローガン、オーロラ、ハーパー、そしてジャクソン。「オーロラはならず者で、ジャクソンはならず者だ」とローガンが言いました。「ジャクソンはならず者ではない」とオーロラが宣言しました。ハーパーは「ハーパーは騎士だ」と述べました。「もしローガンがならず者なら、ハーパーはならず者だ」とジャクソンが言いました。では、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) ローガンはならず者です  \n(2) オーロラは騎士です  \n(3) ハーパーはならず者です  \n(4) ジャクソンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ハーパー、ベンジャミン、デイビッド、そしてエイヴァ。「ベンジャミンはならず者だ」とハーパーは宣言しました。ベンジャミンはデイビッドが騎士だと主張しました。「ハーパーはならず者で、エイヴァは騎士だ」とデイビッドは言いました。エイヴァの発言では、「ベンジャミンはならず者か、デイビッドはならず者だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーは騎士です  \n(2) ベンジャミンはならず者です  \n(3) デイビッドはならず者です  \n(4) エイヴァは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：アレクサンダー、ジャクソン、マシュー、そしてエイブリー。アレクサンダーはこう主張しました：「もしエイブリーが騎士なら、ジャクソンはならず者です」。ジャクソンは、アレクサンダーがならず者であり、アレクサンダーが騎士であると述べました。マシューはこう言いました：「アレクサンダーはならず者か、エイブリーはならず者です」。エイブリーはこう言いました：「マシューは騎士であり、マシューはならず者です」。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アレクサンダーは騎士です  \n(2) ジャクソンはならず者です  \n(3) マシューは騎士です  \n(4) エイブリーはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エマ、スカーレット、ハーパー、そしてウィリアム。エマは「ハーパーはならず者で、エマは騎士です」と言いました。スカーレットは「ウィリアムはならず者か、スカーレットは騎士です」と言いました。「ウィリアムは騎士です」とハーパーは主張しました。「もしスカーレットがならず者なら、スカーレットは騎士です」とウィリアムは言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エマはならず者です  \n(2) スカーレットは騎士です  \n(3) ハーパーは騎士です  \n(4) ウィリアムは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ウィリアム、エイヴァ、ジャック、そしてアメリア。ウィリアムは「アメリアはならず者で、ジャックはならず者だ」と述べました。エイヴァによれば、「もしウィリアムが騎士なら、ウィリアムはならず者だ」とのことです。ジャックは「アメリアはならず者ではない」と言いました。「もしアメリアが騎士なら、ウィリアムはならず者だ」とアメリアは宣言しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムはならず者です  \n(2) エイヴァは騎士です  \n(3) ジャックは騎士です  \n(4) アメリアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：デイビッド、ライリー、セバスチャン、そしてエリザベス。デイビッドは「セバスチャンは騎士だ」と言いました。ライリーは「エリザベスはならず者ではない」と述べました。「デイビッドは騎士である場合に限り、デイビッドはならず者だ」とセバスチャンは宣言しました。「デイビッドは騎士だ」とエリザベスは宣言しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドはならず者です  \n(2) ライリーはならず者です  \n(3) セバスチャンはならず者です  \n(4) エリザベスはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：メイソン、ソフィア、ウィリアム、そしてエイヴァ。メイソンはこう言いました。「もしエイヴァが騎士なら、ソフィアはならず者です。」ソフィアは「エイヴァはならず者です」と言いました。ウィリアムは「もしエイヴァが騎士なら、ウィリアムは騎士です」と述べました。エイヴァによれば、「ソフィアはウィリアムが騎士である場合に限り騎士です。」では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) メイソンは騎士です  \n(2) ソフィアはならず者です  \n(3) ウィリアムはならず者です  \n(4) エイヴァは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エラ、リリー、アメリア、そしてライリー。エラは「ライリーは騎士であり、ライリーはならず者です」と述べました。リリーは「アメリアはならず者であり、エラはならず者です」とコメントしました。アメリアの言葉では「エラはならず者です」。ライリーによれば「エラはならず者です」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラはならず者です  \n(2) リリーはならず者です  \n(3) アメリアは騎士です  \n(4) ライリーは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：イヴリン、ウィリアム、デイビッド、そしてセバスチャン。イヴリンは「デイビッドはならず者です」と言いました。ウィリアムは「イヴリンは騎士ではありません」と言いました。「ウィリアムはならず者であるのは、セバスチャンが騎士である場合に限る」とデイビッドは主張しました。セバスチャンの発言では「セバスチャンは騎士であるのは、ウィリアムがならず者である場合に限る」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンは騎士です  \n(2) ウィリアムはならず者です  \n(3) デイビッドはならず者です  \n(4) セバスチャンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ヘンリー、ジェイコブ、シャーロット、そしてエラ。ヘンリーは「ヘンリーは騎士だ」と述べました。ジェイコブは「シャーロットはならず者ではない」とコメントしました。シャーロットは「もしエラが騎士なら、ヘンリーはならず者だ」と表現しました。エラの言葉では「シャーロットはならず者ではない」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ヘンリーはならず者です  \n(2) ジェイコブは騎士です  \n(3) シャーロットは騎士です  \n(4) エラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エマ、リリー、エイブリー、そしてエリザベス。「エリザベスはならず者ではない」とエマが言いました。リリーはこう言いました。「エマは騎士である場合に限り、エリザベスは騎士です」。エイブリーは、「エマはならず者である場合に限り、エリザベスはならず者です」と指摘しました。「もしエリザベスが騎士なら、リリーは騎士です」とエリザベスが主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エマは騎士です  \n(2) リリーは騎士です  \n(3) エイブリーは騎士です  \n(4) エリザベスは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：マイケル、ソフィア、ジェイコブ、そしてサミュエル。マイケルは「ジェイコブはならず者か、サミュエルは騎士だ」と述べました。ソフィアは「マイケルは騎士である場合、ジェイコブはならず者である」と言いました。ジェイコブの発言は「マイケルは騎士ではない」です。サミュエルは「ジェイコブは騎士だ」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルは騎士です  \n(2) ソフィアは騎士です  \n(3) ジェイコブはならず者です  \n(4) サミュエルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：セバスチャン、ジェームズ、ジェイコブ、そしてジャック。セバスチャンは「ジェイコブはならず者ではない」と言いました。ジェームズは「ジャックはならず者ではない」と言っているのが聞かれました。ジェイコブは「セバスチャンはならず者であるのは、ジェームズがならず者である場合に限る」と主張しました。「ジェイコブは騎士ではない」とジャックが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) セバスチャンはならず者です  \n(2) ジェームズは騎士です  \n(3) ジェイコブはならず者です  \n(4) ジャックは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ミア、ジャクソン、ルーカス、そしてハーパー。ミアは「もしミアが騎士なら、ハーパーはならず者です」と言いました。ジャクソンは「ジャクソンは騎士です」とコメントしました。ルーカスは「ジャクソンは騎士である場合に限り、ハーパーは騎士です」と述べました。ハーパーは「ルーカスはならず者である場合に限り、ハーパーは騎士です」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアは騎士です  \n(2) ジャクソンは騎士です  \n(3) ルーカスはならず者です  \n(4) ハーパーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：アビゲイル、エマ、ヘンリー、そしてイザベラ。アビゲイルは「ヘンリーはエマが騎士である場合に限り騎士です」と言いました。「イザベラはならず者です」とエマが言いました。ヘンリーはイザベラが騎士であり、アビゲイルが騎士であると言いました。イザベラは「アビゲイルがならず者であれば、アビゲイルは騎士です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アビゲイルはならず者です  \n(2) エマは騎士です  \n(3) ヘンリーはならず者です  \n(4) イザベラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：イーサン、アメリア、オリビア、そしてエイデン。イーサンは「もしオリビアが騎士なら、アメリアはならず者だ」と言いました。アメリアによれば、「エイデンは騎士か、オリビアはならず者だ」とのことです。「もしイーサンが騎士なら、イーサンはならず者だ」とオリビアは宣言しました。エイデンはアメリアがならず者だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンは騎士です  \n(2) アメリアは騎士です  \n(3) オリビアはならず者です  \n(4) エイデンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ダニエル、アビゲイル、エイヴァ、そしてハーパー。ダニエルが言ったように、「アビゲイルはならず者である場合に限り、エイヴァはならず者です」。アビゲイルは「エイヴァはならず者ではない」と言いました。エイヴァは「ダニエルは騎士であるか、ダニエルはならず者である」と言っているのが聞かれました。ハーパーが言ったように、「エイヴァはならず者です」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルは騎士です  \n(2) アビゲイルは騎士です  \n(3) エイヴァは騎士です  \n(4) ハーパーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：スカーレット、グレース、ジェイコブ、そしてエミリー。スカーレットは、「エミリーがならず者であるならば、グレースもならず者である」と言いました。グレースは「スカーレットはならず者だ」と主張しました。ジェイコブの言葉では、「エミリーが騎士であるならば、エミリーはならず者だ」と言いました。エミリーは「スカーレットはならず者ではない」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) スカーレットはならず者です  \n(2) グレースは騎士です  \n(3) ジェイコブは騎士です  \n(4) エミリーはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：マイケル、イーサン、ローガン、そしてソフィア。マイケルの発言はこうです：「イーサンはならず者か、マイケルは騎士です」。イーサンはこう言いました：「もしマイケルが騎士なら、イーサンも騎士です」。ローガンはこう言いました：「もしソフィアがならず者なら、イーサンはならず者です」。ソフィアはこう言いました：「ローガンは騎士ではありません」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルは騎士です  \n(2) イーサンはならず者です  \n(3) ローガンは騎士です  \n(4) ソフィアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ルーク、ジャクソン、グレース、そしてソフィア。ルークの発言によれば、「グレースは騎士で、ジャクソンはならず者です」。ジャクソンは、ソフィアはならず者で、ルークは騎士だと言いました。グレースはあなたに、ソフィアは騎士だと伝えました。ソフィアは「ジャクソンは騎士ではない」と主張しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) ジャクソンはならず者です  \n(3) グレースは騎士です  \n(4) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：アメリア、ジャクソン、デイビッド、そしてソフィア。アメリアは「ジャクソンが騎士なら、ソフィアも騎士です」と言いました。「デイビッドはならず者か、ジャクソンは騎士です」とジャクソンが言いました。デイビッドはあなたにソフィアが騎士だと言いました。ソフィアはデイビッドが騎士で、アメリアがならず者だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアはならず者です  \n(2) ジャクソンは騎士です  \n(3) デイビッドはならず者です  \n(4) ソフィアはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：エイヴァ、エラ、マシュー、そしてノア。エイヴァは「マシューが騎士である限り、マシューはならず者です」と主張しました。エラは「マシューがならず者なら、ノアは騎士です」と言いました。「エラが騎士なら、エラはならず者です」とマシューが言いました。ノアは「エイヴァがならず者なら、マシューはならず者です」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァはならず者です  \n(2) エラは騎士です  \n(3) マシューはならず者です  \n(4) ノアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：マシュー、エマ、メイソン、そしてジェイコブ。「エマはならず者だ」とマシューは宣言しました。エマの言葉では、「メイソンは騎士です」。メイソンは、「エマはならず者で、マシューはならず者です」と指摘しました。ジェイコブは、「メイソンはならず者です」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マシューは騎士です  \n(2) エマはならず者です  \n(3) メイソンはならず者です  \n(4) ジェイコブは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ビクトリア、デイビッド、イーサン、そしてスカーレット。ビクトリアは「イーサンが騎士であるならば、ビクトリアは騎士である」と表現しました。「ビクトリアはならず者で、スカーレットはならず者だ」とデイビッドが言いました。イーサンは「スカーレットが騎士であるならば、デイビッドはならず者だ」と述べました。スカーレットは「ビクトリアが騎士であるならば、デイビッドはならず者だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ビクトリアは騎士です  \n(2) デイビッドはならず者です  \n(3) イーサンは騎士です  \n(4) スカーレットは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ヘンリー、ダニエル、セバスチャン、そしてジェームズ。ヘンリーは「ダニエルはならず者か、ジェームズは騎士だ」と言いました。ダニエルは「セバスチャンは騎士か、セバスチャンはならず者だ」と述べました。「もしジェームズがならず者なら、ダニエルはならず者だ」とセバスチャンが言いました。ジェームズは「もしセバスチャンが騎士なら、ヘンリーは騎士だ」とコメントしました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ヘンリーは騎士です  \n(2) ダニエルは騎士です  \n(3) セバスチャンは騎士です  \n(4) ジェームズは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：アメリア、ジャック、エマ、そしてデイビッド。アメリアは「デイビッドはならず者ではない」と主張しました。ジャックは「デイビッドはならず者だ」と述べました。エマは「もしエマが騎士なら、アメリアはならず者だ」と言いました。デイビッドは「デイビッドは騎士で、ジャックも騎士だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアはならず者です  \n(2) ジャックは騎士です  \n(3) エマは騎士です  \n(4) デイビッドはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：ヘンリー、ビクトリア、エイブリー、そしてエマ。ヘンリーの言葉では、「ビクトリアはならず者です」。ビクトリアは、「もしヘンリーが騎士なら、エイブリーも騎士です」と主張しました。エイブリーは、「ビクトリアは騎士ではありません」と述べました。「エイブリーはならず者で、ヘンリーもならず者です」とエマは主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ヘンリーはならず者です  \n(2) ビクトリアは騎士です  \n(3) エイブリーはならず者です  \n(4) エマは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：リアム、オーウェン、メイソン、そしてオリバー。リアムは「メイソンはならず者で、オリバーもならず者だ」と言いました。「リアムは騎士である場合に限り、リアムはならず者だ」とオーウェンが言いました。メイソンは「オリバーは騎士である場合に限り、リアムは騎士だ」と言いました。オリバーによれば、「メイソンは騎士だ」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムは騎士です  \n(2) オーウェンはならず者です  \n(3) メイソンはならず者です  \n(4) オリバーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは4人の住人に出会います：スカーレット、オリビア、メイソン、そしてエリザベス。スカーレットは「メイソンはならず者ではない」とコメントしました。オリビアの言葉では「メイソンは騎士であるか、エリザベスは騎士である」と言いました。メイソンはエリザベスは騎士ではないと言いました。エリザベスの発言では「エリザベスは騎士であるのは、メイソンが騎士である場合に限る」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) スカーレットは騎士です  \n(2) オリビアは騎士です  \n(3) メイソンは騎士です  \n(4) エリザベスはならず者です"
    }
]