[
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ओलिवर और ईथन। ओलिवर ने आपको बताया कि ओलिवर एक शूरवीर है या ईथन एक धूर्त है। ईथन के एक बयान में: \"ओलिवर एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ओलिवर एक शूरवीर है  \n(2) ईथन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: माइकल और याकूब। माइकल ने कहा, \"याकूब एक धूर्त है।\" \"माइकल एक धूर्त है यदि और केवल यदि माइकल एक शूरवीर है,\" याकूब ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक शूरवीर है  \n(2) याकूब एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: अमेलिया और हार्पर। अमेलिया को यह कहते हुए सुना गया, \"हार्पर एक शूरवीर है या हार्पर एक धूर्त है।\" \"अमेलिया एक शूरवीर है और अमेलिया एक धूर्त है,\" हार्पर ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक शूरवीर है  \n(2) हार्पर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: लोगन और लिली। लोगन ने कहा, \"लिली धूर्त नहीं है\"। लिली ने कहा कि लोगन धूर्त है और लिली शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक धूर्त है  \n(2) लिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: जैक और एवलिन। जैक के शब्दों में: \"एवलिन एक शूरवीर है या एवलिन एक धूर्त है\"। एवलिन ने कहा: \"अगर जैक एक धूर्त है तो एवलिन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक एक शूरवीर है  \n(2) एवलिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: सैमुएल और आरिया। सैमुएल के शब्दों में: \"आरिया एक शूरवीर है यदि और केवल यदि आरिया एक धूर्त है\"। आरिया ने टिप्पणी की, \"सैमुएल एक धूर्त है या सैमुएल एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक धूर्त है  \n(2) आरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: डैनियल और लियम। डैनियल के एक बयान में: \"लियम एक धूर्त है यदि और केवल यदि डैनियल एक शूरवीर है\"। लियम ने कहा, \"डैनियल एक शूरवीर है या लियम एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक धूर्त है  \n(2) लियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एवा और हेनरी। एवा ने आपको बताया कि हेनरी एक शूरवीर है या हेनरी एक धूर्त है। \"एवा एक शूरवीर है यदि और केवल यदि एवा एक धूर्त है,\" हेनरी ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक शूरवीर है  \n(2) हेनरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: पेनलोप और अलेक्जेंडर। पेनलोप ने कहा: \"यदि पेनलोप एक शूरवीर है तो अलेक्जेंडर एक शूरवीर है\"। अलेक्जेंडर के अनुसार, \"पेनलोप एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक शूरवीर है  \n(2) अलेक्जेंडर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: राइली और सोफिया। \"सोफिया एक शूरवीर है यदि और केवल यदि सोफिया एक धूर्त है\" - राइली। सोफिया ने कहा, \"राइली एक धूर्त है या सोफिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक धूर्त है  \n(2) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: लियम और बेंजामिन। लियम ने कहा कि अगर बेंजामिन एक धूर्त है तो लियम एक शूरवीर है। \"लियम एक शूरवीर है या लियम एक धूर्त है,\" बेंजामिन ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक शूरवीर है  \n(2) बेंजामिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: स्कारलेट और आरिया। \"आरिया एक धूर्त है और आरिया एक शूरवीर है,\" स्कारलेट ने कहा। \"स्कारलेट एक शूरवीर है यदि और केवल यदि स्कारलेट एक धूर्त है\" - आरिया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) स्कारलेट एक धूर्त है  \n(2) आरिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: हार्पर और ल्यूक। हार्पर को यह कहते हुए सुना गया, \"ल्यूक एक शूरवीर है\"। \"हार्पर एक शूरवीर है यदि और केवल यदि ल्यूक एक शूरवीर है,\" ल्यूक ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक शूरवीर है  \n(2) ल्यूक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एवा और शार्लट। एवा ने कहा कि शार्लट एक धूर्त है। शार्लट ने कहा: \"एवा एक शूरवीर है यदि और केवल यदि शार्लट एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक शूरवीर है  \n(2) शार्लट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: यूसुफ और सैमुएल। यूसुफ ने कहा, \"सैमुएल एक शूरवीर है और सैमुएल एक धूर्त है\"। सैमुएल ने कहा कि यूसुफ एक शूरवीर है यदि और केवल यदि यूसुफ एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) यूसुफ एक धूर्त है  \n(2) सैमुएल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: सेबेस्टियन और बेंजामिन। \"अगर सेबेस्टियन एक शूरवीर है तो बेंजामिन एक धूर्त है,\" सेबेस्टियन ने दावा किया। \"सेबेस्टियन एक शूरवीर है और सेबेस्टियन एक धूर्त है\" - बेंजामिन। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सेबेस्टियन एक शूरवीर है  \n(2) बेंजामिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: अमेलिया और याकूब। अमेलिया ने कहा कि याकूब एक शूरवीर है और याकूब एक धूर्त है। याकूब ने टिप्पणी की, \"अगर अमेलिया एक धूर्त है तो अमेलिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक धूर्त है  \n(2) याकूब एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: अबिगेल और हार्पर। अबिगेल ने कहा: \"अगर अबिगेल एक शूरवीर है तो हार्पर एक शूरवीर है\"। हार्पर के अनुसार, \"अबिगेल एक शूरवीर है या हार्पर एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) अबिगेल एक शूरवीर है  \n(2) हार्पर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: स्कारलेट और यूसुफ। \"स्कारलेट एक शूरवीर है यदि और केवल यदि यूसुफ एक धूर्त है,\" स्कारलेट ने दावा किया। यूसुफ को यह कहते हुए सुना गया, \"यदि स्कारलेट एक धूर्त है तो यूसुफ एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) स्कारलेट एक धूर्त है  \n(2) यूसुफ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: डैनियल और राइली। डैनियल के अनुसार, \"राइली शूरवीर नहीं है।\" \"डैनियल शूरवीर है यदि और केवल यदि राइली शूरवीर है,\" राइली ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक शूरवीर है  \n(2) राइली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एलिज़ाबेथ और ओलिवर। \"ओलिवर एक धूर्त नहीं है,\" एलिज़ाबेथ ने कहा। ओलिवर ने कहा, \"ओलिवर एक शूरवीर है या एलिज़ाबेथ एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक शूरवीर है  \n(2) ओलिवर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: डैनियल और अबिगेल। डैनियल के अनुसार, \"अबिगेल एक धूर्त है और अबिगेल एक शूरवीर है\"। अबिगेल ने कहा, \"डैनियल एक शूरवीर है या डैनियल एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक धूर्त है  \n(2) अबिगेल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: सोफिया और लोगन। \"लोगन एक शूरवीर है या लोगन एक धूर्त है,\" सोफिया ने घोषणा की। \"सोफिया एक शूरवीर है या सोफिया एक धूर्त है,\" लोगन ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) लोगन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: शार्लट और अलेक्जेंडर। शार्लट ने कहा, \"अगर अलेक्जेंडर एक शूरवीर है तो अलेक्जेंडर एक धूर्त है।\" \"शार्लट एक शूरवीर है या अलेक्जेंडर एक शूरवीर है,\" अलेक्जेंडर ने घोषणा की। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) शार्लट एक धूर्त है  \n(2) अलेक्जेंडर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: शार्लट और ऐडन। शार्लट ने आपको बताया कि ऐडन एक धूर्त है। ऐडन ने कहा, \"शार्लट एक धूर्त है या शार्लट एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक धूर्त है  \n(2) ऐडन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: शार्लट और स्कारलेट। \"स्कारलेट एक शूरवीर है और स्कारलेट एक धूर्त है\" - शार्लट। स्कारलेट ने कहा, \"स्कारलेट एक शूरवीर है और शार्लट एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) शार्लट एक धूर्त है  \n(2) स्कारलेट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ओलिविया और हेनरी। ओलिविया ने कहा: \"हेनरी एक शूरवीर है या हेनरी एक धूर्त है\"। हेनरी के शब्दों में: \"ओलिविया एक धूर्त है और ओलिविया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक शूरवीर है  \n(2) हेनरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: डैनियल और लिली। डैनियल को यह कहते हुए सुना गया, \"अगर लिली एक शूरवीर है तो लिली एक धूर्त है\"। लिली को यह कहते हुए सुना गया, \"लिली एक शूरवीर है या डैनियल एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक धूर्त है  \n(2) लिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: जैक और बेंजामिन। जैक ने आपको बताया कि बेंजामिन एक शूरवीर है या जैक एक शूरवीर है। बेंजामिन ने कहा, \"अगर जैक एक शूरवीर है तो जैक एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक एक शूरवीर है  \n(2) बेंजामिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: डैनियल और सैमुएल। डैनियल ने कहा, \"सैमुएल एक धूर्त है या सैमुएल एक शूरवीर है।\" सैमुएल ने कहा कि सैमुएल एक शूरवीर है या डैनियल एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक शूरवीर है  \n(2) सैमुएल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: लियम और आरिया। \"आरिया धूर्त नहीं है\" - लियम। आरिया ने कहा: \"आरिया शूरवीर है यदि और केवल यदि लियम शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक शूरवीर है  \n(2) आरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: विलियम और नूह। विलियम ने कहा कि नूह एक धूर्त है या नूह एक शूरवीर है। नूह के एक बयान में: \"विलियम एक शूरवीर है यदि और केवल यदि विलियम एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) नूह एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: मिया और आरिया। \"मिया एक शूरवीर है या आरिया एक शूरवीर है,\" मिया ने घोषणा की। आरिया ने कहा, \"अगर मिया एक शूरवीर है तो मिया एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक शूरवीर है  \n(2) आरिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: औरोरा और शार्लट। औरोरा ने कहा, \"शार्लट एक शूरवीर है यदि और केवल यदि औरोरा एक शूरवीर है\"। जैसे कि शार्लट ने कहा, \"यदि शार्लट एक शूरवीर है तो औरोरा एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) औरोरा एक शूरवीर है  \n(2) शार्लट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: क्लोई और याकूब। क्लोई ने कहा, \"याकूब एक शूरवीर है और याकूब एक धूर्त है\"। याकूब ने कहा: \"क्लोई एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) क्लोई एक धूर्त है  \n(2) याकूब एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: लियम और लोगन। लियम को यह कहते हुए सुना गया, \"लियम एक शूरवीर है यदि और केवल यदि लोगन एक धूर्त है।\" लोगन ने कहा, \"लियम एक धूर्त नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक धूर्त है  \n(2) लोगन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: सैमुएल और इसाबेला। \"इसाबेला एक शूरवीर है\" - सैमुएल। इसाबेला ने कहा कि सैमुएल एक धूर्त है और इसाबेला एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक धूर्त है  \n(2) इसाबेला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: बेंजामिन और लिली। बेंजामिन के शब्दों में: \"अगर लिली एक धूर्त है तो लिली एक शूरवीर है।\" \"बेंजामिन एक धूर्त है और बेंजामिन एक शूरवीर है,\" लिली ने घोषित किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक धूर्त है  \n(2) लिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: मेसन और ज़ोई। मेसन ने कहा, \"ज़ोई एक शूरवीर है और ज़ोई एक धूर्त है\"। ज़ोई ने कहा: \"मेसन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) ज़ोई एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: सोफिया और शार्लट। सोफिया ने टिप्पणी की, \"अगर सोफिया एक शूरवीर है तो शार्लट एक धूर्त है।\" \"सोफिया एक धूर्त है और सोफिया एक शूरवीर है\" - शार्लट। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) शार्लट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: विलियम और डेविड। जैसे विलियम ने कहा, \"डेविड एक धूर्त है और डेविड एक शूरवीर है\"। डेविड ने कहा, \"अगर विलियम एक शूरवीर है तो डेविड एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक धूर्त है  \n(2) डेविड एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: सोफिया और नूह। \"अगर सोफिया एक शूरवीर है तो नूह एक धूर्त है\" - सोफिया। नूह ने कहा, \"अगर सोफिया एक शूरवीर है तो नूह एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) नूह एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: शार्लट और एवलिन। शार्लट ने कहा, \"अगर शार्लट एक शूरवीर है तो एवलिन एक शूरवीर है\"। एवलिन ने कहा, \"एवलिन एक शूरवीर है यदि और केवल यदि शार्लट एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक शूरवीर है  \n(2) एवलिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: डैनियल और जैक। डैनियल ने कहा कि अगर डैनियल एक शूरवीर है तो जैक एक शूरवीर है। \"जैक एक शूरवीर है,\" जैक ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक शूरवीर है  \n(2) जैक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एवलिन और हार्पर। \"हार्पर शूरवीर नहीं है,\" एवलिन ने कहा। हार्पर के शब्दों में: \"एवलिन धूर्त है यदि और केवल यदि एवलिन शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक शूरवीर है  \n(2) हार्पर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एवरी और माइकल। \"एवरी एक शूरवीर है यदि और केवल यदि माइकल एक धूर्त है,\" एवरी ने कहा। \"एवरी एक शूरवीर नहीं है,\" माइकल ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक शूरवीर है  \n(2) माइकल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एलिज़ाबेथ और औरोरा। एलिज़ाबेथ के अनुसार, \"एलिज़ाबेथ एक शूरवीर है यदि और केवल यदि औरोरा एक शूरवीर है\"। औरोरा ने कहा, \"एलिज़ाबेथ एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक शूरवीर है  \n(2) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: राइली और बेंजामिन। जैसे राइली ने कहा, \"राइली एक शूरवीर है या बेंजामिन एक धूर्त है\"। बेंजामिन ने कहा: \"राइली एक धूर्त है यदि और केवल यदि बेंजामिन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक धूर्त है  \n(2) बेंजामिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: पेनलोप और ओलिवर। पेनलोप ने कहा कि ओलिवर एक धूर्त है यदि और केवल यदि पेनलोप एक शूरवीर है। ओलिवर ने कहा कि यदि पेनलोप एक धूर्त है तो पेनलोप एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक धूर्त है  \n(2) ओलिवर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: क्लोई और जेम्स। जैसे कि क्लोई ने कहा, \"जेम्स एक धूर्त है\"। जेम्स के अनुसार, \"क्लोई एक धूर्त है यदि और केवल यदि जेम्स एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) क्लोई एक धूर्त है  \n(2) जेम्स एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: हेनरी और डेविड। \"डेविड एक धूर्त है और डेविड एक शूरवीर है,\" हेनरी ने कहा। डेविड के एक बयान में: \"हेनरी एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हेनरी एक धूर्त है  \n(2) डेविड एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एवलिन और एलिज़ाबेथ। एवलिन ने आपको बताया कि एवलिन एक शूरवीर है यदि और केवल यदि एलिज़ाबेथ एक धूर्त है। \"एवलिन एक शूरवीर है\" - एलिज़ाबेथ। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक धूर्त है  \n(2) एलिज़ाबेथ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: जैक्सन और एलिज़ाबेथ। जैक्सन के अनुसार, \"एलिज़ाबेथ एक धूर्त है और जैक्सन एक शूरवीर है\"। \"अगर जैक्सन एक धूर्त है तो जैक्सन एक शूरवीर है,\" एलिज़ाबेथ ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक धूर्त है  \n(2) एलिज़ाबेथ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ऐडन और एम्मा। ऐडन ने कहा, \"ऐडन एक शूरवीर है और एम्मा एक शूरवीर है\"। \"अगर एम्मा एक शूरवीर है तो ऐडन एक शूरवीर है\" - एम्मा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक शूरवीर है  \n(2) एम्मा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: सेबेस्टियन और एवा। सेबेस्टियन के एक बयान में: \"एवा एक शूरवीर है\"। \"अगर सेबेस्टियन एक शूरवीर है तो एवा एक शूरवीर है,\" एवा ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सेबेस्टियन एक शूरवीर है  \n(2) एवा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: जेम्स और ओलिवर। जेम्स ने कहा: \"अगर ओलिवर एक धूर्त है तो ओलिवर एक शूरवीर है\"। ओलिवर ने आपको बताया कि जेम्स एक शूरवीर है या जेम्स एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) ओलिवर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: राइली और मैथ्यू। \"मैथ्यू एक धूर्त है या मैथ्यू एक शूरवीर है,\" राइली ने दावा किया। मैथ्यू ने कहा, \"अगर राइली एक धूर्त है तो मैथ्यू एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक शूरवीर है  \n(2) मैथ्यू एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: जैक्सन और माइकल। जैक्सन ने कहा, \"अगर जैक्सन एक शूरवीर है तो माइकल एक धूर्त है।\" माइकल ने कहा, \"जैक्सन एक शूरवीर नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक शूरवीर है  \n(2) माइकल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: पेनलोप और अलेक्जेंडर। पेनलोप ने कहा, \"अलेक्जेंडर एक शूरवीर है।\" \"पेनलोप एक धूर्त है यदि और केवल यदि पेनलोप एक शूरवीर है,\" अलेक्जेंडर ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक धूर्त है  \n(2) अलेक्जेंडर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: आरिया और नूह। \"नूह शूरवीर नहीं है,\" आरिया ने कहा। \"आरिया धूर्त है यदि और केवल यदि नूह शूरवीर है,\" नूह ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) आरिया एक धूर्त है  \n(2) नूह एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: नूह और जैक्सन। नूह ने कहा, \"जैक्सन एक धूर्त है यदि और केवल यदि नूह एक शूरवीर है\"। जैक्सन ने आपको बताया कि यदि नूह एक शूरवीर है तो नूह एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक शूरवीर है  \n(2) जैक्सन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एवा और ईथन। एवा ने कहा: \"एवा एक शूरवीर है यदि और केवल यदि ईथन एक धूर्त है।\" ईथन ने कहा, \"ईथन एक शूरवीर है या एवा एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक शूरवीर है  \n(2) ईथन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: अबिगेल और विक्टोरिया। अबिगेल ने कहा, \"अगर विक्टोरिया एक धूर्त है तो विक्टोरिया एक शूरवीर है\"। विक्टोरिया के एक बयान में: \"विक्टोरिया एक शूरवीर है और अबिगेल एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अबिगेल एक धूर्त है  \n(2) विक्टोरिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: यूसुफ और जैक्सन। \"अगर जैक्सन शूरवीर है तो यूसुफ शूरवीर है\" - यूसुफ। \"अगर जैक्सन शूरवीर है तो यूसुफ शूरवीर है,\" जैक्सन ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) यूसुफ एक शूरवीर है  \n(2) जैक्सन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: नूह और शार्लट। नूह ने आपको बताया कि शार्लट एक शूरवीर है और नूह एक शूरवीर है। शार्लट को यह कहते हुए सुना गया, \"शार्लट एक शूरवीर है यदि और केवल यदि नूह एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक शूरवीर है  \n(2) शार्लट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एवरी और क्लोई। एवरी ने कहा कि क्लोई एक शूरवीर है और क्लोई एक धूर्त है। \"एवरी एक शूरवीर नहीं है,\" क्लोई ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक धूर्त है  \n(2) क्लोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एवलिन और एवा। \"अगर एवलिन एक शूरवीर है तो एवा एक शूरवीर है,\" एवलिन ने दावा किया। एवा ने आपको बताया कि एवा एक शूरवीर है या एवलिन एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक शूरवीर है  \n(2) एवा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: मैथ्यू और विक्टोरिया। मैथ्यू के शब्दों में: \"विक्टोरिया शूरवीर नहीं है\"। विक्टोरिया के शब्दों में: \"विक्टोरिया शूरवीर है और मैथ्यू शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक शूरवीर है  \n(2) विक्टोरिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: डैनियल और विलियम। \"विलियम एक शूरवीर है या डैनियल एक शूरवीर है,\" डैनियल ने घोषणा की। विलियम ने कहा कि डैनियल एक शूरवीर है या डैनियल एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक शूरवीर है  \n(2) विलियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ल्यूक और अलेक्जेंडर। ल्यूक ने कहा, \"अगर ल्यूक एक शूरवीर है तो अलेक्जेंडर एक धूर्त है।\" अलेक्जेंडर ने कहा, \"अलेक्जेंडर एक शूरवीर है और ल्यूक एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) अलेक्जेंडर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: मिया और सैमुएल। मिया ने कहा कि मिया एक शूरवीर है और सैमुएल एक शूरवीर है। सैमुएल ने कहा कि मिया एक शूरवीर है और मिया एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक धूर्त है  \n(2) सैमुएल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: लियम और हेनरी। लियम के अनुसार, \"लियम एक शूरवीर है यदि और केवल यदि हेनरी एक शूरवीर है\"। हेनरी ने कहा, \"लियम एक धूर्त नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक शूरवीर है  \n(2) हेनरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ओलिविया और यूसुफ। \"अगर यूसुफ एक शूरवीर है तो ओलिविया एक शूरवीर है\" - ओलिविया। यूसुफ ने टिप्पणी की, \"ओलिविया एक धूर्त है यदि और केवल यदि ओलिविया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक शूरवीर है  \n(2) यूसुफ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: जैक और जैक्सन। \"जैक एक शूरवीर है और जैक्सन एक धूर्त है,\" जैक ने दावा किया। जैक्सन ने आपको बताया कि जैक एक धूर्त नहीं है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक एक धूर्त है  \n(2) जैक्सन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एवलिन और ईथन। एवलिन के एक बयान में: \"एवलिन एक शूरवीर है यदि और केवल यदि ईथन एक धूर्त है\"। जैसा कि ईथन ने कहा, \"ईथन एक शूरवीर है यदि और केवल यदि एवलिन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक धूर्त है  \n(2) ईथन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एवरी और औरोरा। एवरी ने टिप्पणी की, \"अगर औरोरा एक शूरवीर है तो एवरी एक शूरवीर है\"। औरोरा के अनुसार, \"एवरी एक शूरवीर है और एवरी एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एवरी एक शूरवीर है  \n(2) औरोरा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: इसाबेला और एवलिन। इसाबेला के एक बयान में: \"एवलिन शूरवीर नहीं है\"। एवलिन ने कहा, \"इसाबेला धूर्त है या इसाबेला शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक धूर्त है  \n(2) एवलिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: सैमुएल और स्कारलेट। \"अगर स्कारलेट एक धूर्त है, तो सैमुएल एक शूरवीर है,\" सैमुएल ने घोषणा की। \"सैमुएल एक शूरवीर नहीं है,\" स्कारलेट ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक शूरवीर है  \n(2) स्कारलेट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: जेम्स और सैमुएल। जेम्स ने कहा कि सैमुएल एक शूरवीर है या जेम्स एक शूरवीर है। \"जेम्स एक धूर्त है या जेम्स एक शूरवीर है,\" सैमुएल ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) सैमुएल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: हार्पर और ज़ोई। हार्पर ने टिप्पणी की, \"ज़ोई एक धूर्त है यदि और केवल यदि ज़ोई एक शूरवीर है\"। ज़ोई को यह कहते हुए सुना गया, \"हार्पर एक धूर्त है या हार्पर एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक धूर्त है  \n(2) ज़ोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: राइली और एलिज़ाबेथ। राइली ने कहा, \"अगर एलिज़ाबेथ एक धूर्त है तो एलिज़ाबेथ एक शूरवीर है\"। एलिज़ाबेथ ने कहा, \"राइली एक धूर्त है या राइली एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक शूरवीर है  \n(2) एलिज़ाबेथ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: हार्पर और एलिज़ाबेथ। हार्पर ने कहा, \"एलिज़ाबेथ एक शूरवीर है और एलिज़ाबेथ एक धूर्त है\"। एलिज़ाबेथ के अनुसार, \"एलिज़ाबेथ एक शूरवीर है या हार्पर एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक धूर्त है  \n(2) एलिज़ाबेथ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एवरी और लियम। एवरी के शब्दों में: \"एवरी एक शूरवीर है या लियम एक शूरवीर है\"। लियम के एक बयान में: \"लियम एक शूरवीर है यदि और केवल यदि एवरी एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक धूर्त है  \n(2) लियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: सोफिया और एमिली। सोफिया के शब्दों में: \"अगर एमिली एक शूरवीर है तो एमिली एक धूर्त है\"। एमिली ने कहा, \"अगर सोफिया एक धूर्त है तो एमिली एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) एमिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एला और याकूब। \"याकूब एक धूर्त है,\" एला ने घोषणा की। याकूब ने कहा: \"अगर याकूब एक शूरवीर है तो एला एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक धूर्त है  \n(2) याकूब एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: जैक और आरिया। \"अगर जैक एक शूरवीर है तो आरिया एक धूर्त है,\" जैक ने घोषणा की। आरिया ने आपको बताया कि जैक एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक एक शूरवीर है  \n(2) आरिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एवा और लुकास। एवा ने आपको बताया कि लुकास एक शूरवीर है। \"लुकास एक शूरवीर है और एवा एक धूर्त है,\" लुकास ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक धूर्त है  \n(2) लुकास एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: मेसन और ओलिवर। \"ओलिवर एक धूर्त है यदि और केवल यदि ओलिवर एक शूरवीर है,\" मेसन ने कहा। \"मेसन एक शूरवीर है यदि और केवल यदि मेसन एक धूर्त है,\" ओलिवर ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) ओलिवर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: अमेलिया और औरोरा। \"औरोरा एक धूर्त नहीं है,\" अमेलिया ने कहा। औरोरा ने कहा, \"अमेलिया एक धूर्त है या अमेलिया एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक शूरवीर है  \n(2) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: अमेलिया और याकूब। \"याकूब एक शूरवीर है और याकूब एक धूर्त है,\" अमेलिया ने घोषणा की। याकूब के एक बयान में: \"अगर अमेलिया एक शूरवीर है तो याकूब एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक धूर्त है  \n(2) याकूब एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: स्कारलेट और विलियम। स्कारलेट के शब्दों में: \"विलियम एक शूरवीर है यदि और केवल यदि विलियम एक धूर्त है\"। विलियम को यह कहते हुए सुना गया, \"यदि स्कारलेट एक धूर्त है तो स्कारलेट एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) स्कारलेट एक धूर्त है  \n(2) विलियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: मेसन और हार्पर। मेसन के एक बयान में: \"हार्पर एक धूर्त है और मेसन एक शूरवीर है\"। हार्पर ने कहा, \"मेसन एक शूरवीर है या मेसन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) हार्पर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ल्यूक और ग्रेस। ल्यूक ने आपको बताया कि ग्रेस एक धूर्त है या ग्रेस एक शूरवीर है। ग्रेस ने कहा: \"अगर ग्रेस एक शूरवीर है तो ल्यूक एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) ग्रेस एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एवरी और जेम्स। एवरी ने कहा, \"जेम्स एक धूर्त है\"। जेम्स ने कहा, \"जेम्स एक शूरवीर है और एवरी एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक शूरवीर है  \n(2) जेम्स एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: जैक्सन और लिली। \"लिली एक धूर्त है या जैक्सन एक शूरवीर है,\" जैक्सन ने घोषणा की। लिली ने कहा, \"जैक्सन एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक शूरवीर है  \n(2) लिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ओवेन और स्कारलेट। ओवेन ने कहा कि ओवेन एक शूरवीर है और स्कारलेट एक धूर्त है। स्कारलेट ने कहा कि अगर स्कारलेट एक शूरवीर है तो ओवेन एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओवेन एक धूर्त है  \n(2) स्कारलेट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एम्मा और इसाबेला। एम्मा के अनुसार, \"यदि इसाबेला एक शूरवीर है तो एम्मा एक शूरवीर है\"। इसाबेला ने कहा, \"यदि एम्मा एक धूर्त है तो एम्मा एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एम्मा एक शूरवीर है  \n(2) इसाबेला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: नूह और मैथ्यू। \"मैथ्यू एक शूरवीर है,\" नूह ने कहा। मैथ्यू ने टिप्पणी की, \"नूह एक शूरवीर है यदि और केवल यदि नूह एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक धूर्त है  \n(2) मैथ्यू एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: लियम और डेविड। लियम ने कहा कि डेविड एक धूर्त है या लियम एक शूरवीर है। डेविड ने कहा: \"अगर डेविड एक शूरवीर है तो लियम एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक शूरवीर है  \n(2) डेविड एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एलिज़ाबेथ और नूह। एलिज़ाबेथ ने आपको बताया कि एलिज़ाबेथ एक शूरवीर है यदि और केवल यदि नूह एक धूर्त है। \"एलिज़ाबेथ एक धूर्त है,\" नूह ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक शूरवीर है  \n(2) नूह एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ओलिविया और जैक। \"अगर जैक एक शूरवीर है तो ओलिविया एक शूरवीर है,\" ओलिविया ने दावा किया। जैक ने कहा, \"ओलिविया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक शूरवीर है  \n(2) जैक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ईथन और एलिज़ाबेथ। \"एलिज़ाबेथ एक धूर्त है और एलिज़ाबेथ एक शूरवीर है\" - ईथन। एलिज़ाबेथ ने कहा, \"ईथन एक शूरवीर है और एलिज़ाबेथ एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक धूर्त है  \n(2) एलिज़ाबेथ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: लियम और नूह। लियम ने कहा, \"अगर नूह एक धूर्त है तो लियम एक शूरवीर है\"। नूह ने कहा कि अगर नूह एक शूरवीर है तो लियम एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक शूरवीर है  \n(2) नूह एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: इसाबेला और एम्मा। \"एम्मा एक शूरवीर है या एम्मा एक धूर्त है,\" इसाबेला ने दावा किया। एम्मा ने आपको बताया कि इसाबेला एक शूरवीर है या एम्मा एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक शूरवीर है  \n(2) एम्मा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: डेविड और एवा। \"एवा एक धूर्त है यदि और केवल यदि एवा एक शूरवीर है,\" डेविड ने घोषणा की। एवा ने asserted किया: \"डेविड एक शूरवीर है और एवा एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक धूर्त है  \n(2) एवा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: लोगन और एला। लोगन ने कहा, \"अगर लोगन एक शूरवीर है तो एला एक धूर्त है।\" \"एला एक शूरवीर है और लोगन एक धूर्त है,\" एला ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक शूरवीर है  \n(2) एला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: सोफिया और आरिया। सोफिया के शब्दों में: \"आरिया एक धूर्त है यदि और केवल यदि आरिया एक शूरवीर है\"। आरिया के शब्दों में: \"सोफिया एक धूर्त है और सोफिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) आरिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: सेबेस्टियन और एवा। सेबेस्टियन के अनुसार, \"एवा एक शूरवीर है यदि और केवल यदि सेबेस्टियन एक शूरवीर है\"। एवा के अनुसार, \"एवा एक शूरवीर है यदि और केवल यदि सेबेस्टियन एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सेबेस्टियन एक शूरवीर है  \n(2) एवा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: लुकास और सेबेस्टियन। लुकास ने कहा, \"सेबेस्टियन एक धूर्त है और लुकास एक शूरवीर है\"। जैसे सेबेस्टियन ने कहा, \"लुकास एक शूरवीर है यदि और केवल यदि सेबेस्टियन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक शूरवीर है  \n(2) सेबेस्टियन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: मैथ्यू और एलिज़ाबेथ। मैथ्यू के शब्दों में: \"मैथ्यू एक शूरवीर है यदि और केवल यदि एलिज़ाबेथ एक शूरवीर है\"। एलिज़ाबेथ ने कहा, \"यदि मैथ्यू एक शूरवीर है तो मैथ्यू एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक धूर्त है  \n(2) एलिज़ाबेथ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एला और इसाबेला। एला ने आपको बताया कि इसाबेला एक धूर्त है। इसाबेला ने कहा कि एला एक शूरवीर है यदि और केवल यदि एला एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक शूरवीर है  \n(2) इसाबेला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: अबिगेल और इसाबेला। \"इसाबेला एक शूरवीर है या अबिगेल एक शूरवीर है,\" अबिगेल ने दावा किया। इसाबेला ने कहा, \"अबिगेल एक शूरवीर नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अबिगेल एक शूरवीर है  \n(2) इसाबेला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ऐडन और विक्टोरिया। ऐडन ने कहा, \"अगर विक्टोरिया एक धूर्त है तो विक्टोरिया एक शूरवीर है\"। विक्टोरिया ने कहा: \"अगर विक्टोरिया एक शूरवीर है तो ऐडन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक शूरवीर है  \n(2) विक्टोरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: अमेलिया और ओलिविया। जैसे अमेलिया ने कहा, \"अगर अमेलिया एक शूरवीर है तो ओलिविया एक धूर्त है।\" ओलिविया ने कहा, \"ओलिविया एक शूरवीर है यदि और केवल यदि अमेलिया एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक शूरवीर है  \n(2) ओलिविया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एवलिन और ओलिविया। एवलिन ने कहा, \"ओलिविया एक शूरवीर है\"। ओलिविया के एक बयान में: \"एवलिन एक धूर्त है या ओलिविया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक शूरवीर है  \n(2) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ईथन और लुकास। ईथन के एक बयान में: \"लुकास एक धूर्त है यदि और केवल यदि ईथन एक शूरवीर है\"। लुकास ने कहा, \"ईथन एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक धूर्त है  \n(2) लुकास एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एवलिन और लियम। एवलिन ने कहा, \"एवलिन एक शूरवीर है यदि और केवल यदि लियम एक धूर्त है\"। लियम के एक बयान में: \"लियम एक शूरवीर है या एवलिन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक धूर्त है  \n(2) लियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: विक्टोरिया और अबिगेल। विक्टोरिया ने कहा: \"यदि अबिगेल एक धूर्त है तो अबिगेल एक शूरवीर है।\" \"अबिगेल एक शूरवीर है यदि और केवल यदि विक्टोरिया एक शूरवीर है,\" अबिगेल ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विक्टोरिया एक शूरवीर है  \n(2) अबिगेल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: विलियम और शार्लट। विलियम ने टिप्पणी की, \"अगर विलियम एक शूरवीर है तो शार्लट एक धूर्त है\"। शार्लट के एक बयान में: \"विलियम एक शूरवीर है और शार्लट एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) शार्लट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एला और स्कारलेट। एला को यह कहते हुए सुना गया, \"स्कारलेट एक धूर्त है या स्कारलेट एक शूरवीर है।\" \"एला एक शूरवीर है या एला एक धूर्त है,\" स्कारलेट ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक शूरवीर है  \n(2) स्कारलेट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: सोफिया और क्लोई। सोफिया ने कहा, \"अगर सोफिया एक शूरवीर है तो क्लोई एक शूरवीर है\"। क्लोई ने कहा कि सोफिया एक धूर्त है या सोफिया एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) क्लोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ओलिविया और एला। ओलिविया को यह कहते हुए सुना गया, \"अगर ओलिविया एक शूरवीर है तो एला एक शूरवीर है\"। एला ने आपको बताया कि अगर एला एक शूरवीर है तो ओलिविया एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ओलिविया एक शूरवीर है  \n(2) एला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: बेंजामिन और पेनलोप। बेंजामिन ने कहा, \"पेनलोप एक शूरवीर है यदि और केवल यदि बेंजामिन एक शूरवीर है\"। पेनलोप ने आपको बताया कि पेनलोप एक शूरवीर है और बेंजामिन एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक शूरवीर है  \n(2) पेनलोप एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: हेनरी और बेंजामिन। हेनरी ने कहा कि हेनरी एक शूरवीर है यदि और केवल यदि बेंजामिन एक शूरवीर है। बेंजामिन के शब्दों में: \"हेनरी एक धूर्त है और बेंजामिन एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) हेनरी एक धूर्त है  \n(2) बेंजामिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: डेविड और नूह। डेविड ने आपको बताया कि नूह एक शूरवीर है यदि और केवल यदि नूह एक धूर्त है। नूह ने कहा कि डेविड एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक धूर्त है  \n(2) नूह एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: बेंजामिन और याकूब। बेंजामिन ने कहा कि याकूब एक धूर्त है या बेंजामिन एक शूरवीर है। याकूब ने कहा, \"याकूब एक शूरवीर है यदि और केवल यदि बेंजामिन एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक धूर्त है  \n(2) याकूब एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: विक्टोरिया और एलिज़ाबेथ। विक्टोरिया के अनुसार, \"एलिज़ाबेथ एक शूरवीर है और विक्टोरिया एक शूरवीर है\"। एलिज़ाबेथ ने कहा, \"विक्टोरिया एक शूरवीर है यदि और केवल यदि एलिज़ाबेथ एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विक्टोरिया एक शूरवीर है  \n(2) एलिज़ाबेथ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: सोफिया और ज़ोई। सोफिया ने कहा, \"ज़ोई धूर्त नहीं है\"। ज़ोई ने कहा कि सोफिया एक शूरवीर है और सोफिया एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) ज़ोई एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: शार्लट और ज़ोई। शार्लट ने कहा, \"ज़ोई एक शूरवीर है यदि और केवल यदि ज़ोई एक धूर्त है\"। ज़ोई के एक बयान में: \"शार्लट एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक धूर्त है  \n(2) ज़ोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: विलियम और पेनलोप। विलियम के एक बयान में: \"पेनलोप एक धूर्त है यदि और केवल यदि पेनलोप एक शूरवीर है\"। पेनलोप के एक बयान में: \"विलियम एक धूर्त है यदि और केवल यदि विलियम एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक धूर्त है  \n(2) पेनलोप एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: हार्पर और अमेलिया। हार्पर ने कहा, \"हार्पर एक शूरवीर है या अमेलिया एक धूर्त है।\" जैसा कि अमेलिया ने कहा, \"अमेलिया एक शूरवीर है यदि और केवल यदि हार्पर एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक धूर्त है  \n(2) अमेलिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: लोगन और जेम्स। लोगन ने टिप्पणी की, \"जेम्स एक धूर्त है और जेम्स एक शूरवीर है\"। जेम्स ने remarked किया, \"लोगन एक धूर्त है या लोगन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक धूर्त है  \n(2) जेम्स एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: इसाबेला और अमेलिया। इसाबेला को कहते हुए सुना गया, \"अमेलिया एक शूरवीर है यदि और केवल यदि इसाबेला एक शूरवीर है\"। अमेलिया ने कहा: \"इसाबेला एक धूर्त है यदि और केवल यदि अमेलिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक धूर्त है  \n(2) अमेलिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: जैक्सन और हार्पर। जैक्सन ने कहा, \"जैक्सन एक शूरवीर है और हार्पर एक शूरवीर है\"। हार्पर ने कहा कि अगर हार्पर एक शूरवीर है तो जैक्सन एक धूर्त है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) जैक्सन एक धूर्त है  \n(2) हार्पर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: स्कारलेट और माइकल। स्कारलेट को यह कहते हुए सुना गया, \"माइकल एक शूरवीर है और माइकल एक धूर्त है।\" \"अगर माइकल एक शूरवीर है तो स्कारलेट एक धूर्त है,\" माइकल ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) स्कारलेट एक धूर्त है  \n(2) माइकल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: सोफिया और मेसन। \"मेसन एक धूर्त है और मेसन एक शूरवीर है,\" सोफिया ने दावा किया। मेसन ने कहा, \"सोफिया एक शूरवीर है और सोफिया एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) मेसन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ग्रेस और अमेलिया। ग्रेस के एक बयान में: \"अमेलिया एक धूर्त है यदि और केवल यदि ग्रेस एक शूरवीर है\"। अमेलिया ने आपको बताया कि यदि ग्रेस एक शूरवीर है तो अमेलिया एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक शूरवीर है  \n(2) अमेलिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ग्रेस और पेनलोप। ग्रेस ने कहा, \"पेनलोप एक धूर्त है।\" पेनलोप ने कहा, \"ग्रेस एक शूरवीर है या पेनलोप एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक धूर्त है  \n(2) पेनलोप एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: सेबेस्टियन और औरोरा। सेबेस्टियन ने कहा, \"सेबेस्टियन एक शूरवीर है और औरोरा एक धूर्त है।\" औरोरा ने कहा, \"सेबेस्टियन एक शूरवीर है या सेबेस्टियन एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सेबेस्टियन एक धूर्त है  \n(2) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: औरोरा और याकूब। औरोरा ने आपको बताया कि याकूब एक शूरवीर है। याकूब के अनुसार, \"यदि याकूब एक शूरवीर है तो औरोरा एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) औरोरा एक शूरवीर है  \n(2) याकूब एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एवा और ज़ोई। एवा ने टिप्पणी की, \"एवा एक शूरवीर है यदि और केवल यदि ज़ोई एक शूरवीर है\"। ज़ोई के शब्दों में: \"एवा एक धूर्त है यदि और केवल यदि ज़ोई एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एवा एक धूर्त है  \n(2) ज़ोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: बेंजामिन और याकूब। बेंजामिन के शब्दों में: \"याकूब एक शूरवीर है\"। याकूब को यह कहते हुए सुना गया, \"याकूब एक शूरवीर है यदि और केवल यदि बेंजामिन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक धूर्त है  \n(2) याकूब एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ल्यूक और एवरी। ल्यूक ने कहा: \"ल्यूक एक शूरवीर है या एवरी एक धूर्त है।\" \"अगर एवरी एक शूरवीर है तो ल्यूक एक धूर्त है,\" एवरी ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक धूर्त है  \n(2) एवरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एला और याकूब। एला ने कहा, \"एला एक शूरवीर है और याकूब एक शूरवीर है\"। याकूब ने कहा कि एला एक धूर्त है यदि और केवल यदि एला एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक धूर्त है  \n(2) याकूब एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: हेनरी और ऐडन। हेनरी ने कहा कि ऐडन एक धूर्त है यदि और केवल यदि हेनरी एक शूरवीर है। \"हेनरी एक शूरवीर नहीं है,\" ऐडन ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हेनरी एक शूरवीर है  \n(2) ऐडन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ओवेन और ल्यूक। \"ओवेन एक शूरवीर है या ल्यूक एक धूर्त है\" - ओवेन। ल्यूक ने कहा, \"अगर ल्यूक एक शूरवीर है तो ओवेन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओवेन एक शूरवीर है  \n(2) ल्यूक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: लुकास और डेविड। लुकास ने कहा, \"डेविड एक धूर्त है या डेविड एक शूरवीर है\"। डेविड ने कहा कि लुकास एक धूर्त नहीं है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक शूरवीर है  \n(2) डेविड एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ओवेन और सेबेस्टियन। ओवेन ने टिप्पणी की, \"सेबेस्टियन एक शूरवीर है या सेबेस्टियन एक धूर्त है\"। सेबेस्टियन ने कहा कि ओवेन एक धूर्त है या ओवेन एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओवेन एक शूरवीर है  \n(2) सेबेस्टियन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ज़ोई और हेनरी। ज़ोई ने कहा, \"ज़ोई एक शूरवीर है यदि और केवल यदि हेनरी एक धूर्त है\"। हेनरी ने कहा कि हेनरी एक शूरवीर है यदि और केवल यदि ज़ोई एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ज़ोई एक शूरवीर है  \n(2) हेनरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एमिली और बेंजामिन। एमिली ने कहा, \"बेंजामिन शूरवीर नहीं है\"। बेंजामिन ने कहा, \"एमिली शूरवीर है यदि और केवल यदि एमिली धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक शूरवीर है  \n(2) बेंजामिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: लिली और लोगन। लिली ने आपको बताया कि लोगन एक शूरवीर है या लिली एक शूरवीर है। \"लिली एक धूर्त है यदि और केवल यदि लोगन एक शूरवीर है,\" लोगन ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लिली एक धूर्त है  \n(2) लोगन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एवरी और ईथन। एवरी ने कहा: \"अगर ईथन एक धूर्त है तो ईथन एक शूरवीर है\"। ईथन ने कहा, \"एवरी एक धूर्त है या ईथन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक शूरवीर है  \n(2) ईथन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: अमेलिया और इसाबेला। अमेलिया ने आपको बताया कि अमेलिया एक शूरवीर है यदि और केवल यदि इसाबेला एक शूरवीर है। इसाबेला ने कहा, \"अमेलिया एक शूरवीर है और इसाबेला एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) अमेलिया एक शूरवीर है  \n(2) इसाबेला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: बेंजामिन और विक्टोरिया। \"विक्टोरिया एक धूर्त नहीं है,\" बेंजामिन ने कहा। विक्टोरिया ने कहा कि अगर विक्टोरिया एक शूरवीर है तो बेंजामिन एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक शूरवीर है  \n(2) विक्टोरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: पेनलोप और अमेलिया। जैसे पेनलोप ने कहा, \"अगर पेनलोप एक शूरवीर है तो अमेलिया एक शूरवीर है\"। अमेलिया ने कहा, \"अगर पेनलोप एक धूर्त है तो अमेलिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक शूरवीर है  \n(2) अमेलिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: शार्लट और सोफिया। शार्लट ने टिप्पणी की, \"सोफिया एक धूर्त है यदि और केवल यदि शार्लट एक शूरवीर है\"। सोफिया के अनुसार, \"शार्लट एक धूर्त है यदि और केवल यदि सोफिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक धूर्त है  \n(2) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: लुकास और जेम्स। लुकास ने कहा: \"लुकास एक शूरवीर है यदि और केवल यदि जेम्स एक शूरवीर है।\" \"यदि जेम्स एक शूरवीर है तो लुकास एक शूरवीर है,\" जेम्स ने घोषणा की। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) लुकास एक शूरवीर है  \n(2) जेम्स एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एवरी और लियम। एवरी ने टिप्पणी की, \"लियम शूरवीर नहीं है\"। लियम के अनुसार, \"लियम शूरवीर है या एवरी शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक धूर्त है  \n(2) लियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ल्यूक और सैमुएल। ल्यूक ने कहा कि सैमुएल एक धूर्त है यदि और केवल यदि ल्यूक एक शूरवीर है। सैमुएल ने आपको बताया कि सैमुएल एक शूरवीर है यदि और केवल यदि ल्यूक एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) सैमुएल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: सोफिया और जेम्स। \"जेम्स एक शूरवीर है यदि और केवल यदि सोफिया एक शूरवीर है,\" सोफिया ने दावा किया। जेम्स ने asserted किया: \"सोफिया एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) जेम्स एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ग्रेस और एलिज़ाबेथ। ग्रेस ने कहा, \"एलिज़ाबेथ एक धूर्त नहीं है।\" \"ग्रेस एक धूर्त है और ग्रेस एक शूरवीर है,\" एलिज़ाबेथ ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक धूर्त है  \n(2) एलिज़ाबेथ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: स्कारलेट और अबिगेल। स्कारलेट ने कहा, \"अबिगेल एक शूरवीर है\"। अबिगेल के अनुसार, \"स्कारलेट एक धूर्त है या स्कारलेट एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) स्कारलेट एक शूरवीर है  \n(2) अबिगेल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एला और एवलिन। \"एवलिन एक धूर्त है या एवलिन एक शूरवीर है\" - एला। एवलिन ने कहा: \"एला एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक शूरवीर है  \n(2) एवलिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ओवेन और आरिया। ओवेन ने कहा कि आरिया एक धूर्त है यदि और केवल यदि आरिया एक शूरवीर है। आरिया ने कहा, \"ओवेन एक शूरवीर है या ओवेन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओवेन एक धूर्त है  \n(2) आरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ओलिविया और इसाबेला। ओलिविया ने कहा, \"इसाबेला एक धूर्त है या इसाबेला एक शूरवीर है\"। इसाबेला ने कहा कि ओलिविया एक शूरवीर है या इसाबेला एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक शूरवीर है  \n(2) इसाबेला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: आरिया और एलिज़ाबेथ। आरिया ने कहा, \"एलिज़ाबेथ एक धूर्त नहीं है\"। एलिज़ाबेथ ने टिप्पणी की, \"आरिया एक धूर्त है यदि और केवल यदि एलिज़ाबेथ एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) आरिया एक धूर्त है  \n(2) एलिज़ाबेथ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ईथन और ओलिविया। ईथन ने आपको बताया कि ओलिविया एक धूर्त है यदि और केवल यदि ओलिविया एक शूरवीर है। \"ईथन एक धूर्त है या ओलिविया एक शूरवीर है,\" ओलिविया ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक धूर्त है  \n(2) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: इसाबेला और ज़ोई। \"अगर ज़ोई एक धूर्त है तो ज़ोई एक शूरवीर है,\" इसाबेला ने दावा किया। ज़ोई ने कहा, \"इसाबेला एक धूर्त है और ज़ोई एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक धूर्त है  \n(2) ज़ोई एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: सोफिया और स्कारलेट। सोफिया ने कहा कि स्कारलेट एक शूरवीर है या स्कारलेट एक धूर्त है। \"अगर सोफिया एक धूर्त है तो सोफिया एक शूरवीर है\" - स्कारलेट। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) स्कारलेट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: डेविड और मिया। जैसे डेविड ने कहा, \"मिया एक धूर्त है या डेविड एक शूरवीर है\"। मिया ने आपको बताया कि डेविड एक शूरवीर है और डेविड एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक शूरवीर है  \n(2) मिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: विक्टोरिया और जैक्सन। विक्टोरिया ने कहा कि जैक्सन एक शूरवीर है यदि और केवल यदि जैक्सन एक धूर्त है। जैक्सन ने कहा कि विक्टोरिया एक शूरवीर है या विक्टोरिया एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विक्टोरिया एक धूर्त है  \n(2) जैक्सन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ज़ोई और एला। ज़ोई ने कहा कि ज़ोई एक शूरवीर है और एला एक शूरवीर है। एला के अनुसार, \"अगर ज़ोई एक शूरवीर है तो ज़ोई एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ज़ोई एक धूर्त है  \n(2) एला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एवा और हार्पर। एवा ने कहा, \"हार्पर एक शूरवीर है यदि और केवल यदि एवा एक शूरवीर है\"। हार्पर के अनुसार, \"एवा एक शूरवीर है यदि और केवल यदि हार्पर एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एवा एक शूरवीर है  \n(2) हार्पर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एला और आरिया। एला ने कहा, \"आरिया एक शूरवीर है यदि और केवल यदि आरिया एक धूर्त है\"। आरिया ने asserted किया: \"एला एक शूरवीर है और एला एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक धूर्त है  \n(2) आरिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: विलियम और हेनरी। जैसे विलियम ने कहा, \"विलियम एक शूरवीर है यदि और केवल यदि हेनरी एक धूर्त है\"। हेनरी को यह कहते हुए सुना गया, \"यदि विलियम एक धूर्त है तो विलियम एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक धूर्त है  \n(2) हेनरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: विलियम और एवा। जैसे विलियम ने कहा, \"एवा एक धूर्त है या एवा एक शूरवीर है\"। \"अगर विलियम एक शूरवीर है तो विलियम एक धूर्त है\" - एवा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) एवा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ओलिवर और याकूब। ओलिवर ने टिप्पणी की, \"ओलिवर एक शूरवीर है और याकूब एक धूर्त है\"। याकूब ने कहा, \"ओलिवर एक शूरवीर है यदि और केवल यदि याकूब एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिवर एक शूरवीर है  \n(2) याकूब एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: मेसन और विलियम। मेसन ने आपको बताया कि विलियम एक धूर्त है। विलियम के एक बयान में: \"मेसन एक शूरवीर है और विलियम एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक शूरवीर है  \n(2) विलियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: आरिया और औरोरा। \"औरोरा एक शूरवीर है\" - आरिया। \"आरिया एक धूर्त है और आरिया एक शूरवीर है,\" औरोरा ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) आरिया एक धूर्त है  \n(2) औरोरा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ओलिवर और एवलिन। ओलिवर ने कहा, \"अगर ओलिवर एक शूरवीर है तो एवलिन एक शूरवीर है।\" \"ओलिवर एक शूरवीर है और एवलिन एक शूरवीर है\" - एवलिन। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिवर एक शूरवीर है  \n(2) एवलिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: सोफिया और एवलिन। \"एवलिन एक शूरवीर है या एवलिन एक धूर्त है\" - सोफिया। एवलिन के एक बयान में: \"एवलिन एक शूरवीर है और सोफिया एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) एवलिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: जैक्सन और एम्मा। जैक्सन के एक बयान में: \"जैक्सन एक शूरवीर है यदि और केवल यदि एम्मा एक शूरवीर है\"। \"एम्मा एक शूरवीर है यदि और केवल यदि जैक्सन एक शूरवीर है\" - एम्मा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक शूरवीर है  \n(2) एम्मा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एमिली और मेसन। एमिली ने कहा कि मेसन एक शूरवीर है और एमिली एक शूरवीर है। मेसन ने कहा: \"अगर एमिली एक शूरवीर है तो एमिली एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक धूर्त है  \n(2) मेसन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: लोगन और शार्लट। जैसे लोगन ने कहा, \"शार्लट एक धूर्त है यदि और केवल यदि शार्लट एक शूरवीर है\"। शार्लट ने कहा, \"यदि लोगन एक शूरवीर है तो लोगन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक धूर्त है  \n(2) शार्लट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: हार्पर और हेनरी। \"अगर हेनरी एक धूर्त है तो हार्पर एक शूरवीर है\" - हार्पर। हेनरी ने कहा, \"हेनरी एक शूरवीर है यदि और केवल यदि हार्पर एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक धूर्त है  \n(2) हेनरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एम्मा और एवलिन। एम्मा ने कहा, \"एवलिन एक शूरवीर है यदि और केवल यदि एम्मा एक शूरवीर है\"। एवलिन ने टिप्पणी की, \"यदि एम्मा एक धूर्त है तो एम्मा एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एम्मा एक शूरवीर है  \n(2) एवलिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: क्लोई और ईथन। क्लोई ने कहा कि ईथन एक शूरवीर है या ईथन एक धूर्त है। ईथन के शब्दों में: \"क्लोई एक धूर्त है और ईथन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) क्लोई एक शूरवीर है  \n(2) ईथन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एलिज़ाबेथ और माइकल। एलिज़ाबेथ ने आपको बताया कि माइकल एक धूर्त है और माइकल एक शूरवीर है। जैसे माइकल ने कहा, \"एलिज़ाबेथ एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक धूर्त है  \n(2) माइकल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: क्लोई और ग्रेस। क्लोई को यह कहते हुए सुना गया, \"क्लोई एक शूरवीर है और ग्रेस एक धूर्त है\"। \"क्लोई एक धूर्त है या क्लोई एक शूरवीर है\" - ग्रेस। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) क्लोई एक धूर्त है  \n(2) ग्रेस एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: लोगन और एमिली। लोगन ने कहा कि लोगन एक शूरवीर है या एमिली एक धूर्त है। एमिली ने कहा, \"लोगन एक धूर्त है यदि और केवल यदि लोगन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक शूरवीर है  \n(2) एमिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एला और लोगन। एला ने कहा: \"एला एक शूरवीर है यदि और केवल यदि लोगन एक शूरवीर है\"। लोगन के शब्दों में: \"लोगन एक शूरवीर है और एला एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एला एक धूर्त है  \n(2) लोगन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: सोफिया और एला। सोफिया के शब्दों में: \"एला एक धूर्त है यदि और केवल यदि एला एक शूरवीर है\"। एला ने आपको बताया कि यदि सोफिया एक धूर्त है तो सोफिया एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) एला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: नूह और एवा। नूह ने टिप्पणी की, \"एवा एक शूरवीर नहीं है\"। एवा ने कहा, \"नूह एक शूरवीर है या नूह एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक धूर्त है  \n(2) एवा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: मेसन और एम्मा। मेसन को यह कहते हुए सुना गया, \"मेसन एक शूरवीर है या एम्मा एक धूर्त है\"। एम्मा ने कहा, \"अगर मेसन एक धूर्त है तो मेसन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक शूरवीर है  \n(2) एम्मा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: राइली और ईथन। राइली ने कहा, \"ईथन एक धूर्त है यदि और केवल यदि राइली एक शूरवीर है।\" \"राइली एक शूरवीर है यदि और केवल यदि ईथन एक शूरवीर है,\" ईथन ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक शूरवीर है  \n(2) ईथन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: जेम्स और स्कारलेट। जेम्स ने कहा, \"स्कारलेट एक धूर्त है या जेम्स एक शूरवीर है\"। स्कारलेट के अनुसार, \"अगर जेम्स एक धूर्त है तो जेम्स एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) स्कारलेट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: ओलिवर और एम्मा। जैसे ओलिवर ने कहा, \"ओलिवर एक शूरवीर है या एम्मा एक धूर्त है।\" \"ओलिवर एक शूरवीर है यदि और केवल यदि ओलिवर एक धूर्त है,\" एम्मा ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिवर एक शूरवीर है  \n(2) एम्मा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: एम्मा और राइली। एम्मा ने कहा, \"अगर एम्मा एक शूरवीर है तो राइली एक शूरवीर है\"। राइली ने आपको बताया कि अगर एम्मा एक धूर्त है तो एम्मा एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एम्मा एक शूरवीर है  \n(2) राइली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: लियम और सैमुएल। लियम ने कहा, \"अगर सैमुएल एक धूर्त है तो सैमुएल एक शूरवीर है।\" \"लियम एक शूरवीर है यदि और केवल यदि लियम एक धूर्त है,\" सैमुएल ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक धूर्त है  \n(2) सैमुएल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 2 निवासियों से मिलते हैं: याकूब और ओलिविया। याकूब ने कहा, \"याकूब एक शूरवीर है या ओलिविया एक शूरवीर है।\" ओलिविया के अनुसार, \"यदि ओलिविया एक शूरवीर है तो याकूब एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) याकूब एक शूरवीर है  \n(2) ओलिविया एक शूरवीर है"
    }
]