[
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：伊森、阿比盖尔、大卫和诺亚。伊森声称：“大卫是无赖或者阿比盖尔是无赖。”阿比盖尔被听到说：“如果阿比盖尔是骑士，那么大卫就是骑士。”大卫说：“诺亚是骑士，而伊森是无赖。”诺亚评论道：“阿比盖尔是无赖当且仅当伊森是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是无赖  \n(2) 阿比盖尔是骑士  \n(3) 大卫是骑士  \n(4) 诺亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：伊丽莎白、索菲娅、梅森和阿比盖尔。伊丽莎白说：“阿比盖尔是无赖，梅森是无赖。”索菲娅说：“如果阿比盖尔是无赖，那么阿比盖尔就是骑士。”梅森宣称：“梅森是骑士，阿比盖尔是骑士。”阿比盖尔提到：“梅森是骑士，阿比盖尔是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是骑士  \n(2) 索菲娅是无赖  \n(3) 梅森是无赖  \n(4) 阿比盖尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：卢卡斯、哈珀、阿梅莉亚和艾米莉。卢卡斯说：“卢卡斯是骑士或者哈珀是骑士。”哈珀宣称：“卢卡斯是骑士或者卢卡斯是无赖。”阿梅莉亚断言：“卢卡斯是骑士并且哈珀是无赖。”艾米莉的陈述是：“如果哈珀是无赖，那么阿梅莉亚就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是一名骑士  \n(2) 哈珀是一名骑士  \n(3) 艾梅莉亚是一名无赖  \n(4) 艾米莉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：约瑟夫、索菲娅、威廉和克洛伊。约瑟夫声称：“如果约瑟夫是骑士，那么威廉就是骑士。”索菲娅说：“约瑟夫是骑士或者克洛伊是骑士。”威廉的陈述是：“约瑟夫不是无赖。”克洛伊被听到说：“威廉不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是一名骑士  \n(2) 索菲娅是一名骑士  \n(3) 威廉是一名骑士  \n(4) 克洛伊是一名骑士"
    },
    {
        "quiz": "一个非常特别的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：斯嘉丽、哈珀、亨利和亚历山大。斯嘉丽说：“亚历山大是无赖当且仅当亚历山大是骑士。”哈珀被听到说：“如果斯嘉丽是骑士，那么哈珀就是骑士。”亨利评论道：“哈珀是骑士或者亚历山大是无赖。”亚历山大提到：“亨利不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 斯嘉丽是无赖  \n(2) 哈珀是骑士  \n(3) 亨利是骑士  \n(4) 亚历山大是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：赖利、欧文、奥利弗和阿梅莉亚。赖利说阿梅莉亚不是无赖。欧文告诉你奥利弗是无赖或者阿梅莉亚是无赖。正如奥利弗所说：“赖利是骑士，阿梅莉亚是无赖。”阿梅莉亚表示奥利弗是骑士，阿梅莉亚是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是无赖  \n(2) 欧文是骑士  \n(3) 奥利弗是无赖  \n(4) 阿梅莉亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：艾米莉、伊丽莎白、约瑟夫和利亚姆。艾米莉说：“利亚姆不是无赖。”伊丽莎白评论道：“如果艾米莉是无赖，那么约瑟夫就是骑士。”约瑟夫说：“如果利亚姆是无赖，那么伊丽莎白就是无赖。”利亚姆断言：“约瑟夫是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是一名骑士  \n(2) 伊丽莎白是一名骑士  \n(3) 约瑟夫是一名骑士  \n(4) 利亚姆是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：哈珀、阿比盖尔、艾娃和伊森。哈珀说：“如果艾娃是无赖，那么阿比盖尔就是骑士。”阿比盖尔则说：“艾娃是无赖。”艾娃告诉你：“如果艾娃是骑士，那么哈珀就是骑士。”伊森被听到说：“艾娃不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是一名骑士  \n(2) 阿比盖尔是一名无赖  \n(3) 艾娃是一名骑士  \n(4) 伊森是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四位居民：艾登、梅森、佐伊和亚历山大。艾登说：“亚历山大不是骑士。”梅森提到：“艾登是骑士或者亚历山大是骑士。”佐伊说：“艾登是骑士或者梅森是骑士。”亚历山大表示佐伊是无赖或者佐伊是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是无赖  \n(2) 梅森是骑士  \n(3) 佐伊是骑士  \n(4) 亚历山大是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：杰克逊、维多利亚、约瑟夫和伊森。杰克逊说：“伊森是骑士。”维多利亚说伊森是无赖，杰克逊是无赖。约瑟夫评论道：“杰克逊是无赖当且仅当伊森是无赖。”伊森评论道：“维多利亚是骑士或者约瑟夫是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是一名骑士  \n(2) 维多利亚是一个无赖  \n(3) 约瑟夫是一名骑士  \n(4) 伊森是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：莉莉、利亚姆、佩内洛普和夏洛特。莉莉宣称：“利亚姆是无赖，而利亚姆是骑士。”利亚姆表示：“如果利亚姆是骑士，那么夏洛特就是无赖。”根据佩内洛普的说法，“利亚姆是无赖。”夏洛特说：“利亚姆是无赖或者夏洛特是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是无赖  \n(2) 利亚姆是骑士  \n(3) 佩内洛普是无赖  \n(4) 夏洛特是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：塞巴斯蒂安、塞缪尔、赖利和洛根。正如塞巴斯蒂安所说：“塞缪尔是骑士，而洛根是无赖。”在塞缪尔的陈述中：“当且仅当塞缪尔是骑士时，塞巴斯蒂安是骑士。”赖利声称：“如果洛根是骑士，那么赖利就是骑士。”洛根声称：“赖利是无赖或者塞巴斯蒂安是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）塞巴斯蒂安是一名骑士  \n（2）塞缪尔是一名骑士  \n（3）赖利是一名骑士  \n（4）洛根是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：约瑟夫、哈珀、雅各布和莉莉。约瑟夫说：“莉莉是个无赖。”哈珀被听到说：“莉莉是个无赖。”雅各布说：“莉莉是个无赖，雅各布是个骑士。”莉莉说：“哈珀是个骑士，或者雅各布是个无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是无赖  \n(2) 哈珀是无赖  \n(3) 雅各布是无赖  \n(4) 莉莉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四位居民：詹姆斯、艾娃、洛根和亚历山大。詹姆斯表示，亚历山大是骑士当且仅当艾娃是无赖。艾娃被听到说：“洛根是骑士当且仅当亚历山大是骑士。”洛根告诉你，洛根是骑士当且仅当詹姆斯是无赖。亚历山大指出：“如果洛根是无赖，那么亚历山大就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）詹姆斯是无赖  \n（2）艾娃是骑士  \n（3）洛根是骑士  \n（4）亚历山大是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：欧文、马修、伊芙琳和威廉。“马修是骑士，”欧文宣称。马修说威廉是无赖，伊芙琳也是无赖。伊芙琳表示，如果伊芙琳是骑士，那么欧文就是无赖。威廉断言：“马修是骑士当且仅当伊芙琳是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是无赖  \n(2) 马修是无赖  \n(3) 伊芙琳是骑士  \n(4) 威廉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：艾拉、夏洛特、佐伊和塞缪尔。艾拉说：“佐伊是骑士，塞缪尔是骑士。”夏洛特声称：“艾拉是无赖或者佐伊是骑士。”佐伊被听到说：“如果夏洛特是无赖，那么艾拉就是骑士。”塞缪尔说佐伊是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是无赖  \n(2) 夏洛特是骑士  \n(3) 佐伊是骑士  \n(4) 塞缪尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：伊丽莎白、克洛伊、本杰明和利亚姆。伊丽莎白评论道：“克洛伊是无赖，而本杰明是骑士。”克洛伊指出：“伊丽莎白是骑士当且仅当利亚姆是无赖。”在本杰明的话中：“利亚姆是无赖或者克洛伊是无赖。”在利亚姆的话中：“利亚姆是骑士，而本杰明是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是无赖  \n(2) 克洛伊是骑士  \n(3) 本杰明是无赖  \n(4) 利亚姆是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：丹尼尔、卢卡斯、克洛伊和亚历山大。“亚历山大是骑士”——丹尼尔说。卢卡斯指出：“亚历山大是骑士。” “丹尼尔是骑士，而亚历山大是无赖”——克洛伊说。亚历山大告诉你，克洛伊是骑士，而亚历山大是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是无赖  \n(2) 卢卡斯是无赖  \n(3) 克洛伊是无赖  \n(4) 亚历山大是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：佩内洛普、马修、本杰明和塞巴斯蒂安。佩内洛普宣称：“如果塞巴斯蒂安是无赖，那么佩内洛普就是骑士。”马修说：“如果马修是骑士，那么本杰明就是无赖。”本杰明评论道：“佩内洛普是无赖当且仅当塞巴斯蒂安是骑士。”塞巴斯蒂安说：“佩内洛普是骑士或者马修是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是一名骑士  \n(2) 马修是一名骑士  \n(3) 本杰明是一名无赖  \n(4) 塞巴斯蒂安是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：詹姆斯、伊森、塞缪尔和艾米莉。“艾米莉不是骑士”——詹姆斯说。伊森说艾米莉是无赖。塞缪尔声明：“伊森是骑士，艾米莉是骑士。”艾米莉被听到说：“塞缪尔是骑士或者塞缪尔是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是一个无赖  \n(2) 伊森是一个无赖  \n(3) 塞缪尔是一个无赖  \n(4) 艾米莉是一个骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：大卫、梅森、塞缪尔和丹尼尔。大卫宣称：“如果梅森是骑士，那么塞缪尔就是无赖。”梅森宣称：“当且仅当大卫是无赖时，梅森才是骑士。”塞缪尔评论道：“丹尼尔是骑士或者大卫是无赖。”丹尼尔表示大卫是骑士，塞缪尔是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 大卫是无赖  \n(2) 梅森是骑士  \n(3) 塞缪尔是骑士  \n(4) 丹尼尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：艾米莉、阿比盖尔、哈珀和詹姆斯。艾米莉被听到说：“如果詹姆斯是骑士，那么詹姆斯就是无赖。”阿比盖尔评论道：“詹姆斯是无赖。”哈珀说：“如果且仅如果哈珀是骑士，艾米莉就是无赖。”詹姆斯说：“如果哈珀是骑士，那么阿比盖尔就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是无赖  \n(2) 阿比盖尔是无赖  \n(3) 哈珀是无赖  \n(4) 詹姆斯是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：卢卡斯、索菲娅、索菲娅和迈克尔。卢卡斯说：“如果索菲娅是骑士，那么索菲娅就是无赖。”索菲娅声称：“卢卡斯是骑士，索菲娅是骑士。”索菲娅声称：“如果索菲娅是无赖，那么迈克尔就是无赖。”迈克尔说：“如果索菲娅是无赖，那么索菲娅就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是一名骑士  \n(2) 索菲娅是一名无赖  \n(3) 索菲娅是一名无赖  \n(4) 迈克尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：米娅、伊芙琳、索菲娅和夏洛特。米娅说道：“索菲娅是无赖或者夏洛特是无赖。”伊芙琳评论道：“米娅是无赖或者米娅是骑士。”索菲娅说：“如果伊芙琳是骑士，那么夏洛特就是无赖。”夏洛特说：“米娅不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是一名骑士  \n(2) 伊芙琳是一名骑士  \n(3) 索菲娅是一名骑士  \n(4) 夏洛特是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：格蕾丝、诺亚、奥利弗和夏洛特。格蕾丝声称：“奥利弗是无赖，夏洛特是骑士。”诺亚评论道：“奥利弗是骑士。”奥利弗告诉你，夏洛特是无赖当且仅当夏洛特是骑士。夏洛特声明：“奥利弗是无赖或者格蕾丝是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是一名骑士  \n(2) 诺亚是一个无赖  \n(3) 奥利弗是一个无赖  \n(4) 夏洛特是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：詹姆斯、艾弗里、伊丽莎白和塞巴斯蒂安。詹姆斯评论道：“塞巴斯蒂安不是无赖。”艾弗里说：“詹姆斯是骑士或者伊丽莎白是骑士。”伊丽莎白说：“伊丽莎白是骑士。”塞巴斯蒂安被听到说：“如果伊丽莎白是骑士，那么詹姆斯就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是一名骑士  \n(2) 艾弗里是一名骑士  \n(3) 伊丽莎白是一名无赖  \n(4) 塞巴斯蒂安是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：格蕾丝、伊森、哈珀和利亚姆。格蕾丝的陈述是：“伊森是无赖或者利亚姆是无赖。”伊森说：“格蕾丝不是无赖。”哈珀说：“如果格蕾丝是无赖，那么哈珀就是骑士。”根据利亚姆的说法：“利亚姆是骑士，哈珀是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是一名骑士  \n(2) 伊森是一名骑士  \n(3) 哈珀是一名骑士  \n(4) 利亚姆是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：伊芙琳、阿丽亚、伊丽莎白和艾米莉。根据伊芙琳的说法，“伊丽莎白不是骑士。”阿丽亚声称：“艾米莉不是骑士。”伊丽莎白宣称：“阿丽亚是无赖，阿丽亚是骑士。”艾米莉宣称：“伊丽莎白是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是一名骑士  \n(2) 阿丽亚是一个无赖  \n(3) 伊丽莎白是一个无赖  \n(4) 艾米莉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：本杰明、艾娃、诺亚和斯嘉丽。本杰明说：“斯嘉丽是一个无赖。”艾娃声明：“斯嘉丽是一个无赖，而本杰明是一个骑士。”诺亚说，如果且仅如果斯嘉丽是一个骑士，那么诺亚就是一个骑士。斯嘉丽评论道：“诺亚是一个无赖或者艾娃是一个骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是无赖  \n(2) 艾娃是无赖  \n(3) 诺亚是无赖  \n(4) 斯嘉丽是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：梅森、伊莎贝拉、艾米莉和维多利亚。梅森告诉你，伊莎贝拉不是骑士。伊莎贝拉说：“如果维多利亚是无赖，那么维多利亚就是骑士。”艾米莉评论道：“梅森不是无赖。”维多利亚说：“伊莎贝拉是无赖或者艾米莉是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是无赖  \n(2) 伊莎贝拉是骑士  \n(3) 艾米莉是无赖  \n(4) 维多利亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：艾拉、利亚姆、赖利和莉莉。艾拉宣称：“利亚姆是个无赖。”利亚姆告诉你，艾拉是个骑士，赖利是个无赖。赖利说：“利亚姆是个骑士或者艾拉是个骑士。”莉莉则说：“艾拉是个骑士当且仅当利亚姆是个无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是一名骑士  \n(2) 利亚姆是一名无赖  \n(3) 赖利是一名骑士  \n(4) 莉莉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：本杰明、诺亚、伊莎贝拉和索菲娅。本杰明说：“如果索菲娅是骑士，那么伊莎贝拉就是骑士。”诺亚被听到说：“索菲娅不是无赖。”伊莎贝拉提到：“本杰明是无赖。”索菲娅宣称：“伊莎贝拉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是一名骑士  \n(2) 诺亚是一个无赖  \n(3) 伊莎贝拉是一个无赖  \n(4) 索菲娅是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：迈克尔、赖利、马修和米娅。迈克尔宣称：“如果赖利是骑士，那么迈克尔就是骑士。”赖利说：“马修是骑士，赖利是骑士。”马修声称：“如果赖利是骑士，那么赖利就是无赖。”米娅被听到说：“马修是骑士或者米娅是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是一名骑士  \n(2) 赖利是一个无赖  \n(3) 马修是一名骑士  \n(4) 米娅是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：詹姆斯、卢克、奥萝拉和斯嘉丽。詹姆斯评论道：“卢克是无赖，奥萝拉是无赖。”卢克指出：“詹姆斯不是无赖。”奥萝拉告诉你，詹姆斯是无赖当且仅当卢克是无赖。斯嘉丽告诉你，卢克是无赖或者斯嘉丽是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）詹姆斯是无赖  \n（2）卢克是无赖  \n（3）奥萝拉是骑士  \n（4）斯嘉丽是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：艾登、米娅、伊丽莎白和塞巴斯蒂安。“米娅是骑士，”艾登说。“艾登是骑士或者塞巴斯蒂安是无赖，”米娅声称。伊丽莎白被听到说：“当且仅当米娅是骑士时，艾登才是骑士。”塞巴斯蒂安被听到说：“米娅是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是一名骑士  \n(2) 米娅是一名骑士  \n(3) 伊丽莎白是一名骑士  \n(4) 塞巴斯蒂安是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：雅各布、利亚姆、艾米莉和索菲娅。雅各布声称：“索菲娅是无赖或者利亚姆是骑士。”利亚姆说：“艾米莉是骑士或者雅各布是骑士。”艾米莉指出：“索菲娅是骑士或者索菲娅是无赖。”索菲娅宣称：“艾米莉是骑士或者艾米莉是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）雅各布是一名骑士  \n（2）利亚姆是一名骑士  \n（3）艾米莉是一名骑士  \n（4）索菲娅是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：洛根、艾拉、伊莎贝拉和欧文。洛根说：“欧文是无赖，伊莎贝拉是骑士。”艾拉指出：“伊莎贝拉是无赖。”伊莎贝拉被听到说：“洛根是无赖或者艾拉是骑士。”欧文则说：“欧文是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是无赖  \n(2) 艾拉是无赖  \n(3) 伊莎贝拉是骑士  \n(4) 欧文是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：卢卡斯、奥利维亚、阿丽亚和夏洛特。卢卡斯声称：“奥利维亚是骑士当且仅当阿丽亚是无赖。”在奥利维亚的话中：“夏洛特是骑士当且仅当阿丽亚是骑士。”阿丽亚声称：“卢卡斯是无赖，奥利维亚是无赖。”夏洛特则评论道：“奥利维亚是无赖或者卢卡斯是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是一名骑士  \n(2) 奥利维亚是一名骑士  \n(3) 阿丽亚是一名无赖  \n(4) 夏洛特是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：梅森、奥萝拉、佩内洛普和卢卡斯。梅森被听到说：“卢卡斯是骑士。”奥萝拉说，如果佩内洛普是骑士，那么佩内洛普就是无赖。佩内洛普指出：“梅森是无赖或者卢卡斯是骑士。”卢卡斯声明：“佩内洛普是骑士，奥萝拉是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是无赖  \n(2) 奥萝拉是无赖  \n(3) 佩内洛普是骑士  \n(4) 卢卡斯是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：詹姆斯、马修、索菲娅和伊芙琳。詹姆斯的陈述是：“马修是无赖或者伊芙琳是无赖。”马修表示索菲娅不是无赖。索菲娅断言：“伊芙琳不是无赖。”在伊芙琳的陈述中：“索菲娅是骑士当且仅当詹姆斯是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是一名骑士  \n(2) 马修是一个无赖  \n(3) 索菲娅是一个无赖  \n(4) 伊芙琳是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：杰克、克洛伊、威廉和卢克。杰克说：“卢克是骑士。”克洛伊说：“杰克是无赖或者威廉是骑士。”威廉评论道：“如果卢克是骑士，那么杰克就是骑士。”卢克说：“杰克是骑士，杰克是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克是无赖  \n(2) 克洛伊是骑士  \n(3) 威廉是骑士  \n(4) 卢克是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：诺亚、索菲娅、伊丽莎白和艾拉。诺亚说索菲娅是骑士。索菲娅说：“诺亚是无赖或者伊丽莎白是骑士。”伊丽莎白说：“如果艾拉是无赖，那么索菲娅就是无赖。”艾拉被听到说：“艾拉是骑士，伊丽莎白是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是一名骑士  \n(2) 索菲娅是一名骑士  \n(3) 伊丽莎白是一名骑士  \n(4) 艾拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：詹姆斯、塞缪尔、亨利和卢克。詹姆斯评论道：“亨利是骑士。”塞缪尔说卢克是无赖。亨利告诉你，塞缪尔是骑士，卢克是骑士。正如卢克所说：“詹姆斯是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是无赖  \n(2) 塞缪尔是骑士  \n(3) 亨利是无赖  \n(4) 卢克是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：艾米莉、洛根、斯嘉丽和梅森。艾米莉说：“洛根不是无赖。”洛根被听到说：“艾米莉是骑士或者梅森是骑士。”斯嘉丽被听到说：“艾米莉是骑士当且仅当梅森是骑士。”梅森说：“斯嘉丽是骑士或者洛根是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是一名骑士  \n(2) 洛根是一名骑士  \n(3) 斯嘉丽是一名骑士  \n(4) 梅森是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：维多利亚、斯嘉丽、伊芙琳和卢卡斯。维多利亚宣称：“卢卡斯是骑士，斯嘉丽是无赖。”斯嘉丽评论道：“斯嘉丽是骑士，伊芙琳是无赖。”伊芙琳说：“维多利亚是骑士。”根据卢卡斯的说法：“如果卢卡斯是骑士，那么伊芙琳就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 维多利亚是一名骑士  \n(2) 斯嘉丽是一名无赖  \n(3) 伊芙琳是一名骑士  \n(4) 卢卡斯是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：欧文、迈克尔、亚历山大和洛根。欧文宣称：“迈克尔不是无赖。”迈克尔被听到说：“欧文是骑士，欧文是无赖。”亚历山大指出：“迈克尔是无赖或者欧文是骑士。”洛根说：“迈克尔是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是无赖  \n(2) 迈克尔是无赖  \n(3) 亚历山大是骑士  \n(4) 洛根是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：丹尼尔、大卫、本杰明和莉莉。丹尼尔说：“如果本杰明是无赖，那么莉莉就是骑士。”大卫声称：“大卫是骑士或者莉莉是无赖。”本杰明评论道：“丹尼尔不是骑士。”莉莉告诉你大卫不是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）丹尼尔是一名骑士  \n（2）大卫是一名骑士  \n（3）本杰明是一名无赖  \n（4）莉莉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：维多利亚、本杰明、塞巴斯蒂安和索菲娅。维多利亚说：“塞巴斯蒂安是骑士当且仅当塞巴斯蒂安是无赖。”本杰明说索菲娅是骑士，而索菲娅是无赖。塞巴斯蒂安说：“如果本杰明是无赖，那么维多利亚就是骑士。”索菲娅被听到说：“本杰明是骑士或者维多利亚是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 维多利亚是无赖  \n(2) 本杰明是无赖  \n(3) 塞巴斯蒂安是无赖  \n(4) 索菲娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：大卫、佐伊、利亚姆和威廉。大卫说，如果且仅如果利亚姆是无赖，那么威廉就是无赖。佐伊声明：“威廉是无赖，而大卫是骑士。”利亚姆告诉你，如果且仅如果威廉是无赖，那么威廉就是骑士。威廉告诉你，如果且仅如果利亚姆是骑士，那么利亚姆就是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 大卫是一名骑士  \n(2) 佐伊是一名骑士  \n(3) 利亚姆是一名无赖  \n(4) 威廉是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：艾登、斯嘉丽、迈克尔和米娅。“如果米娅是骑士，那么米娅就是无赖”——艾登。斯嘉丽评论道：“米娅是骑士或者斯嘉丽是骑士。” “艾登是骑士或者斯嘉丽是骑士”——迈克尔。“迈克尔不是无赖”——米娅。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是无赖  \n(2) 斯嘉丽是骑士  \n(3) 迈克尔是骑士  \n(4) 米娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：本杰明、哈珀、卢克和欧文。本杰明评论道：“本杰明是骑士当且仅当卢克是无赖。”哈珀说：“欧文不是无赖。”卢克宣称：“本杰明是无赖，欧文是骑士。”欧文声称：“本杰明不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是一名骑士  \n(2) 哈珀是一个无赖  \n(3) 卢克是一个无赖  \n(4) 欧文是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：艾娃、丹尼尔、亨利和大卫。艾娃说亨利是无赖当且仅当亨利是骑士。丹尼尔说艾娃是骑士或者艾娃是无赖。“如果大卫是无赖，那么丹尼尔就是骑士，”亨利提到。大卫评论道：“亨利不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是无赖  \n(2) 丹尼尔是骑士  \n(3) 亨利是骑士  \n(4) 大卫是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：塞巴斯蒂安、洛根、艾弗里和丹尼尔。塞巴斯蒂安告诉你他是骑士。洛根被听到说：“艾弗里是无赖当且仅当塞巴斯蒂安是无赖。”艾弗里评论道：“如果洛根是无赖，那么塞巴斯蒂安就是骑士。”丹尼尔表示塞巴斯蒂安是无赖，而丹尼尔是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞巴斯蒂安是一名骑士  \n(2) 洛根是一名骑士  \n(3) 艾弗里是一名骑士  \n(4) 丹尼尔是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：威廉、艾玛、格蕾丝和阿丽亚。威廉说：“威廉是骑士，阿丽亚是骑士。”艾玛说：“格蕾丝是无赖。”格蕾丝提到：“如果威廉是无赖，那么阿丽亚是骑士。”阿丽亚被听到说：“如果格蕾丝是骑士，那么威廉是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是无赖  \n(2) 艾玛是无赖  \n(3) 格蕾丝是骑士  \n(4) 阿丽亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：艾拉、奥利弗、约瑟夫和艾娃。艾拉说艾拉是骑士，奥利弗是无赖。奥利弗宣称：“如果奥利弗是骑士，那么约瑟夫就是骑士。”有人听到约瑟夫说：“艾拉不是骑士。”艾娃告诉你，艾娃是骑士或者艾拉是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是无赖  \n(2) 奥利弗是骑士  \n(3) 约瑟夫是骑士  \n(4) 艾娃是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：格蕾丝、大卫、阿丽亚和米娅。格蕾丝被听到说：“如果米娅是无赖，那么阿丽亚就是骑士。”大卫告诉你：“如果大卫是骑士，那么格蕾丝就是无赖。”阿丽亚断言：“米娅是骑士当且仅当大卫是骑士。”米娅则说：“大卫不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是无赖  \n(2) 大卫是骑士  \n(3) 阿丽亚是无赖  \n(4) 米娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：奥利弗、佩内洛普、维多利亚和塞缪尔。奥利弗说，如果佩内洛普是骑士，那么塞缪尔就是无赖。佩内洛普被听到说：“塞缪尔是无赖或者佩内洛普是骑士。”维多利亚评论道：“佩内洛普是无赖。”塞缪尔表示维多利亚是无赖，佩内洛普也是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利弗是一名骑士  \n(2) 佩内洛普是一名骑士  \n(3) 维多利亚是一名无赖  \n(4) 塞缪尔是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：维多利亚、艾弗里、阿比盖尔和梅森。维多利亚说：“阿比盖尔是骑士。”艾弗里声称：“梅森是无赖或者阿比盖尔是骑士。”阿比盖尔的陈述是：“阿比盖尔是骑士或者维多利亚是无赖。”梅森说：“维多利亚是无赖而艾弗里是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 维多利亚是一名骑士  \n(2) 艾弗里是一名骑士  \n(3) 阿比盖尔是一名骑士  \n(4) 梅森是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：伊森、亚历山大、索菲娅和佐伊。伊森说：“亚历山大是无赖或者索菲娅是无赖。”亚历山大评论道：“如果佐伊是骑士，那么亚历山大就是骑士。”索菲娅说伊森不是无赖。佐伊评论道：“伊森是无赖或者索菲娅是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是一名骑士  \n(2) 亚历山大是一个无赖  \n(3) 索菲娅是一名骑士  \n(4) 佐伊是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：夏洛特、欧文、诺亚和赖利。夏洛特评论道：“诺亚是一个无赖。”欧文说道：“赖利是骑士当且仅当夏洛特是骑士。”诺亚告诉你欧文是骑士。赖利声明：“诺亚是无赖或者赖利是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是无赖  \n(2) 欧文是骑士  \n(3) 诺亚是骑士  \n(4) 赖利是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：米娅、艾弗里、卢克和诺亚。米娅说，艾弗里是骑士当且仅当艾弗里是无赖。艾弗里说：“卢克是骑士或者卢克是无赖。”卢克被听到说：“米娅是骑士当且仅当艾弗里是无赖。”诺亚声明：“如果卢克是无赖，那么艾弗里就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是无赖  \n(2) 艾弗里是骑士  \n(3) 卢克是骑士  \n(4) 诺亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：奥利弗、伊森、格蕾丝和艾娃。正如奥利弗所说：“伊森是无赖或者格蕾丝是骑士。”伊森则说道：“格蕾丝是无赖而且格蕾丝是骑士。”格蕾丝说：“格蕾丝是骑士而且伊森是骑士。”艾娃说：“格蕾丝是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利弗是一名骑士  \n(2) 伊森是一个无赖  \n(3) 格蕾丝是一个无赖  \n(4) 艾娃是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：欧文、艾玛、亚历山大和奥萝拉。欧文说：“艾玛是骑士或者亚历山大是无赖。”艾玛宣称：“如果亚历山大是骑士，那么欧文就是无赖。”亚历山大告诉你，奥萝拉不是无赖。奥萝拉说艾玛是无赖，亚历山大也是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是一名骑士  \n(2) 艾玛是一名骑士  \n(3) 亚历山大是一名无赖  \n(4) 奥萝拉是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：雅各布、马修、艾弗里和杰克逊。雅各布说：“马修是一个无赖。”马修提到：“当且仅当雅各布是骑士时，马修才是骑士。”根据艾弗里的说法，“雅各布是骑士或者雅各布是无赖。”杰克逊表示雅各布是无赖，艾弗里也是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 雅各布是一名骑士  \n(2) 马修是一个无赖  \n(3) 艾弗里是一名骑士  \n(4) 杰克逊是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：亨利、艾娃、夏洛特和诺亚。亨利评论道：“艾娃是无赖，而亨利是骑士。”艾娃说：“诺亚不是无赖。”夏洛特说：“艾娃不是无赖。”诺亚断言：“亨利是骑士或者亨利是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是无赖  \n(2) 艾娃是骑士  \n(3) 夏洛特是骑士  \n(4) 诺亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：洛根、奥利维亚、艾登和艾玛。正如洛根所说：“奥利维亚是无赖，艾登是无赖。”奥利维亚声称：“如果洛根是无赖，那么洛根就是骑士。”艾登声称：“如果洛根是无赖，那么奥利维亚是无赖。”艾玛说奥利维亚是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是无赖  \n(2) 奥利维亚是无赖  \n(3) 艾登是骑士  \n(4) 艾玛是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：威廉、亨利、佩内洛普和艾娃。威廉声称：“如果佩内洛普是骑士，那么佩内洛普就是无赖。”亨利说：“威廉不是骑士。”佩内洛普声明：“艾娃是骑士。”艾娃表示：“威廉是骑士当且仅当亨利是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 亨利是一个无赖  \n(3) 佩内洛普是一个无赖  \n(4) 艾娃是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：维多利亚、卢卡斯、赖利和克洛伊。维多利亚评论道：“赖利不是骑士。”卢卡斯断言：“如果维多利亚是骑士，那么赖利就是骑士。”赖利说：“如果维多利亚是无赖，那么克洛伊就是无赖。”克洛伊评论道：“卢卡斯不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 维多利亚是无赖  \n(2) 卢卡斯是骑士  \n(3) 赖利是骑士  \n(4) 克洛伊是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：艾米莉、威廉、迈克尔和米娅。艾米莉说：“如果米娅是骑士，那么威廉就是无赖。”威廉宣称：“米娅不是骑士。”迈克尔说：“威廉是无赖。”米娅提到：“如果威廉是骑士，那么迈克尔就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是一名骑士  \n(2) 威廉是一个无赖  \n(3) 迈克尔是一名骑士  \n(4) 米娅是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：亚历山大、索菲娅、梅森和约瑟夫。亚历山大宣称：“索菲娅不是骑士。”索菲娅说：“梅森是无赖。”梅森说：“如果索菲娅是无赖，那么亚历山大就是骑士。”约瑟夫评论道：“亚历山大不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亚历山大是一名骑士  \n(2) 索菲娅是一个无赖  \n(3) 梅森是一名骑士  \n(4) 约瑟夫是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：米娅、索菲娅、维多利亚和威廉。米娅说：“索菲娅是骑士或者索菲娅是无赖。”索菲娅被听到说：“如果米娅是骑士，那么维多利亚就是无赖。”维多利亚说：“索菲娅是无赖或者米娅是骑士。”根据威廉的说法，“维多利亚是无赖，索菲娅是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是骑士  \n(2) 索菲娅是无赖  \n(3) 维多利亚是骑士  \n(4) 威廉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：哈珀、夏洛特、索菲娅和利亚姆。根据哈珀的说法，“夏洛特是骑士”。夏洛特说索菲娅是骑士。“索菲娅是骑士，利亚姆也是骑士，”索菲娅提到。利亚姆的声明是：“索菲娅是骑士当且仅当夏洛特是无赖”。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是无赖  \n(2) 夏洛特是无赖  \n(3) 索菲娅是无赖  \n(4) 利亚姆是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：艾娃、奥利维亚、马修和艾拉。艾娃说：“艾娃是骑士，马修是无赖。”奥利维亚说：“艾拉是骑士或者艾娃是骑士。”马修的陈述是：“如果且仅如果马修是骑士，奥利维亚就是无赖。”艾拉评论道：“马修是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是无赖  \n(2) 奥利维亚是无赖  \n(3) 马修是无赖  \n(4) 艾拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：奥利弗、艾弗里、佐伊和塞巴斯蒂安。奥利弗说：“艾弗里不是无赖。”艾弗里说：“佐伊是无赖，塞巴斯蒂安是无赖。”佐伊评论道：“塞巴斯蒂安不是无赖。”塞巴斯蒂安评论道：“艾弗里是骑士，艾弗里是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利弗是一名骑士  \n(2) 艾弗里是一名骑士  \n(3) 佐伊是一名无赖  \n(4) 塞巴斯蒂安是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：莉莉、艾娃、亨利和阿梅莉亚。莉莉说艾娃是无赖，而莉莉是骑士。有人听到艾娃说：“亨利是无赖当且仅当艾娃是骑士。”亨利告诉你，亨利是骑士或者艾娃是无赖。阿梅莉亚断言：“亨利是无赖当且仅当莉莉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是无赖  \n(2) 艾娃是骑士  \n(3) 亨利是无赖  \n(4) 阿梅莉亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：马修、哈珀、莉莉和洛根。马修宣称：“莉莉是无赖，哈珀是骑士。”根据哈珀的说法：“莉莉是无赖或者莉莉是骑士。”莉莉声称：“马修是骑士，洛根是骑士。”在洛根的话中：“哈珀是骑士，哈珀是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是一名骑士  \n(2) 哈珀是一名骑士  \n(3) 莉莉是一名无赖  \n(4) 洛根是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：梅森、莉莉、卢卡斯和亨利。梅森被听到说：“梅森是骑士，卢卡斯是无赖。”莉莉宣称：“如果梅森是无赖，那么卢卡斯就是无赖。”卢卡斯被听到说：“如果亨利是无赖，那么亨利就是骑士。”亨利指出：“梅森是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是无赖  \n(2) 莉莉是骑士  \n(3) 卢卡斯是无赖  \n(4) 亨利是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：迈克尔、塞巴斯蒂安、艾玛和欧文。迈克尔说：“艾玛是无赖当且仅当欧文是无赖。”塞巴斯蒂安说：“迈克尔是无赖。”艾玛表示迈克尔不是骑士。“迈克尔是无赖当且仅当欧文是骑士。”——欧文。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是无赖  \n(2) 塞巴斯蒂安是骑士  \n(3) 艾玛是骑士  \n(4) 欧文是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：夏洛特、米娅、维多利亚和雅各布。夏洛特说：“米娅是骑士或者雅各布是无赖。”米娅声称：“夏洛特不是骑士。”维多利亚说：“雅各布是骑士。”根据雅各布的说法：“雅各布是骑士，米娅是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是一名骑士  \n(2) 米娅是一个无赖  \n(3) 维多利亚是一个无赖  \n(4) 雅各布是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：卢卡斯、克洛伊、赖利和大卫。卢卡斯宣称：“赖利是骑士当且仅当克洛伊是无赖。”克洛伊评论道：“赖利是骑士，而卢卡斯是无赖。”赖利提到：“卢卡斯是无赖。”大卫说：“赖利是骑士，而克洛伊是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是无赖  \n(2) 克洛伊是骑士  \n(3) 赖利是骑士  \n(4) 大卫是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：米娅、维多利亚、阿梅莉亚和丹尼尔。米娅声称：“米娅是骑士当且仅当维多利亚是无赖。”维多利亚提到：“如果丹尼尔是无赖，那么阿梅莉亚就是无赖。”阿梅莉亚断言：“如果米娅是骑士，那么维多利亚就是骑士。”丹尼尔声称：“丹尼尔是骑士，维多利亚是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是无赖  \n(2) 维多利亚是无赖  \n(3) 阿梅莉亚是骑士  \n(4) 丹尼尔是无赖"
    },
    {
        "quiz": "一个非常特别的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：本杰明、卢卡斯、亚历山大和丹尼尔。本杰明说：“如果卢卡斯是骑士，那么丹尼尔就是骑士。”卢卡斯说：“丹尼尔不是无赖。”亚历山大说：“本杰明是骑士，而卢卡斯是无赖。”丹尼尔的陈述是：“本杰明不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是一名骑士  \n(2) 卢卡斯是一名骑士  \n(3) 亚历山大是一名无赖  \n(4) 丹尼尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：艾娃、利亚姆、洛根和阿梅莉亚。艾娃说，如果且仅如果洛根是骑士，那么利亚姆就是无赖。利亚姆声称：“阿梅莉亚不是骑士。”洛根声称：“如果利亚姆是骑士，那么阿梅莉亚就是无赖。”阿梅莉亚提到：“利亚姆如果且仅如果艾娃是骑士，那么他就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是一名骑士  \n(2) 利亚姆是一个无赖  \n(3) 洛根是一名骑士  \n(4) 阿梅莉亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：索菲娅、米娅、哈珀和艾米莉。索菲娅说：“哈珀是骑士，米娅是骑士。”米娅提到：“如果哈珀是骑士，那么哈珀就是无赖。”哈珀指出：“艾米莉是骑士当且仅当米娅是无赖。”艾米莉宣称：“如果哈珀是骑士，那么米娅是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 米娅是骑士  \n(3) 哈珀是无赖  \n(4) 艾米莉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：迈克尔、杰克逊、伊丽莎白和丹尼尔。迈克尔声称：“伊丽莎白是一个无赖。”杰克逊说：“如果且仅如果迈克尔是骑士，那么丹尼尔就是一个无赖。”伊丽莎白宣称：“如果且仅如果丹尼尔是骑士，那么迈克尔就是骑士。”丹尼尔声称：“杰克逊是一个无赖或者迈克尔是一个无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是一名骑士  \n(2) 杰克逊是一名骑士  \n(3) 伊丽莎白是一个无赖  \n(4) 丹尼尔是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：赖利、阿比盖尔、奥利弗和斯嘉丽。赖利表示斯嘉丽是无赖，而赖利是骑士。阿比盖尔说：“赖利不是骑士。”奥利弗说：“阿比盖尔是无赖，赖利也是无赖。”斯嘉丽声称：“如果奥利弗是骑士，那么阿比盖尔就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是无赖  \n(2) 阿比盖尔是骑士  \n(3) 奥利弗是无赖  \n(4) 斯嘉丽是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：佩内洛普、阿梅莉亚、艾娃和卢卡斯。佩内洛普说：“艾娃不是骑士。”阿梅莉亚评论道：“佩内洛普是无赖或者卢卡斯是骑士。”艾娃指出：“如果阿梅莉亚是无赖，那么佩内洛普就是无赖。”卢卡斯说：“佩内洛普不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是无赖  \n(2) 阿梅莉亚是骑士  \n(3) 艾娃是骑士  \n(4) 卢卡斯是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：塞缪尔、佩内洛普、梅森和大卫。塞缪尔被听到说：“佩内洛普是骑士当且仅当梅森是无赖。”佩内洛普说大卫是无赖，而佩内洛普是骑士。梅森声称：“佩内洛普是无赖。”大卫说：“梅森是无赖当且仅当佩内洛普是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是一名骑士  \n(2) 佩内洛普是一名无赖  \n(3) 梅森是一名骑士  \n(4) 大卫是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：塞缪尔、亚历山大、阿梅莉亚和莉莉。塞缪尔说：“塞缪尔是骑士，亚历山大是骑士。”亚历山大说：“塞缪尔是无赖。”阿梅莉亚断言：“塞缪尔不是无赖。”莉莉说：“如果塞缪尔是骑士，那么阿梅莉亚就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是无赖  \n(2) 亚历山大是骑士  \n(3) 阿梅莉亚是无赖  \n(4) 莉莉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：索菲娅、阿梅莉亚、伊丽莎白和阿比盖尔。索菲娅评论道：“阿梅莉亚是骑士。”阿梅莉亚声称：“索菲娅是无赖，而阿梅莉亚是骑士。”伊丽莎白说：“伊丽莎白是骑士或者索菲娅是无赖。”阿比盖尔则说：“如果阿梅莉亚是无赖，那么伊丽莎白就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 阿梅莉亚是无赖  \n(3) 伊丽莎白是骑士  \n(4) 阿比盖尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：塞巴斯蒂安、阿梅莉亚、赖利和伊莎贝拉。塞巴斯蒂安告诉你，伊莎贝拉是骑士当且仅当赖利是骑士。阿梅莉亚说：“塞巴斯蒂安不是骑士。”赖利指出：“如果伊莎贝拉是骑士，那么阿梅莉亚就是骑士。”伊莎贝拉宣称：“伊莎贝拉是骑士，而塞巴斯蒂安是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞巴斯蒂安是无赖  \n(2) 阿梅莉亚是骑士  \n(3) 赖利是骑士  \n(4) 伊莎贝拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：塞缪尔、莉莉、哈珀和梅森。塞缪尔宣称：“塞缪尔是骑士或者莉莉是无赖。”莉莉说道：“如果哈珀是无赖，那么梅森就是骑士。”哈珀说：“如果梅森是无赖，那么塞缪尔就是无赖。”梅森断言：“如果哈珀是骑士，那么塞缪尔就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是无赖  \n(2) 莉莉是骑士  \n(3) 哈珀是骑士  \n(4) 梅森是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：莉莉、伊森、杰克和艾米莉。正如莉莉所说：“杰克不是无赖。”伊森提到：“如果莉莉是无赖，那么莉莉就是骑士。”根据杰克的说法：“伊森是无赖或者莉莉是骑士。”艾米莉说：“莉莉是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是骑士  \n(2) 伊森是骑士  \n(3) 杰克是骑士  \n(4) 艾米莉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：欧文、詹姆斯、洛根和米娅。欧文说：“洛根是无赖当且仅当詹姆斯是骑士。”詹姆斯提到：“如果米娅是骑士，那么詹姆斯就是骑士。”洛根声明：“如果詹姆斯是无赖，那么米娅就是骑士。”米娅说：“欧文是骑士当且仅当洛根是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是无赖  \n(2) 詹姆斯是骑士  \n(3) 洛根是骑士  \n(4) 米娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：阿丽亚、奥利弗、迈克尔和艾弗里。阿丽亚宣称：“如果奥利弗是无赖，那么艾弗里就是骑士。”奥利弗被听到说：“如果阿丽亚是骑士，那么艾弗里就是无赖。”迈克尔的话是：“奥利弗是无赖或者阿丽亚是无赖。”艾弗里的话是：“如果迈克尔是骑士，那么艾弗里就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿丽亚是一名骑士  \n(2) 奥利弗是一个无赖  \n(3) 迈克尔是一名骑士  \n(4) 艾弗里是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：艾登、夏洛特、索菲娅和塞巴斯蒂安。根据艾登的说法，“夏洛特是一个无赖”。夏洛特的陈述是：“索菲娅是一个无赖当且仅当索菲娅是一个骑士”。索菲娅说：“艾登是一个骑士，塞巴斯蒂安是一个骑士”。“夏洛特是一个骑士，艾登是一个骑士，”塞巴斯蒂安声称。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是一名骑士  \n(2) 夏洛特是一个无赖  \n(3) 索菲娅是一个无赖  \n(4) 塞巴斯蒂安是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：亨利、詹姆斯、艾玛和伊莎贝拉。亨利宣称：“如果亨利是骑士，那么詹姆斯就是无赖。”詹姆斯说：“伊莎贝拉是无赖当且仅当艾玛是骑士。”艾玛说：“詹姆斯是骑士当且仅当亨利是无赖。”伊莎贝拉说：“亨利是骑士，詹姆斯是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是一名骑士  \n(2) 詹姆斯是一个无赖  \n(3) 艾玛是一名骑士  \n(4) 伊莎贝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：诺亚、卢克、塞缪尔和维多利亚。诺亚告诉你，如果维多利亚是骑士，那么卢克就是骑士。卢克提到：“塞缪尔是骑士或者诺亚是骑士。”塞缪尔说：“维多利亚是骑士或者维多利亚是无赖。”维多利亚说，如果塞缪尔是无赖，那么卢克就是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是一名骑士  \n(2) 卢克是一名骑士  \n(3) 塞缪尔是一名骑士  \n(4) 维多利亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：利亚姆、艾玛、卢克和奥利弗。“利亚姆是骑士或者艾玛是骑士”——利亚姆说。艾玛说：“利亚姆是无赖或者利亚姆是骑士。”卢克说：“利亚姆是骑士当且仅当利亚姆是无赖。”奥利弗说利亚姆是骑士而艾玛是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是一名骑士  \n(2) 艾玛是一名骑士  \n(3) 卢克是一名无赖  \n(4) 奥利弗是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：诺亚、丹尼尔、大卫和佩内洛普。诺亚宣称：“大卫是骑士，丹尼尔是无赖。”丹尼尔表示丹尼尔是骑士，大卫也是骑士。大卫被听到说：“丹尼尔不是骑士。”佩内洛普说，如果丹尼尔是无赖，那么诺亚就是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是骑士  \n(2) 丹尼尔是无赖  \n(3) 大卫是骑士  \n(4) 佩内洛普是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：奥利维亚、丹尼尔、佩内洛普和塞巴斯蒂安。奥利维亚说：“如果塞巴斯蒂安是骑士，那么佩内洛普就是无赖。”丹尼尔说：“塞巴斯蒂安不是无赖。”佩内洛普说：“如果塞巴斯蒂安是无赖，那么丹尼尔就是无赖。”塞巴斯蒂安说：“如果奥利维亚是骑士，那么丹尼尔就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是无赖  \n(2) 丹尼尔是骑士  \n(3) 佩内洛普是骑士  \n(4) 塞巴斯蒂安是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：艾拉、佐伊、丹尼尔和艾娃。艾拉说：“如果佐伊是无赖，那么艾娃就是无赖。”佐伊声称：“艾娃是无赖，丹尼尔是无赖。”丹尼尔声称：“如果艾娃是骑士，那么佐伊就是无赖。”艾娃指出：“丹尼尔是无赖或者佐伊是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是无赖  \n(2) 佐伊是无赖  \n(3) 丹尼尔是骑士  \n(4) 艾娃是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：伊芙琳、利亚姆、诺亚和迈克尔。正如伊芙琳所说：“诺亚是无赖或者利亚姆是骑士。”利亚姆声称：“诺亚不是无赖。”诺亚表示：“如果迈克尔是无赖，那么诺亚就是骑士。”迈克尔评论道：“诺亚是无赖或者伊芙琳是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是一名骑士  \n(2) 利亚姆是一名骑士  \n(3) 诺亚是一名骑士  \n(4) 迈克尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：卢克、艾玛、奥利弗和伊莎贝拉。卢克说：“艾玛不是无赖。”艾玛说，如果卢克是无赖，那么奥利弗就是无赖。奥利弗提到：“如果伊莎贝拉是骑士，那么伊莎贝拉就是无赖。”伊莎贝拉宣称：“艾玛是骑士或者奥利弗是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 艾玛是一名骑士  \n(3) 奥利弗是一名无赖  \n(4) 伊莎贝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：亚历山大、卢克、艾娃和威廉。亚历山大表示卢克不是无赖。卢克告诉你艾娃是无赖，威廉也是无赖。艾娃表示威廉是无赖。威廉表示如果亚历山大是骑士，那么卢克就是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亚历山大是无赖  \n(2) 卢克是无赖  \n(3) 艾娃是无赖  \n(4) 威廉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：大卫、索菲娅、奥萝拉和杰克逊。在大卫的话中：“奥萝拉是骑士或者大卫是骑士”。索菲娅说：“如果索菲娅是骑士，那么杰克逊就是骑士”。奥萝拉说：“大卫不是骑士”。杰克逊被听到说：“索菲娅不是无赖”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 大卫是一名骑士  \n(2) 索菲娅是一名骑士  \n(3) 奥萝拉是一名无赖  \n(4) 杰克逊是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：卢卡斯、塞巴斯蒂安、伊森和赖利。正如卢卡斯所说：“塞巴斯蒂安是无赖当且仅当伊森是骑士。”塞巴斯蒂安表示卢卡斯是骑士。伊森被听到说：“卢卡斯是骑士当且仅当赖利是骑士。”赖利告诉你，塞巴斯蒂安是骑士或者伊森是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是无赖  \n(2) 塞巴斯蒂安是无赖  \n(3) 伊森是无赖  \n(4) 赖利是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：艾拉、塞巴斯蒂安、卢卡斯和艾娃。艾拉被听到说：“艾娃是骑士。”塞巴斯蒂安被听到说：“如果艾娃是骑士，那么艾娃就是无赖。”卢卡斯被听到说：“如果艾拉是骑士，那么艾娃就是无赖。”艾娃指出：“卢卡斯是无赖或者卢卡斯是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是一名骑士  \n(2) 塞巴斯蒂安是一个无赖  \n(3) 卢卡斯是一个无赖  \n(4) 艾娃是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：威廉、艾拉、卢卡斯和雅各布。威廉说：“如果雅各布是无赖，那么艾拉就是无赖。”艾拉告诉你，威廉是无赖或者卢卡斯是无赖。卢卡斯表示，如果雅各布是骑士，那么威廉就是无赖。雅各布指出：“艾拉是骑士，而威廉是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 艾拉是一个无赖  \n(3) 卢卡斯是一名骑士  \n(4) 雅各布是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：赖利、阿梅莉亚、威廉和丹尼尔。“如果丹尼尔是无赖，那么威廉就是无赖，”赖利宣称。“丹尼尔是无赖当且仅当威廉是骑士，”阿梅莉亚说。威廉说：“丹尼尔不是无赖。”丹尼尔提到：“赖利不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是骑士  \n(2) 阿梅莉亚是无赖  \n(3) 威廉是无赖  \n(4) 丹尼尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：欧文、伊莎贝拉、诺亚和杰克逊。欧文声称：“伊莎贝拉是骑士。”伊莎贝拉指出：“如果诺亚是骑士，那么杰克逊就是无赖。”诺亚说杰克逊是无赖，而诺亚是骑士。在杰克逊的陈述中：“欧文是骑士或者诺亚是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是一名骑士  \n(2) 伊莎贝拉是一名骑士  \n(3) 诺亚是一名无赖  \n(4) 杰克逊是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：赖利、佩内洛普、伊莎贝拉和亚历山大。赖利说亚历山大是骑士，佩内洛普是骑士。佩内洛普说如果且仅如果伊莎贝拉是骑士，那么伊莎贝拉就是无赖。伊莎贝拉说：“赖利是骑士或者亚历山大是骑士。”亚历山大提到：“赖利是骑士而赖利是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是无赖  \n(2) 佩内洛普是无赖  \n(3) 伊莎贝拉是无赖  \n(4) 亚历山大是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：克洛伊、奥萝拉、杰克和奥利弗。正如克洛伊所说：“如果且仅如果杰克是无赖，奥利弗就是骑士。”奥萝拉被听到说：“如果奥利弗是骑士，那么克洛伊就是骑士。”杰克说克洛伊是骑士。奥利弗说：“如果且仅如果奥萝拉是骑士，克洛伊就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 克洛伊是一名骑士  \n(2) 奥萝拉是一名骑士  \n(3) 杰克是一名骑士  \n(4) 奥利弗是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：奥利维亚、阿丽亚、斯嘉丽和本杰明。奥利维亚被听到说：“斯嘉丽是个无赖。”阿丽亚评论道：“如果斯嘉丽是骑士，那么本杰明就是骑士。”斯嘉丽说：“奥利维亚是骑士，本杰明是骑士。”本杰明声称：“斯嘉丽不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是一名骑士  \n(2) 阿丽亚是一名骑士  \n(3) 斯嘉丽是一名无赖  \n(4) 本杰明是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：阿梅莉亚、奥利维亚、亨利和奥萝拉。阿梅莉亚评论道：“奥萝拉是骑士或者亨利是骑士。”奥利维亚说：“亨利是无赖。”亨利声称：“奥利维亚是无赖或者奥利维亚是骑士。”奥萝拉说：“阿梅莉亚是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是一名骑士  \n(2) 奥利维亚是一个无赖  \n(3) 亨利是一名骑士  \n(4) 奥萝拉是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四位居民：威廉、伊森、莉莉和阿梅莉亚。威廉声称：“莉莉是骑士。”伊森说：“莉莉是无赖或者阿梅莉亚是无赖。”莉莉则表示：“伊森是无赖当且仅当阿梅莉亚是无赖。”阿梅莉亚提到：“伊森是骑士当且仅当伊森是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是无赖  \n(2) 伊森是骑士  \n(3) 莉莉是无赖  \n(4) 阿梅莉亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四位居民：伊芙琳、梅森、利亚姆和佩内洛普。“利亚姆不是无赖，”伊芙琳宣称。根据梅森的说法，“利亚姆是骑士或者利亚姆是无赖”。利亚姆说：“梅森是无赖，伊芙琳是骑士”。在佩内洛普的话中：“佩内洛普是骑士，伊芙琳是骑士”。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是无赖  \n(2) 梅森是骑士  \n(3) 利亚姆是无赖  \n(4) 佩内洛普是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：诺亚、亚历山大、佩内洛普和克洛伊。诺亚表示佩内洛普是骑士，而克洛伊是无赖。亚历山大表示如果佩内洛普是骑士，那么克洛伊就是骑士。根据佩内洛普的说法，“佩内洛普是骑士，而克洛伊是无赖。”克洛伊宣称：“如果诺亚是无赖，那么亚历山大就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是无赖  \n(2) 亚历山大是骑士  \n(3) 佩内洛普是无赖  \n(4) 克洛伊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四位居民：夏洛特、阿丽亚、威廉和赖利。夏洛特提到：“阿丽亚是骑士，而赖利是无赖。”阿丽亚表示赖利是骑士或者赖利是无赖。威廉断言：“夏洛特是无赖当且仅当赖利是骑士。”赖利的陈述是：“如果阿丽亚是骑士，那么威廉就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是无赖  \n(2) 阿丽亚是骑士  \n(3) 威廉是骑士  \n(4) 赖利是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：杰克逊、塞巴斯蒂安、丹尼尔和莉莉。杰克逊被听到说：“如果莉莉是无赖，那么杰克逊就是骑士。”塞巴斯蒂安被听到说：“杰克逊是骑士当且仅当丹尼尔是无赖。”丹尼尔提到：“丹尼尔是骑士当且仅当塞巴斯蒂安是无赖。”莉莉说：“杰克逊不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是一名骑士  \n(2) 塞巴斯蒂安是一个无赖  \n(3) 丹尼尔是一名骑士  \n(4) 莉莉是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：佩内洛普、伊森、艾登和伊芙琳。佩内洛普声称：“艾登是无赖或者伊森是无赖。”伊森的陈述是：“如果艾登是骑士，那么伊芙琳就是骑士。”艾登说，如果艾登是骑士，那么伊芙琳就是无赖。伊芙琳则评论道：“伊森是无赖当且仅当伊森是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是一名骑士  \n(2) 伊森是一个无赖  \n(3) 艾登是一名骑士  \n(4) 伊芙琳是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：奥利维亚、迈克尔、伊丽莎白和杰克逊。奥利维亚被听到说：“如果迈克尔是无赖，那么杰克逊就是骑士。”迈克尔说，只有当杰克逊是无赖时，奥利维亚才是骑士。“迈克尔是骑士，”伊丽莎白提到。“奥利维亚不是骑士，”杰克逊说。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是一名骑士  \n(2) 迈克尔是一名骑士  \n(3) 伊丽莎白是一名骑士  \n(4) 杰克逊是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：克洛伊、佐伊、大卫和夏洛特。“如果且仅如果夏洛特是无赖，佐伊就是无赖。”——克洛伊说。“克洛伊不是骑士，”佐伊宣称。大卫说：“夏洛特不是无赖。”夏洛特则说：“佐伊是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 克洛伊是无赖  \n(2) 佐伊是骑士  \n(3) 大卫是无赖  \n(4) 夏洛特是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：洛根、利亚姆、夏洛特和哈珀。洛根说：“洛根是骑士或者哈珀是骑士。”根据利亚姆的说法：“夏洛特是无赖。”夏洛特的陈述是：“洛根是骑士。”哈珀则说：“利亚姆是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是一名骑士  \n(2) 利亚姆是一个无赖  \n(3) 夏洛特是一名骑士  \n(4) 哈珀是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：佩内洛普、卢克、诺亚和奥萝拉。佩内洛普说：“卢克是无赖或者奥萝拉是骑士。”卢克说：“诺亚是骑士或者诺亚是无赖。”诺亚说：“卢克是无赖或者奥萝拉是无赖。”奥萝拉提到：“当且仅当诺亚是无赖时，奥萝拉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是一名骑士  \n(2) 卢克是一名骑士  \n(3) 诺亚是一名无赖  \n(4) 奥萝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：伊丽莎白、本杰明、艾登和艾玛。伊丽莎白说：“艾玛是无赖，艾登是骑士。”本杰明则说：“伊丽莎白是骑士当且仅当艾玛是骑士。”艾登评论道：“艾玛不是无赖。”艾玛的陈述是：“伊丽莎白不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是无赖  \n(2) 本杰明是骑士  \n(3) 艾登是无赖  \n(4) 艾玛是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：克洛伊、维多利亚、丹尼尔和本杰明。克洛伊说：“维多利亚是骑士。”维多利亚指出：“丹尼尔是无赖，而维多利亚是骑士。”丹尼尔说：“克洛伊是骑士当且仅当维多利亚是无赖。”本杰明说：“如果本杰明是骑士，那么维多利亚就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 克洛伊是一名骑士  \n(2) 维多利亚是一名骑士  \n(3) 丹尼尔是一名无赖  \n(4) 本杰明是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：威廉、索菲娅、奥萝拉和伊森。威廉说：“奥萝拉是骑士当且仅当伊森是无赖。”索菲娅宣称：“如果威廉是骑士，那么威廉就是无赖。”奥萝拉指出：“威廉不是无赖。”伊森评论道：“奥萝拉不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 索菲娅是一名无赖  \n(3) 奥萝拉是一名骑士  \n(4) 伊森是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：奥萝拉、洛根、夏洛特和伊芙琳。奥萝拉声称：“洛根是无赖，夏洛特是骑士。”洛根被听到说：“奥萝拉是无赖，伊芙琳是无赖。”夏洛特评论道：“如果夏洛特是骑士，那么伊芙琳就是骑士。”伊芙琳则说：“奥萝拉不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥萝拉是一名骑士  \n(2) 洛根是一个无赖  \n(3) 夏洛特是一名骑士  \n(4) 伊芙琳是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：马修、佐伊、威廉和约瑟夫。马修告诉你，约瑟夫不是骑士。佐伊说，马修是无赖当且仅当马修是骑士。“马修是无赖当且仅当约瑟夫是无赖，”威廉提到。约瑟夫说：“佐伊不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是一名骑士  \n(2) 佐伊是一名无赖  \n(3) 威廉是一名无赖  \n(4) 约瑟夫是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：阿梅莉亚、卢卡斯、梅森和索菲娅。阿梅莉亚说索菲娅是无赖或者梅森是骑士。正如卢卡斯所说：“如果阿梅莉亚是无赖，那么卢卡斯就是骑士。”梅森说：“如果索菲娅是无赖，那么索菲娅就是骑士。”索菲娅断言：“卢卡斯不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是一名骑士  \n(2) 卢卡斯是一名骑士  \n(3) 梅森是一名骑士  \n(4) 索菲娅是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：塞缪尔、詹姆斯、卢卡斯和索菲娅。塞缪尔说：“卢卡斯是无赖，索菲娅是骑士。”詹姆斯说：“詹姆斯是骑士，索菲娅是无赖。”卢卡斯说：“如果塞缪尔是无赖，那么詹姆斯就是无赖。”索菲娅说：“如果卢卡斯是无赖，那么詹姆斯就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是无赖  \n(2) 詹姆斯是无赖  \n(3) 卢卡斯是骑士  \n(4) 索菲娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：阿梅莉亚、伊莎贝拉、丹尼尔和大卫。阿梅莉亚说：“伊莎贝拉是骑士当且仅当阿梅莉亚是骑士。”伊莎贝拉则说道：“阿梅莉亚是骑士当且仅当大卫是无赖。”丹尼尔声称：“大卫是无赖当且仅当丹尼尔是骑士。”大卫被听到说：“丹尼尔是无赖当且仅当伊莎贝拉是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是一名骑士  \n(2) 伊莎贝拉是一名骑士  \n(3) 丹尼尔是一个无赖  \n(4) 大卫是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：杰克、卢卡斯、奥萝拉和艾弗里。杰克声称：“杰克是骑士，奥萝拉是骑士。”卢卡斯的话是：“杰克不是无赖。”奥萝拉声称：“如果杰克是骑士，那么杰克就是无赖。”艾弗里说：“杰克是无赖当且仅当奥萝拉是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克是无赖  \n(2) 卢卡斯是无赖  \n(3) 奥萝拉是骑士  \n(4) 艾弗里是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四位居民：杰克、伊丽莎白、艾拉和迈克尔。杰克说：“如果且仅如果伊丽莎白是无赖，迈克尔就是骑士。”伊丽莎白说：“艾拉是骑士或者艾拉是无赖。”艾拉说：“杰克是无赖或者伊丽莎白是无赖。”迈克尔说：“如果艾拉是骑士，那么迈克尔就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克是一个无赖  \n(2) 伊丽莎白是一个骑士  \n(3) 艾拉是一个骑士  \n(4) 迈克尔是一个骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：艾娃、索菲娅、奥利弗和梅森。艾娃声称：“索菲娅是一个无赖。”索菲娅评论道：“梅森不是一个无赖。”奥利弗指出：“艾娃是一个骑士或者梅森是一个无赖。”梅森说：“如果梅森是一个骑士，那么索菲娅就是一个骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是无赖  \n(2) 索菲娅是骑士  \n(3) 奥利弗是无赖  \n(4) 梅森是骑士"
    },
    {
        "quiz": "一个非常特别的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：奥利维亚、杰克、莉莉和本杰明。奥利维亚说莉莉是骑士。“奥利维亚是无赖，”杰克提到。莉莉声明：“杰克是无赖，本杰明是无赖。”本杰明说：“莉莉不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是无赖  \n(2) 杰克是骑士  \n(3) 莉莉是无赖  \n(4) 本杰明是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：克洛伊、佐伊、杰克和索菲娅。克洛伊说：“杰克是个无赖。”佐伊指出：“杰克是个骑士。”杰克表示佐伊是个无赖，克洛伊也是个无赖。索菲娅说克洛伊是个骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 克洛伊是一名骑士  \n(2) 佐伊是一名无赖  \n(3) 杰克是一名无赖  \n(4) 索菲娅是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：艾拉、亚历山大、艾玛和莉莉。艾拉评论道：“艾玛是无赖，而艾拉是骑士。”亚历山大被听到说：“艾玛是骑士，莉莉是骑士。”艾玛声明：“艾拉不是无赖。”莉莉说：“艾玛是骑士，亚历山大是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是无赖  \n(2) 亚历山大是无赖  \n(3) 艾玛是无赖  \n(4) 莉莉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：伊丽莎白、伊森、阿比盖尔和莉莉。伊丽莎白被听到说：“如果伊森是骑士，那么阿比盖尔就是骑士。”伊森指出：“莉莉是无赖或者伊丽莎白是无赖。”阿比盖尔指出：“伊丽莎白是骑士当且仅当伊森是骑士。”莉莉说：“伊森是无赖当且仅当莉莉是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是一名骑士  \n(2) 伊森是一个无赖  \n(3) 阿比盖尔是一个无赖  \n(4) 莉莉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：阿丽亚、阿梅莉亚、奥萝拉和艾娃。阿丽亚评论道：“阿梅莉亚是无赖当且仅当奥萝拉是无赖。”阿梅莉亚声称：“奥萝拉是无赖或者奥萝拉是骑士。”根据奥萝拉的说法，“艾娃是无赖。”艾娃说：“艾娃是骑士或者奥萝拉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿丽亚是无赖  \n(2) 阿梅莉亚是骑士  \n(3) 奥萝拉是无赖  \n(4) 艾娃是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：伊丽莎白、哈珀、威廉和本杰明。伊丽莎白说：“威廉是骑士，哈珀是骑士。”哈珀说：“本杰明不是骑士。”威廉说本杰明是骑士。“哈珀是骑士，本杰明是骑士。”——本杰明。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是无赖  \n(2) 哈珀是骑士  \n(3) 威廉是无赖  \n(4) 本杰明是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：奥利弗、约瑟夫、克洛伊和洛根。奥利弗表示洛根不是骑士。约瑟夫指出：“洛根是骑士或者奥利弗是骑士。”克洛伊指出：“如果奥利弗是无赖，那么洛根就是无赖。”洛根宣称：“奥利弗是骑士而克洛伊是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利弗是一名骑士  \n(2) 约瑟夫是一名骑士  \n(3) 克洛伊是一名骑士  \n(4) 洛根是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：杰克逊、伊丽莎白、伊芙琳和梅森。杰克逊说：“伊芙琳是一个无赖。”伊丽莎白的话是：“梅森是骑士当且仅当伊芙琳是骑士。”伊芙琳提到：“如果杰克逊是无赖，那么梅森就是骑士。”梅森告诉你：“如果杰克逊是无赖，那么伊丽莎白就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是无赖  \n(2) 伊丽莎白是骑士  \n(3) 伊芙琳是骑士  \n(4) 梅森是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：亨利、洛根、索菲娅和格蕾丝。亨利说：“洛根是骑士当且仅当索菲娅是骑士。”洛根告诉你，格蕾丝是骑士当且仅当索菲娅是骑士。索菲娅说亨利是骑士当且仅当格蕾丝是无赖。格蕾丝评论道：“亨利是无赖或者格蕾丝是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是一名骑士  \n(2) 洛根是一个无赖  \n(3) 索菲娅是一个无赖  \n(4) 格蕾丝是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：克洛伊、米娅、艾弗里和约瑟夫。克洛伊被听到说：“米娅不是无赖。”米娅说：“米娅是骑士或者克洛伊是无赖。”艾弗里告诉你，艾弗里是骑士或者米娅是骑士。约瑟夫声称：“米娅是骑士当且仅当艾弗里是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 克洛伊是一名骑士  \n(2) 米娅是一名骑士  \n(3) 艾弗里是一名骑士  \n(4) 约瑟夫是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：卢克、阿梅莉亚、亨利和莉莉。卢克说：“亨利是无赖当且仅当莉莉是无赖。”阿梅莉亚宣称：“莉莉是骑士或者亨利是骑士。”亨利宣称：“阿梅莉亚是无赖或者卢克是骑士。”莉莉声称：“卢克是骑士当且仅当阿梅莉亚是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 阿梅莉亚是一名骑士  \n(3) 亨利是一名骑士  \n(4) 莉莉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：艾登、马修、艾拉和赖利。艾登告诉你艾拉是一个无赖。马修说：“赖利不是无赖。” “艾登是无赖当且仅当赖利是骑士”——艾拉。赖利告诉你艾登是骑士，赖利也是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是一名骑士  \n(2) 马修是一名骑士  \n(3) 艾拉是一名无赖  \n(4) 赖利是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：卢克、哈珀、佩内洛普和奥萝拉。在卢克的话中：“佩内洛普是骑士当且仅当佩内洛普是无赖。”哈珀说：“奥萝拉是无赖，而哈珀是骑士。”佩内洛普表示卢克是无赖。奥萝拉声明：“哈珀是骑士当且仅当奥萝拉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是无赖  \n(2) 哈珀是骑士  \n(3) 佩内洛普是骑士  \n(4) 奥萝拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：迈克尔、塞巴斯蒂安、本杰明和伊莎贝拉。迈克尔说：“伊莎贝拉是无赖，塞巴斯蒂安是无赖。”塞巴斯蒂安则说：“塞巴斯蒂安是骑士。”本杰明断言：“如果伊莎贝拉是骑士，那么伊莎贝拉就是无赖。”伊莎贝拉说：“塞巴斯蒂安是无赖，迈克尔是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是无赖  \n(2) 塞巴斯蒂安是骑士  \n(3) 本杰明是骑士  \n(4) 伊莎贝拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：诺亚、雅各布、阿丽亚和伊森。诺亚宣称：“伊森是骑士或者伊森是无赖。”雅各布评论道：“如果阿丽亚是骑士，那么伊森就是无赖。”阿丽亚评论道：“如果伊森是无赖，那么诺亚就是无赖。”伊森声称：“诺亚不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是一名骑士  \n(2) 雅各布是一名骑士  \n(3) 阿丽亚是一名无赖  \n(4) 伊森是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：洛根、斯嘉丽、伊森和格蕾丝。洛根告诉你，如果格蕾丝是无赖，那么斯嘉丽就是无赖。斯嘉丽说：“如果洛根是无赖，那么格蕾丝就是无赖。”伊森评论道：“洛根是无赖。”格蕾丝说斯嘉丽是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是一名骑士  \n(2) 斯嘉丽是一名骑士  \n(3) 伊森是一名无赖  \n(4) 格蕾丝是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：艾玛、阿梅莉亚、伊森和伊莎贝拉。艾玛说：“伊莎贝拉不是骑士。”阿梅莉亚被听到说：“伊莎贝拉是无赖。”伊森声称：“伊莎贝拉不是无赖。”伊莎贝拉宣称：“艾玛是骑士当且仅当伊森是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是一名骑士  \n(2) 阿梅莉亚是一名骑士  \n(3) 伊森是一个无赖  \n(4) 伊莎贝拉是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：佩内洛普、欧文、本杰明和杰克逊。佩内洛普评论道：“欧文是无赖或者杰克逊是无赖。”根据欧文的说法，“佩内洛普是骑士或者佩内洛普是无赖。”本杰明宣称：“如果本杰明是骑士，那么欧文就是骑士。”杰克逊表示：“欧文是骑士或者本杰明是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是无赖  \n(2) 欧文是骑士  \n(3) 本杰明是骑士  \n(4) 杰克逊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：伊丽莎白、佐伊、斯嘉丽和本杰明。伊丽莎白说：“斯嘉丽是无赖或者斯嘉丽是骑士。”佐伊说：“本杰明不是骑士。”斯嘉丽说：“如果且仅如果伊丽莎白是骑士，佐伊就是无赖。”本杰明说：“伊丽莎白是骑士或者伊丽莎白是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是一名骑士  \n(2) 佐伊是一名无赖  \n(3) 斯嘉丽是一名骑士  \n(4) 本杰明是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：夏洛特、格蕾丝、阿丽亚和索菲娅。“格蕾丝是骑士当且仅当格蕾丝是无赖，”夏洛特宣称。“阿丽亚是骑士，而夏洛特是无赖，”格蕾丝提到。“如果阿丽亚是骑士，那么格蕾丝就是骑士，”阿丽亚声称。“夏洛特不是骑士，”索菲娅说。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是无赖  \n(2) 格蕾丝是骑士  \n(3) 阿丽亚是骑士  \n(4) 索菲娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：阿梅莉亚、艾登、杰克和米娅。阿梅莉亚表示杰克是无赖，艾登是骑士。“阿梅莉亚是骑士”——艾登说。杰克告诉你，如果阿梅莉亚是无赖，那么艾登就是无赖。正如米娅所说：“阿梅莉亚是骑士当且仅当阿梅莉亚是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是无赖  \n(2) 艾登是无赖  \n(3) 杰克是骑士  \n(4) 米娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：马修、利亚姆、洛根和艾拉。马修宣称：“洛根是无赖当且仅当利亚姆是骑士。”利亚姆被听到说：“马修是无赖或者艾拉是骑士。”洛根断言：“如果马修是无赖，那么利亚姆就是骑士。”艾拉提到：“利亚姆是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是无赖  \n(2) 利亚姆是骑士  \n(3) 洛根是骑士  \n(4) 艾拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：索菲娅、莉莉、丹尼尔和维多利亚。索菲娅说：“莉莉是骑士当且仅当维多利亚是无赖。”莉莉宣称：“索菲娅是无赖或者丹尼尔是无赖。”丹尼尔指出：“如果丹尼尔是骑士，那么索菲娅就是骑士。”维多利亚声明：“索菲娅是骑士或者丹尼尔是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 莉莉是一个无赖  \n(3) 丹尼尔是一名骑士  \n(4) 维多利亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：佩内洛普、詹姆斯、雅各布和索菲娅。正如佩内洛普所说：“索菲娅是一个无赖。”詹姆斯被听到说：“雅各布是一个无赖，当且仅当索菲娅是一个骑士。”根据雅各布的说法：“如果詹姆斯是一个无赖，那么詹姆斯就是一个骑士。”索菲娅的声明是：“雅各布是一个骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是一名骑士  \n(2) 詹姆斯是一个无赖  \n(3) 雅各布是一个无赖  \n(4) 索菲娅是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：艾娃、丹尼尔、杰克和威廉。“如果艾娃是骑士，那么丹尼尔就是骑士。”——艾娃。丹尼尔表示：“如果杰克是骑士，那么艾娃就是骑士。”杰克表示：“如果丹尼尔是无赖，那么丹尼尔就是骑士。”威廉表示：“杰克不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是一名骑士  \n(2) 丹尼尔是一名骑士  \n(3) 杰克是一名骑士  \n(4) 威廉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：卢克、欧文、亚历山大和塞巴斯蒂安。卢克说，如果欧文是无赖，那么亚历山大就是骑士。“卢克是无赖，亚历山大是骑士。”——欧文。“如果塞巴斯蒂安是无赖，那么卢克就是骑士，”亚历山大宣称。“当且仅当卢克是无赖时，欧文才是无赖，”塞巴斯蒂安声称。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 欧文是一个无赖  \n(3) 亚历山大是一名骑士  \n(4) 塞巴斯蒂安是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：伊芙琳、杰克逊、艾弗里和亚历山大。伊芙琳的陈述是：“亚历山大是骑士当且仅当杰克逊是骑士。”杰克逊指出：“艾弗里是无赖当且仅当伊芙琳是无赖。”艾弗里被听到说：“杰克逊是骑士。”亚历山大说杰克逊是骑士，艾弗里是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是一名骑士  \n(2) 杰克逊是一个无赖  \n(3) 艾弗里是一个无赖  \n(4) 亚历山大是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：艾登、阿梅莉亚、索菲娅和赖利。艾登宣称：“阿梅莉亚是骑士或者赖利是无赖。”阿梅莉亚说：“艾登是无赖或者艾登是骑士。”索菲娅告诉你赖利是无赖，而赖利是骑士。赖利指出：“艾登不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是一名骑士  \n(2) 阿梅莉亚是一名骑士  \n(3) 索菲娅是一名无赖  \n(4) 赖利是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：奥利维亚、伊芙琳、丹尼尔和伊莎贝拉。奥利维亚声称：“伊芙琳是骑士或者伊莎贝拉是骑士。”伊芙琳则声称：“丹尼尔是无赖。”根据丹尼尔的说法，“伊芙琳是无赖当且仅当伊芙琳是骑士。”伊莎贝拉表示奥利维亚是骑士或者伊芙琳是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是骑士  \n(2) 伊芙琳是骑士  \n(3) 丹尼尔是无赖  \n(4) 伊莎贝拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：梅森、赖利、丹尼尔和亨利。在梅森的话中：“梅森是骑士，丹尼尔是骑士。”赖利评论道：“亨利是无赖或者丹尼尔是骑士。”丹尼尔说，如果且仅如果梅森是无赖，亨利就是无赖。在亨利的陈述中：“丹尼尔不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是一名骑士  \n(2) 赖利是一名骑士  \n(3) 丹尼尔是一名骑士  \n(4) 亨利是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：赖利、艾娃、奥利维亚和佩内洛普。“奥利维亚是骑士当且仅当佩内洛普是无赖”——赖利说。艾娃表示赖利是骑士当且仅当佩内洛普是无赖。根据奥利维亚的说法，“佩内洛普是骑士”。佩内洛普告诉你赖利是无赖或者艾娃是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是无赖  \n(2) 艾娃是骑士  \n(3) 奥利维亚是骑士  \n(4) 佩内洛普是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：迈克尔、奥萝拉、梅森和佩内洛普。迈克尔说：“梅森是无赖当且仅当梅森是骑士。”奥萝拉告诉你佩内洛普是无赖，而迈克尔是骑士。梅森声明：“佩内洛普是无赖。”佩内洛普评论道：“迈克尔是无赖，而奥萝拉是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是无赖  \n(2) 奥萝拉是无赖  \n(3) 梅森是骑士  \n(4) 佩内洛普是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：塞巴斯蒂安、伊森、佩内洛普和艾弗里。塞巴斯蒂安告诉你艾弗里不是无赖。“塞巴斯蒂安是无赖或者佩内洛普是无赖，”伊森声称。正如佩内洛普所说，“塞巴斯蒂安是无赖而伊森是骑士。”艾弗里表示佩内洛普是骑士而艾弗里是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）塞巴斯蒂安是无赖  \n（2）伊森是骑士  \n（3）佩内洛普是骑士  \n（4）艾弗里是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：艾米莉、卢克、斯嘉丽和米娅。艾米莉提到：“斯嘉丽不是骑士。”卢克评论道：“如果艾米莉是无赖，那么米娅就是骑士。”斯嘉丽指出：“艾米莉是无赖，米娅是骑士。”米娅断言：“艾米莉是骑士，卢克是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是骑士  \n(2) 卢克是骑士  \n(3) 斯嘉丽是无赖  \n(4) 米娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：雅各布、克洛伊、艾弗里和斯嘉丽。雅各布说：“如果斯嘉丽是骑士，那么克洛伊就是无赖。”克洛伊宣称：“如果雅各布是骑士，那么艾弗里就是骑士。”艾弗里评论道：“雅各布不是骑士。”斯嘉丽则说道：“雅各布是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）雅各布是一名骑士  \n（2）克洛伊是一个无赖  \n（3）艾弗里是一个无赖  \n（4）斯嘉丽是一名骑士"
    },
    {
        "quiz": "一个非常特别的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：洛根、奥萝拉、哈珀和杰克逊。洛根提到：“奥萝拉是无赖，杰克逊是无赖。”奥萝拉宣称：“杰克逊不是无赖。”哈珀指出：“哈珀是骑士。”杰克逊提到：“如果洛根是无赖，那么哈珀就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是无赖  \n(2) 奥萝拉是骑士  \n(3) 哈珀是无赖  \n(4) 杰克逊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：哈珀、本杰明、大卫和艾娃。“本杰明是个无赖，”哈珀宣称。本杰明表示大卫是个骑士。“哈珀是个无赖，艾娃是个骑士，”大卫提到。艾娃的声明是：“本杰明是个无赖或者大卫是个无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是一名骑士  \n(2) 本杰明是一个无赖  \n(3) 大卫是一个无赖  \n(4) 艾娃是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：亚历山大、杰克逊、马修和艾弗里。亚历山大声称：“如果艾弗里是骑士，那么杰克逊就是无赖。”杰克逊表示亚历山大是无赖，而亚历山大是骑士。正如马修所说：“亚历山大是无赖或者艾弗里是无赖。”而艾弗里则说：“马修是骑士，马修是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亚历山大是一名骑士  \n(2) 杰克逊是一个无赖  \n(3) 马修是一名骑士  \n(4) 艾弗里是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：艾玛、斯嘉丽、哈珀和威廉。“哈珀是无赖，艾玛是骑士，”艾玛说。正如斯嘉丽所说，“威廉是无赖或者斯嘉丽是骑士。” “威廉是骑士，”哈珀声称。“如果斯嘉丽是无赖，那么斯嘉丽就是骑士，”威廉提到。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是无赖  \n(2) 斯嘉丽是骑士  \n(3) 哈珀是骑士  \n(4) 威廉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：威廉、艾娃、杰克和阿梅莉亚。威廉说：“阿梅莉亚是无赖，杰克是无赖。”根据艾娃的说法，“如果威廉是骑士，那么威廉就是无赖。”杰克说：“阿梅莉亚不是无赖。”阿梅莉亚宣称：“如果阿梅莉亚是骑士，那么威廉就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是无赖  \n(2) 艾娃是骑士  \n(3) 杰克是骑士  \n(4) 阿梅莉亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：大卫、赖利、塞巴斯蒂安和伊丽莎白。大卫说：“塞巴斯蒂安是骑士。”赖利声明：“伊丽莎白不是无赖。”塞巴斯蒂安宣称：“大卫是骑士当且仅当大卫是无赖。”伊丽莎白宣称：“大卫是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 大卫是无赖  \n(2) 赖利是无赖  \n(3) 塞巴斯蒂安是无赖  \n(4) 伊丽莎白是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：梅森、索菲娅、威廉和艾娃。梅森说：“如果艾娃是骑士，那么索菲娅就是无赖。”索菲娅提到：“艾娃是无赖。”威廉评论道：“如果艾娃是骑士，那么威廉就是骑士。”根据艾娃的说法：“索菲娅是骑士当且仅当威廉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是一名骑士  \n(2) 索菲娅是一名无赖  \n(3) 威廉是一名无赖  \n(4) 艾娃是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：艾拉、莉莉、阿梅莉亚和赖利。艾拉说：“赖利是骑士，而赖利是无赖。”莉莉评论道：“阿梅莉亚是无赖，艾拉是无赖。”在阿梅莉亚看来：“艾拉是无赖。”根据赖利的说法：“艾拉是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是无赖  \n(2) 莉莉是无赖  \n(3) 阿梅莉亚是骑士  \n(4) 赖利是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：伊芙琳、威廉、大卫和塞巴斯蒂安。伊芙琳说：“大卫是个无赖。”威廉说：“伊芙琳不是骑士。”大卫声称：“威廉是无赖当且仅当塞巴斯蒂安是骑士。”在塞巴斯蒂安的陈述中：“塞巴斯蒂安是骑士当且仅当威廉是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是一名骑士  \n(2) 威廉是一个无赖  \n(3) 大卫是一个无赖  \n(4) 塞巴斯蒂安是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：亨利、雅各布、夏洛特和艾拉。亨利说：“亨利是骑士。”雅各布评论道：“夏洛特不是无赖。”夏洛特表示，如果艾拉是骑士，那么亨利就是无赖。艾拉说：“夏洛特不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是无赖  \n(2) 雅各布是骑士  \n(3) 夏洛特是骑士  \n(4) 艾拉是骑士"
    },
    {
        "quiz": "一个非常特别的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：艾玛、莉莉、艾弗里和伊丽莎白。“伊丽莎白不是无赖，”艾玛说。莉莉说：“当且仅当伊丽莎白是骑士时，艾玛才是骑士。”艾弗里指出：“当且仅当伊丽莎白是无赖时，艾玛才是无赖。”伊丽莎白声称：“如果伊丽莎白是骑士，那么莉莉就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是骑士  \n(2) 莉莉是骑士  \n(3) 艾弗里是骑士  \n(4) 伊丽莎白是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：迈克尔、索菲娅、雅各布和塞缪尔。迈克尔说：“雅各布是无赖或者塞缪尔是骑士。”索菲娅说，迈克尔是骑士当且仅当雅各布是无赖。雅各布的陈述是：“迈克尔不是骑士。”塞缪尔说：“雅各布是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是一名骑士  \n(2) 索菲娅是一名骑士  \n(3) 雅各布是一个无赖  \n(4) 塞缪尔是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：塞巴斯蒂安、詹姆斯、雅各布和杰克。塞巴斯蒂安告诉你雅各布不是无赖。詹姆斯被听到说：“杰克不是无赖。”雅各布声称：“当且仅当詹姆斯是无赖时，塞巴斯蒂安就是无赖。”杰克提到：“雅各布不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）塞巴斯蒂安是无赖  \n（2）詹姆斯是骑士  \n（3）雅各布是无赖  \n（4）杰克是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：米娅、杰克逊、卢卡斯和哈珀。米娅说：“如果米娅是骑士，那么哈珀就是无赖。”杰克逊评论道：“杰克逊是骑士。”卢卡斯说道：“杰克逊是骑士当且仅当哈珀是骑士。”哈珀被听到说：“卢卡斯是无赖当且仅当哈珀是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是一名骑士  \n(2) 杰克逊是一名骑士  \n(3) 卢卡斯是一名无赖  \n(4) 哈珀是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：阿比盖尔、艾玛、亨利和伊莎贝拉。阿比盖尔说：“亨利是骑士当且仅当艾玛是骑士。”艾玛说：“伊莎贝拉是无赖。”亨利说伊莎贝拉是骑士，阿比盖尔是骑士。伊莎贝拉说：“如果阿比盖尔是无赖，那么阿比盖尔就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是无赖  \n(2) 艾玛是骑士  \n(3) 亨利是无赖  \n(4) 伊莎贝拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：伊森、阿梅莉亚、奥利维亚和艾登。伊森说：“如果奥利维亚是骑士，那么阿梅莉亚就是无赖。”阿梅莉亚说：“艾登是骑士或者奥利维亚是无赖。”奥利维亚宣称：“如果伊森是骑士，那么伊森就是无赖。”艾登说阿梅莉亚是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是一名骑士  \n(2) 阿梅莉亚是一名骑士  \n(3) 奥利维亚是一名无赖  \n(4) 艾登是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了四个居民：丹尼尔、阿比盖尔、艾娃和哈珀。正如丹尼尔所说：“阿比盖尔是无赖当且仅当艾娃是无赖。”阿比盖尔提到：“艾娃不是无赖。”艾娃被听到说：“丹尼尔是骑士或者丹尼尔是无赖。”哈珀说：“艾娃是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）丹尼尔是一名骑士  \n（2）阿比盖尔是一名骑士  \n（3）艾娃是一名骑士  \n（4）哈珀是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：斯嘉丽、格蕾丝、雅各布和艾米莉。斯嘉丽告诉你，格蕾丝是无赖当且仅当艾米莉是无赖。格蕾丝声称：“斯嘉丽是无赖。”雅各布说：“如果艾米莉是骑士，那么艾米莉就是无赖。”艾米莉则说：“斯嘉丽不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 斯嘉丽是无赖  \n(2) 格蕾丝是骑士  \n(3) 雅各布是骑士  \n(4) 艾米莉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：迈克尔、伊森、洛根和索菲娅。迈克尔的陈述是：“伊森是无赖或者迈克尔是骑士。”伊森则说：“如果迈克尔是骑士，那么伊森就是骑士。”洛根说：“如果索菲娅是无赖，那么伊森就是无赖。”索菲娅说：“洛根不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是一名骑士  \n(2) 伊森是一个无赖  \n(3) 洛根是一名骑士  \n(4) 索菲娅是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：卢克、杰克逊、格蕾丝和索菲娅。卢克的陈述是：“格蕾丝是骑士，杰克逊是无赖。”杰克逊说索菲娅是无赖，卢克是骑士。格蕾丝告诉你索菲娅是骑士。索菲娅声称：“杰克逊不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 杰克逊是一个无赖  \n(3) 格蕾丝是一名骑士  \n(4) 索菲娅是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：阿梅莉亚、杰克逊、大卫和索菲娅。阿梅莉亚说，如果杰克逊是骑士，那么索菲娅就是骑士。“大卫是无赖或者杰克逊是骑士”——杰克逊。大卫告诉你索菲娅是骑士。索菲娅说大卫是骑士，而阿梅莉亚是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是无赖  \n(2) 杰克逊是骑士  \n(3) 大卫是无赖  \n(4) 索菲娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：艾娃、艾拉、马修和诺亚。艾娃声称：“马修是无赖当且仅当马修是骑士。”艾拉评论道：“如果马修是无赖，那么诺亚就是骑士。”马修说：“如果艾拉是骑士，那么艾拉就是无赖。”诺亚被听到说：“如果艾娃是无赖，那么马修就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是无赖  \n(2) 艾拉是骑士  \n(3) 马修是无赖  \n(4) 诺亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：马修、艾玛、梅森和雅各布。马修宣称：“艾玛是无赖。”在艾玛的话中：“梅森是骑士。”梅森指出：“艾玛是无赖，马修是无赖。”雅各布说：“梅森是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是一名骑士  \n(2) 艾玛是一名无赖  \n(3) 梅森是一名无赖  \n(4) 雅各布是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四位居民：维多利亚、大卫、伊森和斯嘉丽。维多利亚表示：“如果且仅如果伊森是骑士，那么维多利亚就是骑士。”大卫说：“维多利亚是无赖，斯嘉丽是无赖。”伊森声明：“如果且仅如果斯嘉丽是骑士，那么大卫就是无赖。”斯嘉丽说：“如果且仅如果维多利亚是骑士，那么大卫就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 维多利亚是一名骑士  \n(2) 大卫是一个无赖  \n(3) 伊森是一名骑士  \n(4) 斯嘉丽是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：亨利、丹尼尔、塞巴斯蒂安和詹姆斯。亨利说：“丹尼尔是无赖或者詹姆斯是骑士。”丹尼尔指出：“塞巴斯蒂安是骑士或者塞巴斯蒂安是无赖。”塞巴斯蒂安提到：“如果詹姆斯是无赖，那么丹尼尔就是无赖。”詹姆斯评论道：“如果塞巴斯蒂安是骑士，那么亨利就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是一名骑士  \n(2) 丹尼尔是一名骑士  \n(3) 塞巴斯蒂安是一名骑士  \n(4) 詹姆斯是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：阿梅莉亚、杰克、艾玛和大卫。阿梅莉亚声称：“大卫不是无赖。”杰克说：“大卫是无赖。”艾玛说：“如果艾玛是骑士，那么阿梅莉亚就是无赖。”大卫说：“大卫是骑士，杰克是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是无赖  \n(2) 杰克是骑士  \n(3) 艾玛是骑士  \n(4) 大卫是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：亨利、维多利亚、艾弗里和艾玛。亨利说：“维多利亚是一个无赖。”维多利亚声称：“如果亨利是骑士，那么艾弗里就是骑士。”艾弗里说：“维多利亚不是骑士。”艾玛声称：“艾弗里是无赖，亨利也是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是无赖  \n(2) 维多利亚是骑士  \n(3) 艾弗里是无赖  \n(4) 艾玛是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：利亚姆、欧文、梅森和奥利弗。利亚姆说梅森是无赖，奥利弗是无赖。欧文提到：“利亚姆是骑士当且仅当利亚姆是无赖。”梅森说：“奥利弗是骑士当且仅当利亚姆是骑士。”根据奥利弗的说法：“梅森是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是一名骑士  \n(2) 欧文是一个无赖  \n(3) 梅森是一个无赖  \n(4) 奥利弗是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了四个居民：斯嘉丽、奥利维亚、梅森和伊丽莎白。斯嘉丽评论道：“梅森不是无赖。”在奥利维亚的话中：“梅森是骑士或者伊丽莎白是骑士。”梅森说伊丽莎白不是骑士。在伊丽莎白的陈述中：“当且仅当梅森是骑士时，伊丽莎白才是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 斯嘉丽是一名骑士  \n(2) 奥利维亚是一名骑士  \n(3) 梅森是一名骑士  \n(4) 伊丽莎白是一名无赖"
    }
]