[
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: إسكندر، إيثان، إليزابيث، لوك، نوح، وماثيو. وفقاً لإسكندر، \"نوح محتال\". إيثان أخبرك أنه إذا كان لوك محتالاً، فإن ماثيو محتال. إليزابيث قالت إن نوح فارس إذا وفقط إذا كان ماثيو محتالاً. \"نوح ليس فارساً\"، ذكر لوك. في بيان من نوح: \"ماثيو ليس محتالاً\". سمع ماثيو يقول، \"إسكندر فارس أو لوك محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إسكندر محتال  \n(2) إيثان محتال  \n(3) إليزابيث محتالة  \n(4) لوك محتال  \n(5) نوح فارس  \n(6) ماثيو فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: رايلي، مايسون، صوفيا، أبيجيل، دانيال، ومايكل. \"صوفيا فارس\"، ادعى رايلي. في تصريح لمايسون: \"دانيال محتال أو مايكل فارس\". كما قالت صوفيا: \"مايسون فارس إذا وفقط إذا كان مايسون محتالًا\". قالت أبيجيل إن دانيال فارس أو رايلي محتالة. أكد دانيال: \"رايلي فارس\". عبر مايكل عن أن رايلي محتالة إذا وفقط إذا كانت أبيجيل محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) رايلي محتالة  \n(2) مايسون فارس  \n(3) صوفيا محتالة  \n(4) أبيجيل فارس  \n(5) دانيال محتال  \n(6) مايكل محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: أميليا، أوليفر، لوكاس، بنيامين، مايكل، ولوغان. قالت أميليا: \"مايكل فارس إذا وفقط إذا كان لوغان فارساً\". أشار أوليفر: \"أميليا محتالة أو مايكل محتال\". أخبرك لوكاس أن مايكل ليس محتالاً. \"لوكاس محتال وأميليا محتالة\" - بنيامين. \"بنيامين محتال أو بنيامين فارس\" - ادعى مايكل. سمع لوغان يقول: \"أميليا فارس وبنيامين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا محتالة  \n(2) أوليفر فارس  \n(3) لوكاس فارس  \n(4) بنيامين محتال  \n(5) مايكل فارس  \n(6) لوغان محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: ويليام، يعقوب، أورورا، ماثيو، لوغان، وغريس. قال ويليام: \"يعقوب فارس أو لوغان فارس.\" أخبرك يعقوب أن ويليام فارس إذا وفقط إذا كان ماثيو فارساً. صرحت أورورا: \"إذا كان يعقوب فارساً، فإن غريس فارس.\" قال ماثيو: \"يعقوب محتال أو غريس محتالة.\" علق لوغان: \"إذا كان ويليام محتالاً، فإن يعقوب فارس.\" وفقاً لغريس، \"لوغان فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام محتال  \n(2) يعقوب محتال  \n(3) أورورا فارس  \n(4) ماثيو فارس  \n(5) لوغان محتال  \n(6) غريس محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: هنري، لوكاس، بينيلوب، غريس، إيلا، وإسكندر. كما قال هنري: \"بينيلوب فارس أو إيلا محتالة\". \"هنري ليس محتالاً\"، أعلن لوكاس. أكدت بينيلوب: \"إذا كان إسكندر فارساً، فإن إيلا فارس\". بكلمات غريس: \"لوكاس فارس\". \"لوكاس فارس إذا وفقط إذا كانت غريس محتالة\" - إيلا. سمع إسكندر يقول: \"هنري محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هنري فارس  \n(2) لوكاس فارس  \n(3) بينيلوب فارس  \n(4) غريس فارس  \n(5) إيلا محتالة  \n(6) إسكندر محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: بنيامين، زوي، صموئيل، ماثيو، كلوي، وداوود. سمع بنيامين يقول: \"زوي فارس إذا وفقط إذا كانت كلوي محتالًا\". أعلنت زوي: \"صموئيل ليس فارسًا\". علق صموئيل: \"صموئيل فارس إذا وفقط إذا كانت كلوي محتالًا\". عبر ماثيو عن أنه إذا كان صموئيل محتالًا، فإن كلوي محتالًا. قالت كلوي: \"ماثيو فارس إذا وفقط إذا كان بنيامين فارسًا\". علق داوود: \"بنيامين فارس وكلوي محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين محتال  \n(2) زوي محتالة  \n(3) صموئيل فارس  \n(4) ماثيو فارس  \n(5) كلوي محتالة  \n(6) داوود محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: دانيال، مايكل، مايسون، ماثيو، بنيامين، وليام. \"بنيامين ليس محتالًا\" - دانيال. قال مايكل: \"إذا كان ماثيو محتالًا، فإن مايسون محتال.\" \"مايكل فارس\" - مايسون. \"دانيال ليس فارسًا\" - أعلن ماثيو. \"مايسون محتال ومايسون فارس\" - ذكر بنيامين. قال ليام إن مايسون محتال ودانيال محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال محتال  \n(2) مايكل فارس  \n(3) مايسون فارس  \n(4) ماثيو فارس  \n(5) بنيامين محتال  \n(6) ليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: إيثان، أبيجيل، هاربر، سكارليت، آفا، وأوليفر. وفقاً لإيثان، \"إذا كان أوليفر محتالاً، فإن هاربر فارس\". \"سكارليت محتالة إذا وفقط إذا كان إيثان محتالاً\"، ادعت أبيجيل. هاربر أخبرك أن أبيجيل محتالة. سكارليت لاحظت، \"إيثان ليس فارساً\". \"إيثان محتال أو هاربر محتالة\"، ذكرت آفا. بكلمات أوليفر: \"أبيجيل فارس إذا وفقط إذا كانت آفا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان فارس  \n(2) أبيجيل محتالة  \n(3) هاربر فارس  \n(4) سكارليت محتالة  \n(5) آفا محتالة  \n(6) أوليفر محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: إيفلين، جاك، مايسون، أورورا، جاكسون، وجيمس. عبرت إيفلين عن أن مايسون ليس فارساً. بكلمات جاك: \"أورورا فارس أو جيمس فارس\". علق مايسون، \"جيمس فارس وأورورا محتالة\". في بيان من أورورا: \"إيفلين محتالة إذا وفقط إذا كان جاكسون محتالاً\". علق جاكسون، \"أورورا محتالة\". كما قال جيمس، \"مايسون فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين محتالة  \n(2) جاك فارس  \n(3) مايسون فارس  \n(4) أورورا محتالة  \n(5) جاكسون فارس  \n(6) جيمس فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: هاربر، يوسف، ماثيو، كلوي، أفري، وإيثان. \"إذا كانت أفري فارسًا، فإن يوسف فارس\"، أعلن هاربر. سمع يوسف يقول، \"إيثان فارس\". \"إذا كان هاربر محتالًا، فإن ماثيو فارس\"، ذكر ماثيو. علقت كلوي، \"ماثيو فارس وإيثان فارس\". في بيان من أفري: \"كلوي ليست فارسًا\". سمع إيثان يقول، \"كلوي محتالة أو هاربر فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر فارس  \n(2) يوسف فارس  \n(3) ماثيو فارس  \n(4) كلوي فارس  \n(5) أفري محتالة  \n(6) إيثان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 6 سكان: صوفيا، زوي، ليام، أبيجيل، آريا، وشارلوت. وفقاً لصوفيا، \"ليام محتال أو زوي محتالة\". زوي أخبرتك أن أبيجيل ليست فارسة. في كلمات ليام: \"صوفيا ليست محتالة\". أبيجيل لاحظت، \"ليام فارس\". \"ليام محتال إذا وفقط إذا كان ليام فارساً\" - آريا. كما قالت شارلوت، \"أبيجيل فارسة إذا وفقط إذا كانت صوفيا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) زوي محتالة  \n(3) ليام فارس  \n(4) أبيجيل فارس  \n(5) آريا محتالة  \n(6) شارلوت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: جاكسون، صموئيل، صوفيا، أفري، دانيال، وأوين. أكد جاكسون: \"أفري محتالة إذا وفقط إذا كان صموئيل فارساً\". \"إذا كانت صوفيا محتالة، فإن دانيال فارس\"، أعلن صموئيل. صوفيا عبرت عن أن صموئيل ليس فارساً. أفري عبرت عن أن دانيال محتال إذا وفقط إذا كانت صوفيا محتالة. في كلمات دانيال: \"أفري محتالة أو جاكسون محتال\". أوين أخبرك أن جاكسون ليس فارساً. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون فارس  \n(2) صموئيل فارس  \n(3) صوفيا محتالة  \n(4) أفري محتالة  \n(5) دانيال فارس  \n(6) أوين محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: ماثيو، أبيجيل، إليزابيث، دانيال، لوكاس، وآريا. في كلمات ماثيو: \"إذا كانت آريا فارساً، فإن لوكاس محتال\". أبيجيل علقت: \"إليزابيث محتالة إذا وفقط إذا كان ماثيو فارساً\". إليزابيث أكدت: \"ماثيو ليس فارساً\". دانيال أخبرك أن لوكاس محتال أو أبيجيل فارس. لوكاس قال: \"ماثيو فارس ولوكاس فارس\". وفقاً لآريا، \"دانيال فارس إذا وفقط إذا كانت إليزابيث محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ماثيو فارس  \n(2) أبيجيل فارس  \n(3) إليزابيث محتالة  \n(4) دانيال فارس  \n(5) لوكاس محتال  \n(6) آريا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: غريس، صوفيا، جيمس، نوح، إسكندر، وداوود. وفقًا لغريس، \"جيمس فارس أو داوود محتال\". \"إسكندر ليس فارسًا\"، أعلنت صوفيا. \"غريس محتالة وداوود فارس\"، أعلن جيمس. قال نوح، \"غريس ليست محتالة\". \"نوح فارس وغريس محتالة\" - إسكندر. \"صوفيا محتالة\"، ذكر داوود. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) غريس فارس  \n(2) صوفيا فارس  \n(3) جيمس محتال  \n(4) نوح فارس  \n(5) إسكندر محتال  \n(6) داوود محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: لوك، صوفيا، رايلي، كلوي، ويليام، وإيفلين. قال لوك: \"رايلي فارس إذا وفقط إذا كان ويليام محتالًا\". وفقًا لصوفيا، \"كلوي ليست محتالًا\". على لسان رايلي: \"رايلي فارس إذا وفقط إذا كانت كلوي محتالًا\". على لسان كلوي: \"إيفلين ليست فارسة\". أشار ويليام، \"إيفلين محتالة\". أضافت إيفلين، \"إيفلين فارسة إذا وفقط إذا كان لوك محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك محتال  \n(2) صوفيا محتالة  \n(3) رايلي محتالة  \n(4) كلوي محتالة  \n(5) ويليام محتال  \n(6) إيفلين فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 6 سكان: بينيلوب، جاكسون، أفري، فيكتوريا، شارلوت، وأورورا. قالت بينيلوب: \"فيكتوريا فارس أو جاكسون محتار\". \"إذا كان أفري فارساً، فإن أورورا محتالة\" - جاكسون. وفقاً لأفري، \"بينيلوب فارس إذا وفقط إذا كانت أورورا محتالة\". لاحظت فيكتوريا، \"فيكتوريا فارس\". لاحظت شارلوت، \"أفري محتال إذا وفقط إذا كانت بينيلوب محتالة\". كما قالت أورورا، \"أفري فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب محتالة  \n(2) جاكسون فارس  \n(3) أفري محتالة  \n(4) فيكتوريا محتالة  \n(5) شارلوت فارس  \n(6) أورورا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: دانيال، غريس، بينيلوب، رايلي، ليام، وبنيامين. في تصريح لدانيال: \"رايلي محتال أو رايلي فارس\". \"بينيلوب ليست محتالة\"، أعلنت غريس. وفقاً لبينيلوب، \"رايلي محتال ورايلي فارس\". رايلي أشار، \"بينيلوب فارس وبنيامين محتال\". ليام قال إنه إذا كانت غريس محتالة فإن دانيال فارس. بنيامين صرح، \"ليام محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال فارس  \n(2) غريس محتالة  \n(3) بينيلوب محتالة  \n(4) رايلي محتالة  \n(5) ليام فارس  \n(6) بنيامين محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: شارلوت، جاكسون، إيفلين، أيدن، إميلي، وأميليا. قالت شارلوت: \"إيفلين ليست فارسة\". ادعى جاكسون: \"شارلوت محتالة أو إيفلين فارسة\". عبرت إيفلين عن أنه إذا كان جاكسون محتالًا، فإن شارلوت فارسة. قال أيدن إن أيدن فارس وجاكسون محتال. \"شارلوت ليست محتالة\" - إميلي. أخبرتك أميليا أن إميلي فارسة وأميليا فارسة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت محتالة  \n(2) جاكسون فارس  \n(3) إيفلين فارس  \n(4) أيدن محتال  \n(5) إميلي محتالة  \n(6) أميليا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: جاكسون، زوي، إميلي، بينيلوب، شارلوت، وصموئيل. \"بينيلوب ليست فارساً\" - جاكسون. زوي أكدت: \"إميلي محتالة\". وفقاً لإميلي، \"بينيلوب فارس\". بينيلوب أخبرتك أن جاكسون محتال أو شارلوت محتالة. شارلوت صرحت، \"جاكسون فارس إذا وفقط إذا كانت إميلي فارسة\". صموئيل قال، \"جاكسون فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون محتال  \n(2) زوي محتالة  \n(3) إميلي فارسة  \n(4) بينيلوب فارسة  \n(5) شارلوت محتالة  \n(6) صموئيل محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: مايكل، أبيجيل، جيمس، نوح، آفا، وأوين. قال مايكل: \"إذا كانت آفا فارسة، فإن جيمس محتال\". أكدت أبيجيل: \"أوين محتال إذا وفقط إذا كانت آفا محتالة\". وفقًا لجيمس، \"مايكل ليس فارسًا\". \"جيمس محتال أو آفا محتالة\" - نوح. عبرت آفا عن أن مايكل فارس إذا وفقط إذا كان مايكل محتالًا. علق أوين، \"مايكل ليس فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل فارس  \n(2) أبيجيل فارس  \n(3) جيمس محتال  \n(4) نوح فارس  \n(5) آفا محتالة  \n(6) أوين محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: لوك، أوين، هنري، إميلي، مايسون، وبينيلوب. في كلمات لوك: \"إميلي محتالة أو أوين محتال\". \"مايسون فارس إذا وفقط إذا كان لوك فارسًا\" - أوين. كما قال هنري: \"مايسون محتال\". كما قالت إميلي: \"مايسون فارس إذا وفقط إذا كان مايسون محتالًا\". علق مايسون: \"لوك فارس وإميلي فارس\". قالت بينيلوب: \"لوك فارس أو بينيلوب فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) أوين محتال  \n(3) هنري فارس  \n(4) إميلي محتالة  \n(5) مايسون محتال  \n(6) بينيلوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: لوك، رايلي، إسكندر، جيمس، لوكاس، ومايكل. قال لوك: \"إسكندر محتال\". وفي كلمات رايلي: \"جيمس فارس\". قال إسكندر: \"رايلي فارس إذا وفقط إذا كان رايلي محتالاً\". قال جيمس إن مايكل فارس. وأكد لوكاس: \"رايلي محتال ومايكل فارس\". وفي تصريح لمايكل: \"جيمس محتال إذا وفقط إذا كان رايلي محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) رايلي فارس  \n(3) إسكندر محتال  \n(4) جيمس فارس  \n(5) لوكاس محتال  \n(6) مايكل فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: داوود، هنري، أبيجيل، أميليا، صوفيا، ويعقوب. قال داوود: \"هنري فارس وأميليا محتالة\". صرح هنري: \"صوفيا فارسة وأبيجيل محتالة\". وفقًا لأبيجيل، \"هنري فارس وصوفيا فارسة\". ادعت أميليا: \"هنري ليس فارسًا\". ذكرت صوفيا: \"إذا كان هنري محتالًا، فإن داوود فارس\". أعلن يعقوب: \"إذا كان يعقوب فارسًا، فإن صوفيا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود محتال  \n(2) هنري محتال  \n(3) أبيجيل محتالة  \n(4) أميليا فارسة  \n(5) صوفيا محتالة  \n(6) يعقوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: مايكل، هنري، ويليام، صوفيا، إيفلين، وجيمس. في تصريح لمايكل: \"إذا كانت صوفيا فارسًا، فإن إيفلين محتالة\". في كلمات هنري: \"مايكل ليس فارسًا\". ويليام عبر عن أن إيفلين فارس أو ويليام فارس. صوفيا قالت: \"مايكل محتال وهنري محتال\". \"مايكل فارس\"، أعلنت إيفلين. جيمس علق: \"صوفيا ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل فارس  \n(2) هنري محتال  \n(3) ويليام فارس  \n(4) صوفيا محتالة  \n(5) إيفلين فارس  \n(6) جيمس محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: بينيلوب، داوود، جيمس، ميا، نوح، وسكارليت. قالت بينيلوب: \"جيمس فارس أو سكارليت محتالة\". قال داوود: \"إذا كان نوح فارسًا، فإن بينيلوب فارس\". قال جيمس: \"إذا كانت ميا فارسة، فإن بينيلوب محتالة\". علقت ميا: \"نوح ليس محتالًا\". أعلن نوح: \"سكارليت محتالة وميا محتالة\". في تصريح من سكارليت: \"ميا ليست فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب فارس  \n(2) داوود فارس  \n(3) جيمس فارس  \n(4) ميا محتالة  \n(5) نوح محتال  \n(6) سكارليت فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: يوسف، إيزابيلا، إيلا، دانيال، لوغان، وجيمس. علق يوسف، \"دانيال محتال أو لوغان محتال\". في تصريح لإيزابيلا: \"دانيال محتال\". وفقًا لإيلا، \"لوغان محتال إذا وفقط إذا كان لوغان فارسًا\". في تصريح لدانيال: \"لوغان محتال وإيلا فارسة\". في كلمات لوغان: \"دانيال فارس\". كما قال جيمس، \"إذا كان يوسف فارسًا، فإن لوغان محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف فارس  \n(2) إيزابيلا فارس  \n(3) إيلا محتالة  \n(4) دانيال محتال  \n(5) لوغان محتال  \n(6) جيمس فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: جاك، لوكاس، مايسون، إيثان، أميليا، وليام. في تصريح لجاك: \"مايسون ليس فارساً\". في تصريح للوكاس: \"ليام فارس أو جاك فارس\". في كلمات مايسون: \"أميليا فارس\". \"إذا كان ليام فارساً، فإن أميليا فارس\"، أعلن إيثان. سُمعت أميليا تقول: \"مايسون فارس إذا وفقط إذا كان جاك محتالاً\". قال ليام: \"مايسون فارس إذا وفقط إذا كان جاك فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاك محتار  \n(2) لوكاس محتال  \n(3) مايسون فارس  \n(4) إيثان فارس  \n(5) أميليا فارس  \n(6) ليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: هنري، جاكسون، إميلي، دانيال، مايكل، وماثيو. علق هنري قائلاً: \"جاكسون فارس\". سمع جاكسون يقول: \"إميلي ليست فارسة\". صرحت إميلي: \"إذا كان ماثيو محتالًا، فإن ماثيو فارس\". عبر دانيال عن أن هنري فارس ومايكل فارس. أكد مايكل: \"مايكل فارس ودانيال فارس\". في بيان لماثيو: \"دانيال فارس وإميلي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هنري فارس  \n(2) جاكسون فارس  \n(3) إميلي محتالة  \n(4) دانيال محتال  \n(5) مايكل محتال  \n(6) ماثيو محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: آفا، هاربر، يعقوب، شارلوت، إيلا، ونوح. سُمعت آفا تقول: \"شارلوت محتالة أو يعقوب محتال\". \"يعقوب فارس أو شارلوت محتالة\"، ذكر هاربر. \"إيلا فارس وشارلوت فارس\"، ادعى يعقوب. في تصريح من شارلوت: \"آفا ليست فارسة\". لاحظت إيلا: \"آفا فارسة وهاربر فارس\". أكد نوح: \"إذا كانت آفا محتالة، فإن يعقوب فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا فارس  \n(2) هاربر فارس  \n(3) يعقوب محتال  \n(4) شارلوت محتالة  \n(5) إيلا فارس  \n(6) نوح فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: إيزابيلا، ليام، إميلي، أبيجيل، كلوي، وصوفيا. قالت إيزابيلا: \"أبيجيل ليست محتالة\". وفقاً لي Liam، \"أبيجيل فارس أو أبيجيل محتالة\". أكدت إميلي: \"أبيجيل فارس أو أبيجيل محتالة\". قالت أبيجيل: \"إذا كانت إميلي محتالة، فإن كلوي محتالة\". في تصريح لكلوي: \"ليام ليس محتالاً\". قالت صوفيا: \"إيزابيلا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا فارس  \n(2) ليام فارس  \n(3) إميلي فارس  \n(4) أبيجيل فارس  \n(5) كلوي فارس  \n(6) صوفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: فيكتوريا، غريس، جاكسون، ليام، هنري، ويوسف. قالت فيكتوريا: \"ليام ليس محتالًا.\" وأشارت غريس: \"إذا كان هنري فارسًا، فإن فيكتوريا فارس.\" وأكد جاكسون: \"إذا كانت فيكتوريا محتالة، فإن هنري محتال.\" قال ليام: \"يوسف فارس.\" وادعى هنري: \"جاكسون ليس فارسًا.\" قال يوسف إن ليام محتال أو غريس فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) فيكتوريا فارس  \n(2) غريس فارس  \n(3) جاكسون فارس  \n(4) ليام فارس  \n(5) هنري محتال  \n(6) يوسف فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: يعقوب، آريا، إسكندر، إيزابيلا، أوليفيا، وبنيامين. في كلمات يعقوب: \"أوليفيا فارس وأوليفيا محتالة\". \"إذا كان بنيامين محتالًا، فإن أوليفيا فارس\"، ذكرت آريا. \"بنيامين محتال إذا وفقط إذا كان إسكندر فارس\"، ذكر إسكندر. أكدت إيزابيلا: \"إسكندر محتال\". قالت أوليفيا إنه إذا كان إسكندر محتالًا، فإن يعقوب محتال. أكد بنيامين: \"إذا كانت إيزابيلا محتالة، فإن إيزابيلا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب محتال  \n(2) آريا فارس  \n(3) إسكندر فارس  \n(4) إيزابيلا محتالة  \n(5) أوليفيا فارس  \n(6) بنيامين محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: أبيجيل، ويليام، إيفلين، صموئيل، فيكتوريا، وصوفيا. علقت أبيجيل، \"فيكتوريا محتالة إذا وفقط إذا كانت فيكتوريا فارسة\". أكد ويليام: \"صوفيا محتالة\". عبرت إيفلين عن أن فيكتوريا محتالة إذا وفقط إذا كان صموئيل محتالاً. قال صموئيل، \"إيفلين محتالة ويليام فارس.\" صرحت فيكتوريا، \"صموئيل محتال وفيكتوريا فارسة\". لاحظت صوفيا، \"إيفلين محتالة أو ويليام فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أبيجيل محتالة  \n(2) ويليام محتال  \n(3) إيفلين محتالة  \n(4) صموئيل محتال  \n(5) فيكتوريا فارسة  \n(6) صوفيا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: لوك، سباستيان، يوسف، ليلي، سكارليت، وجيمس. قال لوك: \"إذا كان جيمس محتالًا، فإن يوسف فارس\". عبّر سباستيان عن أن ليلي ليست فارسة. علق يوسف، \"إذا كانت سكارليت محتالة، فإن ليلي محتالة\". قالت ليلي، \"يوسف محتال ولوك فارس\". صرحت سكارليت، \"جيمس محتال ويوسف محتال\". أعلن جيمس، \"سكارليت فارسة وسباستيان فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) سباستيان فارس  \n(3) يوسف فارس  \n(4) ليلي محتالة  \n(5) سكارليت محتالة  \n(6) جيمس محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: غريس، جاك، دانيال، إيفلين، إيلا، وميا. قالت غريس لك: \"إذا كانت إيفلين فارسة، فإن إيلا محتالة.\" ادعى جاك: \"إيلا ليست فارسة.\" أشار دانيال: \"دانيال فارس إذا وفقط إذا كان جاك محتالاً.\" قالت إيفلين: \"ميا محتالة إذا وفقط إذا كانت ميا فارسة.\" ذكرت إيلا: \"ميا ليست فارسة.\" صرحت ميا: \"جاك محتال أو دانيال فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) غريس فارس  \n(2) جاك محتال  \n(3) دانيال محتال  \n(4) إيفلين محتالة  \n(5) إيلا فارس  \n(6) ميا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: ليام، يوسف، مايكل، يعقوب، إليزابيث، ومايسون. قال ليام: \"يوسف فارس ومايكل فارس\". \"إذا كان ليام محتالاً، فإن ليام فارس\"، ادعى يوسف. صرح مايكل: \"يوسف فارس إذا وفقط إذا كان يعقوب محتالاً\". في كلمات يعقوب: \"يعقوب فارس إذا وفقط إذا كان مايكل محتالاً\". أعربت إليزابيث عن أن ليام ليس فارساً. \"يوسف فارس إذا وفقط إذا كان يعقوب محتالاً\"، ادعى مايسون. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام محتال  \n(2) يوسف محتال  \n(3) مايكل محتال  \n(4) يعقوب محتال  \n(5) إليزابيث فارس  \n(6) مايسون محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: ليام، إيفلين، إيزابيلا، جاكسون، أيدن، وصوفيا. ليام أعرب عن أن إيفلين فارس. إيفلين قالت: \"إيفلين فارس وإيزابيلا محتالة\". كما قالت إيزابيلا: \"إذا كانت صوفيا محتالة، فإن ليام فارس\". كما قال جاكسون: \"إيفلين محتالة وصوفيا فارس\". في كلمات أيدن: \"جاكسون محتال وإيفلين فارس\". \"إذا كان ليام فارسًا، فإن جاكسون فارس\" - صوفيا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام محتال  \n(2) إيفلين محتالة  \n(3) إيزابيلا فارسة  \n(4) جاكسون فارس  \n(5) أيدن محتال  \n(6) صوفيا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: إسكندر، رايلي، آفا، شارلوت، أميليا، وأوليفيا. وفقًا لإسكندر، \"إذا كانت رايلي محتالة، فإن أميليا محتالة\". أكدت رايلي: \"أفا فارس إذا وفقط إذا كانت شارلوت فارسة\". كما قالت آفا: \"شارلوت ليست محتالة\". في بيان من شارلوت: \"أميليا ليست فارسة\". \"أوليفيا فارسة أو آفا محتالة\"، ذكرت أميليا. أكدت أوليفيا: \"رايلي محتالة أو إسكندر فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إسكندر فارس  \n(2) رايلي فارس  \n(3) آفا محتالة  \n(4) شارلوت محتالة  \n(5) أميليا فارس  \n(6) أوليفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: أوين، زوي، غريس، ليلي، لوكاس، وصوفيا. \"إذا كانت ليلي محتالة، فإن ليلي فارس\"، أعلن أوين. علقت زوي، \"ليلي محتالة\". في كلمات غريس: \"لوكاس محتال أو زوي محتالة\". \"لوكاس محتال إذا وفقط إذا كانت ليلي فارس\"، ذكرت ليلي. علق لوكاس، \"إذا كان أوين محتالًا، فإن أوين فارس\". أكدت صوفيا: \"ليلي ليست فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين محتال  \n(2) زوي فارسة  \n(3) غريس فارسة  \n(4) ليلي محتالة  \n(5) لوكاس محتال  \n(6) صوفيا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: جيمس، صوفيا، رايلي، هنري، جاكسون، وبينيلوب. في كلمات جيمس: \"إذا كانت صوفيا فارسة، فإن رايلي محتال\". \"بينيلوب ليست فارسة\" - صوفيا. \"جيمس ليس محتالاً\"، ادعى رايلي. \"رايلي فارس\" - هنري. \"هنري محتال وصوفيا فارسة\" - جاكسون. قالت بينيلوب: \"صوفيا فارسة إذا وفقط إذا كان رايلي محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس فارس  \n(2) صوفيا محتالة  \n(3) رايلي فارس  \n(4) هنري فارس  \n(5) جاكسون محتال  \n(6) بينيلوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: سكارليت، إيزابيلا، أيدن، إسكندر، ويليام، ويوسف. في كلمات سكارليت: \"إسكندر فارس إذا وفقط إذا كان ويليام محتالًا\". \"ويليام محتال إذا وفقط إذا كان ويليام فارسًا\" - إيزابيلا. \"إيزابيلا فارس\" ، ادعى أيدن. في بيان من إسكندر: \"سكارليت محتالة أو ويليام محتال\". أشار ويليام، \"أيدن ليس محتالًا\". \"أيدن ليس فارسًا\" - يوسف. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سكارليت فارس  \n(2) إيزابيلا محتالة  \n(3) أيدن محتال  \n(4) إسكندر فارس  \n(5) ويليام محتال  \n(6) يوسف فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: دانيال، ليلي، صوفيا، لوك، نوح، وأفري. في تصريح لدانيال: \"لوك فارس أو نوح محتال\". \"دانيال محتال أو صوفيا محتالة\"، أعلنت ليلي. صوفيا قالت إن نوح فارس أو لوك فارس. لوك أشار، \"أفري فارس ونوح محتال\". في كلمات نوح: \"لوك فارس\". كما قالت أفري، \"دانيال محتال أو صوفيا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال فارس  \n(2) ليلي فارس  \n(3) صوفيا محتالة  \n(4) لوك محتال  \n(5) نوح محتال  \n(6) أفري محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: فيكتوريا، هاربر، إسكندر، جيمس، ليلي، وأوليفر. قالت فيكتوريا: \"إسكندر محتال أو جيمس فارس\". وفقًا لهاربر، \"ليلي محتالة\". قال إسكندر: \"أوليفر محتال\". صرح جيمس: \"جيمس فارس وأوليفر فارس\". \"أوليفر فارس وفيكتوريا محتالة\" - ليلي. أعرب أوليفر عن أن إسكندر فارس أو جيمس فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) فيكتوريا فارس  \n(2) هاربر فارس  \n(3) إسكندر محتال  \n(4) جيمس فارس  \n(5) ليلي محتالة  \n(6) أوليفر فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: ليام، إيلا، صوفيا، أوين، مايكل، ومايسون. في كلمات ليام: \"صوفيا محتالة أو ليام فارس\". في كلمات إيلا: \"صوفيا فارس\". وفقًا لصوفيا، \"ليام ليس محتالًا\". أوين أكد: \"مايكل ليس فارسًا\". \"ليام ليس محتالًا\" - مايكل. قال مايسون إن مايكل محتال أو مايكل فارس. إذن، من هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام فارس  \n(2) إيلا فارس  \n(3) صوفيا فارس  \n(4) أوين محتار  \n(5) مايكل فارس  \n(6) مايسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: أوليفر، هنري، أوليفيا، أوين، سباستيان، وأميليا. في تصريح من أوليفر: \"أوليفيا ليست محتالة\". هنري عبر عن أن أوليفيا محتالة. \"أميليا محتالة وأوليفر محتال\"، ذكرت أوليفيا. أوين أخبرك أن أميليا ليست فارسة. سباستيان صرح: \"أوين فارس إذا وفقط إذا كانت أوليفيا فارسة\". أميليا أكدت: \"أميليا فارسة إذا وفقط إذا كان سباستيان فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفر محتال  \n(2) هنري فارس  \n(3) أوليفيا محتالة  \n(4) أوين محتال  \n(5) سباستيان فارس  \n(6) أميليا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: أبيجيل، كلوي، مايكل، داوود، إيفلين، وصوفيا. قالت أبيجيل: \"داوود ليس محتالًا\". وفي كلمات كلوي: \"أبيجيل فارس إذا وفقط إذا كانت صوفيا فارسة\". علق مايكل: \"صوفيا فارسة أو كلوي محتالة\". قال داوود: \"كلوي ليست محتالة\". قالت إيفلين: \"داوود محتال إذا وفقط إذا كانت صوفيا محتالة\". وفي بيان من صوفيا: \"داوود محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أبيجيل محتالة  \n(2) كلوي محتالة  \n(3) مايكل فارس  \n(4) داوود محتال  \n(5) إيفلين محتالة  \n(6) صوفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: لوك، إميلي، إسكندر، بنيامين، آريا، وإيفلين. في تصريح من لوك: \"بنيامين فارس\". سُمعت إميلي تقول: \"إيفلين فارس أو إسكندر محتال\". \"إذا كان لوك فارساً، فإن لوك محتال\" - إسكندر. وفقاً لبنيامين، \"إذا كان لوك فارساً، فإن إميلي فارس\". آريا قالت إن لوك ليس محتالاً. كما قالت إيفلين: \"إميلي ليست فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) إميلي فارس  \n(3) إسكندر محتال  \n(4) بنيامين فارس  \n(5) آريا فارس  \n(6) إيفلين محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: إيثان، إيلا، كلوي، آريا، أوين، وشارلوت. علق إيثان، \"آريا فارس أو إيثان فارس\". سُمعت إيلا تقول، \"شارلوت ليست محتالة\". علقّت كلوي، \"إيثان فارس أو آريا فارس\". في كلمات آريا: \"كلوي محتالة وإيلا محتالة\". في بيان من أوين: \"كلوي ليست فارسة\". كما قالت شارلوت، \"كلوي ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان فارس  \n(2) إيلا فارس  \n(3) كلوي فارس  \n(4) آريا محتالة  \n(5) أوين محتال  \n(6) شارلوت فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: أورورا، ويليام، ليام، لوغان، لوك، وبينيلوب. \"ليام ليس محتالًا\"، ادعت أورورا. أخبرك ويليام أن لوغان محتال أو لوك فارس. علق ليام، \"لوك محتال أو أورورا محتالة\". أكد لوغان: \"أورورا فارس أو ليام فارس\". علق لوك، \"لوك فارس إذا وفقط إذا كان ليام فارسًا\". في بيان من بينيلوب: \"ليام ليس فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أورورا فارس  \n(2) ويليام محتال  \n(3) ليام فارس  \n(4) لوغان فارس  \n(5) لوك محتال  \n(6) بينيلوب محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: غريس، شارلوت، جاك، سباستيان، أبيجيل، وميا. في تصريح من غريس: \"إذا كان جاك محتالاً، فإن أبيجيل محتالة\". \"سباستيان ليس محتالاً\"، ذكرت شارلوت. جاك أشار، \"ميا فارس\". سباستيان قال إن أبيجيل فارس إذا وفقط إذا كانت غريس فارساً. أبيجيل علقت، \"شارلوت محتالة أو شارلوت فارس\". وفقاً لميا، \"أبيجيل فارس أو غريس فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) غريس فارس  \n(2) شارلوت فارس  \n(3) جاك فارس  \n(4) سباستيان فارس  \n(5) أبيجيل فارس  \n(6) ميا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: أيدن، بنيامين، لوكاس، يوسف، آريا، وجيمس. أيدن قال: \"جيمس فارس أو بنيامين فارس\". بنيامين صرح: \"أيدن محتال\". لوكاس أشار: \"جيمس فارس أو جيمس محتال\". \"بنيامين ليس محتالًا\" - يوسف. سُمعت آريا تقول: \"إذا كان لوكاس فارسًا، فإن يوسف محتال\". جيمس صرح: \"يوسف محتال إذا وفقط إذا كان أيدن فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن فارس  \n(2) بنيامين محتال  \n(3) لوكاس فارس  \n(4) يوسف محتال  \n(5) آريا فارس  \n(6) جيمس فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: آفا، إميلي، لوك، لوكاس، هاربر، وإيلا. في كلمات آفا: \"لوك فارس إذا وفقط إذا كانت إيلا محتالة\". صرحت إميلي، \"إذا كانت إميلي فارسة، فإن لوك محتال\". أكد لوك: \"إيلا فارسة وإيلا محتالة\". \"هاربر محتالة ولوك محتال\"، ادعى لوكاس. كما قالت هاربر، \"لوكاس محتال إذا وفقط إذا كانت آفا فارسة\". سُمعت إيلا تقول، \"إذا كانت إميلي فارسة، فإن هاربر فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا فارس  \n(2) إميلي فارس  \n(3) لوك محتال  \n(4) لوكاس محتال  \n(5) هاربر فارس  \n(6) إيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: أبيجيل، ليلي، إيلا، إميلي، صوفيا، ولوغان. قالت أبيجيل: \"صوفيا ليست محتالة\". أعربت ليلي عن أن إيلا فارس أو لوغان فارس. ادعت إيلا: \"صوفيا محتالة وصوفيا فارس\". وفقًا لكلمات إميلي: \"أبيجيل فارس\". كما قالت صوفيا: \"إذا كانت صوفيا فارس، فإن ليلي فارس\". كما قال لوغان: \"صوفيا ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أبيجيل فارس  \n(2) ليلي فارس  \n(3) إيلا محتالة  \n(4) إميلي فارس  \n(5) صوفيا فارس  \n(6) لوغان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: إيما، أفري، ويليام، ماثيو، سكارليت، وإيثان. علقت إيما، \"إيما فارس أو ويليام فارس\". كما قال أفري، \"إيما محتالة وويليام محتال\". قال ويليام، \"إيثان محتال\". \"أفري محتال أو ويليام محتال\"، ادعى ماثيو. في كلمات سكارليت: \"ماثيو محتال وإيثان فارس\". قال إيثان، \"إيما فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما فارس  \n(2) أفري محتالة  \n(3) ويليام محتال  \n(4) ماثيو فارس  \n(5) سكارليت محتالة  \n(6) إيثان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: جاكسون، أبيجيل، إيلا، نوح، أفري، وماثيو. علق جاكسون، \"أبيجيل محتالة وأبيجيل فارس\". لاحظت أبيجيل، \"أفري محتالة وأفري فارس\". أعلنت إيلا، \"ماثيو محتال أو ماثيو فارس\". قال نوح، \"إذا كان أفري فارسًا، فإن إيلا فارس\". علق أفري، \"ماثيو فارس\". ادعى ماثيو، \"إذا كان جاكسون فارسًا، فإن إيلا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون محتال  \n(2) أبيجيل محتالة  \n(3) إيلا فارسة  \n(4) نوح فارس  \n(5) أفري فارسة  \n(6) ماثيو فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: سكارليت، لوك، بينيلوب، ميا، رايلي، ونوح. في كلمات سكارليت: \"لوك فارس إذا وفقط إذا كانت سكارليت فارساً\". كما قال لوك: \"سكارليت فارس\". في كلمات بينيلوب: \"رايلي محتال أو لوك محتال\". ميا صرحت: \"نوح فارس أو لوك محتال\". رايلي أشار: \"ميا فارس إذا وفقط إذا كان لوك محتالاً\". نوح عبر عن أن ميا فارس إذا وفقط إذا كانت رايلي فارساً. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سكارليت فارس  \n(2) لوك فارس  \n(3) بينيلوب محتالة  \n(4) ميا محتالة  \n(5) رايلي فارس  \n(6) نوح محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: هاربر، مايسون، داوود، أوين، كلوي، وزوي. لاحظت هاربر، \"زوي ليست محتالة\". قال مايسون إن أوين محتال أو زوي فارس. علق داوود، \"إذا كانت كلوي فارسة، فإن هاربر فارسة\". لاحظ أوين، \"هاربر فارسة وكلوي فارسة\". كما قالت كلوي، \"مايسون فارس وهاربر محتالة\". سُمعت زوي تقول، \"زوي فارسة وكلوي فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر محتالة  \n(2) مايسون فارس  \n(3) داوود محتال  \n(4) أوين محتال  \n(5) كلوي فارسة  \n(6) زوي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: إيفلين، إسكندر، أورورا، أوين، مايسون، ولوغان. أكدت إيفلين: \"مايسون فارس ولوغان محتال\". أكد إسكندر: \"لوغان محتال وإيفلين فارس\". أخبرتك أورورا أنه إذا كان إسكندر فارسًا، فإن لوغان فارس. ادعى أوين: \"لوغان محتال وأورورا محتالة\". ذكر مايسون: \"إسكندر محتال إذا وفقط إذا كان أوين فارسًا\". أكد لوغان: \"أورورا ليست فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين محتالة  \n(2) إسكندر محتال  \n(3) أورورا فارسة  \n(4) أوين محتال  \n(5) مايسون محتال  \n(6) لوغان محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: مايكل، آريا، إيفلين، إيثان، صوفيا، وأورورا. \"أورورا فارس أو إيفلين محتالة\" - مايكل. في تصريح من آريا: \"صوفيا فارس وإيثان فارس\". سُمعت إيفلين تقول: \"مايكل فارس\". \"صوفيا فارس وآريا فارس\" - إيثان. أخبرت صوفيا أنك إذا كان مايكل فارسًا فإن أورورا محتالة. أكدت أورورا: \"صوفيا محتالة أو مايكل فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل فارس  \n(2) آريا محتالة  \n(3) إيفلين فارسة  \n(4) إيثان محتال  \n(5) صوفيا محتالة  \n(6) أورورا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: بينيلوب، جيمس، نوح، صموئيل، كلوي، وأبيجيل. قالت بينيلوب: \"نوح ليس فارساً\". أعلن جيمس: \"صموئيل محتال أو صموئيل فارس\". قال نوح: \"كلوي ليست فارسة\". علق صموئيل: \"نوح محتال إذا وفقط إذا كانت بينيلوب فارسة\". قالت كلوي: \"بينيلوب فارسة أو بينيلوب محتالة\". أعلنت أبيجيل: \"نوح فارس إذا وفقط إذا كان جيمس محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب فارس  \n(2) جيمس فارس  \n(3) نوح محتال  \n(4) صموئيل فارس  \n(5) كلوي فارس  \n(6) أبيجيل فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: صموئيل، أوليفر، صوفيا، يوسف، أوليفيا، وميا. علق صموئيل، \"يوسف فارس وأوليفر محتار\". وفقًا لأوليفر، \"إذا كان يوسف محتالًا، فإن أوليفر فارس\". صرحت صوفيا أن أوليفيا فارس إذا وفقط إذا كان يوسف محتالًا. \"ميا فارس\"، ادعى يوسف. أخبرتك أوليفيا أن يوسف فارس وصموئيل فارس. في كلمات ميا: \"أوليفيا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صموئيل محتال  \n(2) أوليفر فارس  \n(3) صوفيا فارس  \n(4) يوسف فارس  \n(5) أوليفيا محتالة  \n(6) ميا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: آفا، داوود، صوفيا، أورورا، أميليا، وسكارليت. \"داوود محتال أو سكارليت فارس\"، ذكرت آفا. أعرب داوود عن أنه إذا كان داوود فارسًا فإن أميليا فارس. سُمع صوفيا تقول، \"سكارليت ليست محتالة\". قالت أورورا، \"آفا محتالة وسكارليت محتالة\". \"صوفيا فارس\"، ادعت أميليا. لاحظت سكارليت، \"إذا كانت صوفيا محتالة فإن آفا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا فارس  \n(2) داوود فارس  \n(3) صوفيا فارس  \n(4) أورورا محتالة  \n(5) أميليا فارس  \n(6) سكارليت فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: لوك، إيما، إميلي، إيفلين، أيدن، وليلي. قال لوك: \"أيدن محتال أو إميلي فارس\". علقت إيما: \"إميلي فارس إذا وفقط إذا كان أيدن محتالًا\". عبرت إميلي عن أن لوك محتال أو إيفلين محتالة. \"إذا كانت إيفلين فارسًا، فإن لوك فارس\" - إيفلين. \"ليلي محتالة أو أيدن فارس\" - أيدن. \"إميلي محتالة وإيفلين فارس\" - ادعت ليلي. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس \n(2) إيما محتالة  \n(3) إميلي محتالة  \n(4) إيفلين فارسة  \n(5) أيدن محتال  \n(6) ليلي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: أفري، لوغان، بينيلوب، إليزابيث، زوي، ورايلي. أفري علقت، \"إذا كانت بينيلوب فارسًا، فإن زوي فارس.\" سمع لوغان يقول، \"رايلي محتالة إذا وفقط إذا كانت زوي فارسًا.\" قالت بينيلوب، \"زوي فارس إذا وفقط إذا كان لوغان فارسًا.\" قالت إليزابيث، \"زوي ليست محتالة.\" \"بينيلوب ليست فارسًا،\" أعلنت زوي. في تصريح من رايلي: \"لوغان فارس وزوي فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري محتالة  \n(2) لوغان محتال  \n(3) بينيلوب فارسة  \n(4) إليزابيث محتالة  \n(5) زوي محتالة  \n(6) رايلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: هاربر، نوح، جيمس، مايسون، آفا، وإيميلي. \"إيميلي محتالة ونوح فارس\"، ادعى هاربر. في كلمات نوح: \"جيمس محتال إذا وفقط إذا كان هاربر محتالاً\". وفقاً لجيمس، \"نوح محتال إذا وفقط إذا كان هاربر محتالاً\". وفقاً لمايسون، \"جيمس ليس محتالاً\". في كلمات آفا: \"إيميلي فارس أو هاربر فارس\". \"جيمس ليس محتالاً\"، ذكرت إيميلي. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر محتالة  \n(2) نوح محتال  \n(3) جيمس فارس  \n(4) مايسون فارس  \n(5) آفا فارس  \n(6) إميلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: جيمس، جاك، فيكتوريا، أوليفيا، إيما، وصوفيا. لاحظ جيمس، \"صوفيا محتالة أو فيكتوريا محتالة\". صرح جاك، \"إيما فارس إذا وفقط إذا كانت صوفيا فارسة\". في بيان من فيكتوريا: \"جيمس فارس إذا وفقط إذا كانت إيما محتالة\". \"جاك فارس\" - أوليفيا. علقت إيما، \"فيكتوريا فارسة وصوفيا فارسة\". عبرت صوفيا عن أن أوليفيا فارسة وفيكتوريا محتالة. إذن من هو فارس ومن هو محتال؟",
        "solution_text_format": "(1) جيمس فارس  \n(2) جاك فارس  \n(3) فيكتوريا فارسة  \n(4) أوليفيا فارسة  \n(5) إيما محتالة  \n(6) صوفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: هاربر، زوي، آفا، ويليام، إيما، وإيثان. أكد هاربر: \"ويليام محتال أو إيثان محتال\". كما قالت زوي: \"آفا فارس وهاربر فارس\". وفقًا لآفا، \"إيثان محتال ويليام فارس\". أعلن ويليام: \"إيثان محتال وزوي محتالة\". صرحت إيما: \"إيثان محتال إذا وفقط إذا كانت زوي محتالة\". قال إيثان: \"إيثان فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر فارس  \n(2) زوي محتالة  \n(3) آفا محتالة  \n(4) ويليام محتال  \n(5) إيما محتالة  \n(6) إيثان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: فيكتوريا، لوكاس، أيدن، كلوي، جيمس، وهاربر. \"كلوي محتالة\"، أعلنت فيكتوريا. \"إذا كانت هاربر فارسة، فإن لوكاس فارس\"، أعلن لوكاس. قال أيدن، \"كلوي محتالة إذا وفقط إذا كان جيمس فارسًا.\" قالت كلوي إن فيكتوريا محتالة أو جيمس فارس. في بيان لجيمس: \"إذا كانت فيكتوريا فارسة، فإن كلوي محتالة\". لاحظت هاربر، \"جيمس محتال إذا وفقط إذا كانت كلوي فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) فيكتوريا محتالة  \n(2) لوكاس فارس  \n(3) أيدن محتال  \n(4) كلوي فارس  \n(5) جيمس فارس  \n(6) هاربر محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: صموئيل، زوي، إيزابيلا، لوغان، مايكل، وويليام. صرح صموئيل، \"إيزابيلا محتالة إذا وفقط إذا كان مايكل فارساً\". أخبرتك زوي أن إيزابيلا محتالة إذا وفقط إذا كان ويليام محتالاً. في تصريح لإيزابيلا: \"زوي فارس أو صموئيل فارس\". قال لوغان إنه إذا كانت زوي محتالة، فإن لوغان فارس. وفقاً لمايكل، \"إيزابيلا فارسة ومايكل فارس\". علق ويليام، \"مايكل فارس إذا وفقط إذا كان ويليام فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صموئيل محتال  \n(2) زوي فارس  \n(3) إيزابيلا فارس  \n(4) لوغان فارس  \n(5) مايكل فارس  \n(6) ويليام فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: ماثيو، صوفيا، جيمس، إيزابيلا، يعقوب، وإيفلين. أكد ماثيو: \"إيفلين فارس وإيزابيلا محتالة\". ذكرت صوفيا: \"جيمس فارس أو جيمس محتال\". صرح جيمس: \"ماثيو فارس ويعقوب فارس\". أعلنت إيزابيلا: \"إذا كان يعقوب محتالًا، فإن صوفيا محتالة\". أخبرك يعقوب أن يعقوب فارس. قالت إيفلين: \"ماثيو ليس فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ماثيو محتال  \n(2) صوفيا فارس  \n(3) جيمس محتال  \n(4) إيزابيلا فارس  \n(5) يعقوب فارس  \n(6) إيفلين فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: يعقوب، آفا، أوليفر، ويليام، كلوي، وداوود. أعرب يعقوب عن أنه إذا كان داوود محتالاً، فإن آفا محتالة. أكدت آفا: \"داوود فارس وداوود محتال\". علق أوليفر، \"إذا كان ويليام محتالاً، فإن داوود محتال\". أكد ويليام: \"يعقوب محتال وأوليفر فارس\". وفقاً لكلوي، \"أوليفر فارس\". أخبرك داوود أن آفا محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب فارس  \n(2) آفا محتالة  \n(3) أوليفر محتال  \n(4) ويليام محتال  \n(5) كلوي محتالة  \n(6) داوود فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: جيمس، مايسون، يعقوب، بينيلوب، هاربر، وإيما. علق جيمس قائلاً: \"بينيلوب محتالة أو يعقوب فارس\". في كلمات مايسون: \"هاربر فارس\". أخبرك يعقوب أنه إذا كان مايسون محتالاً، فإن مايسون فارس. سمع بينيلوب تقول: \"هاربر محتال وإيما محتالة\". وفقاً لهاربر، \"إيما فارس أو جيمس فارس\". عبرت إيما عن أنه إذا كانت هاربر فارساً، فإن جيمس فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس فارس  \n(2) مايسون فارس  \n(3) يعقوب فارس  \n(4) بينيلوب محتالة  \n(5) هاربر فارس  \n(6) إيما فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: أوليفيا، ميا، آفا، أوليفر، رايلي، وجاكسون. في كلمات أوليفيا: \"ميا محتالة إذا وفقط إذا كان أوليفر محتالًا\". وفقًا لميا، \"آفا فارس أو ميا فارس\". وفقًا لآفا، \"رايلي محتال أو أوليفر فارس\". قال أوليفر إن ميا فارس أو آفا فارس. في بيان من رايلي: \"إذا كان جاكسون محتالًا، فإن جاكسون فارس\". أشار جاكسون، \"أوليفيا فارس إذا وفقط إذا كانت أوليفيا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا فارس  \n(2) ميا فارس  \n(3) آفا فارس  \n(4) أوليفر فارس  \n(5) رايلي محتال  \n(6) جاكسون محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: داوود، آفا، أورورا، إيلا، لوغان، ولوك. أخبرك داوود أن لوك هو فارس إذا وفقط إذا كانت آفا محتالة. \"إذا كان لوك محتالًا، فإن لوغان فارس\"، ذكرت آفا. أعربت أورورا عن أنه إذا كان داوود فارسًا، فإن آفا فارس. أعربت إيلا أن لوغان محتال أو لوك فارس. \"آفا فارس أو داوود فارس\"، ادعى لوغان. أكد لوك: \"أورورا محتالة أو لوغان محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود فارس  \n(2) آفا فارس  \n(3) أورورا فارس  \n(4) إيلا محتالة  \n(5) لوغان فارس  \n(6) لوك محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: أبيجيل، آريا، سباستيان، هنري، آفا، وبنيامين. كما قالت أبيجيل، \"آريا فارس إذا وفقط إذا كان بنيامين محتالاً\". آريا أخبرتك أن آريا فارس أو بنيامين محتال. \"آفا محتال أو هنري فارس\"، أعلن سباستيان. سمع هنري يقول، \"آفا فارس وبنيامين فارس\". آفا قالت، \"بنيامين محتال وأبيجيل فارس\". بنيامين قال، \"إذا كانت أبيجيل فارس، فإن آفا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أبيجيل محتالة  \n(2) آريا فارسة  \n(3) سباستيان فارس  \n(4) هنري محتال  \n(5) آفا محتالة  \n(6) بنيامين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: صموئيل، مايسون، بنيامين، صوفيا، هاربر، وآريا. صموئيل قال: \"آريا فارس\". مايسون قال: \"بنيامين محتال إذا وفقط إذا كانت آريا فارس\". وفقًا لبنيامين، \"صموئيل فارس أو صوفيا فارس\". صوفيا علقت: \"آريا فارس أو هاربر محتالة\". سمع هاربر يقول: \"هاربر فارس\". سمع آريا تقول: \"إذا كان بنيامين فارس، فإن بنيامين محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صموئيل محتال  \n(2) مايسون فارس  \n(3) بنيامين فارس  \n(4) صوفيا فارس  \n(5) هاربر محتالة  \n(6) آريا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: هاربر، ويليام، آريا، صموئيل، لوكاس، ومايسون. كما قالت هاربر، \"لوكاس محتال وصموئيل محتال\". قال ويليام إن مايسون محتال وصموئيل فارس. عبرت آريا عن أن هاربر فارس ومايسون فارس. صرح صموئيل، \"آريا ليست محتالة\". عبر لوكاس عن أن مايسون محتال أو ويليام محتال. أخبرك مايسون أن هاربر ليست محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر محتالة  \n(2) ويليام محتال  \n(3) آريا محتالة  \n(4) صموئيل محتال  \n(5) لوكاس فارس  \n(6) مايسون محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 6 سكان: مايكل، إيما، كلوي، زوي، إسكندر، وإيلا. في تصريح لمايكل: \"إذا كانت زوي فارساً، فإن كلوي محتالة\". لاحظت إيما، \"كلوي محتالة أو زوي محتالة\". أخبرتك كلوي أن مايكل محتال أو إيما محتالة. كما قالت زوي، \"مايكل ليس محتالاً\". صرح إسكندر، \"كلوي محتالة\". وفقاً لإيلا، \"كلوي فارس أو إسكندر فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل فارس  \n(2) إيما فارس  \n(3) كلوي محتالة  \n(4) زوي فارس  \n(5) إسكندر فارس  \n(6) إيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: ميا، كلوي، داوود، شارلوت، إليزابيث، وأوليفيا. قالت ميا: \"ميا فارس أو أوليفيا محتالة\". قالت كلوي إن شارلوت فارس. صرح داوود: \"إليزابيث محتالة\". قالت شارلوت: \"كلوي فارس إذا وفقط إذا كانت ميا محتالة\". أعلنت إليزابيث: \"ميا فارس أو أوليفيا فارس\". سُمعت أوليفيا تقول: \"شارلوت فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا محتالة  \n(2) كلوي فارسة  \n(3) داوود محتال  \n(4) شارلوت فارسة  \n(5) إليزابيث فارسة  \n(6) أوليفيا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: لوك، لوكاس، دانيال، سكارليت، غريس، وصموئيل. وفقاً للوك، \"إذا كانت سكارليت محتالة، فإن لوك فارس\". أكد لوكاس: \"إذا كانت غريس فارسة، فإن سكارليت محتالة\". سمع دانيال يقول، \"لوكاس محتال أو لوك فارس\". علقت سكارليت، \"دانيال محتال\". في بيان من غريس: \"سكارليت فارسة\". \"إذا كان لوك فارساً، فإن دانيال محتال\"، ذكر صموئيل. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) لوكاس فارس  \n(3) دانيال فارس  \n(4) سكارليت محتالة  \n(5) غريس محتالة  \n(6) صموئيل محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: إميلي، أوين، ميا، بنيامين، ماثيو، وإيزابيلا. قالت إميلي: \"إذا كانت ميا محتالة، فإن إيزابيلا محتالة.\" علق أوين: \"بنيامين محتال.\" ادعت ميا: \"أوين ليس فارساً.\" وفقاً لبنيامين، \"ماثيو محتال أو بنيامين فارس.\" قال ماثيو: \"إذا كان بنيامين محتالاً، فإن إيزابيلا فارس.\" سُمعت إيزابيلا تقول: \"إذا كان أوين فارساً، فإن أوين محتال.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي فارس  \n(2) أوين محتال  \n(3) ميا فارس  \n(4) بنيامين فارس  \n(5) ماثيو فارس  \n(6) إيزابيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: إميلي، شارلوت، جيمس، لوكاس، إيفلين، وأميليا. وفقاً لإميلي، \"إذا كانت أميليا فارسة، فإن لوكاس محتال\". أكدت شارلوت: \"أميليا محتالة\". في كلمات جيمس: \"شارلوت ليست فارسة\". صرح لوكاس، \"أميليا فارسة وشارلوت فارسة\". في كلمات إيفلين: \"شارلوت فارسة\". في كلمات أميليا: \"إميلي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي فارس  \n(2) شارلوت فارس  \n(3) جيمس محتال  \n(4) لوكاس محتال  \n(5) إيفلين فارس  \n(6) أميليا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: يوسف، صوفيا، آفا، أميليا، أبيجيل، وليام. في كلمات يوسف: \"إذا كانت آفا فارسًا، فإن يوسف فارس\". صوفيا عبرت عن أن أبيجيل فارس أو أميليا محتالة. آفا عبرت عن أن أبيجيل محتالة وأميليا فارس. أميليا صرحت، \"يوسف محتال ووليام محتال\". وفقًا لأبيجيل، \"آفا محتالة إذا وفقط إذا كانت صوفيا محتالة\". \"أميليا ليست محتالة\"، ادعى وليام. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف فارس  \n(2) صوفيا فارس  \n(3) آفا محتالة  \n(4) أميليا محتالة  \n(5) أبيجيل محتالة  \n(6) ليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 6 سكان: أوليفر، بينيلوب، ميا، لوكاس، صوفيا، ومايكل. وفقاً لأوليور، \"لوكاس محتال وبينيلوب فارس\". كما قالت بينيلوب، \"إذا كانت بينيلوب فارساً، فإن أوليفر فارس\". أكدت ميا: \"لوكاس ليس فارساً\". قال لوكاس إن صوفيا فارس وأوليفر فارس. \"مايكل فارس أو صوفيا فارس\" - صوفيا. أخبرك مايكل أن أوليفر فارس وبينيلوب محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفر فارس  \n(2) بينيلوب فارس  \n(3) ميا فارس  \n(4) لوكاس محتال  \n(5) صوفيا محتالة  \n(6) مايكل محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: أبيجيل، إميلي، لوغان، دانيال، أيدن، وإيما. قالت أبيجيل: \"دانيال محتال إذا وفقط إذا كان لوغان فارساً\". علقت إميلي: \"لوغان فارس\". قال لوغان: \"إذا كان أيدن فارساً، فإن دانيال محتال\". علق دانيال: \"لوغان ليس فارساً\". سمع أيدن يقول: \"أبيجيل محتالة\". وفي كلمات إيما: \"أيدن محتال ولوغان فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أبيجيل فارس  \n(2) إميلي فارس  \n(3) لوغان فارس  \n(4) دانيال محتال  \n(5) أيدن محتال  \n(6) إيما فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: إيلا، إسكندر، صموئيل، نوح، لوك، وداوود. قالت إيلا: \"إسكندر ليس فارساً\". علق إسكندر: \"إيلا فارس أو لوك محتال\". صرح صموئيل: \"لوك محتال\". قال نوح: \"إذا كانت إيلا محتالة، فإن لوك محتال\". قال لوك: \"نوح فارس وصموئيل محتال\". ادعى داوود: \"إيلا محتالة وإيلا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا محتالة  \n(2) إسكندر فارس  \n(3) صموئيل فارس  \n(4) نوح فارس  \n(5) لوك محتال  \n(6) داوود محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: زوي، دانيال، لوكاس، آفا، أوين، وأميليا. زوي قالت: \"إذا كانت أميليا فارسة، فإن آفا فارسة\". دانيال أخبرك أن أوين محتال أو دانيال فارس. في كلمات لوكاس: \"دانيال ليس فارساً\". آفا صرحت: \"زوي محتالة\". وفقاً لأوين، \"أوين فارس أو زوي فارس\". وفقاً لأميليا، \"دانيال فارس وزوي فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) زوي فارس  \n(2) دانيال محتال  \n(3) لوكاس فارس  \n(4) آفا محتالة  \n(5) أوين فارس  \n(6) أميليا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 6 سكان: جيمس، لوك، أبيجيل، مايسون، فيكتوريا، وزوي. في تصريح لجيمس: \"لوك فارس ومايسون محتال\". قال لوك: \"فيكتوريا محتالة أو أبيجيل محتالة\". أعربت أبيجيل عن أنه إذا كانت فيكتوريا فارسة فإن أبيجيل فارسة. \"فيكتوريا محتالة أو جيمس فارس\"، ادعى مايسون. \"إذا كان جيمس محتالاً فإن أبيجيل فارسة\"، ذكرت فيكتوريا. \"لوك محتال وفيكتوريا محتالة\" - زوي. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس محتال  \n(2) لوك محتال  \n(3) أبيجيل فارس  \n(4) مايسون محتال  \n(5) فيكتوريا فارس  \n(6) زوي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: صوفيا، آريا، أوين، إيفلين، بنيامين، وإيلا. صوفيا أخبرتك أن صوفيا فارس إذا وفقط إذا كانت إيفلين محتالة. بكلمات آريا: \"إيلا محتالة وآريا فارس\". أوين أشار، \"صوفيا فارس\". في بيان لإيفلين: \"إيلا فارس\". بنيامين أكد: \"صوفيا ليست محتالة\". إيلا عبرت أنه إذا كان بنيامين فارسًا فإن آريا محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) آريا فارس  \n(3) أوين فارس  \n(4) إيفلين محتالة  \n(5) بنيامين فارس  \n(6) إيلا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: إسكندر، دانيال، مايكل، يعقوب، آريا، وبنيامين. قال إسكندر: \"بنيامين فارس ويعقوب فارس.\" أعلن دانيال: \"إذا كان دانيال فارساً، فإن يعقوب محتال.\" كما قال مايكل: \"إذا كان يعقوب فارساً، فإن إسكندر محتال.\" قال يعقوب: \"إذا كان إسكندر محتالاً، فإن دانيال محتال.\" علقت آريا: \"يعقوب ليس محتالاً.\" أشار بنيامين: \"آريا محتالة.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إسكندر محتال  \n(2) دانيال فارس  \n(3) مايكل فارس  \n(4) يعقوب محتال  \n(5) آريا محتالة  \n(6) بنيامين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: بنيامين، كلوي، فيكتوريا، إيزابيلا، إيلا، وإميلي. قال بنيامين: \"كلوي ليست فارسًا\". سُمعت كلوي تقول: \"كلوي فارس\". أعلنت فيكتوريا: \"كلوي محتالة وإميلي محتالة\". أخبرتك إيزابيلا أن بنيامين فارس. علقت إيلا: \"بنيامين ليس محتالًا\". أكدت إميلي: \"كلوي محتالة إذا وفقط إذا كانت فيكتوريا فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين محتال  \n(2) كلوي فارس  \n(3) فيكتوريا محتالة  \n(4) إيزابيلا محتالة  \n(5) إيلا محتالة  \n(6) إميلي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: صوفيا، ويليام، آريا، إليزابيث، أوين، ولوكاس. قالت صوفيا: \"إذا كانت إليزابيث محتالة، فإن آريا محتالة\". أعلن ويليام: \"أوين فارس أو لوكاس محتال\". علق آريا: \"لوكاس ليس فارسًا\". قالت إليزابيث إن آريا ليست محتالة. في كلمات أوين: \"صوفيا محتالة إذا وفقط إذا كانت صوفيا فارسًا\". قال لوكاس: \"أوين فارس ولوكاس فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) ويليام فارس  \n(3) آريا فارس  \n(4) إليزابيث فارس  \n(5) أوين محتال  \n(6) لوكاس محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: مايكل، بنيامين، سباستيان، غريس، إيثان، وآريا. \"إيثان محتال أو مايكل فارس\"، ادعى مايكل. علق بنيامين، \"إذا كان مايكل محتالًا، فإن آريا محتالة\". \"بنيامين فارس\" - سباستيان. وفقًا لغريس، \"سباستيان محتال وآريا فارس\". سمع إيثان يقول، \"مايكل فارس\". كما قالت آريا، \"إيثان فارس أو بنيامين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل فارس  \n(2) بنيامين فارس  \n(3) سباستيان فارس  \n(4) غريس محتالة  \n(5) إيثان فارس  \n(6) آريا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: لوكاس، أيدن، صوفيا، إسكندر، ميا، وزوي. قال لوكاس: \"إذا كان أيدن فارسًا، فإن ميا فارس.\" أشار أيدن: \"صوفيا محتالة إذا وفقط إذا كان لوكاس فارسًا.\" قالت صوفيا إن إسكندر فارس أو إسكندر محتال. قال إسكندر: \"ميا محتالة إذا وفقط إذا كانت صوفيا محتالة.\" علقت ميا: \"زوي ليست فارسة.\" قالت زوي إن صوفيا محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس فارس  \n(2) أيدن محتال  \n(3) صوفيا فارس  \n(4) إسكندر فارس  \n(5) ميا فارس  \n(6) زوي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: أبيجيل، آفا، صوفيا، سكارليت، رايلي، وداوود. \"صوفيا ليست فارساً\"، ادعت أبيجيل. \"صوفيا محتالة وآفا فارس\"، ذكرت آفا. صوفيا قالت إن رايلي ليس فارساً. سكارليت لاحظت، \"صوفيا محتالة أو داوود محتال\". رايلي أكد: \"صوفيا فارس أو أبيجيل فارس\". داوود عبر عن أن آفا محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أبيجيل فارس  \n(2) آفا محتالة  \n(3) صوفيا محتالة  \n(4) صوفيا فارس  \n(5) رايلي فارس  \n(6) داوود فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: إيلا، بينيلوب، ليام، يعقوب، غريس، وجيمس. \"بينيلوب محتالة أو ليام محتال\"، أعلنت إيلا. قالت بينيلوب إن ليام محتال وجيمس محتال. علق ليام، \"بينيلوب محتالة\". \"غريس فارسة أو جيمس فارس\"، ذكر يعقوب. في تصريح من غريس: \"إيلا فارسة أو غريس فارسة\". في تصريح من جيمس: \"يعقوب محتال أو يعقوب فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا فارس  \n(2) بينيلوب محتالة  \n(3) ليام فارس  \n(4) يعقوب فارس  \n(5) غريس فارس  \n(6) جيمس فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: ميا، جيمس، إيما، مايسون، إيلا، وهاربر. \"هاربر ليس فارساً\"، ذكرت ميا. \"هاربر فارس\"، ادعى جيمس. أكدت إيما: \"إيما فارس ومايسون فارس\". صرح مايسون، \"إيما محتالة إذا وفقط إذا كانت إيلا محتالة\". علقت إيلا، \"هاربر ليس فارساً\". وفقاً لهاربر، \"مايسون فارس أو جيمس محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا محتالة  \n(2) جيمس فارس  \n(3) إيما محتالة  \n(4) مايسون فارس  \n(5) إيلا محتالة  \n(6) هاربر فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: أوين، صموئيل، يوسف، صوفيا، أوليفيا، وزوي. وفقًا لأوين، \"أوليفيا فارس إذا وفقط إذا كانت زوي فارسة\". قال صموئيل إن أوليفيا ليست محتالة. قال يوسف، \"إذا كانت زوي فارسة، فإن صوفيا محتالة.\" أكدت صوفيا: \"أوليفيا محتالة إذا وفقط إذا كان يوسف محتالًا\". كما قالت أوليفيا، \"زوي محتالة\". أكدت زوي: \"يوسف محتال إذا وفقط إذا كان أوين فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين محتال  \n(2) صموئيل محتال  \n(3) يوسف فارس  \n(4) صوفيا محتالة  \n(5) أوليفيا محتالة  \n(6) زوي فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: إيلا، كلوي، ليام، يوسف، داوود، وإيما. علقت إيلا، \"إيما ليست فارسة\". وفقاً لكلوي، \"يوسف محتال أو كلوي فارسة\". قال ليام، \"يوسف فارس وإيلا فارسة\". علق يوسف، \"كلوي ليست محتالة\". قال داوود، \"إيما فارسة وإيلا فارسة\". صرحت إيما، \"كلوي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا فارس  \n(2) كلوي فارس  \n(3) ليام فارس  \n(4) يوسف فارس  \n(5) داوود محتار  \n(6) إيما محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: نوح، إميلي، كلوي، داوود، لوك، وأوليفيا. في تصريح من نوح: \"داوود فارس إذا وفقط إذا كانت إميلي محتالة\". قالت إميلي: \"نوح ليس محتالاً\". صرحت كلوي: \"داوود محتال وإميلي فارس\". أشار داوود: \"نوح ليس محتالاً\". قال لوك: \"أوليفيا محتالة\". علقت أوليفيا: \"كلوي ليست فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح محتال  \n(2) إميلي محتالة  \n(3) كلوي محتالة  \n(4) داوود محتال  \n(5) لوك محتال  \n(6) أوليفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: إيزابيلا، إيلا، زوي، إميلي، مايسون، وأوليفيا. قالت إيزابيلا إن إيلا محتالة وإميلي فارسة. لاحظت إيلا: \"إيلا فارسة أو إميلي محتالة\". \"إذا كانت إيلا محتالة، فإن زوي فارسة\"، ذكرت زوي. في بيان من إميلي: \"مايسون محتال إذا وفقط إذا كانت أوليفيا محتالة\". وفقًا لمايسون، \"إيلا فارسة وزوي محتالة\". في بيان من أوليفيا: \"إذا كانت إيزابيلا محتالة، فإن إيلا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا محتالة  \n(2) إيلا فارسة  \n(3) زوي فارسة  \n(4) إميلي فارسة  \n(5) مايسون محتال  \n(6) أوليفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: سباستيان، إميلي، أفري، أورورا، آفا، وصوفيا. وفقًا لسباستيان، \"إذا كانت إميلي محتالة، فإن آفا فارس\". عبرت إميلي عن أن صوفيا فارس أو أفري محتالة. سمع أفري يقول، \"آفا محتالة أو أورورا محتالة\". في بيان من أورورا: \"صوفيا محتالة وأورورا فارس\". سمع آفا يقول، \"إميلي ليست فارسًا\". سمع صوفيا يقول، \"أفري محتالة أو أفري فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سباستيان فارس  \n(2) إميلي فارس  \n(3) أفري فارس  \n(4) أورورا محتالة  \n(5) آفا محتالة  \n(6) صوفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: ويليام، ليام، أوليفيا، أبيجيل، هنري، ولوغان. ويليام أعرب عن أن هنري فارس إذا وفقط إذا كان ويليام فارسًا. في كلمات ليام: \"لوغان فارس إذا وفقط إذا كانت أوليفيا فارسًا\". \"لوغان فارس أو ويليام محتار\" - أوليفيا. أبيجيل صرحت، \"ويليام فارس إذا وفقط إذا كانت أوليفيا محتالة\". هنري قال إن ليام فارس وويليام فارس. \"هنري فارس أو أوليفيا فارس\" - أعلن لوغان. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام فارس  \n(2) ليام فارس  \n(3) أوليفيا فارس  \n(4) أبيجيل محتالة  \n(5) هنري فارس  \n(6) لوغان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: إيما، بنيامين، يوسف، مايسون، آفا، وداوود. أخبرتك إيما أن بنيامين فارس. سمع بنيامين وهو يقول: \"داوود فارس\". ذكر يوسف: \"يوسف فارس أو داوود فارس\". وفقًا لمايسون، \"بنيامين فارس وإيما محتالة\". ادعت آفا: \"إذا كانت آفا فارسًا، فإن يوسف محتال\". صرح داوود: \"بنيامين فارس ويوسف فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما محتالة  \n(2) بنيامين محتال  \n(3) يوسف محتال  \n(4) مايسون محتال  \n(5) آفا فارس  \n(6) داوود محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: إسكندر، ميا، ليلي، آفا، إيزابيلا، وأيدن. علق إسكندر، \"إيزابيلا ليست محتالة\". كما قالت ميا، \"إسكندر فارس إذا وفقط إذا كانت إيزابيلا فارسة\". \"إسكندر محتال\"، ذكرت ليلي. كما قالت آفا، \"إذا كان أيدن فارسًا، فإن ميا محتالة\". \"أيدن فارس أو أيدن محتال\"، أعلنت إيزابيلا. أيدن أكد: \"ميا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إسكندر فارس  \n(2) ميا فارس  \n(3) ليلي محتالة  \n(4) آفا محتالة  \n(5) إيزابيلا فارس  \n(6) أيدن فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: ليلي، يعقوب، لوك، مايكل، أوين، وأفري. في تصريح ليلي: \"إذا كان يعقوب محتالاً، فإن أفري محتالة\". قال يعقوب: \"ليلي ليست فارسة\". قال لوك: \"مايكل فارس\". في كلمات مايكل: \"ليلي ليست محتالة\". علق أوين: \"أفري فارسة وليلي فارسة\". لاحظ أفري: \"لوك محتال إذا وفقط إذا كانت ليلي فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي فارس  \n(2) يعقوب محتال  \n(3) لوك فارس  \n(4) مايكل فارس  \n(5) أوين محتال  \n(6) أفري محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: أوليفر، نوح، فيكتوريا، إيلا، أميليا، وإيثان. قال أوليفر: \"إيلا محتالة أو أميليا فارس\". في كلمات نوح: \"أوليفر ليس محتالًا\". \"نوح محتال إذا وفقط إذا كانت أميليا محتالة\"، ذكرت فيكتوريا. قالت إيلا: \"فيكتوريا فارس أو إيلا فارس\". في بيان من أميليا: \"أوليفر فارس وفيكتوريا محتالة\". كما قال إيثان: \"فيكتوريا محتالة وفيكتوريا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفر محتال  \n(2) نوح محتال  \n(3) فيكتوريا فارس  \n(4) إيلا فارس  \n(5) أميليا محتالة  \n(6) إيثان محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: آفا، شارلوت، إيلا، جاكسون، أوين، وأميليا. قالت آفا: \"شارلوت محتالة وأوين محتال\". ادعت شارلوت: \"آفا ليست محتالة\". قالت إيلا: \"أميليا محتالة إذا وفقط إذا كان جاكسون محتالاً\". وفقاً لجكسون، \"إذا كانت شارلوت فارسة، فإن أوين محتال\". عبر أوين عن أن شارلوت محتالة إذا وفقط إذا كانت آفا محتالة. عبرت أميليا عن أن شارلوت ليست فارسة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا محتالة  \n(2) شارلوت محتالة  \n(3) إيلا فارسة  \n(4) جاكسون فارس  \n(5) أوين فارس  \n(6) أميليا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: ويليام، إليزابيث، جاكسون، إيما، أميليا، وسباستيان. ويليام أعرب عن أن جاكسون فارس. بكلمات إليزابيث: \"أميليا فارس أو إيما محتالة\". بكلمات جاكسون: \"سباستيان فارس أو ويليام محتال\". وفقًا لإيما، \"إليزابيث فارس أو سباستيان محتال\". أميليا صرحت، \"جاكسون فارس إذا وفقط إذا كانت إيما فارس\". كما قال سباستيان، \"إليزابيث فارس أو إليزابيث محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام فارس  \n(2) إليزابيث فارس  \n(3) جاكسون فارس  \n(4) إيما فارس  \n(5) أميليا فارس  \n(6) سباستيان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: إميلي، بنيامين، فيكتوريا، صوفيا، رايلي، وإيزابيلا. قالت إميلي إن فيكتوريا محتالة إذا وفقط إذا كان بنيامين فارسًا. في بيان لبنيامين: \"إذا كانت صوفيا فارسة، فإن صوفيا محتالة\". وفقًا لفيكتوريا، \"بنيامين محتال\". أكدت صوفيا: \"إذا كانت إميلي فارسة، فإن إيزابيلا محتالة\". صرحت رايلي، \"إذا كانت إميلي فارسة، فإن فيكتوريا فارسة\". صرحت إيزابيلا، \"إميلي ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي فارس  \n(2) بنيامين فارس  \n(3) فيكتوريا محتالة  \n(4) صوفيا محتالة  \n(5) رايلي محتالة  \n(6) إيزابيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: أيدن، إيزابيلا، أفري، أوليفيا، ويليام، ونوح. قال أيدن: \"نوح محتال وأفري محتالة.\" كما قالت إيزابيلا: \"أيدن محتال إذا وفقط إذا كان نوح محتالًا.\" في كلمات أفري: \"نوح فارس.\" أخبرتك أوليفيا أن أفري فارس إذا وفقط إذا كان نوح محتالًا. أكد ويليام: \"إذا كانت أفري محتالة، فإن نوح محتال.\" في كلمات نوح: \"ويليام فارس وإيزابيلا محتالة.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن محتال  \n(2) إيزابيلا محتالة  \n(3) أفري فارس  \n(4) أوليفيا محتالة  \n(5) ويليام فارس  \n(6) نوح فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: مايكل، إيزابيلا، زوي، صوفيا، إيفلين، وصموئيل. قال مايكل: \"زوي محتالة أو زوي فارس\". أكدت إيزابيلا: \"إذا كانت صوفيا فارسًا، فإن إيفلين محتالة\". في تصريح من زوي: \"إيزابيلا فارس أو إيفلين محتالة\". أخبرتك صوفيا أن إيفلين محتالة أو صموئيل محتال. أعلنت إيفلين: \"زوي ليست فارسًا\". أكد صموئيل: \"زوي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل فارس  \n(2) إيزابيلا فارس  \n(3) زوي فارس  \n(4) صوفيا فارس  \n(5) إيفلين محتالة  \n(6) صموئيل محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: غريس، سباستيان، ليام، أيدن، ليلي، وسكارليت. قالت غريس: \"سكارليت محتالة وسكارليت فارس\". في تصريح لسباستيان: \"أيدن فارس وسكارليت فارس\". كما قال ليام: \"ليام فارس أو ليلي محتالة\". أيدن أخبرك أن سكارليت فارس أو سكارليت محتالة. \"ليام فارس وسباستيان فارس\"، ادعت ليلي. أكدت سكارليت: \"إذا كانت غريس محتالة، فإن أيدن فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) غريس محتالة  \n(2) سباستيان فارس  \n(3) ليام فارس  \n(4) أيدن فارس  \n(5) ليلي فارس  \n(6) سكارليت فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: مايسون، بينيلوب، بنيامين، سباستيان، رايلي، وأوليفيا. في تصريح لمايسون: \"رايلي فارس\". علقت بينيلوب، \"إذا كانت رايلي فارسًا، فإن مايسون محتار\". \"مايسون محتال\"، ذكر بنيامين. وفقًا لسباستيان، \"أوليفيا ليست فارسًا\". أكدت رايلي: \"إذا كان بنيامين فارسًا، فإن سباستيان فارس\". علقت أوليفيا، \"بينيلوب محتالة إذا وفقط إذا كان سباستيان فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايسون محتال  \n(2) بينيلوب فارس  \n(3) بنيامين فارس  \n(4) سباستيان محتال  \n(5) رايلي محتالة  \n(6) أوليفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 6 سكان: ليلي، هاربر، أفري، أوليفيا، ماثيو، وأميليا. في كلمات ليلي: \"إذا كانت أفري فارساً، فإن أميليا فارس.\" هاربر أخبرك أن ليلي ليست فارساً. أفري لاحظت، \"هاربر محتال أو أوليفيا محتالة.\" أوليفيا أخبرتك أنه إذا كانت ليلي محتالة، فإن أميليا فارس. ماثيو أخبرك أن أوليفيا فارس إذا وفقط إذا كانت أميليا فارس. أميليا صرحت، \"أفري ليست محتالة.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي فارس  \n(2) هاربر محتالة  \n(3) أفري فارس  \n(4) أوليفيا فارس  \n(5) ماثيو فارس  \n(6) أميليا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: آريا، إيزابيلا، إيثان، أميليا، مايسون، وويليام. \"ويليام محتال أو مايسون محتال\"، أعلنت آريا. \"ويليام فارس\"، ذكرت إيزابيلا. في كلمات إيثان: \"مايسون فارس\". \"إيثان محتال\" - أميليا. \"آريا محتالة وويليام محتال\" - مايسون. قال ويليام إن إيزابيلا محتالة أو إيزابيلا فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آريا فارس  \n(2) إيزابيلا فارس  \n(3) إيثان محتال  \n(4) أميليا فارس  \n(5) مايسون محتال  \n(6) ويليام فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: يوسف، ليام، زوي، إيزابيلا، مايسون، وهنري. أكد يوسف: \"إيزابيلا فارس وهنري محتال\". في بيان ليام: \"زوي فارس\". كما قالت زوي: \"إيزابيلا ليست محتالة\". \"إذا كان هنري فارسًا، فإن مايسون فارس\"، ذكرت إيزابيلا. علق مايسون، \"يوسف فارس\". قال هنري، \"إذا كان مايسون محتالًا، فإن ليام محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف محتال  \n(2) ليام محتال  \n(3) زوي محتالة  \n(4) إيزابيلا محتالة  \n(5) مايسون محتال  \n(6) هنري فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: أيدن، غريس، بينيلوب، مايكل، نوح، وإيفلين. قال أيدن: \"نوح فارس\". في تصريح من غريس: \"نوح ليس فارسًا\". وفقًا لبينيلوب، \"نوح ليس محتالًا\". \"بينيلوب ليست فارسة\"، ذكر مايكل. عبر نوح عن أنه إذا كان أيدن فارسًا، فإن بينيلوب فارس. سُمعت إيفلين تقول: \"إيفلين فارسة وبينيلوب محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن فارس  \n(2) غريس محتالة  \n(3) بينيلوب فارس  \n(4) مايكل محتال  \n(5) نوح فارس  \n(6) إيفلين محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: إيزابيلا، أميليا، يوسف، رايلي، فيكتوريا، وجيمس. أخبرتك إيزابيلا أنه إذا كانت أميليا محتالة، فإن يوسف محتال. سُمعت أميليا تقول: \"فيكتوريا محتالة\". قال يوسف إن إيزابيلا فارس أو جيمس فارس. أخبرتك رايلي أن إيزابيلا فارس ويوسف فارس. علقت فيكتوريا قائلة: \"رايلي ليس فارسًا\". أعرب جيمس عن أن أميليا محتالة وإيزابيلا فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا فارس  \n(2) أميليا فارس  \n(3) يوسف فارس  \n(4) رايلي فارس  \n(5) فيكتوريا محتالة  \n(6) جيمس محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: لوغان، إميلي، أوين، إيلا، آريا، ورايلي. كما قال لوغان: \"أوين فارس\". \"لوغان محتار ولوغان فارس\"، ادعت إميلي. في بيان من أوين: \"لوغان محتال ورايلي فارس\". وفقًا لإيلا، \"رايلي فارس إذا وفقط إذا كانت إميلي محتالة\". آريا عبرت عن أن لوغان ليس محتالًا. قال رايلي إن إميلي فارس أو رايلي فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان محتال  \n(2) إميلي محتالة  \n(3) أوين محتال  \n(4) إيلا محتالة  \n(5) آريا محتالة  \n(6) رايلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: إيثان، هنري، جاك، يعقوب، إيفلين، وبنيامين. أكد إيثان: \"بنيامين فارس وإيفلين محتالة\". لاحظ هنري، \"إذا كان يعقوب فارسًا، فإن جاك فارس\". أعلن جاك: \"إذا كان بنيامين محتالًا، فإن هنري فارس\". سمع يعقوب يقول: \"جاك محتال إذا وفقط إذا كان جاك فارسًا\". \"إذا كان يعقوب فارسًا، فإن جاك فارس\" - إيفلين. عبر بنيامين عن أنه إذا كان جاك فارسًا، فإن جاك محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان محتال  \n(2) هنري فارس  \n(3) جاك فارس  \n(4) يعقوب محتال  \n(5) إيفلين فارس  \n(6) بنيامين محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: دانيال، ميا، أوليفر، أفري، مايكل، وأوليفيا. قال دانيال: \"أوليفيا محتالة إذا وفقط إذا كانت أوليفيا فارسة\". ذكرت ميا: \"مايكل محتال إذا وفقط إذا كانت أوليفيا محتالة\". ادعى أوليفر: \"أوليفيا محتالة\". قال أفري: \"ميا محتالة\". قال مايكل: \"أوليفر فارس\". أكدت أوليفيا: \"أفري محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال محتال  \n(2) ميا محتالة  \n(3) أوليفر فارس  \n(4) أفري فارسة  \n(5) مايكل فارس  \n(6) أوليفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: غريس، نوح، شارلوت، أورورا، إيزابيلا، ولوك. غريس أعربت عن أن شارلوت محتالة وأورورا فارسة. \"غريس فارسة وغريس محتالة\"، أعلن نوح. \"أورورا محتالة أو لوك فارس\"، ادعت شارلوت. أورورا أعربت عن أن شارلوت محتالة أو إيزابيلا فارسة. \"نوح محتال\"، أعلنت إيزابيلا. \"إيزابيلا فارسة\" - لوك. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) غريس محتالة  \n(2) نوح محتال  \n(3) شارلوت فارسة  \n(4) أورورا فارسة  \n(5) إيزابيلا فارسة  \n(6) لوك فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: شارلوت، يعقوب، ويليام، هاربر، أميليا، وليام. في تصريح من شارلوت: \"إذا كان ليام محتالًا، فإن ويليام محتال\". كما قال يعقوب: \"شارلوت محتالة وليام محتال\". ويليام أعرب عن أن أميليا محتالة أو شارلوت فارس. \"ويليام ليس فارسًا\" - هاربر. في تصريح من أميليا: \"ويليام ليس محتالًا\". ليام أعرب أنه إذا كان يعقوب محتالًا، فإن ليام فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت فارس  \n(2) يعقوب محتال  \n(3) ويليام فارس  \n(4) هاربر محتالة  \n(5) أميليا فارس  \n(6) ليام فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: يوسف، زوي، سباستيان، لوك، صوفيا، ونوح. كما قال يوسف: \"سباستيان محتال أو لوك فارس\". وفقًا لزوي، \"إذا كان نوح فارسًا، فإن صوفيا محتالة\". قال سباستيان إنه إذا كان يوسف فارسًا، فإن لوك محتال. أخبرك لوك أن يوسف فارس أو زوي فارس. قالت صوفيا إن زوي فارس وزوي محتالة. على لسان نوح: \"صوفيا فارس وسباستيان محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف فارس  \n(2) زوي فارس  \n(3) سباستيان محتال  \n(4) لوك فارس  \n(5) صوفيا محتالة  \n(6) نوح محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: أيدن، إيما، ليلي، جاك، دانيال، وشارلوت. علق أيدن، \"إيما ليست محتالة\". أكدت إيما: \"أيدن محتال أو جاك فارس\". \"دانيال ليس محتالًا\"، ذكرت ليلي. \"جاك فارس أو شارلوت فارس\"، أعلن جاك. قال دانيال إن شارلوت فارس إذا وفقط إذا كانت ليلي محتالة. قالت شارلوت، \"دانيال محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن فارس  \n(2) إيما فارس  \n(3) ليلي فارس  \n(4) جاك فارس  \n(5) دانيال فارس  \n(6) شارلوت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: أيدن، كلوي، أفري، شارلوت، إميلي، وأورورا. قال أيدن: \"إميلي ليست فارسًا\". سُمعت كلوي تقول: \"أورورا فارس أو أيدن فارس\". \"إذا كانت إميلي محتالة، فإن إميلي فارس\"، ادعى أفري. \"أورورا فارس أو أيدن محتال\"، ذكرت شارلوت. كما قالت إميلي: \"كلوي ليست محتالة\". صرحت أورورا: \"إذا كان أفري فارسًا، فإن شارلوت فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن محتال  \n(2) كلوي فارس  \n(3) أفري فارس  \n(4) شارلوت فارس  \n(5) إميلي فارس  \n(6) أورورا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: جيمس، ليلي، إيثان، صوفيا، صوفيا، وإيزابيلا. كما قال جيمس، \"ليلي محتالة\". \"إيثان فارس\"، ادعت ليلي. أشار إيثان، \"إيثان فارس وإيزابيلا فارسة\". \"ليلي محتالة وإيثان محتال\"، أعلنت صوفيا. وفقًا لصوفيا، \"إيثان محتال\". \"إذا كانت صوفيا محتالة، فإن ليلي محتالة\" - إيزابيلا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس فارس  \n(2) ليلي محتالة  \n(3) إيثان محتال  \n(4) صوفيا فارسة  \n(5) صوفيا فارسة  \n(6) إيزابيلا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: جيمس، صوفيا، يوسف، إيثان، إيفلين، وليلي. \"إذا كان إيثان محتالًا، فإن يوسف فارس\"، أعلن جيمس. صوفيا أكدت: \"إذا كانت إيفلين فارسًا، فإن ليلي فارس\". سمع يوسف يقول: \"يوسف فارس وصوفيا محتالة\". كما قال إيثان: \"إذا كانت صوفيا فارسًا، فإن صوفيا محتالة\". إيفلين صرحت: \"إيثان محتال أو ليلي فارس\". ليلي صرحت: \"يوسف ليس فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس محتال  \n(2) صوفيا فارس  \n(3) يوسف محتال  \n(4) إيثان محتال  \n(5) إيفلين فارس  \n(6) ليلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: إيزابيلا، ماثيو، صموئيل، يوسف، ويليام، وشارلوت. تم سماع إيزابيلا تقول: \"ماثيو محتال أو شارلوت فارس\". في كلمات ماثيو: \"صموئيل محتال ويوسف محتال\". قال صموئيل إن إيزابيلا فارس أو إيزابيلا محتالة. في بيان ليوسف: \"ويليام ليس محتالًا\". \"صموئيل محتال\"، أعلن ويليام. \"ماثيو فارس إذا وفقط إذا كان صموئيل فارسًا\"، أعلنت شارلوت. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا فارس  \n(2) ماثيو محتال  \n(3) صموئيل فارس  \n(4) يوسف محتال  \n(5) ويليام محتال  \n(6) شارلوت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: إيلا، مايسون، بنيامين، أورورا، لوكاس، ويعقوب. وفقاً لإيلا، \"أورورا فارس أو بنيامين فارس\". علق مايسون، \"بنيامين فارس أو لوكاس فارس\". قال بنيامين إن مايسون فارس أو أورورا فارس. كما قالت أورورا، \"إيلا فارس أو لوكاس فارس\". أكد لوكاس: \"إذا كانت إيلا محتالة، فإن مايسون محتال\". \"أورورا محتالة إذا وفقط إذا كان بنيامين فارساً\"، ذكر يعقوب. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا فارس  \n(2) مايسون فارس  \n(3) بنيامين فارس  \n(4) أورورا فارس  \n(5) لوكاس فارس  \n(6) يعقوب محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: ميا، بينيلوب، فيكتوريا، أميليا، هنري، ويعقوب. في تصريح لميا: \"بينيلوب فارس\". لاحظت بينيلوب، \"إذا كانت أميليا فارسًا، فإن فيكتوريا محتالة\". لاحظت فيكتوريا، \"ميا محتالة إذا وفقط إذا كان هنري محتالًا\". \"يعقوب ليس محتالًا\" - أميليا. \"يعقوب ليس محتالًا\" - هنري. \"فيكتوريا ليست محتالة\"، ادعى يعقوب. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا فارس  \n(2) بينيلوب فارس  \n(3) فيكتوريا محتالة  \n(4) أميليا محتالة  \n(5) هنري محتال  \n(6) يعقوب محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: أيدن، أورورا، لوك، بنيامين، إميلي، ومايسون. وفقاً لأيدن، \"إذا كان مايسون محتالاً، فإن مايسون فارس\". أعربت أورورا عن أن بنيامين فارس. لوك أشار، \"مايسون فارس ومايسون محتال\". \"مايسون محتال وبنيامين فارس\"، ادعى بنيامين. كما قالت إميلي، \"إذا كان مايسون محتالاً، فإن لوك محتال\". في كلمات مايسون: \"أورورا فارس ولوك محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن محتال  \n(2) أورورا محتالة  \n(3) لوك محتال  \n(4) بنيامين محتال  \n(5) إميلي فارسة  \n(6) مايسون محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: لوغان، جيمس، سكارليت، لوكاس، إيما، وليلي. \"جيمس محتال إذا وفقط إذا كان لوغان فارساً\" - لوغان. سمع جيمس يقول، \"إذا كان لوكاس محتالاً، فإن لوغان فارس.\" كما قالت سكارليت، \"إيما محتالة وليلي فارسة.\" \"سكارليت فارسة إذا وفقط إذا كان جيمس محتالاً\" - لوكاس. قالت إيما، \"إذا كانت ليلي محتالة، فإن لوكاس فارس.\" قالت ليلي، \"لوغان فارس وليلي فارسة.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان محتار  \n(2) جيمس محتار  \n(3) سكارليت محتارة  \n(4) لوكاس محتار  \n(5) إيما محتارة  \n(6) ليلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: هاربر، جاكسون، سكارليت، أبيجيل، أوليفر، ودانيال. قالت هاربر: \"سكارليت فارس ودانيال فارس\". أشار جاكسون: \"أبيجيل فارس وأبيجيل محتالة\". في كلمات سكارليت: \"جاكسون ليس فارسًا\". وفقًا لأبيجيل، \"إذا كان أوليفر فارسًا، فإن هاربر فارس\". في بيان من أوليفر: \"جاكسون محتال ودانيال فارس\". أعرب دانيال عن أن سكارليت فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر فارس  \n(2) جاكسون محتال  \n(3) سكارليت فارس  \n(4) أبيجيل فارس  \n(5) أوليفر فارس  \n(6) دانيال فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: صوفيا، أورورا، آفا، داوود، بينيلوب، وويليام. صوفيا قالت: \"ويليام محتال\". أورورا قالت: \"آفا فارس وبينيلوب فارس\". سُمعت آفا تقول: \"داوود فارس إذا وفقط إذا كان داوود محتال\". داوود أكد: \"إذا كان ويليام محتالًا، فإن أورورا فارس\". \"صوفيا فارس وأورورا فارس\"، أعلنت بينيلوب. ويليام قال: \"داوود فارس وبينيلوب فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) أورورا محتالة  \n(3) آفا محتالة  \n(4) داوود محتال  \n(5) بينيلوب محتالة  \n(6) ويليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: سباستيان، آريا، آفا، أوليفيا، بنيامين، وشارلوت. قال سباستيان إن بنيامين محتال أو آريا محتالة. أعربت آريا عن أن آفا محتالة. سُمعت آفا تقول: \"شارلوت فارس إذا وفقط إذا كان بنيامين فارسًا\". أخبرتك أوليفيا أن آريا محتالة إذا وفقط إذا كانت آريا فارسًا. \"شارلوت ليست فارسًا\"، ادعى بنيامين. أعربت شارلوت عن أن أوليفيا فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سباستيان محتال  \n(2) آريا فارس  \n(3) آفا محتالة  \n(4) أوليفيا محتالة  \n(5) بنيامين فارس  \n(6) شارلوت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 6 سكان: غريس، أوليفر، أورورا، صوفيا، سباستيان، وأوليفيا. وفقاً لغريس، \"إذا كانت غريس فارساً، فإن أورورا محتالة\". وفقاً لأوليفر، \"أورورا محتالة\". أشارت أورورا، \"أورورا فارس إذا وفقط إذا كان سباستيان فارساً\". \"أوليفر محتال\" - صوفيا. \"أورورا محتالة أو أورورا فارس\" - ذكر سباستيان. أشارت أوليفيا، \"سباستيان ليس محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) غريس فارس  \n(2) أوليفر فارس  \n(3) أورورا محتالة  \n(4) صوفيا محتالة  \n(5) سباستيان فارس  \n(6) أوليفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: إيما، إيفلين، آريا، أيدن، صوفيا، وأفري. سُمعت إيما تقول: \"إيفلين محتالة إذا وفقط إذا كانت أفري فارسة\". \"أفري فارسة أو أفري محتالة\"، ادعت إيفلين. قالت آريا إن إيما محتالة وإيفلين فارسة. علق أيدن: \"صوفيا فارسة وأفري محتالة\". في تصريح لصوفيا: \"آريا ليست محتالة\". عبرت أفري عن أن صوفيا محتالة وأن أفري فارسة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما فارس  \n(2) إيفلين فارس  \n(3) آريا محتالة  \n(4) أيدن محتال  \n(5) صوفيا محتالة  \n(6) أفري محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: دانيال، آريا، أوين، إيثان، إسكندر، وبنيامين. علق دانيال، \"أوين ليس فارساً\". قالت آريا، \"إذا كان أوين محتالاً، فإن بنيامين محتال\". في كلمات أوين: \"بنيامين محتال\". قال إيثان، \"أوين فارس\". \"آريا فارس إذا وفقط إذا كانت آريا محتالة\"، ذكر إسكندر. في كلمات بنيامين: \"إيثان فارس أو أوين محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال فارس  \n(2) آريا محتالة  \n(3) أوين محتال  \n(4) إيثان محتال  \n(5) إسكندر محتال  \n(6) بنيامين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: بنيامين، آفا، ويليام، لوكاس، رايلي، وليلي. سُمع بنيامين يقول: \"ليلي فارس إذا وفقط إذا كانت آفا فارسة\". بكلمات آفا: \"لوكاس فارس أو ليلي محتالة\". أكد ويليام: \"لوكاس فارس إذا وفقط إذا كانت رايلي محتالة\". علق لوكاس، \"رايلي محتالة ورايلي فارس\". صرحت رايلي، \"ليلي ليست محتالة\". قالت ليلي إن ويليام محتال وويليام فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين محتال  \n(2) آفا فارس  \n(3) ويليام محتال  \n(4) لوكاس محتال  \n(5) رايلي محتالة  \n(6) ليلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: ويليام، ليلي، هاربر، دانيال، شارلوت، وإليزابيث. قال لك ويليام إن شارلوت فارس. سُمعت ليلي تقول، \"ويليام فارس\". قال هاربر، \"إليزابيث محتالة وشارلوت فارس.\" كما قال دانيال، \"إذا كان دانيال فارساً، فإن ويليام محتال.\" أعلنت شارلوت، \"شارلوت فارس وإليزابيث فارس.\" أعلنت إليزابيث، \"هاربر محتال أو هاربر فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام محتال  \n(2) ليلي محتالة  \n(3) هاربر محتالة  \n(4) دانيال فارس  \n(5) شارلوت محتالة  \n(6) إليزابيث فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: صوفيا، بينيلوب، إميلي، أيدن، داوود، وآريا. في تصريح لصوفيا: \"بينيلوب محتالة\". بينيلوب قالت: \"بينيلوب فارسة وداوود فارس\". إميلي أخبرتكم أن داوود فارس. أيدن أشار: \"بينيلوب فارسة أو آريا محتالة\". داوود قال: \"أيدن محتال وأيدن فارس\". وفقًا لآريا، \"صوفيا فارسة وداوود محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) بينيلوب محتالة  \n(3) إميلي محتالة  \n(4) أيدن محتال  \n(5) داوود محتال  \n(6) آريا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: إيفلين، دانيال، مايسون، صوفيا، زوي، وأفري. \"زوي محتالة وإيفلين فارسة\" - إيفلين. في كلمات دانيال: \"إذا كانت زوي محتالة، فإن صوفيا محتالة\". وفقًا لمايسون، \"إيفلين فارسة\". وفقًا لصوفيا، \"أفري محتالة أو زوي فارسة\". \"مايسون ليس محتالًا\"، أعلنت زوي. \"زوي محتالة أو دانيال محتال\"، ذكر أفري. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين محتالة  \n(2) دانيال فارس  \n(3) مايسون محتال  \n(4) صوفيا محتالة  \n(5) زوي محتالة  \n(6) أفري فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: صوفيا، إسكندر، يعقوب، هاربر، سكارليت، وهنري. وفقًا لصوفيا، \"يعقوب فارس وسكارليت فارس\". وفقًا لإسكندر، \"هاربر محتالة ويعقوب محتال\". يعقوب أخبرك أن هنري فارس. \"صوفيا فارس إذا وفقط إذا كان إسكندر فارس\" - هاربر. \"هنري فارس أو يعقوب فارس\"، أعلنت سكارليت. وفقًا لهنري، \"صوفيا محتالة أو إسكندر محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) إسكندر محتال  \n(3) يعقوب فارس  \n(4) هاربر محتالة  \n(5) سكارليت فارس  \n(6) هنري فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: لوغان، بنيامين، ماثيو، ويليام، ميا، وغريس. علق لوغان، \"إذا كان بنيامين محتالًا، فإن ماثيو فارس\". أعلن بنيامين، \"غريس محتالة أو لوغان فارس\". قال ماثيو، \"ميا محتالة إذا وفقط إذا كانت غريس محتالة\". صرح ويليام، \"إذا كان بنيامين محتالًا، فإن غريس محتالة\". أكدت ميا: \"ويليام محتال\". علقت غريس، \"بنيامين ليس فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان فارس  \n(2) بنيامين فارس  \n(3) ماثيو فارس  \n(4) ويليام فارس  \n(5) ميا محتالة  \n(6) غريس محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: أميليا، آريا، هنري، أوليفر، صوفيا، ويوسف. قالت أميليا: \"إذا كان أوليفر فارسًا، فإن آريا فارسًا\". قالت آريا: \"هنري محتال وأوليفر فارس\". كما قال هنري: \"إذا كانت صوفيا محتالة، فإن يوسف فارس\". عبر أوليفر عن أن هنري فارس إذا وفقط إذا كانت صوفيا محتالة. أخبرتك صوفيا أنه إذا كان أوليفر فارسًا، فإن هنري فارس. أكد يوسف: \"أوليفر محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا فارس  \n(2) آريا محتالة  \n(3) هنري فارس  \n(4) أوليفر محتال  \n(5) صوفيا فارس  \n(6) يوسف فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: فيكتوريا، أفري، جاكسون، صوفيا، غريس، وصموئيل. قالت فيكتوريا إن صوفيا ليست فارساً. عبرت أفري عن أن فيكتوريا ليست فارساً. أخبرك جاكسون أن أفري محتالة وصوفيا محتالة. صرحت صوفيا، \"أفري محتالة وغريس فارس\". كما قالت غريس، \"أفري فارس\". عبر صموئيل عن أن غريس محتالة إذا وفقط إذا كان جاكسون فارساً. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) فيكتوريا فارس  \n(2) أفري محتالة  \n(3) جاكسون فارس  \n(4) صوفيا محتالة  \n(5) غريس محتالة  \n(6) صموئيل فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: داوود، زوي، إيثان، ليلي، هاربر، وإيما. قال داوود لك إن ليلي محتالة إذا وفقط إذا كان داوود فارساً. كما قالت زوي: \"إيما فارس أو داوود محتال\". قال إيثان إن هاربر ليست فارساً. بكلمات ليلي: \"إذا كان داوود فارساً، فإن ليلي فارساً\". صرحت هاربر: \"ليلي ليست محتالة\". سُمعت إيما تقول: \"ليلي فارس إذا وفقط إذا كان داوود فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود فارس  \n(2) زوي محتالة  \n(3) إيثان فارس \n(4) ليلي محتالة \n(5) هاربر محتالة  \n(6) إيما محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: إيفلين، أورورا، إيلا، شارلوت، أبيجيل، وإيزابيلا. وفقًا لإيفلين، \"أبيجيل فارس وشارلوت فارس\". أشارت أورورا، \"إيزابيلا ليست فارسًا\". قالت إيلا، \"إيفلين محتالة وأبيجيل فارس\". في كلمات شارلوت: \"إيلا ليست محتالة\". في تصريح من أبيجيل: \"إيلا فارس أو أورورا فارس\". أخبرتك إيزابيلا أن إيفلين محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين محتالة  \n(2) أورورا محتالة  \n(3) إيلا محتالة  \n(4) شارلوت محتالة  \n(5) أبيجيل محتالة  \n(6) إيزابيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: إليزابيث، ماثيو، أوليفر، آفا، لوغان، ونوح. سُمعت إليزابيث تقول: \"إذا كان أوليفر فارساً، فإن آفا فارساً\". سُمِع ماثيو يقول: \"آفا محتالة إذا وفقط إذا كانت إليزابيث محتالة\". بكلمات أوليفر: \"إليزابيث فارس\". في تصريح آفا: \"لوغان فارس وآفا فارس\". علق لوغان، \"آفا محتالة إذا وفقط إذا كان أوليفر محتالاً\". \"ماثيو ليس محتالاً\"، ذكر نوح. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث فارس  \n(2) ماثيو فارس  \n(3) أوليفر فارس  \n(4) آفا فارس  \n(5) لوغان فارس  \n(6) نوح فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: سباستيان، جاك، إيثان، بينيلوب، صوفيا، ولوك. في تصريح لسباستيان: \"جاك فارس إذا وفقط إذا كان إيثان محتالًا\". \"بينيلوب فارس إذا وفقط إذا كانت بينيلوب محتالة\"، أعلن جاك. علق إيثان، \"بينيلوب محتالة\". لاحظت بينيلوب، \"جاك محتال وصوفيا محتالة\". كما قالت صوفيا، \"سباستيان محتال أو لوك فارس\". \"بينيلوب محتالة أو جاك محتال\"، ادعى لوك. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سباستيان فارس  \n(2) جاك محتال  \n(3) إيثان فارس  \n(4) بينيلوب محتالة  \n(5) صوفيا فارس  \n(6) لوك فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: إيثان، ويليام، إيما، بنيامين، إيزابيلا، وميا. قال إيثان: \"بنيامين محتال أو ويليام محتال\". أكد ويليام: \"ميا فارس إذا وفقط إذا كانت إيزابيلا فارسًا\". ادعت إيما: \"ميا محتالة وإيزابيلا فارس\". علق بنيامين: \"ويليام فارس وميا فارس\". علق إيزابيلا: \"إذا كان بنيامين فارسًا، فإن إيما محتالة\". أخبرت ميا أنك إيزابيلا فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان محتال  \n(2) ويليام فارس  \n(3) إيما محتالة  \n(4) بنيامين فارس  \n(5) إيزابيلا فارس  \n(6) ميا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: لوغان، أوليفيا، أيدن، شارلوت، يعقوب، وزوي. قال لوغان: \"يعقوب فارس\". لاحظت أوليفيا: \"أيدن فارس أو زوي محتالة\". \"إذا كان لوغان فارساً، فإن أوليفيا فارس\" - أيدن. علقّت شارلوت: \"زوي فارس أو أوليفيا فارس\". كما قال يعقوب: \"أيدن محتال أو شارلوت محتالة\". وفقاً لزوي، \"يعقوب محتال إذا وفقط إذا كان لوغان فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان محتال  \n(2) أوليفيا فارس  \n(3) أيدن فارس  \n(4) شارلوت فارس  \n(5) يعقوب محتال  \n(6) زوي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: شارلوت، بنيامين، سباستيان، دانيال، جيمس، وميا. \"إذا كان جيمس فارسًا، فإن سباستيان محتال\"، أعلنت شارلوت. أكد بنيامين: \"سباستيان محتال\". صرح سباستيان، \"جيمس فارس\". علق دانيال، \"ميا محتالة إذا وفقط إذا كان سباستيان فارسًا\". قال جيمس، \"ميا فارسًا\". سُمعت ميا تقول، \"دانيال محتال أو جيمس فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت محتالة  \n(2) بنيامين محتال  \n(3) سباستيان فارس  \n(4) دانيال محتال  \n(5) جيمس فارس  \n(6) ميا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: جيمس، صوفيا، رايلي، جاكسون، جاك، وبنيامين. قال لك جيمس إنه إذا كان جاكسون محتالاً، فإن رايلي محتال. كما قالت صوفيا: \"رايلي محتال إذا وفقط إذا كان جيمس محتالاً\". في تصريح لرايلي: \"بنيامين محتال أو بنيامين فارس\". عبر جاكسون عن أن بنيامين محتال أو بنيامين فارس. عبر جاك عن أن جيمس ليس فارساً. أشار بنيامين، \"إذا كانت صوفيا فارسة، فإن جاك فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس فارس  \n(2) صوفيا فارس  \n(3) رايلي فارس  \n(4) جاكسون فارس  \n(5) جاك محتال  \n(6) بنيامين محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 6 سكان: غريس، ميا، أميليا، أبيجيل، سكارليت، وأورورا. في كلمات غريس: \"سكارليت محتالة أو أورورا فارسة\". في تصريح ميا: \"سكارليت فارسة إذا وفقط إذا كانت أبيجيل فارسة\". أميليا صرحت، \"أبيجيل محتالة أو غريس محتالة\". \"غريس محتالة وأورورا فارسة\"، ادعت أبيجيل. سكارليت لاحظت، \"أورورا محتالة وغريس فارسة\". \"أبيجيل محتالة\" - أورورا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) غريس فارس  \n(2) ميا فارس  \n(3) أميليا فارس  \n(4) أبيجيل محتالة  \n(5) سكارليت محتالة  \n(6) أورورا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: صوفيا، رايلي، لوكاس، ليام، جاكسون، وسكارليت. \"ليام ليس فارسًا\" - صوفيا. \"صوفيا محتالة أو لوكاس محتال\" ، أعلن رايلي. قال لوكاس إنه إذا كان جاكسون فارسًا، فإن سكارليت فارس. سمع ليام يقول، \"سكارليت محتالة\". صرح جاكسون، \"إذا كان ليام محتالًا، فإن رايلي فارس\". وفقًا لسكارليت، \"لوكاس محتال إذا وفقط إذا كانت صوفيا فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا محتالة  \n(2) رايلي فارس  \n(3) لوكاس محتال  \n(4) ليام فارس  \n(5) جاكسون فارس  \n(6) سكارليت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: يعقوب، كلوي، دانيال، آفا، آريا، وبينيلوب. علق يعقوب قائلاً: \"دانيال فارس إذا وفقط إذا كان يعقوب فارساً\". سُمع كلوي يقول: \"إذا كانت بينيلوب فارساً، فإن يعقوب محتال\". سُمع دانيال يقول: \"إذا كان يعقوب محتالاً، فإن كلوي محتالة\". صرحت آفا: \"دانيال فارس وكلوي محتالة\". كما قالت آريا: \"بينيلوب محتالة وبينيلوب فارس\". علقت بينيلوب: \"بينيلوب فارس إذا وفقط إذا كانت آفا فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب فارس  \n(2) كلوي محتالة  \n(3) دانيال فارس  \n(4) آفا فارس  \n(5) آريا محتالة  \n(6) بينيلوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: يعقوب، جاك، إليزابيث، ميا، زوي، ومايسون. قال يعقوب: \"جاك ليس محتالاً\". سمع جاك يقول: \"زوي محتالة ويعقوب محتال\". ادعت إليزابيث: \"ميا محتالة\". في تصريح لميا: \"زوي ليست فارسة\". سمع زوي تقول: \"إليزابيث فارسة\". أكد مايسون: \"زوي ليست فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب محتال  \n(2) جاك محتال  \n(3) إليزابيث فارسة  \n(4) ميا محتالة  \n(5) زوي فارسة  \n(6) مايسون محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 6 سكان: إميلي، أوليفر، سكارليت، إيلا، إيزابيلا، وآفا. قالت إميلي: \"سكارليت فارس إذا وفقط إذا كان أوليفر فارساً\". كما قال أوليفر: \"إيزابيلا فارس إذا وفقط إذا كانت آفا فارساً\". لاحظت سكارليت: \"أوليفر فارس إذا وفقط إذا كانت إيزابيلا فارساً\". لاحظت إيلا: \"إميلي فارس وإيلا فارس\". كما قالت إيزابيلا: \"أوليفر محتـال أو إيلا فارس\". \"سكارليت محتـالة إذا وفقط إذا كانت إيزابيلا فارساً\" - آفا. فمن هو الفارس ومن هو المحتـال؟",
        "solution_text_format": "(1) إميلي محتالة  \n(2) أوليفر فارس  \n(3) سكارليت محتالة  \n(4) إيلا محتالة  \n(5) إيزابيلا محتالة  \n(6) آفا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: شارلوت، إيلا، إسكندر، أيدن، جاكسون، ويوسف. أكدت شارلوت: \"جاكسون فارس أو إيلا فارس\". كما قالت إيلا: \"شارلوت ليست فارسًا\". علق إسكندر: \"جاكسون محتار إذا وفقط إذا كان أيدن محتالًا\". أشار أيدن: \"إسكندر ليس محتالًا\". في كلمات جاكسون: \"إسكندر فارس\". كما قال يوسف: \"إيلا ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت فارس  \n(2) إيلا محتالة  \n(3) إسكندر فارس  \n(4) أيدن فارس  \n(5) جاكسون فارس  \n(6) يوسف محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 6 سكان: إيفلين، هنري، لوغان، أفري، دانيال، وأيدن. قالت إيفلين إن دانيال محتال ولوغان فارس. أخبرك هنري أن لوغان فارس إذا وفقط إذا كان أيدن محتالاً. \"دانيال فارس\"، ادعى لوغان. سمع أفري يقول، \"هنري ليس محتالاً\". \"هنري ليس محتالاً\" - دانيال. في كلمات أيدن: \"هنري ليس محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين محتالة  \n(2) هنري محتال  \n(3) لوغان محتال  \n(4) أفري محتالة  \n(5) دانيال محتال  \n(6) أيدن محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: يعقوب، ويليام، فيكتوريا، مايسون، غريس، وأميليا. ادعى يعقوب: \"مايسون فارس\". بكلمات ويليام: \"ويليام فارس ويعقوب فارس\". \"يعقوب فارس إذا وفقط إذا كان يعقوب محتالًا\" - فيكتوريا. علق مايسون، \"ويليام محتال\". عبرت غريس عن أن غريس فارس وأن ويليام فارس. \"مايسون محتال وأميليا فارس\"، ذكرت أميليا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب فارس  \n(2) ويليام محتار  \n(3) فيكتوريا محتالة  \n(4) مايسون فارس  \n(5) غريس محتالة  \n(6) أميليا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: إميلي، أوليفيا، صموئيل، ليام، إيفلين، ومايسون. أخبرتك إميلي أن إيفلين ليست محتالة. قالت أوليفيا: \"مايسون فارس وليام فارس.\" ادعى صموئيل: \"ليام محتال.\" قال ليام: \"أوليفيا ليست محتالة.\" بكلمات إيفلين: \"مايسون محتال أو ليام محتال.\" \"ليام محتال وليام فارس\" - مايسون. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي فارس  \n(2) أوليفيا محتالة  \n(3) صموئيل فارس  \n(4) ليام محتال  \n(5) إيفلين فارس  \n(6) مايسون محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: مايسون، صموئيل، إميلي، شارلوت، فيكتوريا، وهاربر. مايسون أكد: \"إذا كان صموئيل فارسًا، فإن إميلي محتالة\". صموئيل قال: \"هاربر ليست فارسة\". \"صموئيل محتال إذا وفقط إذا كان مايسون محتالًا\" - إميلي. شارلوت قالت إن إميلي ليست فارسة. فيكتوريا علقت: \"شارلوت فارسة أو صموئيل فارس\". \"فيكتوريا فارسة إذا وفقط إذا كانت هاربر فارسة\"، أعلنت هاربر. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايسون فارس  \n(2) صموئيل محتال  \n(3) إميلي محتالة  \n(4) شارلوت فارس  \n(5) فيكتوريا فارس  \n(6) هاربر فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: دانيال، أوليفر، آفا، فيكتوريا، زوي، وأوليفيا. أكد دانيال: \"أوليفيا محتالة أو أوليفر فارس\". علق أوليفر، \"زوي محتالة وآفا محتالة\". أكدت آفا: \"أوليفيا محتالة\". أخبرتك فيكتوريا أن أوليفيا فارس إذا وفقط إذا كان دانيال فارساً. وفقاً لزوي، \"أوليفيا ليست فارساً\". كما قالت أوليفيا، \"دانيال فارس أو أوليفيا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال فارس  \n(2) أوليفر فارس  \n(3) آفا محتالة  \n(4) فيكتوريا فارسة  \n(5) زوي محتالة  \n(6) أوليفيا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: أبيجيل، مايسون، زوي، إسكندر، لوك، وليلي. وفقًا لأبيجيل، \"مايسون فارس إذا وفقط إذا كان لوك محتالًا\". قال مايسون، \"ليلي فارس وزوي محتالة.\" \"إذا كانت زوي فارسة، فإن لوك فارس\"، ادعت زوي. \"إذا كان مايسون فارسًا، فإن لوك فارس\"، أعلن إسكندر. علق لوك، \"زوي محتالة إذا وفقط إذا كان إسكندر محتالًا\". \"أبيجيل محتالة أو مايسون فارس\"، ذكرت ليلي. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أبيجيل فارس  \n(2) مايسون محتال  \n(3) زوي فارس  \n(4) إسكندر فارس  \n(5) لوك فارس  \n(6) ليلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: أفري، لوغان، ليلي، صوفيا، إيثان، وإيلا. \"صوفيا محتالة أو ليلي فارس\"، ادعت أفري. قال لوغان إن صوفيا محتالة إذا وفقط إذا كان إيثان محتالًا. علقت ليلي، \"إيلا فارس وإيثان فارس\". صوفيا علقت، \"إذا كان إيثان محتالًا، فإن إيثان فارس\". علق إيثان، \"أفري فارس أو ليلي محتالة\". \"لوغان محتال وصوفيا محتالة\" - إيلا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري محتالة  \n(2) لوغان فارس  \n(3) ليلي محتالة  \n(4) صوفيا فارسة  \n(5) إيثان فارس  \n(6) إيلا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: ويليام، يوسف، إميلي، جيمس، سباستيان، وآفا. سمع ويليام يقول: \"سباستيان محتال أو آفا فارس\". كما قال يوسف: \"ويليام محتال إذا وفقط إذا كانت آفا محتالة\". في تصريح لإميلي: \"آفا فارس إذا وفقط إذا كان يوسف فارسًا\". صرح جيمس: \"سباستيان ليس فارسًا\". \"إذا كان يوسف فارسًا، فإن آفا محتالة\"، أعلن سباستيان. قالت آفا: \"ويليام فارس ويوسف محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام محتال  \n(2) يوسف فارس  \n(3) إميلي محتالة  \n(4) جيمس محتال  \n(5) سباستيان فارس  \n(6) آفا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: إليزابيث، أيدن، دانيال، لوغان، أوليفر، وسباستيان. أكدت إليزابيث: \"أيدن ليس فارسًا\". سمع أيدن يقول: \"سباستيان محتال إذا وفقط إذا كان سباستيان فارسًا\". كما قال دانيال: \"لوغان ليس فارسًا\". في تصريح لوغان: \"أيدن ليس فارسًا\". أخبرك أوليفر أن سباستيان ليس محتالًا. وفي كلمات سباستيان: \"أيدن ليس فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث فارس  \n(2) أيدن محتال  \n(3) دانيال محتال  \n(4) لوغان فارس  \n(5) أوليفر فارس  \n(6) سباستيان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: أفري، شارلوت، لوكاس، ليلي، صوفيا، وفيكتوريا. \"شارلوت ليست فارسًا\"، ذكرت أفري. سُمعت شارلوت تقول، \"فيكتوريا محتالة\". \"إذا كانت ليلي فارسًا، فإن صوفيا محتالة\"، ذكر لوكاس. علقت ليلي، \"لوكاس ليس فارسًا\". أكدت صوفيا: \"فيكتوريا محتالة إذا وفقط إذا كانت فيكتوريا فارسًا\". علق فيكتوريا، \"إذا كان لوكاس محتالًا، فإن صوفيا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري فارس  \n(2) شارلوت محتالة  \n(3) لوكاس فارس  \n(4) ليلي محتالة  \n(5) صوفيا محتالة  \n(6) فيكتوريا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: لوكاس، أوليفر، جاكسون، بنيامين، نوح، ولوك. قال لوكاس إن لوك فارس. في تصريح لأوليور: \"نوح محتال\". سمع جاكسون يقول: \"إذا كان لوك محتالًا، فإن بنيامين محتال\". وفقًا لبنيامين، \"لوك محتال ولوكاس محتال\". قال نوح إن أوليفر محتال وأن نوح فارس. في تصريح للوك: \"لوكاس محتال ونوح فارس\". إذن، من هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس محتال  \n(2) أوليفر فارس  \n(3) جاكسون محتال  \n(4) بنيامين فارس  \n(5) نوح محتال  \n(6) لوك محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: جاك، أيدن، صموئيل، صوفيا، إيفلين، وأفري. في كلمات جاك: \"إذا كان جاك فارسًا، فإن أفري محتالة\". علق أيدن، \"جاك فارس\". قال صموئيل، \"إيفلين فارس ومحتال أيدن\". قالت صوفيا، \"جاك ليس محتالًا\". في بيان لإيفلين: \"صموئيل محتال وصوفيا محتالة\". عبرت أفري عن أن صموئيل فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاك فارس  \n(2) أيدن فارس  \n(3) صموئيل محتال  \n(4) صوفيا فارس  \n(5) إيفلين محتالة  \n(6) أفري محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: لوكاس، ويليام، سباستيان، دانيال، إيما، وأوليفيا. لوكاس أعرب عن أن سباستيان فارس. ويليام علق، \"لوكاس ليس فارساً\". سباستيان قال، \"أوليفيا محتالة\". كما قال دانيال، \"إيما فارس وسباستيان محتال\". إيما صرحت، \"لوكاس فارس\". أوليفيا علقت، \"سباستيان فارس أو لوكاس محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس محتال  \n(2) ويليام فارس  \n(3) سباستيان محتال  \n(4) دانيال محتال  \n(5) إيما محتالة  \n(6) أوليفيا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: ويليام، أيدن، سكارليت، أفري، آفا، وبنيامين. ذكر ويليام، \"إذا كانت سكارليت فارساً، فإن آفا محتالة\". عبر أيدن عن أنه إذا كان بنيامين محتالاً، فإن بنيامين فارس. في تصريح من سكارليت: \"ويليام ليس فارساً\". أفري صرحت، \"أيدن محتال\". آفا قالت، \"سكارليت فارس.\" بنيامين عبر أن آفا فارس وأفري فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام فارس  \n(2) أيدن محتال  \n(3) سكارليت محتالة  \n(4) أفري فارس  \n(5) آفا محتالة  \n(6) بنيامين محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: جاكسون، هنري، دانيال، لوك، صموئيل، وكلوي. \"دانيال محتال\" - جاكسون. لاحظ هنري، \"إذا كان صموئيل فارسًا، فإن كلوي فارس.\" قال دانيال إن لوك فارس. \"كلوي ليست فارسة\"، أعلن لوك. \"هنري ليس محتالًا\"، ذكر صموئيل. سُمعت كلوي تقول، \"لوك محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون فارس  \n(2) هنري فارس  \n(3) دانيال محتال  \n(4) لوك محتال  \n(5) صموئيل فارس  \n(6) كلوي فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: جاكسون، صوفيا، إيزابيلا، إليزابيث، آفا، وليلي. في تصريح لجكسون: \"آفا فارس إذا وفقط إذا كانت آفا محتالة\". وفقاً لصوفيا، \"آفا محتالة وإيزابيلا محتالة\". \"إذا كانت آفا فارساً، فإن آفا محتالة\"، ادعت إيزابيلا. إليزابيث صرحت، \"آفا محتالة إذا وفقط إذا كانت صوفيا محتالة\". وفقاً لآفا، \"إيزابيلا فارس أو صوفيا محتالة\". في كلمات ليلي: \"إليزابيث فارس وآفا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون محتال  \n(2) صوفيا محتالة  \n(3) إيزابيلا محتالة  \n(4) إليزابيث محتالة  \n(5) آفا فارس  \n(6) ليلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: صموئيل، ليلي، آريا، أفري، أبيجيل، وبنيامين. صموئيل قال: \"ليلي فارس وآريا فارس\". ليلي قالت: \"صموئيل فارس\". آريا أخبرتكم أن أبيجيل فارس. في تصريح من أفري: \"إذا كان بنيامين فارساً، فإن بنيامين محتال\". في كلمات أبيجيل: \"أفري محتالة وليلي محتالة\". بنيامين علق: \"أبيجيل فارس أو ليلي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صموئيل محتال  \n(2) ليلي محتالة  \n(3) آريا فارسة  \n(4) أفري محتالة  \n(5) أبيجيل فارسة  \n(6) بنيامين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: إيزابيلا، صوفيا، إيلا، جاكسون، لوك، وهنري. قالت إيزابيلا: \"إذا كان جاكسون فارسًا، فإن إيلا فارس\". لاحظت صوفيا: \"إيزابيلا ليست محتالة\". علقّت إيلا: \"هنري فارس وإيزابيلا محتالة\". أكد جاكسون: \"لوك ليس فارسًا\". أكد لوك: \"إذا كانت إيزابيلا محتالة، فإن صوفيا فارس\". كما قال هنري: \"لوك فارس أو لوك محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا فارس  \n(2) صوفيا فارس  \n(3) إيلا محتالة  \n(4) جاكسون محتال  \n(5) لوك فارس  \n(6) هنري فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: شارلوت، هنري، إليزابيث، أورورا، يوسف، وجاكسون. في كلمات شارلوت: \"يوسف فارس وأورورا محتالة\". وفقاً لهنري، \"يوسف محتال إذا وفقط إذا كان جاكسون فارساً\". إليزابيث أخبرتك أن أورورا ليست محتالة. \"إليزابيث محتالة أو إليزابيث فارس\"، ادعت أورورا. \"أورورا محتالة إذا وفقط إذا كانت شارلوت محتالة\"، أعلن يوسف. جاكسون أخبرك أن شارلوت فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت محتالة  \n(2) هنري محتال  \n(3) إليزابيث فارسة  \n(4) أورورا فارسة  \n(5) يوسف محتال  \n(6) جاكسون محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: إيما، لوغان، جاكسون، دانيال، آريا، وهنري. \"إيما فارس إذا وفقط إذا كانت آريا محتالًا\"، أعلنت إيما. أخبرك لوغان أن إيما فارس إذا وفقط إذا كان دانيال فارسًا. وفقًا لجكسون، \"آريا محتال إذا وفقط إذا كان هنري محتالًا\". في تصريح لدانيال: \"آريا ليست فارسًا\". أشارت آريا، \"دانيال فارس إذا وفقط إذا كان هنري محتالًا\". علق هنري، \"إيما فارس أو جاكسون فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما فارس  \n(2) لوغان فارس  \n(3) جاكسون محتال  \n(4) دانيال فارس  \n(5) آريا محتالة  \n(6) هنري فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: إليزابيث، صوفيا، فيكتوريا، أبيجيل، غريس، ولوك. قالت إليزابيث: \"صوفيا فارس إذا وفقط إذا كان لوك محتالاً\". علقت صوفيا، \"إليزابيث فارس أو غريس فارس\". كما قالت فيكتوريا، \"غريس محتال وأبيجيل فارس\". قالت أبيجيل، \"فيكتوريا محتال أو صوفيا فارس.\" قالت غريس، \"لوك محتال وإليزابيث فارس.\" أخبرك لوك أن صوفيا فارس وأبيجيل محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث فارس  \n(2) صوفيا فارس  \n(3) فيكتوريا محتالة  \n(4) أبيجيل فارس  \n(5) غريس فارس  \n(6) لوك محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: ليلي، إيزابيلا، إيلا، جيمس، إليزابيث، وسباستيان. قالت ليلي: \"جيمس ليس فارسًا.\" لاحظت إيزابيلا: \"إيلا فارس أو إيلا محتالة\". علقّت إيلا: \"ليلي محتالة وليلي فارس.\" أكد جيمس: \"إليزابيث محتالة أو إيلا فارس.\" وفقًا لإليزابيث: \"إذا كانت إيلا محتالة، فإن إيزابيلا محتالة.\" في كلمات سباستيان: \"ليلي فارس وإليزابيث فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي محتالة  \n(2) إيزابيلا فارسة  \n(3) إيلا محتالة  \n(4) جيمس فارس  \n(5) إليزابيث محتالة  \n(6) سباستيان محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: ويليام، إيثان، أورورا، أفري، أبيجيل، ولوكاس. أكد ويليام: \"إذا كانت أبيجيل محتالة، فإن لوكاس محتال\". علق إيثان: \"أفري محتالة أو لوكاس محتال\". في بيان من أورورا: \"أبيجيل فارس إذا وفقط إذا كان لوكاس فارسًا\". في كلمات أفري: \"إذا كان لوكاس فارسًا، فإن إيثان محتال\". قالت أبيجيل إنه إذا كان لوكاس فارسًا، فإن إيثان محتال. أخبرك لوكاس أن أبيجيل فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام فارس  \n(2) إيثان محتال  \n(3) أورورا فارس  \n(4) أفري فارس  \n(5) أبيجيل فارس  \n(6) لوكاس فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: رايلي، إيثان، هنري، إسكندر، إيما، وإيزابيلا. قالت رايلي إن إيما ليست محتالة. أكد إيثان: \"رايلي محتالة أو إيزابيلا فارس\". وفقًا لهنري، \"رايلي محتالة وإيما محتالة\". علق إسكندر، \"إيثان محتال وهنري فارس\". في كلمات إيما: \"إيثان ليس محتالًا\". علق إيزابيلا، \"إذا كانت إيما محتالة، فإن رايلي فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) رايلي فارس  \n(2) إيثان فارس  \n(3) هنري محتال  \n(4) إسكندر محتال  \n(5) إيما فارس  \n(6) إيزابيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: أميليا، آفا، أوليفيا، أوليفر، جاك، وأفري. قالت أميليا: \"أفري محتالة وأوليفر فارس\". وفي كلمات آفا: \"جاك فارس\". قالت أوليفيا: \"أوليفر فارس أو أميليا فارس\". علق أوليفر: \"آفا محتالة أو أوليفيا محتالة\". أخبرك جاك أن أوليفر ليس فارساً. وأخبرتك أفري أن آفا فارس أو أوليفيا محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا فارس  \n(2) آفا محتالة  \n(3) أوليفيا فارس  \n(4) أوليفر فارس  \n(5) جاك محتال  \n(6) أفري محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: إسكندر، إيلا، أورورا، هاربر، آفا، وإميلي. أكد إسكندر: \"إيلا فارس أو إميلي محتالة\". أعلنت إيلا: \"هاربر فارس وأورورا محتالة\". قالت أورورا إن إميلي فارس. \"آفا ليست فارسًا\" - هاربر. ادعت آفا: \"إميلي محتالة وأورورا محتالة\". ذكرت إميلي: \"إميلي فارس أو أورورا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إسكندر محتال  \n(2) إيلا محتالة  \n(3) أورورا فارس  \n(4) هاربر فارس  \n(5) آفا محتالة  \n(6) إميلي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: كلوي، جاك، أفري، مايكل، سباستيان، وإليزابيث. قالت كلوي: \"إليزابيث ليست فارساً\". صرح جاك، \"سباستيان فارس إذا وفقط إذا كانت إليزابيث فارساً\". سمع أفري يقول: \"أفري فارس وسباستيان محتال\". في كلمات مايكل: \"جاك ليس محتالاً\". سمع سباستيان يقول: \"جاك محتال\". لاحظت إليزابيث، \"سباستيان ليس فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) كلوي فارس  \n(2) جاك محتال  \n(3) أفري محتالة  \n(4) مايكل محتال  \n(5) سباستيان فارس  \n(6) إليزابيث محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: إيثان، أبيجيل، صوفيا، يعقوب، إيفلين، وبينيلوب. قال إيثان: \"صوفيا ليست محتالة\". وأشارت أبيجيل: \"بينيلوب ليست محتالة\". أخبرتك صوفيا أن بينيلوب فارس أو إيثان محتال. كما قال يعقوب: \"إيثان محتال أو إيثان فارس\". عبرت إيفلين عن أن إيثان محتال أو بينيلوب محتالة. وفي تصريح من بينيلوب: \"إيثان فارس أو إيفلين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان فارس  \n(2) أبيجيل فارس  \n(3) صوفيا فارس  \n(4) يعقوب فارس  \n(5) إيفلين محتالة  \n(6) بينيلوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: يوسف، يعقوب، سكارليت، بينيلوب، لوكاس، ولوغان. وفقاً ليوسف، \"سكارليت محتالة وبينيلوب فارسة\". سمع يعقوب يقول، \"لوكاس فارس\". قالت سكارليت إن يوسف فارس وبينيلوب محتالة. \"لوكاس فارس أو يوسف فارس\" - بينيلوب. قال لوكاس إن يوسف ليس فارساً. قال لوغان، \"سكارليت ليست محتالة.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف فارس  \n(2) يعقوب محتال  \n(3) سكارليت محتالة  \n(4) بينيلوب فارس  \n(5) لوكاس محتال  \n(6) لوغان محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: لوغان، زوي، نوح، لوك، صوفيا، وأميليا. سمع لوغان يقول: \"صوفيا محتالة إذا وفقط إذا كان نوح محتالًا\". وفقًا لزوي، \"لوغان محتال ولوك فارس\". في تصريح من نوح: \"لوغان محتال\". علق لوك، \"إذا كانت صوفيا فارسة، فإن صوفيا محتالة\". في كلمات صوفيا: \"زوي محتالة أو أميليا محتالة\". قالت أميليا، \"أميليا فارسة أو صوفيا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان محتال  \n(2) زوي فارسة  \n(3) نوح فارس  \n(4) لوك فارس  \n(5) صوفيا محتالة  \n(6) أميليا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: هاربر، نوح، إيزابيلا، آفا، صموئيل، وجاكسون. \"إذا كانت إيزابيلا فارسًا، فإن إيزابيلا محتالة\"، ذكر هاربر. كما قال نوح: \"إذا كان هاربر فارسًا، فإن إيزابيلا فارسًا\". أكدت إيزابيلا: \"جاكسون محتال إذا وفقط إذا كان هاربر فارسًا\". في كلمات آفا: \"جاكسون فارس\". كما قال صموئيل: \"إذا كانت إيزابيلا فارسًا، فإن نوح فارس\". \"نوح فارس أو صموئيل محتال\"، ادعى جاكسون. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر محتالة  \n(2) نوح فارس  \n(3) إيزابيلا فارس  \n(4) آفا فارس  \n(5) صموئيل فارس  \n(6) جاكسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: صوفيا، إيزابيلا، ليلي، إيما، صموئيل، وإليزابيث. صرحت صوفيا، \"إيزابيلا فارس وصموئيل فارس\". أعلنت إيزابيلا، \"إليزابيث فارس\". علقت ليلي، \"إيما فارس وصموئيل فارس\". ذكرت إيما، \"صوفيا محتالة أو إليزابيث فارس\". علق صموئيل، \"إذا كانت صوفيا فارس، فإن إليزابيث فارس\". قالت إليزابيث إن ليلي محتالة وإيزابيلا فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا محتالة  \n(2) إيزابيلا محتالة  \n(3) ليلي فارسة  \n(4) إيما فارسة  \n(5) صموئيل فارس  \n(6) إليزابيث محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: إيثان، لوك، أوين، أوليفر، إيلا، وصوفيا. في تصريح لإيثان: \"أوليفر ليس محتالاً\". قال لوك: \"إذا كانت صوفيا محتالة، فإن لوك فارس\". \"لوك محتال\"، ادعى أوين. علق أوليفر: \"إذا كانت إيلا فارسة، فإن أوين محتال\". قالت إيلا إن أوين فارس وإيلا فارسة. \"أوين فارس أو إيلا محتالة\"، ادعت صوفيا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان فارس  \n(2) لوك فارس  \n(3) أوين محتال  \n(4) أوليفر فارس  \n(5) إيلا محتالة  \n(6) صوفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: إيلا، بنيامين، بينيلوب، هاربر، ميا، وإميلي. \"بنيامين ليس محتالاً\"، ذكرت إيلا. \"إذا كان هاربر فارساً، فإن بنيامين فارس\"، ادعى بنيامين. قالت بينيلوب، \"إيلا ليست محتالة\". وفقاً لهاربر، \"بينيلوب فارس أو إيلا فارس\". \"إميلي فارس أو إيلا فارس\"، ادعت ميا. قالت إميلي إن هاربر محتال أو إيلا محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا فارس  \n(2) بنيامين فارس  \n(3) بينيلوب فارس  \n(4) هاربر فارس  \n(5) ميا فارس  \n(6) إميلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: لوك، أميليا، إميلي، إيما، هاربر، وسكارليت. علق لوك قائلاً: \"إميلي محتالة إذا وفقط إذا كان لوك فارسًا\". بكلمات أميليا: \"لوك ليس فارسًا\". في تصريح لإميلي: \"إذا كانت سكارليت محتالة، فإن أميليا فارسًا\". سُمعت إيما تقول: \"لوك ليس فارسًا\". أخبرك هاربر أن لوك فارس أو سكارليت فارس. صرحت سكارليت: \"هاربر محتال أو إميلي فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) أميليا محتالة  \n(3) إميلي محتالة  \n(4) إيما محتالة  \n(5) هاربر فارس  \n(6) سكارليت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بستة سكان: هاربر، إيثان، إيما، لوغان، أوين، ولوك. وفقًا لهاربر، \"إيما محتالة إذا وفقط إذا كان لوغان فارسًا\". في بيان لإيثان: \"إذا كان لوغان محتالًا، فإن أوين محتال\". أكدت إيما: \"إذا كان لوك فارسًا، فإن أوين محتال\". في بيان لوغان: \"هاربر محتالة إذا وفقط إذا كان لوغان فارسًا\". \"لوك محتال وهاربر فارس\"، أعلن أوين. في كلمات لوك: \"إيما فارس أو لوك فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر محتالة  \n(2) إيثان فارس  \n(3) إيما فارس  \n(4) لوغان فارس  \n(5) أوين محتال  \n(6) لوك فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بستة سكان: أيدن، أوليفر، كلوي، مايسون، ليام، وليلي. أيدن أكد: \"ليام ليس فارساً\". أوليفر صرح، \"أيدن ليس محتالاً\". كلوي قالت إن مايسون ليس فارساً. \"أيدن فارس وكلوي فارس\"، ذكر مايسون. وفقاً لي Liam، \"أيدن محتال وليلي محتال\". ليلي قالت إن مايسون محتال ومايسون فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن محتال  \n(2) أوليفر محتال  \n(3) كلوي فارس  \n(4) مايسون محتال  \n(5) ليام فارس  \n(6) ليلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 6 سكان: سباستيان، جيمس، دانيال، أوليفيا، مايسون، وصوفيا. قال سباستيان: \"إذا كان جيمس فارسًا، فإن مايسون محتال\". عبر جيمس عن أن سباستيان محتال إذا وفقط إذا كانت أوليفيا فارسة. قال دانيال: \"مايسون محتال وصوفيا فارسة\". قالت أوليفيا إن سباستيان محتال أو مايسون محتال. في تصريح لمايسون: \"مايسون فارس أو صوفيا فارسة\". أكدت صوفيا: \"دانيال ليس فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سباستيان محتال  \n(2) جيمس فارس  \n(3) دانيال محتال  \n(4) أوليفيا فارس  \n(5) مايسون فارس  \n(6) صوفيا فارس"
    }
]