[
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：奥萝拉、伊森、诺亚、阿丽亚和阿比盖尔。奥萝拉说：“阿比盖尔不是无赖。”伊森则说：“阿比盖尔是无赖或者阿丽亚是无赖。”诺亚说：“阿丽亚是无赖。”阿丽亚告诉你，只有当诺亚是骑士时，奥萝拉才是无赖。阿比盖尔说诺亚是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥萝拉是一名骑士  \n(2) 伊森是一名骑士  \n(3) 诺亚是一名骑士  \n(4) 阿丽亚是一名无赖  \n(5) 阿比盖尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：阿比盖尔、梅森、伊丽莎白、艾米莉和索菲娅。阿比盖尔宣称：“索菲娅是无赖或者伊丽莎白是骑士。”梅森提到：“索菲娅是骑士。”伊丽莎白声称：“阿比盖尔不是骑士。”艾米莉的陈述是：“阿比盖尔是骑士或者伊丽莎白是骑士。”索菲娅则说：“如果艾米莉是骑士，那么艾米莉就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是骑士  \n(2) 梅森是无赖  \n(3) 伊丽莎白是无赖  \n(4) 艾米莉是骑士  \n(5) 索菲娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：佩内洛普、卢卡斯、阿梅莉亚、艾米莉和佐伊。佩内洛普声称：“卢卡斯是骑士或者阿梅莉亚是骑士。”卢卡斯的陈述是：“如果卢卡斯是骑士，那么佐伊就是无赖。”阿梅莉亚提到：“艾米莉是无赖。”艾米莉指出：“佩内洛普是无赖，佐伊是无赖。”佐伊告诉你，艾米莉是骑士，而艾米莉是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是一名骑士  \n(2) 卢卡斯是一名骑士  \n(3) 阿梅莉亚是一名骑士  \n(4) 艾米莉是一名无赖  \n(5) 佐伊是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：威廉、雅各布、艾登、阿丽亚和洛根。威廉说：“如果艾登是骑士，那么阿丽亚就是无赖。”雅各布被听到说：“洛根是无赖，而雅各布是骑士。”艾登说：“阿丽亚是无赖或者威廉是骑士。”阿丽亚告诉你威廉是无赖。洛根声明：“雅各布是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 雅各布是一个无赖  \n(3) 艾登是一名骑士  \n(4) 阿丽亚是一个无赖  \n(5) 洛根是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：卢卡斯、亚历山大、亨利、艾登和塞巴斯蒂安。卢卡斯评论道：“亨利是骑士。”亚历山大提到：“艾登是骑士。”亨利说：“塞巴斯蒂安是骑士，亨利是骑士。”艾登宣称：“卢卡斯不是骑士。”塞巴斯蒂安断言：“卢卡斯是无赖或者艾登是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）卢卡斯是无赖  \n（2）亚历山大是骑士  \n（3）亨利是无赖  \n（4）艾登是骑士  \n（5）塞巴斯蒂安是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：阿梅莉亚、佐伊、欧文、塞缪尔和阿丽亚。阿梅莉亚说：“佐伊是无赖，欧文是无赖。”佐伊表示阿梅莉亚是骑士，阿丽亚是骑士。欧文被听到说：“塞缪尔是骑士，阿梅莉亚是无赖。”塞缪尔宣称：“如果阿丽亚是骑士，那么佐伊就是骑士。”阿丽亚评论道：“只有当欧文是无赖时，佐伊才是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是一名骑士  \n(2) 佐伊是一个无赖  \n(3) 欧文是一个无赖  \n(4) 塞缪尔是一名骑士  \n(5) 阿丽亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：丹尼尔、梅森、阿丽亚、利亚姆和迈克尔。丹尼尔说：“迈克尔是个无赖。”梅森断言：“利亚姆是个无赖。”阿丽亚说：“如果梅森是个无赖，那么迈克尔就是个无赖。”利亚姆说：“梅森是个无赖当且仅当梅森是个骑士。”迈克尔说：“阿丽亚不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是一名骑士  \n(2) 梅森是一名骑士  \n(3) 阿丽亚是一名骑士  \n(4) 利亚姆是一名无赖  \n(5) 迈克尔是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：艾娃、阿比盖尔、哈珀、佩内洛普和伊森。艾娃告诉你，伊森是骑士，而阿比盖尔是无赖。有人听到阿比盖尔说：“阿比盖尔是骑士或者佩内洛普是无赖。”根据哈珀的说法，“如果哈珀是骑士，那么阿比盖尔就是骑士。”佩内洛普声称：“阿比盖尔不是无赖。”伊森告诉你，如果艾娃是骑士，那么阿比盖尔就是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是无赖  \n(2) 阿比盖尔是骑士  \n(3) 哈珀是骑士  \n(4) 佩内洛普是骑士  \n(5) 伊森是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：大卫、伊芙琳、詹姆斯、格蕾丝和梅森。大卫说：“伊芙琳是无赖或者伊芙琳是骑士。”伊芙琳表示格蕾丝是无赖，梅森是骑士。詹姆斯表示大卫不是骑士。格蕾丝说：“如果大卫是无赖，那么詹姆斯就是无赖。”梅森评论道：“格蕾丝是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 大卫是一名骑士  \n(2) 伊芙琳是一名无赖  \n(3) 詹姆斯是一名无赖  \n(4) 格蕾丝是一名骑士  \n(5) 梅森是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：阿丽亚、杰克逊、伊森、欧文和亨利。阿丽亚评论道：“欧文是骑士或者阿丽亚是骑士。”杰克逊评论道：“如果伊森是骑士，那么阿丽亚就是骑士。”伊森宣称：“阿丽亚是无赖当且仅当欧文是无赖。”欧文被听到说：“如果亨利是骑士，那么亨利就是无赖。”亨利提到：“杰克逊是无赖当且仅当欧文是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿丽亚是无赖  \n(2) 杰克逊是无赖  \n(3) 伊森是骑士  \n(4) 欧文是无赖  \n(5) 亨利是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：利亚姆、阿比盖尔、奥利弗、夏洛特和约瑟夫。利亚姆说：“夏洛特是骑士，约瑟夫是无赖。”阿比盖尔说：“夏洛特是无赖或者利亚姆是骑士。”奥利弗说：“夏洛特是骑士。”夏洛特告诉你利亚姆是无赖。根据约瑟夫的话：“利亚姆不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是无赖  \n(2) 阿比盖尔是无赖  \n(3) 奥利弗是骑士  \n(4) 夏洛特是骑士  \n(5) 约瑟夫是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：艾拉、维多利亚、赖利、艾弗里和索菲娅。艾拉声称：“艾拉是骑士或者维多利亚是无赖。”维多利亚声称：“如果维多利亚是骑士，那么赖利就是骑士。”赖利声称：“艾拉不是骑士。”艾弗里宣称：“索菲娅是骑士或者艾拉是无赖。”索菲娅表示，如果维多利亚是无赖，那么赖利就是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是无赖  \n(2) 维多利亚是骑士  \n(3) 赖利是骑士  \n(4) 艾弗里是骑士  \n(5) 索菲娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：约瑟夫、迈克尔、伊丽莎白、卢卡斯和阿丽亚。约瑟夫说：“卢卡斯是无赖，伊丽莎白是无赖。”迈克尔说：“伊丽莎白是无赖，伊丽莎白是骑士。”伊丽莎白说：“迈克尔不是无赖。”卢卡斯评论道：“迈克尔不是骑士。”阿丽亚断言：“阿丽亚是骑士，约瑟夫是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是无赖  \n(2) 迈克尔是无赖  \n(3) 伊丽莎白是无赖  \n(4) 卢卡斯是骑士  \n(5) 阿丽亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：亚历山大、詹姆斯、艾娃、洛根和格蕾丝。亚历山大告诉你：“如果格蕾丝是骑士，那么洛根就是骑士。”詹姆斯指出：“艾娃是无赖或者洛根是骑士。”根据艾娃的说法：“詹姆斯是无赖当且仅当亚历山大是骑士。”洛根宣称：“亚历山大是无赖当且仅当詹姆斯是骑士。”格蕾丝宣称：“艾娃是无赖并且艾娃是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亚历山大是一名骑士  \n(2) 詹姆斯是一名骑士  \n(3) 艾娃是一名无赖  \n(4) 洛根是一名无赖  \n(5) 格蕾丝是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：伊芙琳、克洛伊、马修、威廉和索菲娅。伊芙琳表示克洛伊是无赖或者威廉是骑士。克洛伊声称：“马修是骑士或者马修是无赖。”马修声称：“威廉不是骑士。”根据威廉的话：“马修是无赖当且仅当伊芙琳是无赖。”在索菲娅的话中：“马修是骑士当且仅当马修是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是无赖  \n(2) 克洛伊是骑士  \n(3) 马修是骑士  \n(4) 威廉是无赖  \n(5) 索菲娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：大卫、夏洛特、杰克逊、塞缪尔和艾弗里。大卫被听到说：“如果塞缪尔是骑士，那么夏洛特就是无赖。”夏洛特说大卫是无赖当且仅当艾弗里是无赖。杰克逊评论道：“夏洛特是无赖或者艾弗里是无赖。”塞缪尔说：“如果杰克逊是无赖，那么大卫就是骑士。”根据艾弗里的说法，“夏洛特是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 大卫是无赖  \n(2) 夏洛特是骑士  \n(3) 杰克逊是骑士  \n(4) 塞缪尔是骑士  \n(5) 艾弗里是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：利亚姆、伊丽莎白、艾登、马修和本杰明。利亚姆说：“艾登是骑士，而本杰明是无赖。”伊丽莎白说：“马修是骑士当且仅当马修是无赖。”艾登的陈述是：“如果利亚姆是无赖，那么利亚姆就是骑士。”马修宣称：“利亚姆不是骑士。”根据本杰明的说法，“艾登是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是无赖  \n(2) 伊丽莎白是无赖  \n(3) 艾登是无赖  \n(4) 马修是骑士  \n(5) 本杰明是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：艾登、夏洛特、亚历山大、卢卡斯和艾米莉。“亚历山大是无赖或者艾米莉是骑士，”艾登说。夏洛特告诉你，艾登不是骑士。亚历山大声明：“艾登是无赖。” “如果艾米莉是骑士，那么夏洛特就是骑士，”卢卡斯声称。艾米莉表示，如果夏洛特是无赖，那么艾登就是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是一名骑士  \n(2) 夏洛特是一个无赖  \n(3) 亚历山大是一个无赖  \n(4) 卢卡斯是一名骑士  \n(5) 艾米莉是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：夏洛特、奥利弗、艾拉、赖利和丹尼尔。夏洛特评论道：“奥利弗是个无赖。”奥利弗说：“丹尼尔不是骑士。”艾拉说：“夏洛特是个无赖，夏洛特是个骑士。”赖利断言：“艾拉是个无赖，或者夏洛特是个无赖。”根据丹尼尔的说法：“如果且仅如果夏洛特是个骑士，奥利弗就是个无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是一名骑士  \n(2) 奥利弗是一个无赖  \n(3) 艾拉是一个无赖  \n(4) 赖利是一名骑士  \n(5) 丹尼尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：伊森、詹姆斯、艾米莉、迈克尔和维多利亚。伊森说：“艾米莉是无赖或者迈克尔是骑士。”詹姆斯被听到说：“伊森是骑士而伊森是无赖。”艾米莉说：“詹姆斯是无赖。”迈克尔断言：“如果艾米莉是骑士，那么艾米莉就是无赖。”根据维多利亚的说法：“伊森是无赖或者迈克尔是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是无赖  \n(2) 詹姆斯是无赖  \n(3) 艾米莉是骑士  \n(4) 迈克尔是无赖  \n(5) 维多利亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：梅森、奥萝拉、亨利、维多利亚和丹尼尔。梅森评论道：“如果维多利亚是骑士，那么奥萝拉就是骑士。”奥萝拉表示丹尼尔是骑士。亨利说：“如果梅森是无赖，那么奥萝拉就是骑士。”维多利亚说：“奥萝拉是骑士，丹尼尔是骑士。”丹尼尔则说：“亨利不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是一名骑士  \n(2) 奥萝拉是一个无赖  \n(3) 亨利是一名骑士  \n(4) 维多利亚是一个无赖  \n(5) 丹尼尔是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了五位居民：詹姆斯、卢卡斯、迈克尔、亚历山大和奥萝拉。詹姆斯说：“卢卡斯是骑士，奥萝拉是骑士。”卢卡斯说：“亚历山大是无赖，或者卢卡斯是骑士。”迈克尔声称：“卢卡斯是无赖，或者詹姆斯是骑士。”亚历山大的话是：“如果卢卡斯是骑士，那么迈克尔就是无赖。”奥萝拉说：“如果奥萝拉是骑士，那么卢卡斯是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是一名骑士  \n(2) 卢卡斯是一名骑士  \n(3) 迈克尔是一名骑士  \n(4) 亚历山大是一名无赖  \n(5) 奥萝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：阿梅莉亚、佐伊、阿比盖尔、雅各布和索菲娅。阿梅莉亚声称：“雅各布是无赖当且仅当索菲娅是骑士。”佐伊说：“雅各布是无赖。”阿比盖尔指出：“佐伊是骑士当且仅当阿梅莉亚是无赖。”雅各布声明：“如果佐伊是无赖，那么雅各布就是骑士。”根据索菲娅的说法：“佐伊不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是无赖  \n(2) 佐伊是无赖  \n(3) 阿比盖尔是无赖  \n(4) 雅各布是骑士  \n(5) 索菲娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：索菲娅、米娅、艾米莉、伊芙琳和夏洛特。索菲娅的陈述是：“伊芙琳是无赖当且仅当米娅是无赖。”米娅说：“伊芙琳是无赖或者索菲娅是骑士。”艾米莉的陈述是：“米娅是骑士或者伊芙琳是无赖。”伊芙琳说：“如果夏洛特是无赖，那么米娅是骑士。”夏洛特表示索菲娅是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 米娅是一名骑士  \n(3) 艾米莉是一名骑士  \n(4) 伊芙琳是一名骑士  \n(5) 夏洛特是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：夏洛特、诺亚、佐伊、杰克和米娅。夏洛特告诉你米娅是无赖，诺亚是骑士。诺亚说：“夏洛特是无赖，佐伊是骑士。”佐伊指出：“诺亚是无赖，夏洛特是骑士。”杰克提到：“米娅不是骑士。”米娅说：“夏洛特是无赖，佐伊是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是无赖  \n(2) 诺亚是无赖  \n(3) 佐伊是无赖  \n(4) 杰克是骑士  \n(5) 米娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：艾弗里、詹姆斯、丹尼尔、艾拉和威廉。艾弗里说：“威廉是个无赖。”詹姆斯被听到说：“艾拉是个骑士或者威廉是个无赖。”丹尼尔评论道：“如果艾弗里是个骑士，那么艾拉就是个骑士。”在艾拉的陈述中：“丹尼尔是个无赖。”根据威廉的说法：“艾弗里是个无赖或者丹尼尔是个无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是无赖  \n(2) 詹姆斯是无赖  \n(3) 丹尼尔是骑士  \n(4) 艾拉是无赖  \n(5) 威廉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：杰克、利亚姆、伊森、阿梅莉亚和哈珀。杰克说：“伊森是无赖或者阿梅莉亚是无赖。”利亚姆则说：“伊森是骑士或者哈珀是骑士。”伊森的陈述是：“杰克不是无赖。”阿梅莉亚的陈述是：“如果利亚姆是骑士，那么阿梅莉亚就是骑士。”哈珀说：“如果利亚姆是无赖，那么阿梅莉亚就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克是一名骑士  \n(2) 利亚姆是一名骑士  \n(3) 伊森是一名骑士  \n(4) 阿梅莉亚是一名无赖  \n(5) 哈珀是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了五位居民：佩内洛普、迈克尔、丹尼尔、马修和伊芙琳。佩内洛普宣称：“佩内洛普是骑士，而迈克尔是无赖。”迈克尔宣称：“丹尼尔是无赖或者丹尼尔是骑士。”丹尼尔评论道：“佩内洛普是无赖或者伊芙琳是无赖。”马修被听到说：“佩内洛普是骑士当且仅当丹尼尔是骑士。”伊芙琳声明：“佩内洛普是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是无赖  \n(2) 迈克尔是骑士  \n(3) 丹尼尔是骑士  \n(4) 马修是无赖  \n(5) 伊芙琳是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：塞巴斯蒂安、诺亚、本杰明、亨利和艾娃。塞巴斯蒂安说，如果且仅如果艾娃是骑士，那么艾娃就是无赖。诺亚评论道：“艾娃是无赖。”本杰明被听到说：“艾娃是无赖或者诺亚是骑士。”亨利提到：“艾娃是无赖。”艾娃声称：“塞巴斯蒂安不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）塞巴斯蒂安是无赖  \n（2）诺亚是骑士  \n（3）本杰明是骑士  \n（4）亨利是骑士  \n（5）艾娃是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：梅森、利亚姆、欧文、伊莎贝拉和艾米莉。梅森说：“利亚姆是无赖，艾米莉是无赖。”利亚姆说：“艾米莉是无赖，或者梅森是骑士。”欧文说：“利亚姆不是骑士。”根据伊莎贝拉的说法，“如果欧文是骑士，那么利亚姆就是骑士。”艾米莉断言：“梅森是骑士，或者梅森是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是无赖  \n(2) 利亚姆是无赖  \n(3) 欧文是骑士  \n(4) 伊莎贝拉是无赖  \n(5) 艾米莉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了5位居民：莉莉、利亚姆、艾拉、艾登和塞缪尔。根据莉莉的说法，“利亚姆是骑士或者塞缪尔是无赖”。根据利亚姆的说法，“如果艾拉是无赖，那么莉莉就是无赖”。“利亚姆不是无赖，”艾拉声称。艾登指出，“莉莉不是无赖”。塞缪尔断言：“莉莉不是无赖”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是骑士  \n(2) 利亚姆是骑士  \n(3) 艾拉是骑士  \n(4) 艾登是骑士  \n(5) 塞缪尔是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：索菲娅、本杰明、奥利维亚、约瑟夫和伊莎贝拉。索菲娅提到：“索菲娅是骑士当且仅当本杰明是无赖。”本杰明宣称：“奥利维亚是无赖。”在奥利维亚的话中：“奥利维亚是骑士当且仅当伊莎贝拉是骑士。”约瑟夫提到：“如果奥利维亚是骑士，那么本杰明就是无赖。”伊莎贝拉提到：“索菲娅不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 本杰明是无赖  \n(3) 奥利维亚是骑士  \n(4) 约瑟夫是骑士  \n(5) 伊莎贝拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：迈克尔、威廉、索菲娅、塞缪尔和赖利。迈克尔声称：“塞缪尔是无赖，索菲娅是无赖。”威廉被听到说：“塞缪尔是骑士。”索菲娅评论道：“迈克尔是无赖。”塞缪尔断言：“迈克尔是无赖当且仅当索菲娅是骑士。”赖利表示迈克尔是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是无赖  \n(2) 威廉是骑士  \n(3) 索菲娅是骑士  \n(4) 塞缪尔是骑士  \n(5) 赖利是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：莉莉、卢克、斯嘉丽、詹姆斯和佩内洛普。莉莉告诉你，斯嘉丽不是骑士。卢克告诉你，斯嘉丽不是骑士。斯嘉丽提到：“詹姆斯是骑士当且仅当卢克是无赖。”詹姆斯表示莉莉是无赖，卢克是无赖。佩内洛普评论道：“卢克不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是无赖  \n(2) 卢克是无赖  \n(3) 斯嘉丽是骑士  \n(4) 詹姆斯是骑士  \n(5) 佩内洛普是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：格蕾丝、米娅、艾登、塞巴斯蒂安和伊丽莎白。格蕾丝被听到说：“如果米娅是无赖，那么艾登就是无赖。”米娅被听到说：“塞巴斯蒂安是骑士或者格蕾丝是无赖。”艾登告诉你，格蕾丝是无赖，塞巴斯蒂安是无赖。“米娅是骑士或者伊丽莎白是无赖，”塞巴斯蒂安声称。伊丽莎白指出：“塞巴斯蒂安不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）格蕾丝是一名骑士  \n（2）米娅是一名骑士  \n（3）艾登是一名无赖  \n（4）塞巴斯蒂安是一名骑士  \n（5）伊丽莎白是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：利亚姆、雅各布、艾米莉、伊丽莎白和梅森。利亚姆说：“如果艾米莉是骑士，那么利亚姆就是骑士。”雅各布宣称：“伊丽莎白是骑士。”艾米莉评论道：“伊丽莎白是骑士。”伊丽莎白声称：“利亚姆是无赖当且仅当雅各布是骑士。”梅森表示：“利亚姆是无赖或者雅各布是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是无赖  \n(2) 雅各布是骑士  \n(3) 艾米莉是骑士  \n(4) 伊丽莎白是骑士  \n(5) 梅森是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：洛根、杰克逊、克洛伊、利亚姆和伊莎贝拉。洛根被听到说：“杰克逊是骑士或者克洛伊是骑士。”杰克逊指出：“利亚姆是无赖或者克洛伊是骑士。”克洛伊表示伊莎贝拉是无赖。利亚姆评论道：“克洛伊是骑士或者伊莎贝拉是骑士。”伊莎贝拉说：“洛根是骑士而克洛伊是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是一名骑士  \n(2) 杰克逊是一名骑士  \n(3) 克洛伊是一名骑士  \n(4) 利亚姆是一名骑士  \n(5) 伊莎贝拉是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：卢卡斯、阿比盖尔、奥利维亚、夏洛特和马修。卢卡斯声称：“马修是骑士，夏洛特是骑士。”阿比盖尔则说道：“如果奥利维亚是骑士，那么马修就是骑士。”奥利维亚表示：“如果卢卡斯是骑士，那么卢卡斯就是无赖。”夏洛特断言：“当且仅当马修是无赖时，夏洛特才是骑士。”马修说：“阿比盖尔是骑士或者夏洛特是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是无赖  \n(2) 阿比盖尔是无赖  \n(3) 奥利维亚是骑士  \n(4) 夏洛特是无赖  \n(5) 马修是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：卢卡斯、格蕾丝、索菲娅、卢克和奥利弗。卢卡斯说：“卢克是骑士。”格蕾丝声明：“卢克不是无赖。”索菲娅宣称：“卢卡斯是无赖，格蕾丝是骑士。”卢克评论道：“卢卡斯是无赖，卢卡斯是骑士。”在奥利弗的话中：“索菲娅是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是无赖  \n(2) 格蕾丝是无赖  \n(3) 索菲娅是无赖  \n(4) 卢克是无赖  \n(5) 奥利弗是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：詹姆斯、索菲娅、艾拉、赖利和亨利。詹姆斯声称：“亨利是无赖，艾拉是无赖。”索菲娅的陈述是：“如果索菲娅是骑士，那么艾拉就是无赖。”在艾拉的话中：“亨利是骑士当且仅当艾拉是骑士。”赖利说：“如果詹姆斯是骑士，那么艾拉就是骑士。”亨利声称：“詹姆斯是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是无赖  \n(2) 索菲娅是骑士  \n(3) 艾拉是无赖  \n(4) 赖利是骑士  \n(5) 亨利是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：克洛伊、杰克、莉莉、亚历山大和威廉。克洛伊评论道：“威廉是个无赖。”杰克说：“亚历山大是个无赖。”莉莉的话是：“如果威廉是骑士，那么威廉就是无赖。”亚历山大说：“当且仅当杰克是无赖时，莉莉就是无赖。”威廉声称：“亚历山大是骑士或者莉莉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 克洛伊是无赖  \n(2) 杰克是无赖  \n(3) 莉莉是无赖  \n(4) 亚历山大是骑士  \n(5) 威廉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：索菲娅、杰克逊、诺亚、伊丽莎白和奥萝拉。“奥萝拉不是无赖，”索菲娅说。有人听到杰克逊说：“诺亚是无赖，奥萝拉是无赖。”在诺亚的陈述中：“如果杰克逊是无赖，那么奥萝拉就是无赖。”伊丽莎白宣称：“诺亚是骑士，诺亚是无赖。”奥萝拉说，如果且仅如果杰克逊是骑士，那么伊丽莎白就是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 杰克逊是一个无赖  \n(3) 诺亚是一个无赖  \n(4) 伊丽莎白是一个无赖  \n(5) 奥萝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：卢克、詹姆斯、莉莉、塞缪尔和亨利。卢克告诉你，如果卢克是骑士，那么亨利就是无赖。詹姆斯说：“亨利不是无赖。”莉莉声明：“卢克是骑士，卢克是无赖。”根据塞缪尔的说法，“当且仅当詹姆斯是无赖时，塞缪尔才是骑士。”亨利说：“当且仅当亨利是骑士时，塞缪尔才是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 詹姆斯是一个无赖  \n(3) 莉莉是一个无赖  \n(4) 塞缪尔是一个无赖  \n(5) 亨利是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：索菲娅、梅森、欧文、艾米莉和塞巴斯蒂安。索菲娅被听到说：“梅森是骑士或者塞巴斯蒂安是骑士。”梅森说：“塞巴斯蒂安是无赖，艾米莉是无赖。”在欧文的话中：“如果艾米莉是无赖，那么索菲娅就是无赖。”在艾米莉的话中：“塞巴斯蒂安是无赖或者索菲娅是骑士。”根据塞巴斯蒂安的说法：“索菲娅是无赖或者塞巴斯蒂安是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 梅森是一个无赖  \n(3) 欧文是一名骑士  \n(4) 艾米莉是一名骑士  \n(5) 塞巴斯蒂安是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：阿梅莉亚、斯嘉丽、维多利亚、卢卡斯和亨利。正如阿梅莉亚所说：“斯嘉丽是骑士当且仅当斯嘉丽是无赖。”根据斯嘉丽的说法：“阿梅莉亚不是无赖。”维多利亚的陈述是：“斯嘉丽是无赖或者维多利亚是骑士。”卢卡斯表示，如果亨利是骑士，那么亨利就是无赖。“斯嘉丽是骑士，阿梅莉亚是骑士，”亨利提到。那谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是无赖  \n(2) 斯嘉丽是无赖  \n(3) 维多利亚是骑士  \n(4) 卢卡斯是骑士  \n(5) 亨利是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：伊芙琳、克洛伊、索菲娅、阿比盖尔和艾米莉。伊芙琳说：“克洛伊是骑士，索菲娅也是骑士。”克洛伊则说：“如果且仅如果索菲娅是无赖，艾米莉就是骑士。”索菲娅评论道：“阿比盖尔是骑士或者索菲娅是骑士。”阿比盖尔说：“如果伊芙琳是无赖，那么艾米莉就是骑士。”艾米莉则表示：“克洛伊是无赖，阿比盖尔也是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是一名骑士  \n(2) 克洛伊是一名骑士  \n(3) 索菲娅是一名骑士  \n(4) 阿比盖尔是一名骑士  \n(5) 艾米莉是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：本杰明、亚历山大、丹尼尔、奥萝拉和约瑟夫。本杰明说：“奥萝拉是骑士。”亚历山大告诉你，如果约瑟夫是无赖，那么约瑟夫就是骑士。丹尼尔的陈述是：“本杰明是无赖或者丹尼尔是骑士。”奥萝拉被听到说：“约瑟夫是骑士当且仅当本杰明是骑士。”约瑟夫说：“丹尼尔是无赖当且仅当奥萝拉是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是一名骑士  \n(2) 亚历山大是一名骑士  \n(3) 丹尼尔是一名骑士  \n(4) 奥萝拉是一名骑士  \n(5) 约瑟夫是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了五位居民：索菲娅、艾拉、欧文、夏洛特和克洛伊。索菲娅说：“夏洛特是骑士或者欧文是骑士。”艾拉被听到说：“夏洛特是无赖而索菲娅是无赖。”欧文评论道：“夏洛特是无赖当且仅当克洛伊是骑士。”夏洛特被听到说：“如果艾拉是骑士，那么夏洛特就是骑士。”克洛伊评论道：“克洛伊是骑士当且仅当艾拉是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 艾拉是骑士  \n(3) 欧文是无赖  \n(4) 夏洛特是无赖  \n(5) 克洛伊是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了五位居民：大卫、威廉、奥萝拉、利亚姆和洛根。大卫告诉你，威廉是无赖或者奥萝拉是无赖。威廉告诉你，如果大卫是无赖，那么利亚姆就是骑士。奥萝拉声称：“大卫是骑士当且仅当奥萝拉是骑士。”利亚姆告诉你，洛根是无赖。洛根则说道：“威廉是骑士当且仅当威廉是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 大卫是一名骑士  \n(2) 威廉是一名骑士  \n(3) 奥萝拉是一名无赖  \n(4) 利亚姆是一名骑士  \n(5) 洛根是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了5位居民：夏洛特、阿比盖尔、格蕾丝、米娅和斯嘉丽。夏洛特说：“如果格蕾丝是无赖，那么米娅就是骑士。”阿比盖尔说：“斯嘉丽是无赖当且仅当米娅是骑士。”格蕾丝的陈述是：“斯嘉丽是无赖。”米娅提到：“格蕾丝是骑士当且仅当斯嘉丽是骑士。”斯嘉丽指出：“米娅不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是无赖  \n(2) 阿比盖尔是骑士  \n(3) 格蕾丝是无赖  \n(4) 米娅是无赖  \n(5) 斯嘉丽是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：约瑟夫、莉莉、本杰明、克洛伊和哈珀。约瑟夫宣称：“约瑟夫是骑士，克洛伊是无赖。”莉莉声称：“如果莉莉是骑士，那么约瑟夫就是无赖。”本杰明评论道：“约瑟夫是无赖当且仅当克洛伊是骑士。”克洛伊表示：“如果哈珀是无赖，那么本杰明就是骑士。”哈珀指出：“本杰明不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是无赖  \n(2) 莉莉是骑士  \n(3) 本杰明是骑士  \n(4) 克洛伊是骑士  \n(5) 哈珀是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了5位居民：塞巴斯蒂安、奥萝拉、亨利、艾娃和艾米莉。塞巴斯蒂安提到：“亨利是无赖，而塞巴斯蒂安是骑士。”奥萝拉评论道：“如果亨利是骑士，那么艾娃就是无赖。”亨利说：“艾米莉不是骑士。”艾娃声明：“亨利是骑士当且仅当奥萝拉是无赖。”艾米莉断言：“亨利是骑士当且仅当奥萝拉是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞巴斯蒂安是无赖  \n(2) 奥萝拉是无赖  \n(3) 亨利是骑士  \n(4) 艾娃是骑士  \n(5) 艾米莉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：艾拉、佐伊、洛根、艾米莉和迈克尔。艾拉说：“佐伊是无赖，而佐伊是骑士。”佐伊表示艾拉是骑士，佐伊是骑士。洛根指出：“如果艾拉是无赖，那么佐伊就是无赖。”艾米莉表示艾拉是无赖，迈克尔是骑士。“如果艾米莉是无赖，那么佐伊就是无赖，”迈克尔声称。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是无赖  \n(2) 佐伊是无赖  \n(3) 洛根是骑士  \n(4) 艾米莉是骑士  \n(5) 迈克尔是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：马修、艾玛、杰克逊、威廉和杰克。马修提到：“杰克逊是骑士当且仅当威廉是无赖。”艾玛被听到说：“马修是骑士。”杰克逊评论道：“艾玛是骑士，艾玛是无赖。”威廉说：“如果杰克是无赖，那么艾玛就是无赖。”杰克说：“杰克是骑士，威廉是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是一名骑士  \n(2) 艾玛是一名骑士  \n(3) 杰克逊是一名无赖  \n(4) 威廉是一名骑士  \n(5) 杰克是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：诺亚、阿丽亚、杰克逊、阿比盖尔和佐伊。诺亚被听到说：“佐伊是骑士，而诺亚是骑士。”阿丽亚告诉你，如果诺亚是骑士，那么杰克逊就是骑士。杰克逊评论道：“诺亚是无赖，阿丽亚是无赖。”阿比盖尔指出：“诺亚是骑士或者阿丽亚是骑士。”佐伊宣称：“阿丽亚是骑士，而诺亚是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是无赖  \n(2) 阿丽亚是骑士  \n(3) 杰克逊是无赖  \n(4) 阿比盖尔是骑士  \n(5) 佐伊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：杰克、米娅、奥萝拉、马修和诺亚。杰克声称：“如果马修是无赖，那么诺亚就是无赖。”米娅说：“米娅是骑士，奥萝拉是骑士。”奥萝拉说：“米娅是骑士。”马修说：“如果马修是骑士，那么米娅就是骑士。”诺亚说：“如果杰克是无赖，那么马修就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）杰克是骑士  \n（2）米娅是骑士  \n（3）奥萝拉是骑士  \n（4）马修是骑士  \n（5）诺亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了5位居民：维多利亚、奥利弗、亨利、佐伊和欧文。维多利亚评论道：“亨利是个无赖。”奥利弗表示，佐伊是个无赖或者欧文是个无赖。亨利指出：“如果欧文是骑士，那么佐伊就是无赖。”佐伊说奥利弗是个无赖，而维多利亚是骑士。欧文则评论道：“如果奥利弗是个无赖，那么奥利弗就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 维多利亚是无赖  \n(2) 奥利弗是骑士  \n(3) 亨利是骑士  \n(4) 佐伊是无赖  \n(5) 欧文是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：梅森、维多利亚、大卫、洛根和亚历山大。梅森的陈述是：“亚历山大是骑士，维多利亚是骑士。”维多利亚则说：“维多利亚是骑士，亚历山大是无赖。”大卫声称：“维多利亚是骑士，或者洛根是无赖。”洛根声称：“如果维多利亚是无赖，那么维多利亚就是骑士。”亚历山大告诉你梅森不是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是无赖  \n(2) 维多利亚是无赖  \n(3) 大卫是骑士  \n(4) 洛根是无赖  \n(5) 亚历山大是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：伊森、索菲娅、大卫、伊芙琳和迈克尔。伊森说索菲娅不是无赖。索菲娅评论道：“伊芙琳不是骑士。”大卫说：“伊森是骑士，迈克尔是无赖。”在伊芙琳的陈述中：“如果大卫是骑士，那么伊森就是无赖。”迈克尔被听到说：“伊森不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是一名骑士  \n(2) 索菲娅是一名骑士  \n(3) 大卫是一名骑士  \n(4) 伊芙琳是一名无赖  \n(5) 迈克尔是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：赖利、阿比盖尔、詹姆斯、欧文和诺亚。赖利告诉你，詹姆斯是骑士或者阿比盖尔是骑士。阿比盖尔说：“赖利是骑士或者赖利是无赖。”詹姆斯评论道：“诺亚不是无赖。”欧文宣称：“阿比盖尔是骑士。”诺亚说：“阿比盖尔是骑士并且赖利是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是一名骑士  \n(2) 阿比盖尔是一名骑士  \n(3) 詹姆斯是一名骑士  \n(4) 欧文是一名骑士  \n(5) 诺亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：奥利维亚、洛根、诺亚、莉莉和米娅。奥利维亚被听到说：“米娅是无赖当且仅当莉莉是骑士。”洛根声明：“米娅是骑士或者莉莉是无赖。”诺亚评论道：“奥利维亚是骑士或者米娅是骑士。”根据莉莉的说法，“如果奥利维亚是无赖，那么诺亚就是骑士。”米娅表示莉莉是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是骑士  \n(2) 洛根是无赖  \n(3) 诺亚是骑士  \n(4) 莉莉是骑士  \n(5) 米娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：杰克、艾娃、索菲娅、佐伊和大卫。“大卫是无赖当且仅当索菲娅是骑士”——杰克说。正如艾娃所说，“大卫是无赖或者索菲娅是骑士”。“如果杰克是无赖，那么艾娃就是骑士，”索菲娅提到。佐伊表示，如果大卫是无赖，那么大卫就是骑士。大卫被听到说：“艾娃不是无赖”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克是无赖  \n(2) 艾娃是骑士  \n(3) 索菲娅是骑士  \n(4) 佐伊是骑士  \n(5) 大卫是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：伊芙琳、卢克、克洛伊、莉莉和艾玛。伊芙琳告诉你，卢克是无赖当且仅当卢克是骑士。卢克说，伊芙琳是无赖当且仅当艾玛是无赖。克洛伊声明：“莉莉是无赖。”莉莉则表示：“艾玛是无赖或者克洛伊是无赖。”艾玛则表示克洛伊是无赖而莉莉是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是无赖  \n(2) 卢克是无赖  \n(3) 克洛伊是无赖  \n(4) 莉莉是骑士  \n(5) 艾玛是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五个居民：杰克逊、艾弗里、奥利弗、赖利和伊丽莎白。根据杰克逊的说法，“伊丽莎白是无赖当且仅当伊丽莎白是骑士”。艾弗里表示，奥利弗是骑士当且仅当杰克逊是骑士。奥利弗说：“赖利是无赖，伊丽莎白是骑士。”赖利被听到说：“伊丽莎白是骑士或者艾弗里是骑士。”伊丽莎白说：“杰克逊是无赖，奥利弗是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是无赖  \n(2) 艾弗里是骑士  \n(3) 奥利弗是无赖  \n(4) 赖利是骑士  \n(5) 伊丽莎白是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：艾米莉、诺亚、艾娃、亨利和詹姆斯。艾米莉说：“诺亚是骑士，詹姆斯是无赖。”诺亚声称：“亨利是无赖。”艾娃声称：“艾娃是骑士或者艾米莉是无赖。”亨利的话是：“亨利是骑士或者诺亚是骑士。”根据詹姆斯的说法：“艾米莉不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是无赖  \n(2) 诺亚是无赖  \n(3) 艾娃是骑士  \n(4) 亨利是骑士  \n(5) 詹姆斯是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：艾玛、奥利维亚、塞缪尔、格蕾丝和索菲娅。艾玛声称：“格蕾丝是无赖或者格蕾丝是骑士”。奥利维亚说索菲娅不是骑士。塞缪尔指出：“格蕾丝是骑士而塞缪尔是骑士”。格蕾丝声明：“索菲娅是骑士”。在索菲娅的陈述中：“塞缪尔不是骑士”。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是骑士  \n(2) 奥利维亚是无赖  \n(3) 塞缪尔是无赖  \n(4) 格蕾丝是骑士  \n(5) 索菲娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：伊森、亨利、威廉、奥利弗和艾娃。伊森说：“艾娃是骑士或者奥利弗是骑士。”亨利说：“奥利弗不是无赖。”威廉断言：“伊森是骑士当且仅当艾娃是骑士。”奥利弗说：“艾娃是骑士或者亨利是无赖。”根据艾娃的说法：“亨利不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是一名骑士  \n(2) 亨利是一名骑士  \n(3) 威廉是一名骑士  \n(4) 奥利弗是一名骑士  \n(5) 艾娃是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：塞缪尔、哈珀、卢卡斯、欧文和克洛伊。“哈珀是骑士，”塞缪尔说。哈珀评论道：“塞缪尔是无赖或者卢卡斯是无赖。”卢卡斯宣称：“塞缪尔是无赖而且克洛伊是骑士。”欧文宣称：“当且仅当哈珀是无赖时，塞缪尔才是无赖。”克洛伊说：“卢卡斯是无赖或者欧文是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是一名骑士  \n(2) 哈珀是一名骑士  \n(3) 卢卡斯是一名无赖  \n(4) 欧文是一名骑士  \n(5) 克洛伊是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：洛根、米娅、伊莎贝拉、迈克尔和奥利弗。洛根说：“伊莎贝拉是无赖，迈克尔是骑士。”米娅提到：“奥利弗不是骑士。”伊莎贝拉指出：“如果且仅如果奥利弗是骑士，奥利弗就是无赖。”迈克尔告诉你，米娅是骑士，伊莎贝拉是无赖。在奥利弗的陈述中：“如果且仅如果米娅是无赖，洛根就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是无赖  \n(2) 米娅是无赖  \n(3) 伊莎贝拉是无赖  \n(4) 迈克尔是无赖  \n(5) 奥利弗是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：阿丽亚、雅各布、梅森、伊莎贝拉和伊芙琳。阿丽亚说：“雅各布是骑士，伊芙琳是无赖。”雅各布评论道：“梅森是无赖，伊芙琳是骑士。”梅森断言：“如果伊莎贝拉是骑士，那么伊芙琳就是无赖。”伊莎贝拉提到：“伊芙琳是骑士或者伊莎贝拉是骑士。”伊芙琳声明：“梅森是骑士当且仅当雅各布是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿丽亚是无赖  \n(2) 雅各布是骑士  \n(3) 梅森是无赖  \n(4) 伊莎贝拉是骑士  \n(5) 伊芙琳是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了五位居民：索菲娅、威廉、佩内洛普、米娅和欧文。索菲娅说：“欧文是骑士当且仅当佩内洛普是骑士。”根据威廉的说法，“如果索菲娅是无赖，那么佩内洛普就是无赖。”佩内洛普表示威廉不是无赖。米娅断言：“索菲娅是无赖或者威廉是骑士。”欧文评论道：“威廉不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 威廉是一名骑士  \n(3) 佩内洛普是一名骑士  \n(4) 米娅是一名骑士  \n(5) 欧文是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：哈珀、索菲娅、夏洛特、利亚姆和梅森。哈珀提到：“梅森是骑士当且仅当利亚姆是骑士。”索菲娅的陈述是：“哈珀是骑士当且仅当梅森是无赖。”夏洛特评论道：“哈珀是无赖或者梅森是骑士。”利亚姆说：“梅森是无赖而哈珀是无赖。”梅森告诉你哈珀是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是无赖  \n(2) 索菲娅是无赖  \n(3) 夏洛特是骑士  \n(4) 利亚姆是骑士  \n(5) 梅森是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了5位居民：马修、艾拉、赖利、艾娃和奥利维亚。马修的陈述是：“艾拉是无赖当且仅当艾娃是无赖。”艾拉则说道：“赖利不是无赖。”在赖利的话中：“奥利维亚是骑士。”根据艾娃的说法，“艾娃是骑士当且仅当马修是骑士。”根据奥利维亚的说法，“艾拉是无赖或者艾拉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是一名骑士  \n(2) 艾拉是一名骑士  \n(3) 赖利是一名骑士  \n(4) 艾娃是一名骑士  \n(5) 奥利维亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：大卫、塞巴斯蒂安、洛根、佐伊和艾娃。大卫评论道：“佐伊是骑士，洛根是骑士。”塞巴斯蒂安评论道：“佐伊是骑士当且仅当洛根是骑士。”洛根告诉你艾娃是骑士，塞巴斯蒂安是骑士。“如果佐伊是骑士，那么塞巴斯蒂安就是骑士，”佐伊提到。艾娃表示佐伊是骑士当且仅当艾娃是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 大卫是一名骑士  \n(2) 塞巴斯蒂安是一名骑士  \n(3) 洛根是一名骑士  \n(4) 佐伊是一名骑士  \n(5) 艾娃是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：约瑟夫、本杰明、艾娃、斯嘉丽和亨利。约瑟夫告诉你艾娃是无赖，而艾娃是骑士。本杰明声称：“如果亨利是骑士，那么艾娃就是无赖。”艾娃说：“亨利是骑士或者斯嘉丽是无赖。”斯嘉丽告诉你约瑟夫不是无赖。“本杰明是无赖当且仅当亨利是骑士，”亨利宣称。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是无赖  \n(2) 本杰明是无赖  \n(3) 艾娃是骑士  \n(4) 斯嘉丽是无赖  \n(5) 亨利是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：哈珀、赖利、洛根、本杰明和约瑟夫。哈珀声称：“本杰明是无赖或者约瑟夫是无赖。”赖利说：“如果洛根是无赖，那么本杰明就是骑士。”洛根指出：“本杰明是无赖，而洛根是骑士。”本杰明表示：“哈珀是骑士。”根据约瑟夫的说法：“洛根是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是一名骑士  \n(2) 赖利是一名骑士  \n(3) 洛根是一名无赖  \n(4) 本杰明是一名骑士  \n(5) 约瑟夫是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：卢卡斯、威廉、梅森、亨利和约瑟夫。卢卡斯被听到说：“约瑟夫是无赖或者梅森是无赖。”威廉指出：“约瑟夫是无赖或者梅森是骑士。”梅森说：“亨利不是骑士。”亨利说约瑟夫是骑士。约瑟夫表示，如果亨利是骑士，那么梅森就是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是一名骑士  \n(2) 威廉是一个无赖  \n(3) 梅森是一个无赖  \n(4) 亨利是一名骑士  \n(5) 约瑟夫是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了五位居民：克洛伊、迈克尔、艾玛、艾拉和亚历山大。克洛伊表示艾拉是骑士或者克洛伊是骑士。“如果亚历山大是无赖，那么克洛伊就是无赖。”——迈克尔。艾玛的陈述是：“亚历山大是骑士或者亚历山大是无赖。”艾拉指出：“如果迈克尔是骑士，那么亚历山大就是骑士。”亚历山大告诉你艾玛是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 克洛伊是一名骑士  \n(2) 迈克尔是一名骑士  \n(3) 艾玛是一名骑士  \n(4) 艾拉是一名骑士  \n(5) 亚历山大是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：佐伊、夏洛特、米娅、雅各布和欧文。佐伊声称：“如果米娅是无赖，那么夏洛特就是骑士。”根据夏洛特的说法，“雅各布是骑士当且仅当米娅是无赖。”米娅说：“欧文是骑士。”雅各布说雅各布是骑士，佐伊是骑士。欧文说：“佐伊是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佐伊是一名骑士  \n(2) 夏洛特是一名骑士  \n(3) 米娅是一名无赖  \n(4) 雅各布是一名骑士  \n(5) 欧文是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：卢卡斯、伊丽莎白、奥萝拉、艾登和塞缪尔。“伊丽莎白不是骑士，”卢卡斯提到。伊丽莎白说：“奥萝拉不是骑士。”根据奥萝拉的话，“如果奥萝拉是骑士，那么伊丽莎白就是无赖。”艾登断言：“卢卡斯是无赖或者伊丽莎白是骑士。”塞缪尔被听到说：“伊丽莎白不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是一名骑士  \n(2) 伊丽莎白是一个无赖  \n(3) 奥萝拉是一名骑士  \n(4) 艾登是一个无赖  \n(5) 塞缪尔是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：丹尼尔、维多利亚、本杰明、米娅和威廉。丹尼尔声称：“米娅是骑士，本杰明是骑士。”维多利亚声称：“如果本杰明是骑士，那么本杰明就是无赖。”本杰明说：“丹尼尔不是无赖。”米娅评论道：“维多利亚是骑士当且仅当丹尼尔是骑士。”威廉声称：“如果维多利亚是无赖，那么米娅就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是无赖  \n(2) 维多利亚是骑士  \n(3) 本杰明是无赖  \n(4) 米娅是无赖  \n(5) 威廉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：本杰明、艾米莉、詹姆斯、伊芙琳和卢卡斯。“艾米莉是无赖或者伊芙琳是骑士”——本杰明说。艾米莉的陈述是：“伊芙琳是无赖或者艾米莉是骑士”。根据詹姆斯的说法，“艾米莉是无赖或者卢卡斯是骑士”。伊芙琳断言：“如果艾米莉是无赖，那么艾米莉就是骑士”。在卢卡斯的话中：“艾米莉是无赖”。那么，谁是骑士，谁是无赖？",
        "solution_text_format": "(1) 本杰明是一名骑士  \n(2) 艾米莉是一名骑士  \n(3) 詹姆斯是一名无赖  \n(4) 伊芙琳是一名骑士  \n(5) 卢卡斯是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：莉莉、洛根、阿梅莉亚、利亚姆和艾娃。莉莉声称：“如果艾娃是骑士，那么阿梅莉亚就是骑士。”洛根提到：“阿梅莉亚是骑士当且仅当艾娃是无赖。”在阿梅莉亚的话中：“洛根是骑士当且仅当利亚姆是无赖。”利亚姆表示莉莉是骑士，艾娃是骑士。艾娃表示：“如果洛根是骑士，那么莉莉就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是骑士  \n(2) 洛根是无赖  \n(3) 阿梅莉亚是骑士  \n(4) 利亚姆是骑士  \n(5) 艾娃是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：米娅、佩内洛普、哈珀、迈克尔和索菲娅。米娅说：“米娅是骑士或者索菲娅是骑士。”佩内洛普宣称：“如果米娅是骑士，那么哈珀就是骑士。”哈珀说：“如果迈克尔是骑士，那么米娅就是骑士。”迈克尔表示：“如果哈珀是无赖，那么佩内洛普就是骑士。”索菲娅断言：“迈克尔不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是一名骑士  \n(2) 佩内洛普是一名骑士  \n(3) 哈珀是一名骑士  \n(4) 迈克尔是一名骑士  \n(5) 索菲娅是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：艾弗里、克洛伊、丹尼尔、阿比盖尔和伊丽莎白。艾弗里宣称：“如果克洛伊是无赖，那么丹尼尔就是骑士。”克洛伊声称：“艾弗里是无赖，丹尼尔是骑士。”丹尼尔声称：“如果伊丽莎白是无赖，那么克洛伊就是骑士。”阿比盖尔评论道：“丹尼尔是无赖当且仅当艾弗里是无赖。”伊丽莎白说：“艾弗里是无赖当且仅当伊丽莎白是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是无赖  \n(2) 克洛伊是无赖  \n(3) 丹尼尔是无赖  \n(4) 阿比盖尔是骑士  \n(5) 伊丽莎白是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：塞巴斯蒂安、佐伊、亚历山大、赖利和诺亚。塞巴斯蒂安说：“如果亚历山大是无赖，那么佐伊就是无赖。”佐伊声称：“诺亚是骑士或者塞巴斯蒂安是骑士。”亚历山大指出：“如果塞巴斯蒂安是无赖，那么塞巴斯蒂安就是骑士。”赖利评论道：“塞巴斯蒂安是骑士。”诺亚声明：“佐伊是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞巴斯蒂安是一名骑士  \n(2) 佐伊是一名骑士  \n(3) 亚历山大是一名骑士  \n(4) 赖利是一名骑士  \n(5) 诺亚是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：艾娃、奥利弗、维多利亚、阿梅莉亚和卢卡斯。艾娃说：“奥利弗是骑士，维多利亚是无赖。”奥利弗说：“卢卡斯是骑士当且仅当维多利亚是骑士。”维多利亚评论道：“阿梅莉亚不是骑士。”阿梅莉亚告诉你，艾娃是骑士，维多利亚是无赖。卢卡斯说：“如果卢卡斯是骑士，那么维多利亚是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是无赖  \n(2) 奥利弗是骑士  \n(3) 维多利亚是骑士  \n(4) 阿梅莉亚是无赖  \n(5) 卢卡斯是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了五位居民：维多利亚、梅森、阿比盖尔、塞缪尔和奥萝拉。维多利亚声称：“维多利亚是骑士当且仅当阿比盖尔是骑士。”梅森说：“塞缪尔是无赖当且仅当维多利亚是无赖。”阿比盖尔的陈述是：“塞缪尔是骑士。”塞缪尔声称：“维多利亚是骑士，阿比盖尔是骑士。”奥萝拉表示塞缪尔是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 维多利亚是一名骑士  \n(2) 梅森是一名骑士  \n(3) 阿比盖尔是一名骑士  \n(4) 塞缪尔是一名骑士  \n(5) 奥萝拉是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：索菲娅、本杰明、约瑟夫、维多利亚和亚历山大。索菲娅声称：“约瑟夫不是骑士。”本杰明说：“约瑟夫是无赖。”约瑟夫告诉你，如果亚历山大是无赖，那么索菲娅就是无赖。维多利亚的话是：“约瑟夫是无赖，且本杰明是无赖。”亚历山大指出：“维多利亚不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 本杰明是无赖  \n(3) 约瑟夫是骑士  \n(4) 维多利亚是无赖  \n(5) 亚历山大是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了5位居民：阿比盖尔、伊丽莎白、约瑟夫、本杰明和索菲娅。阿比盖尔说：“阿比盖尔是骑士，索菲娅是骑士。”伊丽莎白说：“阿比盖尔是骑士当且仅当阿比盖尔是无赖。”约瑟夫说：“本杰明是无赖或者阿比盖尔是骑士。”本杰明宣称：“索菲娅是无赖并且索菲娅是骑士。”索菲娅说：“约瑟夫是无赖当且仅当阿比盖尔是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是无赖  \n(2) 伊丽莎白是无赖  \n(3) 约瑟夫是骑士  \n(4) 本杰明是无赖  \n(5) 索菲娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了五位居民：伊莎贝拉、艾米莉、艾拉、塞缪尔和阿梅莉亚。伊莎贝拉说：“塞缪尔是骑士或者塞缪尔是无赖。”艾米莉宣称：“阿梅莉亚是无赖或者艾拉是骑士。”艾拉说：“艾米莉不是无赖。”塞缪尔被听到说：“艾拉不是无赖。”阿梅莉亚宣称：“塞缪尔是无赖而艾拉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是一名骑士  \n(2) 艾米莉是一名骑士  \n(3) 艾拉是一名骑士  \n(4) 塞缪尔是一名骑士  \n(5) 阿梅莉亚是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：威廉、梅森、约瑟夫、卢卡斯和维多利亚。威廉说：“卢卡斯是无赖或者梅森是骑士。”梅森声称：“维多利亚是骑士。”约瑟夫声称：“如果梅森是无赖，那么梅森就是骑士。”卢卡斯宣称：“维多利亚是骑士，威廉是骑士。”维多利亚评论道：“如果卢卡斯是骑士，那么威廉就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 梅森是一名骑士  \n(3) 约瑟夫是一名骑士  \n(4) 卢卡斯是一名骑士  \n(5) 维多利亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：斯嘉丽、迈克尔、伊森、格蕾丝和约瑟夫。斯嘉丽说：“约瑟夫是骑士当且仅当伊森是骑士。” 迈克尔说：“伊森是骑士或者约瑟夫是无赖。” 伊森声称：“斯嘉丽不是骑士。” 格蕾丝评论道：“迈克尔不是骑士。” 约瑟夫说：“如果斯嘉丽是骑士，那么迈克尔就是无赖。” 那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 斯嘉丽是一名骑士  \n(2) 迈克尔是一名骑士  \n(3) 伊森是一个无赖  \n(4) 格蕾丝是一个无赖  \n(5) 约瑟夫是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：亚历山大、詹姆斯、索菲娅、克洛伊和米娅。亚历山大说：“米娅是骑士。”詹姆斯评论道：“克洛伊是无赖或者亚历山大是无赖。”索菲娅宣称：“克洛伊是无赖。”克洛伊指出：“詹姆斯是骑士，亚历山大是骑士。”米娅说，如果且仅如果索菲娅是骑士，那么克洛伊就是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）亚历山大是无赖  \n（2）詹姆斯是骑士  \n（3）索菲娅是骑士  \n（4）克洛伊是无赖  \n（5）米娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：佐伊、索菲娅、迈克尔、马修和洛根。佐伊说：“洛根是骑士。”索菲娅说：“洛根是骑士或者洛根是无赖。”迈克尔声称：“马修是骑士。”马修提到：“如果佐伊是骑士，那么索菲娅就是骑士。”洛根说马修是无赖或者迈克尔是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佐伊是无赖  \n(2) 索菲娅是骑士  \n(3) 迈克尔是骑士  \n(4) 马修是骑士  \n(5) 洛根是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五个居民：詹姆斯、索菲娅、利亚姆、艾登和艾拉。詹姆斯说：“索菲娅是骑士当且仅当索菲娅是无赖。”索菲娅声称：“艾拉不是骑士。”利亚姆宣称：“艾登是骑士。”艾登说索菲娅是骑士或者艾拉是无赖。艾拉评论道：“利亚姆是无赖，索菲娅是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是无赖  \n(2) 索菲娅是骑士  \n(3) 利亚姆是骑士  \n(4) 艾登是骑士  \n(5) 艾拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：哈珀、伊莎贝拉、米娅、艾玛和詹姆斯。哈珀说：“伊莎贝拉是无赖或者伊莎贝拉是骑士。”伊莎贝拉声明：“哈珀是骑士或者詹姆斯是骑士。”米娅提到：“艾玛不是无赖。”艾玛声称：“如果米娅是无赖，那么哈珀就是骑士。”詹姆斯断言：“如果伊莎贝拉是骑士，那么米娅就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是一名骑士  \n(2) 伊莎贝拉是一名骑士  \n(3) 米娅是一名骑士  \n(4) 艾玛是一名骑士  \n(5) 詹姆斯是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：欧文、维多利亚、诺亚、赖利和莉莉。欧文提到：“欧文是骑士当且仅当维多利亚是骑士。”维多利亚说：“如果诺亚是骑士，那么诺亚就是无赖。”根据诺亚的说法：“欧文是无赖当且仅当赖利是无赖。”赖利说：“赖利是骑士，诺亚是骑士。”莉莉说：“如果诺亚是骑士，那么欧文是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是一名骑士  \n(2) 维多利亚是一名骑士  \n(3) 诺亚是一个无赖  \n(4) 赖利是一个无赖  \n(5) 莉莉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：艾玛、利亚姆、莉莉、克洛伊和佐伊。艾玛说：“利亚姆是无赖，克洛伊是无赖。”利亚姆说佐伊是骑士。莉莉评论道：“佐伊不是无赖。”根据克洛伊的说法，“利亚姆不是无赖。”佐伊声称：“如果佐伊是骑士，那么利亚姆就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是无赖  \n(2) 利亚姆是骑士  \n(3) 莉莉是骑士  \n(4) 克洛伊是骑士  \n(5) 佐伊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：艾米莉、奥萝拉、佐伊、奥利维亚和诺亚。艾米莉被听到说：“如果奥萝拉是无赖，那么奥利维亚就是骑士。”奥萝拉说奥利维亚不是骑士。在佐伊的陈述中：“奥萝拉是无赖当且仅当奥利维亚是骑士。”奥利维亚说：“艾米莉是骑士当且仅当诺亚是无赖。”诺亚声明：“奥萝拉是骑士或者佐伊是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是一名骑士  \n(2) 奥萝拉是一名骑士  \n(3) 佐伊是一名骑士  \n(4) 奥利维亚是一名无赖  \n(5) 诺亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：艾米莉、奥利弗、伊莎贝拉、奥利维亚和塞巴斯蒂安。艾米莉的陈述是：“奥利维亚是无赖。”奥利弗说：“伊莎贝拉是无赖。”伊莎贝拉表示，只有当奥利弗是无赖时，艾米莉才是骑士。奥利维亚指出：“奥利弗是骑士。”塞巴斯蒂安提到：“如果塞巴斯蒂安是骑士，那么奥利弗就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是骑士  \n(2) 奥利弗是无赖  \n(3) 伊莎贝拉是骑士  \n(4) 奥利维亚是无赖  \n(5) 塞巴斯蒂安是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：索菲娅、艾米莉、艾娃、大卫和杰克逊。索菲娅声称：“艾娃是骑士，而索菲娅是骑士。”艾米莉指出：“索菲娅是无赖当且仅当艾娃是无赖。”根据艾娃的说法，“艾米莉是骑士或者索菲娅是骑士。”大卫表示索菲娅是无赖，而杰克逊是骑士。杰克逊被听到说：“艾米莉是骑士当且仅当索菲娅是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 艾米莉是一名骑士  \n(3) 艾娃是一名骑士  \n(4) 大卫是一名无赖  \n(5) 杰克逊是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：洛根、阿比盖尔、利亚姆、亨利和诺亚。洛根说：“诺亚不是无赖。”阿比盖尔评论道：“如果洛根是骑士，那么亨利就是骑士。”利亚姆表示：“如果亨利是骑士，那么阿比盖尔就是骑士。”亨利说：“利亚姆是骑士当且仅当阿比盖尔是无赖。”诺亚说：“如果利亚姆是骑士，那么诺亚就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是无赖  \n(2) 阿比盖尔是骑士  \n(3) 利亚姆是骑士  \n(4) 亨利是无赖  \n(5) 诺亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：艾娃、伊莎贝拉、佐伊、莉莉和艾玛。艾娃提到：“艾娃是骑士或者莉莉是骑士。”伊莎贝拉宣称：“莉莉是无赖。”佐伊告诉你：“如果且仅如果艾娃是无赖，伊莎贝拉就是骑士。”莉莉被听到说：“艾娃是骑士或者艾玛是骑士。”艾玛提到：“佐伊是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是一名骑士  \n(2) 伊莎贝拉是一个无赖  \n(3) 佐伊是一名骑士  \n(4) 莉莉是一名骑士  \n(5) 艾玛是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：威廉、艾娃、艾登、亚历山大和卢克。威廉表示，如果亚历山大是无赖，那么威廉就是骑士。艾娃表示，如果亚历山大是骑士，那么亚历山大就是无赖。艾登评论道：“艾娃是无赖或者威廉是骑士。”亚历山大说：“艾登是无赖。”卢克提到：“艾登是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 艾娃是一名骑士  \n(3) 艾登是一名骑士  \n(4) 亚历山大是一名无赖  \n(5) 卢克是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：杰克逊、卢克、艾米莉、雅各布和奥萝拉。杰克逊说：“艾米莉是骑士或者卢克是无赖。”卢克被听到说：“奥萝拉是骑士并且奥萝拉是无赖。”艾米莉的陈述是：“如果雅各布是骑士，那么卢克是无赖。”雅各布说：“如果艾米莉是骑士，那么杰克逊是骑士。”奥萝拉说：“杰克逊是骑士或者艾米莉是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是一名骑士  \n(2) 卢克是一个无赖  \n(3) 艾米莉是一名骑士  \n(4) 雅各布是一名骑士  \n(5) 奥萝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：卢卡斯、塞巴斯蒂安、塞缪尔、阿梅莉亚和伊森。卢卡斯被听到说：“伊森不是无赖。”塞巴斯蒂安告诉你，伊森是骑士，而塞巴斯蒂安也是骑士。塞缪尔声明：“如果塞缪尔是骑士，那么塞巴斯蒂安就是无赖。”在阿梅莉亚的话中：“伊森不是无赖。”伊森提到：“塞巴斯蒂安是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是一名骑士  \n(2) 塞巴斯蒂安是一个无赖  \n(3) 塞缪尔是一名骑士  \n(4) 阿梅莉亚是一名骑士  \n(5) 伊森是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了5位居民：阿梅莉亚、艾娃、夏洛特、艾拉和塞巴斯蒂安。阿梅莉亚被听到说：“如果且仅如果夏洛特是无赖，那么塞巴斯蒂安就是无赖。”艾娃指出：“艾娃是骑士或者夏洛特是无赖。”夏洛特声明：“塞巴斯蒂安不是骑士。”艾拉声称：“阿梅莉亚是无赖而艾娃是骑士。”塞巴斯蒂安说：“如果艾拉是骑士，那么艾娃就是骑士。”那么谁是骑士，谁是无赖？",
        "solution_text_format": "(1) 阿梅莉亚是无赖  \n(2) 艾娃是骑士  \n(3) 夏洛特是无赖  \n(4) 艾拉是骑士  \n(5) 塞巴斯蒂安是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：杰克逊、伊丽莎白、塞巴斯蒂安、威廉和卢卡斯。杰克逊表示威廉不是无赖。伊丽莎白指出：“威廉是骑士或者杰克逊是骑士。”塞巴斯蒂安表示：“杰克逊是骑士当且仅当伊丽莎白是无赖。”在威廉的话中：“卢卡斯是无赖而杰克逊是骑士。”在卢卡斯的话中：“威廉是骑士而伊丽莎白是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是无赖  \n(2) 伊丽莎白是无赖  \n(3) 塞巴斯蒂安是无赖  \n(4) 威廉是无赖  \n(5) 卢卡斯是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：艾米莉、伊莎贝拉、索菲娅、塞缪尔和阿梅莉亚。正如艾米莉所说：“塞缪尔是无赖或者伊莎贝拉是无赖。”伊莎贝拉提到：“塞缪尔不是无赖。”索菲娅说艾米莉是无赖，阿梅莉亚是无赖。在塞缪尔的陈述中：“如果塞缪尔是骑士，那么阿梅莉亚就是无赖。”根据阿梅莉亚的说法：“如果艾米莉是无赖，那么艾米莉就是骑士。”那么，谁是骑士，谁是无赖？",
        "solution_text_format": "(1) 艾米莉是无赖  \n(2) 伊莎贝拉是骑士  \n(3) 索菲娅是骑士  \n(4) 塞缪尔是骑士  \n(5) 阿梅莉亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：奥利维亚、伊莎贝拉、诺亚、克洛伊和艾弗里。奥利维亚说克洛伊是一个无赖。伊莎贝拉的陈述是：“诺亚是骑士当且仅当艾弗里是无赖。”诺亚说：“艾弗里不是无赖。”正如克洛伊所说：“伊莎贝拉是无赖，诺亚是无赖。”在艾弗里的话中：“奥利维亚是无赖或者克洛伊是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是骑士  \n(2) 伊莎贝拉是无赖  \n(3) 诺亚是骑士  \n(4) 克洛伊是无赖  \n(5) 艾弗里是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五个居民：奥利弗、梅森、亚历山大、伊莎贝拉和赖利。奥利弗说：“赖利是个无赖。”梅森提到：“亚历山大不是骑士。”亚历山大声称：“赖利是无赖当且仅当伊莎贝拉是无赖。”伊莎贝拉断言：“奥利弗是个无赖。”赖利的陈述是：“奥利弗是骑士，奥利弗是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利弗是一名骑士  \n(2) 梅森是一个无赖  \n(3) 亚历山大是一名骑士  \n(4) 伊莎贝拉是一个无赖  \n(5) 赖利是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：斯嘉丽、卢克、克洛伊、格蕾丝和杰克。斯嘉丽说，如果且仅如果克洛伊是骑士，那么克洛伊就是无赖。卢克说，如果卢克是骑士，那么格蕾丝就是骑士。克洛伊评论道：“卢克是骑士或者格蕾丝是骑士。”在格蕾丝的陈述中：“杰克是骑士或者格蕾丝是骑士。”杰克则说：“卢克是无赖，格蕾丝是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）斯嘉丽是无赖  \n（2）卢克是骑士  \n（3）克洛伊是骑士  \n（4）格蕾丝是骑士  \n（5）杰克是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：塞巴斯蒂安、马修、奥利维亚、梅森和本杰明。塞巴斯蒂安说：“如果马修是骑士，那么奥利维亚就是骑士。”马修声称：“梅森是无赖或者本杰明是无赖。”奥利维亚的陈述是：“塞巴斯蒂安是骑士或者本杰明是无赖。”梅森评论道：“塞巴斯蒂安是无赖。”本杰明提到：“奥利维亚是骑士或者奥利维亚是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞巴斯蒂安是一名骑士  \n(2) 马修是一名骑士  \n(3) 奥利维亚是一名骑士  \n(4) 梅森是一个无赖  \n(5) 本杰明是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：卢克、奥利维亚、阿丽亚、亨利和阿梅莉亚。卢克声称：“亨利是骑士，奥利维亚是骑士。”奥利维亚说：“阿梅莉亚是无赖当且仅当阿丽亚是无赖。”在阿丽亚的话中：“卢克是无赖当且仅当亨利是无赖。”亨利告诉你，如果卢克是骑士，那么阿丽亚就是骑士。阿梅莉亚指出：“阿丽亚是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 奥利维亚是一名骑士  \n(3) 阿丽亚是一名骑士  \n(4) 亨利是一名骑士  \n(5) 阿梅莉亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：伊森、梅森、威廉、约瑟夫和阿梅莉亚。正如伊森所说：“如果约瑟夫是无赖，那么梅森就是无赖。”梅森提到：“伊森是骑士当且仅当伊森是无赖。”威廉宣称：“阿梅莉亚是骑士当且仅当威廉是骑士。”约瑟夫提到：“威廉不是无赖。”在阿梅莉亚的话中：“伊森是骑士，约瑟夫是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是骑士  \n(2) 梅森是无赖  \n(3) 威廉是无赖  \n(4) 约瑟夫是无赖  \n(5) 阿梅莉亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：梅森、奥利弗、亨利、莉莉和利亚姆。梅森说：“莉莉不是无赖。”奥利弗说：“莉莉是无赖或者利亚姆是骑士。”亨利断言：“利亚姆是骑士，梅森是骑士。”莉莉说：“奥利弗是无赖。”利亚姆说：“亨利是无赖或者奥利弗是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是无赖  \n(2) 奥利弗是骑士  \n(3) 亨利是无赖  \n(4) 莉莉是无赖  \n(5) 利亚姆是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：艾登、迈克尔、克洛伊、亚历山大和诺亚。根据艾登的说法，“艾登是骑士或者亚历山大是无赖”。迈克尔宣称：“当且仅当克洛伊是骑士时，艾登才是骑士。”克洛伊说：“当且仅当诺亚是无赖时，迈克尔是骑士。”亚历山大的陈述是：“克洛伊是骑士并且克洛伊是无赖。”根据诺亚的说法，“迈克尔是无赖”。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是一名骑士  \n(2) 迈克尔是一名骑士  \n(3) 克洛伊是一名骑士  \n(4) 亚历山大是一个无赖  \n(5) 诺亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：塞缪尔、莉莉、马修、伊莎贝拉和夏洛特。塞缪尔声称：“马修不是骑士。”莉莉的陈述是：“马修是骑士，塞缪尔是骑士。”马修告诉你，如果塞缪尔是骑士，那么伊莎贝拉是骑士。伊莎贝拉被听到说：“如果夏洛特是无赖，那么马修是无赖。”夏洛特说莉莉是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是无赖  \n(2) 莉莉是无赖  \n(3) 马修是骑士  \n(4) 伊莎贝拉是骑士  \n(5) 夏洛特是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：约瑟夫、艾弗里、艾拉、维多利亚和艾米莉。约瑟夫提到：“如果艾米莉是骑士，那么艾拉就是骑士。”艾弗里说：“艾拉是骑士，艾米莉是骑士。”艾拉说：“艾弗里是无赖当且仅当艾弗里是骑士。”维多利亚声称：“如果艾米莉是骑士，那么艾弗里就是无赖。”艾米莉的陈述是：“艾弗里是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是一名骑士  \n(2) 艾弗里是一个无赖  \n(3) 艾拉是一个无赖  \n(4) 维多利亚是一名骑士  \n(5) 艾米莉是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：格蕾丝、索菲娅、伊芙琳、奥利弗和伊森。格蕾丝说索菲娅是个无赖。索菲娅则说：“伊森是个骑士。”伊芙琳断言：“伊森是个骑士。”奥利弗指出：“索菲娅是个骑士，奥利弗是个骑士。”伊森宣称：“当且仅当奥利弗是个无赖时，伊芙琳才是个无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是无赖  \n(2) 索菲娅是骑士  \n(3) 伊芙琳是骑士  \n(4) 奥利弗是骑士  \n(5) 伊森是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：迈克尔、杰克逊、伊丽莎白、佩内洛普和奥利维亚。迈克尔提到：“奥利维亚不是骑士。”杰克逊说：“伊丽莎白是骑士，或者奥利维亚是骑士。”伊丽莎白指出：“伊丽莎白是骑士，杰克逊是无赖。”佩内洛普提到：“如果迈克尔是无赖，那么奥利维亚就是骑士。”奥利维亚声称：“佩内洛普是无赖，或者佩内洛普是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是无赖  \n(2) 杰克逊是骑士  \n(3) 伊丽莎白是无赖  \n(4) 佩内洛普是骑士  \n(5) 奥利维亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：奥萝拉、诺亚、大卫、艾登和夏洛特。根据奥萝拉的说法，“夏洛特是无赖或者艾登是骑士”。诺亚说：“如果大卫是无赖，那么夏洛特就是无赖。”大卫表示，如果奥萝拉是无赖，那么艾登就是骑士。“艾登是骑士或者夏洛特是骑士，”艾登宣称。“当且仅当大卫是骑士时，艾登才是无赖，”夏洛特声称。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥萝拉是一名骑士  \n(2) 诺亚是一名骑士  \n(3) 大卫是一名骑士  \n(4) 艾登是一名骑士  \n(5) 夏洛特是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了5位居民：索菲娅、阿梅莉亚、利亚姆、哈珀和夏洛特。索菲娅的陈述是：“索菲娅是骑士当且仅当阿梅莉亚是无赖。”阿梅莉亚则说：“哈珀是骑士当且仅当利亚姆是骑士。”利亚姆的陈述是：“如果索菲娅是无赖，那么索菲娅就是骑士。”哈珀说：“利亚姆是骑士当且仅当夏洛特是骑士。”夏洛特表示：“如果利亚姆是骑士，那么哈珀就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 阿梅莉亚是一名无赖  \n(3) 利亚姆是一名骑士  \n(4) 哈珀是一名无赖  \n(5) 夏洛特是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：莉莉、洛根、卢克、诺亚和奥利弗。莉莉说：“洛根是个无赖。”洛根提到：“只有当诺亚是个无赖时，莉莉才是骑士。”卢克说：“只有当诺亚是个无赖时，洛根才是骑士。”根据诺亚的说法：“如果诺亚是骑士，那么卢克就是骑士。”奥利弗说：“如果洛根是个无赖，那么卢克就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是骑士  \n(2) 洛根是无赖  \n(3) 卢克是骑士  \n(4) 诺亚是骑士  \n(5) 奥利弗是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：格蕾丝、伊丽莎白、卢克、夏洛特和艾玛。格蕾丝说道：“如果艾玛是骑士，那么艾玛就是无赖。”伊丽莎白的陈述是：“卢克是无赖当且仅当艾玛是骑士。”卢克评论道：“艾玛不是骑士。”夏洛特声称：“夏洛特是骑士，伊丽莎白是无赖。”艾玛提到：“夏洛特是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是一名骑士  \n(2) 伊丽莎白是一名骑士  \n(3) 卢克是一名骑士  \n(4) 夏洛特是一名无赖  \n(5) 艾玛是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了5位居民：艾登、本杰明、艾米莉、大卫和欧文。艾登说：“欧文是骑士当且仅当大卫是骑士。”本杰明指出：“艾米莉是骑士当且仅当欧文是骑士。”艾米莉说：“本杰明不是骑士。”大卫被听到说：“欧文是骑士。”欧文声称：“艾米莉是骑士或者欧文是骑士。”那么，谁是骑士，谁是无赖？",
        "solution_text_format": "(1) 艾登是一名骑士  \n(2) 本杰明是一名骑士  \n(3) 艾米莉是一个无赖  \n(4) 大卫是一个无赖  \n(5) 欧文是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：洛根、伊莎贝拉、卢克、伊森和索菲娅。洛根说：“伊莎贝拉是骑士，卢克是无赖。”伊莎贝拉则表示：“卢克是无赖。”卢克说：“如果卢克是骑士，那么伊森就是骑士。”伊森声称：“卢克是骑士，索菲娅是骑士。”索菲娅指出：“伊莎贝拉不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是无赖  \n(2) 伊莎贝拉是无赖  \n(3) 卢克是骑士  \n(4) 伊森是骑士  \n(5) 索菲娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：伊芙琳、约瑟夫、索菲娅、卢克和詹姆斯。伊芙琳说道：“约瑟夫是无赖或者伊芙琳是骑士。”约瑟夫评论道：“如果卢克是无赖，那么詹姆斯就是骑士。”索菲娅宣称：“索菲娅是骑士或者卢克是骑士。”卢克断言：“伊芙琳是无赖而索菲娅是无赖。”詹姆斯被听到说：“如果伊芙琳是骑士，那么约瑟夫就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是无赖  \n(2) 约瑟夫是骑士  \n(3) 索菲娅是骑士  \n(4) 卢克是无赖  \n(5) 詹姆斯是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：莉莉、赖利、威廉、阿丽亚和大卫。“赖利不是骑士，”莉莉提到。赖利说：“大卫是骑士。”威廉被听到说：“莉莉是骑士。”阿丽亚说：“莉莉是骑士当且仅当威廉是骑士。”大卫说阿丽亚不是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是无赖  \n(2) 赖利是骑士  \n(3) 威廉是无赖  \n(4) 阿丽亚是骑士  \n(5) 大卫是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：雅各布、梅森、卢卡斯、本杰明和塞巴斯蒂安。“卢卡斯是骑士当且仅当塞巴斯蒂安是无赖。”——雅各布。梅森声称：“梅森是骑士或者雅各布是无赖。”根据卢卡斯的说法，“塞巴斯蒂安是无赖而雅各布是无赖。”本杰明评论道：“塞巴斯蒂安不是骑士。”塞巴斯蒂安说，梅森是骑士当且仅当雅各布是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）雅各布是一名骑士  \n（2）梅森是一名骑士  \n（3）卢卡斯是一名无赖  \n（4）本杰明是一名无赖  \n（5）塞巴斯蒂安是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了五个居民：米娅、塞缪尔、阿梅莉亚、索菲娅和亨利。米娅说：“塞缪尔是无赖当且仅当索菲娅是无赖。”塞缪尔说：“阿梅莉亚是骑士或者阿梅莉亚是无赖。”阿梅莉亚说：“亨利是无赖。”索菲娅说：“阿梅莉亚是无赖而塞缪尔是骑士。”亨利说：“索菲娅是骑士而米娅是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是无赖  \n(2) 塞缪尔是骑士  \n(3) 阿梅莉亚是骑士  \n(4) 索菲娅是无赖  \n(5) 亨利是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：奥萝拉、丹尼尔、本杰明、伊莎贝拉和艾登。奥萝拉声称：“艾登不是无赖。”丹尼尔被听到说：“伊莎贝拉是无赖当且仅当伊莎贝拉是骑士。”根据本杰明的说法：“如果艾登是骑士，那么丹尼尔就是骑士。”伊莎贝拉表示：“如果丹尼尔是无赖，那么本杰明就是骑士。”艾登指出：“丹尼尔是无赖当且仅当丹尼尔是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥萝拉是无赖  \n(2) 丹尼尔是无赖  \n(3) 本杰明是骑士  \n(4) 伊莎贝拉是骑士  \n(5) 艾登是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：艾玛、洛根、卢克、斯嘉丽和卢卡斯。艾玛声称：“卢卡斯是无赖，斯嘉丽也是无赖。”洛根说：“艾玛是骑士当且仅当艾玛是无赖。”卢克说：“洛根是无赖当且仅当斯嘉丽是骑士。”斯嘉丽被听到说：“如果艾玛是骑士，那么洛根就是骑士。”卢卡斯说：“艾玛是骑士，斯嘉丽是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是无赖  \n(2) 洛根是无赖  \n(3) 卢克是骑士  \n(4) 斯嘉丽是骑士  \n(5) 卢卡斯是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：迈克尔、艾拉、伊丽莎白、杰克和阿比盖尔。迈克尔说：“伊丽莎白不是无赖。”艾拉说：“杰克是骑士当且仅当艾拉是骑士。”伊丽莎白声明：“伊丽莎白是骑士或者杰克是骑士。”杰克说：“艾拉不是无赖。”阿比盖尔说：“迈克尔是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是一名骑士  \n(2) 艾拉是一名骑士  \n(3) 伊丽莎白是一名骑士  \n(4) 杰克是一名骑士  \n(5) 阿比盖尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：威廉、大卫、佐伊、艾娃和索菲娅。威廉说：“索菲娅是无赖，而索菲娅是骑士。”大卫说：“佐伊是骑士。”佐伊声明：“索菲娅是骑士当且仅当艾娃是骑士。”艾娃说：“大卫是无赖或者佐伊是骑士。”索菲娅被听到说：“如果艾娃是骑士，那么艾娃就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是无赖  \n(2) 大卫是无赖  \n(3) 佐伊是无赖  \n(4) 艾娃是骑士  \n(5) 索菲娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：奥利维亚、艾娃、本杰明、约瑟夫和斯嘉丽。奥利维亚说：“本杰明是骑士或者奥利维亚是骑士。”艾娃评论道：“如果斯嘉丽是无赖，那么艾娃就是骑士。”本杰明说，如果约瑟夫是骑士，那么斯嘉丽就是骑士。约瑟夫表示，艾娃是骑士当且仅当奥利维亚是无赖。斯嘉丽被听到说：“奥利维亚是骑士当且仅当艾娃是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是一名骑士  \n(2) 艾娃是一名骑士  \n(3) 本杰明是一名骑士  \n(4) 约瑟夫是一名无赖  \n(5) 斯嘉丽是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：艾登、大卫、佩内洛普、索菲娅和斯嘉丽。艾登表示佩内洛普是无赖，斯嘉丽也是无赖。大卫说，如果斯嘉丽是无赖，那么大卫就是骑士。根据佩内洛普的话，“如果斯嘉丽是骑士，那么艾登就是无赖”。根据索菲娅的话，“佩内洛普是无赖，而索菲娅是骑士”。斯嘉丽指出，“如果大卫是骑士，那么大卫就是无赖”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是无赖  \n(2) 大卫是骑士  \n(3) 佩内洛普是骑士  \n(4) 索菲娅是无赖  \n(5) 斯嘉丽是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：梅森、约瑟夫、艾玛、杰克逊和亚历山大。梅森说：“杰克逊是骑士当且仅当亚历山大是骑士。”约瑟夫说：“艾玛是骑士，而梅森是无赖。”有人听到艾玛说：“亚历山大不是骑士。”杰克逊声称：“亚历山大是骑士当且仅当约瑟夫是骑士。”亚历山大说梅森是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是无赖  \n(2) 约瑟夫是无赖  \n(3) 艾玛是无赖  \n(4) 杰克逊是无赖  \n(5) 亚历山大是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：丹尼尔、阿比盖尔、约瑟夫、阿梅莉亚和伊森。丹尼尔说：“约瑟夫不是骑士。”阿比盖尔说：“阿梅莉亚是骑士，阿比盖尔是骑士。”约瑟夫评论道：“阿梅莉亚是无赖当且仅当阿比盖尔是骑士。”阿梅莉亚声明：“约瑟夫是无赖，丹尼尔是无赖。”伊森的话是：“阿梅莉亚是骑士当且仅当丹尼尔是无赖。”那么，谁是骑士，谁是无赖？",
        "solution_text_format": "(1) 丹尼尔是一名骑士  \n(2) 阿比盖尔是一个无赖  \n(3) 约瑟夫是一个无赖  \n(4) 阿梅莉亚是一个无赖  \n(5) 伊森是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了5位居民：马修、艾娃、本杰明、卢卡斯和卢克。根据马修的说法：“艾娃是骑士当且仅当卢卡斯是骑士。”艾娃说：“本杰明是骑士。”本杰明被听到说：“艾娃是骑士或者马修是骑士。”卢卡斯的话是：“本杰明是骑士或者马修是骑士。”卢克断言：“本杰明是无赖当且仅当艾娃是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是一名骑士  \n(2) 艾娃是一名骑士  \n(3) 本杰明是一名骑士  \n(4) 卢卡斯是一名骑士  \n(5) 卢克是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了5位居民：夏洛特、哈珀、伊丽莎白、威廉和佩内洛普。夏洛特说，伊丽莎白是骑士当且仅当佩内洛普是骑士。“夏洛特不是骑士”——哈珀。伊丽莎白告诉你，佩内洛普是骑士，伊丽莎白也是骑士。威廉被听到说：“如果夏洛特是无赖，那么伊丽莎白就是骑士。”佩内洛普说：“夏洛特是无赖当且仅当夏洛特是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是一名骑士  \n(2) 哈珀是一个无赖  \n(3) 伊丽莎白是一个无赖  \n(4) 威廉是一名骑士  \n(5) 佩内洛普是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：艾登、艾米莉、洛根、约瑟夫和佐伊。艾登说：“佐伊是无赖或者洛根是无赖。”艾米莉宣称：“如果艾米莉是骑士，那么佐伊就是无赖。”洛根的陈述是：“艾米莉不是骑士。”约瑟夫表示：“洛根是无赖或者洛根是骑士。”佐伊告诉你，约瑟夫是无赖，而佐伊是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是一名骑士  \n(2) 艾米莉是一名骑士  \n(3) 洛根是一个无赖  \n(4) 约瑟夫是一名骑士  \n(5) 佐伊是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了5位居民：艾弗里、梅森、伊芙琳、伊丽莎白和洛根。艾弗里提到：“如果伊丽莎白是骑士，那么梅森就是骑士。”梅森告诉你：“如果洛根是骑士，那么伊芙琳就是无赖。”伊芙琳说：“梅森是骑士，而伊丽莎白是无赖。”在伊丽莎白的话中：“梅森是骑士，而梅森是无赖。”根据洛根的说法：“伊芙琳是无赖，而梅森是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是一名骑士  \n(2) 梅森是一名骑士  \n(3) 伊芙琳是一名骑士  \n(4) 伊丽莎白是一名无赖  \n(5) 洛根是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：索菲娅、哈珀、阿比盖尔、奥利弗和杰克。索菲娅说杰克不是无赖。哈珀评论道：“奥利弗是骑士，索菲娅是骑士”。根据阿比盖尔的说法，“哈珀是骑士，索菲娅是无赖”。根据奥利弗的说法，“阿比盖尔不是骑士”。杰克告诉你杰克是骑士，阿比盖尔是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 哈珀是无赖  \n(3) 阿比盖尔是无赖  \n(4) 奥利弗是骑士  \n(5) 杰克是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：阿丽亚、米娅、艾弗里、威廉和艾登。阿丽亚告诉你，米娅是无赖或者艾弗里是无赖。“艾登不是无赖，”米娅声称。艾弗里评论道：“阿丽亚不是无赖。” “米娅是无赖而艾弗里是无赖，”威廉宣称。艾登说：“如果阿丽亚是骑士，那么威廉就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿丽亚是一名骑士  \n(2) 米娅是一个无赖  \n(3) 艾弗里是一名骑士  \n(4) 威廉是一个无赖  \n(5) 艾登是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：莉莉、亨利、约瑟夫、阿梅莉亚和索菲娅。莉莉宣称：“阿梅莉亚不是骑士。”亨利声称：“阿梅莉亚是无赖当且仅当莉莉是无赖。”约瑟夫评论道：“亨利不是骑士。”阿梅莉亚说道：“如果亨利是无赖，那么索菲娅就是骑士。”索菲娅说：“约瑟夫是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是骑士  \n(2) 亨利是无赖  \n(3) 约瑟夫是骑士  \n(4) 阿梅莉亚是无赖  \n(5) 索菲娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：杰克逊、赖利、艾登、索菲娅和塞缪尔。“索菲娅是无赖当且仅当塞缪尔是无赖”——杰克逊说。赖利告诉你杰克逊不是骑士。艾登说如果索菲娅是无赖，那么赖利就是无赖。索菲娅表示赖利不是骑士。塞缪尔告诉你如果杰克逊是骑士，那么杰克逊就是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是一个无赖  \n(2) 赖利是一个骑士  \n(3) 艾登是一个无赖  \n(4) 索菲娅是一个无赖  \n(5) 塞缪尔是一个骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了5位居民：哈珀、奥利弗、艾玛、佐伊和卢克。哈珀表示佐伊是骑士，卢克是骑士。奥利弗说：“佐伊是骑士或者卢克是骑士。”艾玛告诉你卢克是骑士，而艾玛是骑士。正如佐伊所说：“哈珀不是骑士。”卢克说哈珀是骑士，而艾玛是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是无赖  \n(2) 奥利弗是骑士  \n(3) 艾玛是无赖  \n(4) 佐伊是骑士  \n(5) 卢克是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：大卫、伊莎贝拉、迈克尔、塞巴斯蒂安和夏洛特。大卫声称：“迈克尔是骑士。”伊莎贝拉说：“大卫是无赖，夏洛特是无赖。”根据迈克尔的说法：“当且仅当迈克尔是骑士时，塞巴斯蒂安才是骑士。”塞巴斯蒂安指出：“迈克尔不是无赖。”夏洛特声明：“如果夏洛特是骑士，那么塞巴斯蒂安就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 大卫是一名骑士  \n(2) 伊莎贝拉是一个无赖  \n(3) 迈克尔是一名骑士  \n(4) 塞巴斯蒂安是一名骑士  \n(5) 夏洛特是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：雅各布、佩内洛普、伊森、马修和诺亚。雅各布评论道：“伊森是个无赖。”佩内洛普声称：“雅各布是骑士，伊森是无赖。”有人听到伊森说：“如果佩内洛普是无赖，那么马修就是无赖。”有人听到马修说：“雅各布是骑士或者诺亚是骑士。”诺亚说：“雅各布是骑士，伊森是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 雅各布是无赖  \n(2) 佩内洛普是无赖  \n(3) 伊森是骑士  \n(4) 马修是无赖  \n(5) 诺亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：伊森、奥萝拉、索菲娅、斯嘉丽和杰克。伊森说：“斯嘉丽不是骑士。”奥萝拉说伊森是骑士，索菲娅也是骑士。索菲娅的声明是：“杰克是骑士当且仅当奥萝拉是无赖。”斯嘉丽宣称：“斯嘉丽是骑士或者杰克是无赖。”杰克说：“如果伊森是骑士，那么斯嘉丽就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是无赖  \n(2) 奥萝拉是无赖  \n(3) 索菲娅是骑士  \n(4) 斯嘉丽是骑士  \n(5) 杰克是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了5位居民：威廉、艾玛、伊莎贝拉、伊森和阿梅莉亚。威廉声称：“如果艾玛是骑士，那么伊森就是无赖。”艾玛宣称：“如果阿梅莉亚是骑士，那么威廉就是骑士。”伊莎贝拉说：“威廉是无赖，阿梅莉亚是骑士。”伊森断言：“伊森是骑士。”阿梅莉亚声称：“当且仅当艾玛是骑士时，伊森才是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 艾玛是一名骑士  \n(3) 伊莎贝拉是一名无赖  \n(4) 伊森是一名无赖  \n(5) 阿梅莉亚是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：克洛伊、索菲娅、奥利弗、艾弗里和夏洛特。克洛伊宣称：“夏洛特是无赖或者艾弗里是骑士。”索菲娅说：“艾弗里是无赖而奥利弗是无赖。”奥利弗说：“克洛伊是骑士或者索菲娅是骑士。”艾弗里指出：“奥利弗不是无赖。”夏洛特说：“奥利弗是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 克洛伊是一名骑士  \n(2) 索菲娅是一名无赖  \n(3) 奥利弗是一名骑士  \n(4) 艾弗里是一名骑士  \n(5) 夏洛特是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了5位居民：本杰明、米娅、伊丽莎白、塞巴斯蒂安和大卫。本杰明说：“伊丽莎白是无赖或者伊丽莎白是骑士。”米娅说：“本杰明是骑士并且本杰明是无赖。”伊丽莎白宣称：“塞巴斯蒂安是无赖或者大卫是骑士。”塞巴斯蒂安断言：“米娅是无赖或者塞巴斯蒂安是骑士。”大卫说：“米娅是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是一名骑士  \n(2) 米娅是一名无赖  \n(3) 伊丽莎白是一名骑士  \n(4) 塞巴斯蒂安是一名骑士  \n(5) 大卫是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：詹姆斯、本杰明、索菲娅、马修和杰克。詹姆斯声称：“杰克是骑士或者马修是骑士。”本杰明说：“马修是无赖或者杰克是无赖。”索菲娅告诉你杰克是无赖。马修说：“索菲娅是无赖当且仅当索菲娅是骑士。”杰克的陈述是：“马修不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是一名骑士  \n(2) 本杰明是一名骑士  \n(3) 索菲娅是一名无赖  \n(4) 马修是一名无赖  \n(5) 杰克是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：阿梅莉亚、斯嘉丽、米娅、艾登和迈克尔。阿梅莉亚告诉你，如果米娅是无赖，那么斯嘉丽就是无赖。斯嘉丽说：“米娅是骑士，斯嘉丽是骑士。”米娅说：“艾登不是骑士。”艾登的陈述是：“如果斯嘉丽是骑士，那么米娅就是骑士。”迈克尔表示：“如果斯嘉丽是无赖，那么艾登就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是一名骑士  \n(2) 斯嘉丽是一个无赖  \n(3) 米娅是一个无赖  \n(4) 艾登是一名骑士  \n(5) 迈克尔是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：艾拉、索菲娅、杰克、马修和利亚姆。艾拉声称：“杰克不是骑士。”索菲娅提到：“杰克是骑士。”杰克说：“索菲娅是骑士或者马修是无赖。”马修宣称：“艾拉是无赖。”利亚姆说索菲娅是无赖，杰克也是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是无赖  \n(2) 索菲娅是骑士  \n(3) 杰克是骑士  \n(4) 马修是骑士  \n(5) 利亚姆是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：约瑟夫、丹尼尔、欧文、雅各布和艾娃。约瑟夫说：“如果艾娃是骑士，那么雅各布就是无赖。”丹尼尔说：“如果约瑟夫是骑士，那么欧文就是无赖。”欧文评论道：“约瑟夫是骑士或者丹尼尔是骑士。”雅各布被听到说：“丹尼尔是骑士而约瑟夫是无赖。”艾娃被听到说：“雅各布是骑士而丹尼尔是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是骑士  \n(2) 丹尼尔是无赖  \n(3) 欧文是骑士  \n(4) 雅各布是无赖  \n(5) 艾娃是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：雅各布、格蕾丝、詹姆斯、奥利弗和伊丽莎白。根据雅各布的说法：“奥利弗是骑士当且仅当詹姆斯是骑士。”格蕾丝的陈述是：“如果雅各布是骑士，那么奥利弗就是无赖。”詹姆斯提到：“奥利弗是无赖或者伊丽莎白是无赖。”奥利弗被听到说：“格蕾丝不是无赖。”伊丽莎白声称：“詹姆斯是无赖或者奥利弗是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 雅各布是无赖  \n(2) 格蕾丝是骑士  \n(3) 詹姆斯是无赖  \n(4) 奥利弗是骑士  \n(5) 伊丽莎白是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了5位居民：艾米莉、佩内洛普、威廉、斯嘉丽和艾娃。艾米莉表示威廉不是骑士。佩内洛普表示威廉是骑士或者斯嘉丽是无赖。“佩内洛普是无赖当且仅当威廉是骑士，”威廉声称。斯嘉丽说：“艾娃是无赖。”艾娃指出：“斯嘉丽是骑士当且仅当斯嘉丽是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是一名骑士  \n(2) 佩内洛普是一名无赖  \n(3) 威廉是一名无赖  \n(4) 斯嘉丽是一名骑士  \n(5) 艾娃是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：夏洛特、亚历山大、艾拉、克洛伊和莉莉。夏洛特宣称：“艾拉是无赖当且仅当克洛伊是无赖。”亚历山大声称：“克洛伊不是骑士。”艾拉断言：“莉莉是骑士或者夏洛特是骑士。”正如克洛伊所说：“如果亚历山大是无赖，那么夏洛特就是无赖。”莉莉评论道：“克洛伊不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是无赖  \n(2) 亚历山大是无赖  \n(3) 艾拉是无赖  \n(4) 克洛伊是骑士  \n(5) 莉莉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：亨利、艾弗里、克洛伊、奥利弗和伊芙琳。亨利被听到说：“克洛伊是骑士。”艾弗里说，如果且仅如果伊芙琳是骑士，那么伊芙琳就是无赖。克洛伊说艾弗里是无赖。奥利弗告诉你，克洛伊是无赖或者艾弗里是骑士。“克洛伊是骑士，”伊芙琳声称。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是一名骑士  \n(2) 艾弗里是一个无赖  \n(3) 克洛伊是一名骑士  \n(4) 奥利弗是一个无赖  \n(5) 伊芙琳是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：威廉、阿梅莉亚、雅各布、艾登和塞缪尔。威廉告诉你，如果塞缪尔是无赖，那么雅各布就是无赖。阿梅莉亚指出：“塞缪尔是无赖或者威廉是无赖。”雅各布声称：“塞缪尔是骑士或者塞缪尔是无赖。”在艾登的话中：“如果阿梅莉亚是无赖，那么艾登就是骑士。”塞缪尔说：“艾登是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 阿梅莉亚是一名无赖  \n(3) 雅各布是一名骑士  \n(4) 艾登是一名骑士  \n(5) 塞缪尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：利亚姆、奥利维亚、艾米莉、伊莎贝拉和伊芙琳。利亚姆说：“奥利维亚是个无赖。”奥利维亚表示艾米莉是个骑士。艾米莉告诉你，奥利维亚是个骑士，伊芙琳是个骑士。伊莎贝拉说：“奥利维亚是个无赖，艾米莉是个无赖。”伊芙琳声称：“艾米莉是个骑士当且仅当艾米莉是个无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是一名骑士  \n(2) 奥利维亚是一名无赖  \n(3) 艾米莉是一名无赖  \n(4) 伊莎贝拉是一名骑士  \n(5) 伊芙琳是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：亨利、赖利、艾米莉、梅森和塞缪尔。亨利说梅森是骑士或者塞缪尔是无赖。赖利的陈述是：“亨利是无赖或者艾米莉是无赖。”艾米莉断言：“亨利不是无赖。”梅森说：“艾米莉是骑士当且仅当塞缪尔是无赖。”塞缪尔说：“赖利不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是一名骑士  \n(2) 赖利是一个无赖  \n(3) 艾米莉是一名骑士  \n(4) 梅森是一名骑士  \n(5) 塞缪尔是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：奥利弗、佩内洛普、奥利维亚、艾娃和塞缪尔。根据奥利弗的说法，“佩内洛普不是骑士”。佩内洛普告诉你，奥利维亚不是骑士。奥利维亚声称：“艾娃是无赖”。艾娃评论道：“奥利弗是无赖，奥利维亚是骑士”。塞缪尔声称：“佩内洛普是无赖或者佩内洛普是骑士”。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利弗是一名骑士  \n(2) 佩内洛普是一个无赖  \n(3) 奥利维亚是一名骑士  \n(4) 艾娃是一个无赖  \n(5) 塞缪尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：奥萝拉、奥利弗、阿比盖尔、卢克和梅森。奥萝拉说：“奥利弗不是骑士。”奥利弗评论道：“如果卢克是无赖，那么梅森就是无赖。”根据阿比盖尔的说法，“奥萝拉不是骑士。”卢克说：“如果奥利弗是骑士，那么阿比盖尔就是无赖。”梅森声称：“奥萝拉是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥萝拉是无赖  \n(2) 奥利弗是骑士  \n(3) 阿比盖尔是骑士  \n(4) 卢克是无赖  \n(5) 梅森是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：艾弗里、塞巴斯蒂安、洛根、伊森和佩内洛普。正如艾弗里所说：“塞巴斯蒂安是骑士当且仅当伊森是骑士。”塞巴斯蒂安表示伊森是骑士。“洛根是骑士而塞巴斯蒂安是骑士，”洛根声称。伊森说，洛根是无赖当且仅当洛根是骑士。佩内洛普评论道：“如果洛根是骑士，那么洛根就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是一名骑士  \n(2) 塞巴斯蒂安是一个无赖  \n(3) 洛根是一个无赖  \n(4) 伊森是一个无赖  \n(5) 佩内洛普是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了5位居民：米娅、艾娃、斯嘉丽、艾米莉和莉莉。米娅指出：“如果艾米莉是骑士，那么艾娃就是无赖。”艾娃声称：“米娅是无赖当且仅当艾米莉是无赖。”斯嘉丽被听到说：“莉莉不是无赖。”正如艾米莉所说：“莉莉不是无赖。”莉莉的声明是：“艾娃不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是骑士  \n(2) 艾娃是无赖  \n(3) 斯嘉丽是无赖  \n(4) 艾米莉是无赖  \n(5) 莉莉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：雅各布、克洛伊、佩内洛普、艾弗里和斯嘉丽。雅各布评论道：“佩内洛普是个无赖。”克洛伊说：“斯嘉丽是骑士或者艾弗里是无赖。”佩内洛普断言：“艾弗里是骑士当且仅当克洛伊是骑士。”艾弗里被听到说：“如果雅各布是无赖，那么佩内洛普就是无赖。”正如斯嘉丽所说：“克洛伊不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 雅各布是一名骑士  \n(2) 克洛伊是一个无赖  \n(3) 佩内洛普是一个无赖  \n(4) 艾弗里是一名骑士  \n(5) 斯嘉丽是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：卢克、杰克逊、卢卡斯、夏洛特和洛根。卢克说：“夏洛特是骑士或者卢克是骑士。”杰克逊提到：“洛根是无赖或者洛根是骑士。”卢卡斯提到：“当且仅当夏洛特是无赖时，洛根是骑士。”夏洛特被听到说：“杰克逊是骑士而卢克是无赖。”洛根提到：“夏洛特是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 杰克逊是一名骑士  \n(3) 卢卡斯是一个无赖  \n(4) 夏洛特是一个无赖  \n(5) 洛根是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：卢卡斯、奥萝拉、诺亚、佩内洛普和本杰明。卢卡斯提到：“奥萝拉是骑士当且仅当佩内洛普是骑士。”在奥萝拉的陈述中：“奥萝拉是骑士，佩内洛普是骑士。”诺亚说卢卡斯是骑士或者佩内洛普是骑士。在佩内洛普的陈述中：“卢卡斯是无赖当且仅当卢卡斯是骑士。”本杰明被听到说：“卢卡斯是骑士，诺亚是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是一名骑士  \n(2) 奥萝拉是一个无赖  \n(3) 诺亚是一名骑士  \n(4) 佩内洛普是一个无赖  \n(5) 本杰明是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：克洛伊、赖利、洛根、艾弗里和伊芙琳。正如克洛伊所说：“伊芙琳是骑士当且仅当赖利是骑士。”赖利说：“洛根是骑士或者伊芙琳是无赖。”在洛根看来：“洛根是骑士当且仅当艾弗里是无赖。”艾弗里评论道：“赖利是骑士并且洛根是骑士。”伊芙琳说：“如果洛根是骑士，那么艾弗里就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 克洛伊是无赖  \n(2) 赖利是无赖  \n(3) 洛根是无赖  \n(4) 艾弗里是无赖  \n(5) 伊芙琳是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：伊丽莎白、艾玛、威廉、塞巴斯蒂安和哈珀。伊丽莎白声称：“艾玛是无赖，哈珀是无赖。”艾玛提到：“伊丽莎白是骑士，威廉是无赖。”威廉表示伊丽莎白是骑士。塞巴斯蒂安评论道：“艾玛不是骑士。”哈珀说：“如果伊丽莎白是无赖，那么塞巴斯蒂安就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是无赖  \n(2) 艾玛是无赖  \n(3) 威廉是无赖  \n(4) 塞巴斯蒂安是骑士  \n(5) 哈珀是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：杰克逊、阿梅莉亚、艾娃、威廉和杰克。杰克逊说：“如果艾娃是无赖，那么杰克就是骑士。”阿梅莉亚宣称：“杰克不是无赖。”艾娃指出：“如果杰克是骑士，那么艾娃就是骑士。”威廉表示杰克是无赖或者杰克逊是骑士。在杰克的陈述中：“如果威廉是骑士，那么威廉就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是一名骑士  \n(2) 阿梅莉亚是一个无赖  \n(3) 艾娃是一名骑士  \n(4) 威廉是一名骑士  \n(5) 杰克是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：艾拉、奥萝拉、伊丽莎白、伊芙琳和赖利。“伊丽莎白不是骑士，”艾拉宣称。“赖利是无赖或者艾拉是无赖，”奥萝拉宣称。“奥萝拉是无赖而赖利是骑士，”伊丽莎白说。伊芙琳指出，“伊丽莎白不是无赖。”赖利说，如果奥萝拉是骑士，那么艾拉就是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是一名骑士  \n(2) 奥萝拉是一名骑士  \n(3) 伊丽莎白是一名无赖  \n(4) 伊芙琳是一名无赖  \n(5) 赖利是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了5位居民：梅森、艾娃、威廉、卢克和雅各布。梅森说：“威廉不是无赖。”艾娃说：“雅各布是无赖。”威廉的陈述是：“雅各布是骑士当且仅当威廉是骑士。”卢克说：“威廉是骑士。”雅各布声称：“梅森是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是无赖  \n(2) 艾娃是无赖  \n(3) 威廉是无赖  \n(4) 卢克是无赖  \n(5) 雅各布是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：约瑟夫、杰克逊、本杰明、塞缪尔和阿比盖尔。在约瑟夫的话中：“塞缪尔是无赖，杰克逊是骑士。”根据杰克逊的说法，“杰克逊是骑士当且仅当约瑟夫是无赖。”本杰明指出，“如果塞缪尔是骑士，那么杰克逊就是骑士。”塞缪尔说：“杰克逊是骑士，本杰明是无赖。”阿比盖尔告诉你，本杰明不是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是无赖  \n(2) 杰克逊是无赖  \n(3) 本杰明是骑士  \n(4) 塞缪尔是无赖  \n(5) 阿比盖尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：威廉、艾拉、杰克逊、亨利和奥萝拉。威廉声称：“杰克逊是一个无赖。”艾拉说：“亨利不是骑士。”杰克逊评论道：“奥萝拉是骑士，艾拉是骑士。”亨利指出：“威廉是骑士当且仅当艾拉是骑士。”奥萝拉评论道：“亨利是无赖或者杰克逊是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是无赖  \n(2) 艾拉是骑士  \n(3) 杰克逊是骑士  \n(4) 亨利是无赖  \n(5) 奥萝拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：亨利、雅各布、杰克逊、夏洛特和莉莉。亨利表示雅各布是骑士。雅各布说：“如果莉莉是骑士，那么杰克逊就是无赖。”杰克逊说：“夏洛特是无赖当且仅当杰克逊是骑士。”根据夏洛特的话，“如果杰克逊是无赖，那么雅各布就是无赖。”莉莉告诉你亨利是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是一名骑士  \n(2) 雅各布是一名骑士  \n(3) 杰克逊是一名无赖  \n(4) 夏洛特是一名无赖  \n(5) 莉莉是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：艾玛、丹尼尔、艾拉、约瑟夫和洛根。艾玛说：“如果艾拉是骑士，那么艾拉就是无赖。”丹尼尔声称：“艾拉是骑士，艾拉是无赖。”艾拉宣称：“艾玛是无赖，艾玛是骑士。”约瑟夫告诉你，如果艾玛是骑士，那么洛根就是骑士。根据洛根的说法，“艾玛不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是骑士  \n(2) 丹尼尔是无赖  \n(3) 艾拉是无赖  \n(4) 约瑟夫是无赖  \n(5) 洛根是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：索菲娅、阿比盖尔、塞缪尔、雅各布和格蕾丝。索菲娅的陈述是：“阿比盖尔是无赖当且仅当阿比盖尔是骑士。”阿比盖尔说：“如果塞缪尔是骑士，那么格蕾丝就是骑士。”塞缪尔说：“阿比盖尔是无赖，而索菲娅是骑士。”雅各布评论道：“如果阿比盖尔是骑士，那么索菲娅就是骑士。”格蕾丝说：“阿比盖尔是无赖当且仅当索菲娅是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 阿比盖尔是骑士  \n(3) 塞缪尔是无赖  \n(4) 雅各布是无赖  \n(5) 格蕾丝是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：詹姆斯、斯嘉丽、卢克、艾拉和雅各布。詹姆斯声称：“斯嘉丽是个无赖。”斯嘉丽提到：“卢克是个无赖。”卢克说：“艾拉是个无赖，而斯嘉丽是个骑士。”艾拉指出：“如果詹姆斯是个无赖，那么雅各布就是个骑士。”雅各布评论道：“卢克是个无赖当且仅当詹姆斯是个无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是无赖  \n(2) 斯嘉丽是骑士  \n(3) 卢克是无赖  \n(4) 艾拉是骑士  \n(5) 雅各布是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了五位居民：伊森、卢卡斯、艾弗里、哈珀和米娅。伊森说：“卢卡斯是骑士，哈珀是骑士。”卢卡斯被听到说：“艾弗里是无赖，米娅是骑士。”艾弗里断言：“伊森是骑士当且仅当卢卡斯是骑士。”哈珀说：“米娅是骑士或者艾弗里是骑士。”米娅在一份声明中说：“伊森是无赖或者卢卡斯是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是无赖  \n(2) 卢卡斯是无赖  \n(3) 艾弗里是骑士  \n(4) 哈珀是骑士  \n(5) 米娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：马修、伊莎贝拉、艾玛、阿比盖尔和亨利。马修说，如果伊莎贝拉是无赖，那么艾玛就是无赖。伊莎贝拉说：“亨利是骑士当且仅当阿比盖尔是无赖。”艾玛说，阿比盖尔是无赖当且仅当伊莎贝拉是无赖。阿比盖尔断言：“马修不是无赖。”根据亨利的说法，“如果亨利是骑士，那么阿比盖尔就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是一名骑士  \n(2) 伊莎贝拉是一个无赖  \n(3) 艾玛是一个无赖  \n(4) 阿比盖尔是一名骑士  \n(5) 亨利是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：佩内洛普、艾娃、格蕾丝、奥利维亚和阿梅莉亚。佩内洛普宣称：“艾娃是骑士当且仅当格蕾丝是骑士。”艾娃说阿梅莉亚是骑士当且仅当阿梅莉亚是无赖。“如果奥利维亚是骑士，那么阿梅莉亚就是骑士，”格蕾丝提到。奥利维亚说：“格蕾丝是骑士或者奥利维亚是骑士。”阿梅莉亚说：“奥利维亚是无赖当且仅当艾娃是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是骑士  \n(2) 艾娃是无赖  \n(3) 格蕾丝是无赖  \n(4) 奥利维亚是骑士  \n(5) 阿梅莉亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：艾娃、哈珀、艾米莉、阿比盖尔和塞巴斯蒂安。艾娃被听到说：“哈珀是无赖，阿比盖尔是骑士。”哈珀则说：“哈珀是骑士。”艾米莉断言：“阿比盖尔是无赖当且仅当哈珀是骑士。”阿比盖尔宣称：“如果艾米莉是无赖，那么哈珀就是无赖。”塞巴斯蒂安说艾米莉是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是一名骑士  \n(2) 哈珀是一个无赖  \n(3) 艾米莉是一名骑士  \n(4) 阿比盖尔是一名骑士  \n(5) 塞巴斯蒂安是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：艾弗里、格蕾丝、斯嘉丽、迈克尔和伊丽莎白。在艾弗里的话中：“格蕾丝是骑士当且仅当伊丽莎白是无赖。”格蕾丝说：“迈克尔是无赖当且仅当斯嘉丽是无赖。”斯嘉丽说：“斯嘉丽是骑士或者伊丽莎白是无赖。”迈克尔声明：“格蕾丝是无赖而斯嘉丽是骑士。”伊丽莎白被听到说：“艾弗里是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是无赖  \n(2) 格蕾丝是骑士  \n(3) 斯嘉丽是无赖  \n(4) 迈克尔是无赖  \n(5) 伊丽莎白是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：伊芙琳、阿比盖尔、伊森、洛根和索菲娅。伊芙琳说：“洛根是骑士。”阿比盖尔说：“索菲娅是骑士，伊芙琳是无赖。”伊森宣称：“洛根是无赖或者伊芙琳是无赖。”洛根说：“索菲娅是骑士当且仅当伊森是骑士。”索菲娅告诉你，阿比盖尔是骑士或者洛根是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是一名骑士  \n(2) 阿比盖尔是一个无赖  \n(3) 伊森是一个无赖  \n(4) 洛根是一名骑士  \n(5) 索菲娅是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：雅各布、杰克、卢卡斯、艾弗里和莉莉。雅各布告诉你，卢卡斯是骑士或者艾弗里是骑士。杰克声称：“杰克是骑士，雅各布是骑士。”根据卢卡斯的说法，“杰克不是骑士。”艾弗里被听到说：“卢卡斯是无赖当且仅当雅各布是无赖。”莉莉说，艾弗里是骑士当且仅当卢卡斯是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 雅各布是一名骑士  \n(2) 杰克是一个无赖  \n(3) 卢卡斯是一名骑士  \n(4) 艾弗里是一名骑士  \n(5) 莉莉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：阿梅莉亚、艾弗里、索菲娅、奥萝拉和诺亚。阿梅莉亚告诉你，如果阿梅莉亚是骑士，那么奥萝拉就是无赖。艾弗里说诺亚是骑士或者奥萝拉是骑士。索菲娅被听到说：“索菲娅是骑士或者奥萝拉是无赖”。根据奥萝拉的说法，“艾弗里不是无赖”。在诺亚的陈述中：“艾弗里是骑士当且仅当阿梅莉亚是骑士”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是一名骑士  \n(2) 艾弗里是一个无赖  \n(3) 索菲娅是一名骑士  \n(4) 奥萝拉是一个无赖  \n(5) 诺亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：赖利、诺亚、艾拉、伊莎贝拉和艾娃。“诺亚是骑士，同时诺亚也是无赖。”——赖利。诺亚被听到说：“如果伊莎贝拉是骑士，那么赖利就是骑士。”艾拉提到：“赖利不是骑士。”伊莎贝拉说：“艾拉不是骑士。”艾娃断言：“伊莎贝拉是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是无赖  \n(2) 诺亚是骑士  \n(3) 艾拉是骑士  \n(4) 伊莎贝拉是无赖  \n(5) 艾娃是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：伊丽莎白、卢克、艾玛、赖利和索菲娅。伊丽莎白说：“赖利是骑士，艾玛是无赖。”卢克则说：“卢克是骑士当且仅当伊丽莎白是无赖。”艾玛声明：“赖利是无赖当且仅当索菲娅是无赖。”赖利宣称：“索菲娅不是骑士。”索菲娅评论道：“卢克是无赖或者伊丽莎白是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是无赖  \n(2) 卢克是无赖  \n(3) 艾玛是无赖  \n(4) 赖利是无赖  \n(5) 索菲娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了5位居民：维多利亚、佩内洛普、伊森、奥萝拉和塞巴斯蒂安。维多利亚说：“奥萝拉是骑士。”佩内洛普说：“伊森是骑士或者塞巴斯蒂安是无赖。”伊森的陈述是：“如果维多利亚是骑士，那么佩内洛普是无赖。”奥萝拉说：“佩内洛普是无赖，伊森是无赖。”塞巴斯蒂安声称：“佩内洛普是骑士或者伊森是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 维多利亚是无赖  \n(2) 佩内洛普是骑士  \n(3) 伊森是骑士  \n(4) 奥萝拉是无赖  \n(5) 塞巴斯蒂安是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了五位居民：艾拉、丹尼尔、哈珀、本杰明和米娅。艾拉提到：“哈珀是无赖，而哈珀是骑士。”丹尼尔评论道：“如果艾拉是骑士，那么丹尼尔就是骑士。”哈珀提到：“如果本杰明是无赖，那么丹尼尔就是骑士。”本杰明声称：“本杰明是骑士，或者哈珀是骑士。”米娅说：“本杰明是无赖当且仅当艾拉是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是无赖  \n(2) 丹尼尔是骑士  \n(3) 哈珀是骑士  \n(4) 本杰明是骑士  \n(5) 米娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：艾米莉、艾玛、斯嘉丽、阿梅莉亚和奥萝拉。艾米莉说：“如果且仅如果艾玛是骑士，奥萝拉就是无赖。”艾玛说：“奥萝拉是骑士。”斯嘉丽评论道：“阿梅莉亚是无赖或者阿梅莉亚是骑士。”在阿梅莉亚的话中：“如果且仅如果艾米莉是骑士，奥萝拉就是无赖。”在奥萝拉的陈述中：“如果斯嘉丽是无赖，那么艾玛就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）艾米莉是无赖  \n（2）艾玛是骑士  \n（3）斯嘉丽是骑士  \n（4）阿梅莉亚是骑士  \n（5）奥萝拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了5位居民：艾弗里、维多利亚、艾玛、哈珀和伊森。艾弗里说：“维多利亚是骑士。”维多利亚声称：“哈珀是骑士，伊森是骑士。”根据艾玛的说法：“哈珀是骑士或者哈珀是无赖。”哈珀的声明是：“维多利亚是无赖或者维多利亚是骑士。”伊森断言：“维多利亚是骑士或者艾玛是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是一名骑士  \n(2) 维多利亚是一名骑士  \n(3) 艾玛是一名骑士  \n(4) 哈珀是一名骑士  \n(5) 伊森是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了5位居民：克洛伊、欧文、利亚姆、梅森和佩内洛普。正如克洛伊所说：“如果梅森是骑士，那么梅森就是无赖。”根据欧文的说法：“利亚姆是无赖当且仅当梅森是无赖。”利亚姆声称：“梅森是骑士。”梅森表示：“如果克洛伊是无赖，那么欧文就是骑士。”佩内洛普说，梅森是骑士当且仅当利亚姆是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 克洛伊是无赖  \n(2) 欧文是骑士  \n(3) 利亚姆是骑士  \n(4) 梅森是骑士  \n(5) 佩内洛普是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了五位居民：奥利维亚、夏洛特、塞巴斯蒂安、梅森和伊丽莎白。奥利维亚说，梅森是骑士当且仅当塞巴斯蒂安是骑士。夏洛特的陈述是：“梅森是无赖或者塞巴斯蒂安是无赖。”塞巴斯蒂安提到：“如果夏洛特是骑士，那么奥利维亚就是无赖。”梅森表示，夏洛特是无赖当且仅当伊丽莎白是骑士。伊丽莎白说：“梅森是无赖当且仅当奥利维亚是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是骑士  \n(2) 夏洛特是骑士  \n(3) 塞巴斯蒂安是无赖  \n(4) 梅森是无赖  \n(5) 伊丽莎白是骑士"
    }
]