[
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: माइकल, ज़ोई, और ईथन। माइकल को यह कहते हुए सुना गया, \"ईथन एक शूरवीर है यदि और केवल यदि माइकल एक शूरवीर है\"। \"ज़ोई एक शूरवीर है या ईथन एक शूरवीर है,\" ज़ोई ने कहा। ईथन ने कहा: \"माइकल एक धूर्त है यदि और केवल यदि ज़ोई एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक शूरवीर है  \n(2) ज़ोई एक शूरवीर है  \n(3) ईथन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: माइकल, मेसन, और याकूब। माइकल ने टिप्पणी की, \"मेसन शूरवीर नहीं है\"। मेसन ने टिप्पणी की, \"माइकल शूरवीर है और याकूब धूर्त है\"। याकूब ने कहा, \"अगर माइकल शूरवीर है तो याकूब शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक शूरवीर है  \n(2) मेसन एक धूर्त है  \n(3) याकूब एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: लुकास, हार्पर, और अमेलिया। लुकास ने कहा कि हार्पर एक धूर्त नहीं है। हार्पर के एक बयान में: \"हार्पर एक शूरवीर है यदि और केवल यदि अमेलिया एक धूर्त है\"। जैसे अमेलिया ने कहा, \"हार्पर एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक शूरवीर है  \n(2) हार्पर एक शूरवीर है  \n(3) अमेलिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ओवेन, यूसुफ, और सोफिया। ओवेन ने कहा, \"यूसुफ एक शूरवीर है या सोफिया एक शूरवीर है।\" \"ओवेन एक धूर्त है यदि और केवल यदि सोफिया एक शूरवीर है,\" यूसुफ ने घोषणा की। \"यदि यूसुफ एक धूर्त है तो यूसुफ एक शूरवीर है,\" सोफिया ने दावा किया। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ओवेन एक धूर्त है  \n(2) यूसुफ एक धूर्त है  \n(3) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: अबिगेल, स्कारलेट, और एवलिन। अबिगेल के शब्दों में: \"अबिगेल एक शूरवीर है यदि और केवल यदि एवलिन एक शूरवीर है\"। स्कारलेट ने कहा, \"अबिगेल एक शूरवीर है\"। एवलिन के अनुसार, \"स्कारलेट एक शूरवीर नहीं है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) अबिगेल एक धूर्त है  \n(2) स्कारलेट एक धूर्त है  \n(3) एवलिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: पेनलोप, मैथ्यू, और विक्टोरिया। \"पेनलोप एक शूरवीर है और मैथ्यू एक शूरवीर है,\" पेनलोप ने दावा किया। मैथ्यू को यह कहते हुए सुना गया, \"विक्टोरिया एक धूर्त है और विक्टोरिया एक शूरवीर है\"। विक्टोरिया ने कहा कि अगर मैथ्यू एक शूरवीर है तो मैथ्यू एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक धूर्त है  \n(2) मैथ्यू एक धूर्त है  \n(3) विक्टोरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एमिली, लियम, और एलिज़ाबेथ। एमिली के अनुसार, \"एलिज़ाबेथ एक शूरवीर है या एलिज़ाबेथ एक धूर्त है\"। लियम ने आपको बताया कि अगर एलिज़ाबेथ एक धूर्त है तो एमिली एक शूरवीर है। एलिज़ाबेथ ने कहा, \"लियम एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक शूरवीर है  \n(2) लियम एक शूरवीर है  \n(3) एलिज़ाबेथ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: माइकल, एवा, और हेनरी। जैसे माइकल ने कहा, \"एवा एक धूर्त है या एवा एक शूरवीर है\"। \"माइकल एक धूर्त नहीं है,\" एवा ने कहा। हेनरी के शब्दों में: \"माइकल एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक शूरवीर है  \n(2) एवा एक शूरवीर है  \n(3) हेनरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ओलिवर, अलेक्जेंडर, और मेसन। \"अलेक्जेंडर एक धूर्त है या अलेक्जेंडर एक शूरवीर है\" - ओलिवर। \"मेसन एक धूर्त नहीं है,\" अलेक्जेंडर ने कहा। मेसन ने नोट किया, \"मेसन एक शूरवीर है या ओलिवर एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिवर एक शूरवीर है  \n(2) अलेक्जेंडर एक शूरवीर है  \n(3) मेसन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: लिली, सैमुएल, और सोफिया। लिली के एक बयान में: \"सोफिया एक शूरवीर है या सैमुएल एक शूरवीर है\"। सैमुएल ने कहा, \"सोफिया एक शूरवीर है या लिली एक धूर्त है\"। जैसे सोफिया ने कहा, \"अगर सैमुएल एक धूर्त है तो सैमुएल एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लिली एक शूरवीर है  \n(2) सैमुएल एक शूरवीर है  \n(3) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: शार्लट, ल्यूक, और लियम। शार्लट ने कहा कि ल्यूक एक धूर्त है यदि और केवल यदि लियम एक धूर्त है। ल्यूक के शब्दों में: \"शार्लट एक शूरवीर नहीं है\"। \"शार्लट एक धूर्त है,\" लियम ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक शूरवीर है  \n(2) ल्यूक एक धूर्त है  \n(3) लियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: सेबेस्टियन, मैथ्यू, और लोगन। सेबेस्टियन को यह कहते हुए सुना गया, \"लोगन एक धूर्त है या सेबेस्टियन एक शूरवीर है\"। मैथ्यू के अनुसार, \"अगर लोगन एक शूरवीर है तो सेबेस्टियन एक धूर्त है\"। लोगन के अनुसार, \"मैथ्यू एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सेबेस्टियन एक धूर्त है  \n(2) मैथ्यू एक शूरवीर है  \n(3) लोगन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: लिली, हार्पर, और ल्यूक। लिली को यह कहते हुए सुना गया, \"हार्पर एक धूर्त है या ल्यूक एक शूरवीर है\"। हार्पर के अनुसार, \"अगर लिली एक धूर्त है तो ल्यूक एक धूर्त है\"। ल्यूक ने कहा, \"लिली एक शूरवीर है और लिली एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लिली एक धूर्त है  \n(2) हार्पर एक शूरवीर है  \n(3) ल्यूक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: जेम्स, अबिगेल, और एवा। जेम्स ने कहा, \"अबिगेल एक शूरवीर है\"। \"अबिगेल एक शूरवीर है यदि और केवल यदि जेम्स एक शूरवीर है,\" अबिगेल ने दावा किया। एवा ने कहा कि अबिगेल एक शूरवीर नहीं है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) अबिगेल एक शूरवीर है  \n(3) एवा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: विक्टोरिया, विलियम, और आरिया। विक्टोरिया ने कहा, \"आरिया एक धूर्त है या आरिया एक शूरवीर है\"। विलियम ने कहा कि विक्टोरिया एक धूर्त है या आरिया एक धूर्त है। \"विलियम एक शूरवीर है या विलियम एक धूर्त है,\" आरिया ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विक्टोरिया एक शूरवीर है  \n(2) विलियम एक धूर्त है  \n(3) आरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: सेबेस्टियन, शार्लट, और राइली। सेबेस्टियन ने कहा, \"राइली एक धूर्त है या सेबेस्टियन एक शूरवीर है\"। \"अगर सेबेस्टियन एक शूरवीर है तो शार्लट एक शूरवीर है\" - शार्लट। राइली के शब्दों में: \"सेबेस्टियन एक धूर्त है यदि और केवल यदि राइली एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सेबेस्टियन एक धूर्त है  \n(2) शार्लट एक शूरवीर है  \n(3) राइली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ओवेन, याकूब, और अमेलिया। ओवेन ने कहा कि याकूब शूरवीर नहीं है। याकूब ने कहा, \"अगर अमेलिया धूर्त है तो ओवेन शूरवीर है।\" अमेलिया ने टिप्पणी की, \"अगर ओवेन शूरवीर है तो ओवेन धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओवेन एक धूर्त है  \n(2) याकूब एक शूरवीर है  \n(3) अमेलिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: अलेक्जेंडर, लुकास, और डैनियल। \"लुकास एक धूर्त नहीं है\" - अलेक्जेंडर। लुकास ने आपको बताया कि डैनियल एक धूर्त नहीं है। \"लुकास एक शूरवीर है यदि और केवल यदि डैनियल एक शूरवीर है\" - डैनियल। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अलेक्जेंडर एक शूरवीर है  \n(2) लुकास एक शूरवीर है  \n(3) डैनियल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: सेबेस्टियन, आरिया, और बेंजामिन। \"आरिया एक धूर्त है या सेबेस्टियन एक शूरवीर है,\" सेबेस्टियन ने दावा किया। आरिया ने कहा, \"सेबेस्टियन एक धूर्त नहीं है।\" \"सेबेस्टियन एक शूरवीर है या बेंजामिन एक शूरवीर है,\" बेंजामिन ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सेबेस्टियन एक शूरवीर है  \n(2) आरिया एक शूरवीर है  \n(3) बेंजामिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: डैनियल, ईथन, और राइली। डैनियल ने आपको बताया कि ईथन एक धूर्त है या राइली एक धूर्त है। ईथन ने आपको बताया कि डैनियल एक शूरवीर है। \"डैनियल एक शूरवीर है यदि और केवल यदि डैनियल एक धूर्त है\" - राइली। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक शूरवीर है  \n(2) ईथन एक शूरवीर है  \n(3) राइली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एलिज़ाबेथ, ज़ोई, और मेसन। एलिज़ाबेथ ने कहा, \"मेसन एक शूरवीर है या ज़ोई एक शूरवीर है\"। ज़ोई ने कहा, \"मेसन एक धूर्त है यदि और केवल यदि मेसन एक शूरवीर है\"। \"एलिज़ाबेथ एक धूर्त है या एलिज़ाबेथ एक शूरवीर है,\" मेसन ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक शूरवीर है  \n(2) ज़ोई एक धूर्त है  \n(3) मेसन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: हार्पर, एमिली, और अबिगेल। हार्पर ने टिप्पणी की, \"अबिगेल एक शूरवीर है और एमिली एक धूर्त है\"। एमिली ने कहा, \"अबिगेल एक शूरवीर है\"। अबिगेल को यह कहते हुए सुना गया, \"हार्पर एक धूर्त है या अबिगेल एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक धूर्त है  \n(2) एमिली एक शूरवीर है  \n(3) अबिगेल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: लोगन, लुकास, और सोफिया। लोगन ने कहा, \"सोफिया एक शूरवीर है\"। लुकास ने कहा कि अगर सोफिया एक धूर्त है तो लोगन एक शूरवीर है। सोफिया ने कहा, \"लोगन एक धूर्त है यदि और केवल यदि लुकास एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक धूर्त है  \n(2) लुकास एक धूर्त है  \n(3) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: शार्लट, मिया, और एवलिन। शार्लट ने कहा, \"एवलिन एक शूरवीर है या मिया एक धूर्त है\"। मिया के अनुसार, \"शार्लट एक शूरवीर है\"। एवलिन ने कहा, \"शार्लट एक धूर्त है यदि और केवल यदि मिया एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक शूरवीर है  \n(2) मिया एक शूरवीर है  \n(3) एवलिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ग्रेस, पेनलोप, और शार्लट। \"अगर पेनलोप एक शूरवीर है तो पेनलोप एक धूर्त है,\" ग्रेस ने दावा किया। पेनलोप के शब्दों में: \"ग्रेस एक धूर्त है या ग्रेस एक शूरवीर है\"। शार्लट ने asserted किया: \"पेनलोप एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक धूर्त है  \n(2) पेनलोप एक शूरवीर है  \n(3) शार्लट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एलिज़ाबेथ, स्कारलेट, और शार्लट। एलिज़ाबेथ के एक बयान में: \"शार्लट एक शूरवीर है\"। स्कारलेट ने कहा, \"शार्लट एक धूर्त है\"। शार्लट ने टिप्पणी की, \"एलिज़ाबेथ एक शूरवीर है या स्कारलेट एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक शूरवीर है  \n(2) स्कारलेट एक धूर्त है  \n(3) शार्लट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ओलिविया, हार्पर, और ईथन। ओलिविया ने कहा, \"ओलिविया एक शूरवीर है या हार्पर एक धूर्त है।\" हार्पर ने कहा, \"ईथन एक धूर्त है यदि और केवल यदि ओलिविया एक शूरवीर है।\" ईथन के एक बयान में: \"हार्पर एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक धूर्त है  \n(2) हार्पर एक शूरवीर है  \n(3) ईथन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एवलिन, यूसुफ, और एमिली। \"यूसुफ एक शूरवीर है यदि और केवल यदि एमिली एक धूर्त है\" - एवलिन। यूसुफ ने आपको बताया कि एमिली एक शूरवीर है। एमिली के अनुसार, \"यूसुफ एक शूरवीर है या एवलिन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक धूर्त है  \n(2) यूसुफ एक शूरवीर है  \n(3) एमिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: स्कारलेट, एवा, और बेंजामिन। स्कारलेट को यह कहते हुए सुना गया, \"बेंजामिन एक शूरवीर है\"। एवा ने कहा कि स्कारलेट एक धूर्त है और स्कारलेट एक शूरवीर है। बेंजामिन के शब्दों में: \"बेंजामिन एक शूरवीर है यदि और केवल यदि स्कारलेट एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) स्कारलेट एक धूर्त है  \n(2) एवा एक धूर्त है  \n(3) बेंजामिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: डैनियल, इसाबेला, और विक्टोरिया। \"डैनियल एक शूरवीर है यदि और केवल यदि इसाबेला एक शूरवीर है,\" डैनियल ने घोषित किया। \"डैनियल एक शूरवीर है\" - इसाबेला। विक्टोरिया ने आपको बताया कि इसाबेला एक धूर्त है और इसाबेला एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक शूरवीर है  \n(2) इसाबेला एक शूरवीर है  \n(3) विक्टोरिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: लियम, ल्यूक, और मैथ्यू। लियम ने कहा, \"मैथ्यू एक धूर्त है यदि और केवल यदि ल्यूक एक धूर्त है\"। ल्यूक ने कहा, \"यदि मैथ्यू एक शूरवीर है तो मैथ्यू एक धूर्त है\"। \"ल्यूक एक शूरवीर है या ल्यूक एक धूर्त है,\" मैथ्यू ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक धूर्त है  \n(2) ल्यूक एक धूर्त है  \n(3) मैथ्यू एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: नूह, अमेलिया, और इसाबेला। नूह ने कहा, \"इसाबेला एक शूरवीर है यदि और केवल यदि इसाबेला एक धूर्त है\"। अमेलिया ने कहा, \"नूह एक धूर्त नहीं है\"। इसाबेला ने कहा, \"अमेलिया एक धूर्त है या इसाबेला एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक धूर्त है  \n(2) अमेलिया एक धूर्त है  \n(3) इसाबेला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: राइली, मिया, और मैथ्यू। राइली ने कहा, \"मिया एक धूर्त है या मैथ्यू एक धूर्त है\"। मिया ने कहा: \"मैथ्यू एक शूरवीर है\"। \"मैथ्यू एक शूरवीर है और राइली एक शूरवीर है,\" मैथ्यू ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक शूरवीर है  \n(2) मिया एक धूर्त है  \n(3) मैथ्यू एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: औरोरा, शार्लट, और जैक। औरोरा ने कहा, \"जैक एक शूरवीर है या शार्लट एक धूर्त है\"। शार्लट के अनुसार, \"औरोरा एक शूरवीर नहीं है\"। जैक ने टिप्पणी की, \"औरोरा एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) औरोरा एक शूरवीर है  \n(2) शार्लट एक धूर्त है  \n(3) जैक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: स्कारलेट, याकूब, और ऐडन। स्कारलेट ने कहा, \"ऐडन एक शूरवीर है या स्कारलेट एक शूरवीर है।\" \"ऐडन एक शूरवीर है या स्कारलेट एक शूरवीर है\" - याकूब। \"स्कारलेट एक धूर्त है या याकूब एक शूरवीर है\" - ऐडन। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) स्कारलेट एक शूरवीर है  \n(2) याकूब एक शूरवीर है  \n(3) ऐडन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: डैनियल, सोफिया, और लियम। डैनियल के एक बयान में: \"अगर लियम एक शूरवीर है तो सोफिया एक शूरवीर है\"। \"लियम एक धूर्त है या लियम एक शूरवीर है,\" सोफिया ने कहा। लियम ने कहा: \"सोफिया एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक शूरवीर है  \n(2) सोफिया एक शूरवीर है  \n(3) लियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एवरी, विक्टोरिया, और इसाबेला। एवरी ने कहा, \"इसाबेला धूर्त नहीं है।\" \"एवरी धूर्त नहीं है,\" विक्टोरिया ने घोषणा की। इसाबेला ने कहा, \"विक्टोरिया शूरवीर है या एवरी धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक शूरवीर है  \n(2) विक्टोरिया एक शूरवीर है  \n(3) इसाबेला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: बेंजामिन, ओलिविया, और यूसुफ। बेंजामिन ने आपको बताया कि अगर ओलिविया एक शूरवीर है तो ओलिविया एक धूर्त है। \"यूसुफ एक शूरवीर है या बेंजामिन एक शूरवीर है,\" ओलिविया ने घोषणा की। यूसुफ ने asserted: \"यूसुफ एक शूरवीर है या बेंजामिन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक धूर्त है  \n(2) ओलिविया एक शूरवीर है  \n(3) यूसुफ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: डेविड, मेसन, और हार्पर। \"अगर डेविड एक शूरवीर है तो मेसन एक शूरवीर है,\" डेविड ने कहा। मेसन ने कहा, \"डेविड एक शूरवीर है\"। हार्पर को यह कहते हुए सुना गया, \"डेविड एक शूरवीर है या हार्पर एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक शूरवीर है  \n(2) मेसन एक शूरवीर है  \n(3) हार्पर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: जेम्स, सोफिया, और एवलिन। \"एवलिन एक शूरवीर है या एवलिन एक धूर्त है\" - जेम्स। सोफिया ने कहा, \"सोफिया एक शूरवीर है और जेम्स एक धूर्त है\"। एवलिन के एक बयान में: \"सोफिया एक शूरवीर है और जेम्स एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) सोफिया एक धूर्त है  \n(3) एवलिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ओवेन, विलियम, और औरोरा। ओवेन ने कहा, \"औरोरा एक शूरवीर है या विलियम एक शूरवीर है\"। विलियम ने कहा, \"अगर ओवेन एक शूरवीर है तो ओवेन एक धूर्त है\"। औरोरा ने कहा, \"अगर विलियम एक शूरवीर है तो ओवेन एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ओवेन एक शूरवीर है  \n(2) विलियम एक धूर्त है  \n(3) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: नूह, याकूब, और सोफिया। नूह के एक बयान में: \"अगर सोफिया एक शूरवीर है तो याकूब एक शूरवीर है\"। याकूब ने कहा कि अगर सोफिया एक धूर्त है तो नूह एक शूरवीर है। सोफिया ने कहा कि नूह एक शूरवीर है या सोफिया एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक शूरवीर है  \n(2) याकूब एक शूरवीर है  \n(3) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: शार्लट, हेनरी, और राइली। शार्लट ने कहा, \"हेनरी एक शूरवीर है\"। हेनरी ने कहा: \"शार्लट एक धूर्त है यदि और केवल यदि हेनरी एक शूरवीर है\"। राइली ने टिप्पणी की, \"यदि हेनरी एक धूर्त है तो शार्लट एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक धूर्त है  \n(2) हेनरी एक धूर्त है  \n(3) राइली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: जैक, मेसन, और डैनियल। जैक ने कहा कि डैनियल एक धूर्त है यदि और केवल यदि डैनियल एक शूरवीर है। मेसन ने remarked किया, \"डैनियल एक शूरवीर है यदि और केवल यदि मेसन एक शूरवीर है\"। डैनियल ने कहा, \"जैक एक शूरवीर है यदि और केवल यदि मेसन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक एक धूर्त है  \n(2) मेसन एक शूरवीर है  \n(3) डैनियल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: लुकास, एवलिन, और जैक। लुकास ने आपको बताया कि एवलिन एक शूरवीर है यदि और केवल यदि जैक एक शूरवीर है। एवलिन के शब्दों में: \"एवलिन एक शूरवीर है या जैक एक शूरवीर है\"। \"यदि एवलिन एक शूरवीर है तो एवलिन एक धूर्त है,\" जैक ने घोषणा की। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) लुकास एक धूर्त है  \n(2) एवलिन एक शूरवीर है  \n(3) जैक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: लोगन, माइकल, और अलेक्जेंडर। लोगन ने कहा, \"अलेक्जेंडर एक धूर्त है यदि और केवल यदि लोगन एक शूरवीर है\"। माइकल ने कहा, \"लोगन एक धूर्त है\"। \"लोगन एक धूर्त है और माइकल एक शूरवीर है,\" अलेक्जेंडर ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक शूरवीर है  \n(2) माइकल एक धूर्त है  \n(3) अलेक्जेंडर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ल्यूक, ज़ोई, और एलिज़ाबेथ। ल्यूक ने कहा, \"एलिज़ाबेथ एक धूर्त नहीं है\"। ज़ोई ने कहा: \"अगर एलिज़ाबेथ एक शूरवीर है तो ल्यूक एक धूर्त है\"। एलिज़ाबेथ के अनुसार, \"एलिज़ाबेथ एक शूरवीर है यदि और केवल यदि ज़ोई एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) ज़ोई एक धूर्त है  \n(3) एलिज़ाबेथ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: बेंजामिन, सोफिया, और सैमुएल। बेंजामिन ने टिप्पणी की, \"सैमुएल एक शूरवीर है यदि और केवल यदि सैमुएल एक धूर्त है\"। सोफिया ने कहा, \"सैमुएल एक धूर्त है यदि और केवल यदि बेंजामिन एक धूर्त है।\" सैमुएल ने remarked किया, \"सोफिया एक शूरवीर है और बेंजामिन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक धूर्त है  \n(2) सोफिया एक शूरवीर है  \n(3) सैमुएल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: मिया, ओलिवर, और ज़ोई। मिया ने कहा, \"ज़ोई एक धूर्त है यदि और केवल यदि मिया एक शूरवीर है।\" \"मिया एक धूर्त है,\" ओलिवर ने दावा किया। ज़ोई ने कहा कि ओलिवर एक शूरवीर है या ज़ोई एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक शूरवीर है  \n(2) ओलिवर एक धूर्त है  \n(3) ज़ोई एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: माइकल, मिया, और ऐडन। माइकल ने कहा: \"ऐडन एक शूरवीर है\"। मिया ने आपको बताया कि माइकल एक धूर्त है यदि और केवल यदि मिया एक शूरवीर है। \"मिया एक धूर्त है या ऐडन एक शूरवीर है\" - ऐडन। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक धूर्त है  \n(2) मिया एक शूरवीर है  \n(3) ऐडन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: औरोरा, हार्पर, और अमेलिया। औरोरा ने कहा, \"अमेलिया एक धूर्त है और हार्पर एक धूर्त है\"। हार्पर ने कहा, \"अगर अमेलिया एक धूर्त है तो अमेलिया एक शूरवीर है\"। अमेलिया ने टिप्पणी की, \"हार्पर एक शूरवीर है और औरोरा एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) औरोरा एक शूरवीर है  \n(2) हार्पर एक धूर्त है  \n(3) अमेलिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: डेविड, डैनियल, और एवलिन। डेविड के शब्दों में: \"डैनियल एक शूरवीर है और एवलिन एक शूरवीर है\"। डैनियल ने टिप्पणी की, \"एवलिन एक शूरवीर है यदि और केवल यदि डेविड एक शूरवीर है\"। एवलिन ने कहा कि डैनियल एक धूर्त नहीं है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक शूरवीर है  \n(2) डैनियल एक शूरवीर है  \n(3) एवलिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: जैक्सन, एवरी, और डैनियल। जैक्सन के एक बयान में: \"अगर डैनियल एक शूरवीर है तो एवरी एक शूरवीर है।\" \"डैनियल एक धूर्त है या एवरी एक शूरवीर है,\" एवरी ने घोषणा की। डैनियल ने आपको बताया कि अगर डैनियल एक शूरवीर है तो एवरी एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक धूर्त है  \n(2) एवरी एक धूर्त है  \n(3) डैनियल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: यूसुफ, एम्मा, और ग्रेस। यूसुफ ने आपको बताया कि एम्मा एक धूर्त है। \"ग्रेस एक धूर्त है या ग्रेस एक शूरवीर है,\" एम्मा ने दावा किया। ग्रेस ने कहा, \"अगर एम्मा एक धूर्त है तो यूसुफ एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) यूसुफ एक धूर्त है  \n(2) एम्मा एक शूरवीर है  \n(3) ग्रेस एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एवा, एला, और सेबेस्टियन। \"एला एक शूरवीर है और एला एक धूर्त है\" - एवा। जैसा कि एला ने कहा, \"एवा एक शूरवीर है और एवा एक धूर्त है\"। सेबेस्टियन ने कहा कि एवा एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक धूर्त है  \n(2) एला एक धूर्त है  \n(3) सेबेस्टियन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ज़ोई, जेम्स, और यूसुफ। \"अगर ज़ोई एक शूरवीर है तो जेम्स एक शूरवीर है,\" ज़ोई ने दावा किया। जेम्स ने asserted किया: \"यूसुफ एक शूरवीर है\"। यूसुफ को यह कहते हुए सुना गया, \"जेम्स एक धूर्त है या यूसुफ एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ज़ोई एक शूरवीर है  \n(2) जेम्स एक शूरवीर है  \n(3) यूसुफ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: राइली, सैमुएल, और पेनलोप। राइली ने कहा, \"पेनलोप एक शूरवीर है और सैमुएल एक शूरवीर है।\" \"पेनलोप एक शूरवीर है यदि और केवल यदि सैमुएल एक शूरवीर है\" - सैमुएल। पेनलोप ने कहा कि यदि पेनलोप एक शूरवीर है तो राइली एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक शूरवीर है  \n(2) सैमुएल एक शूरवीर है  \n(3) पेनलोप एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: सैमुएल, अबिगेल, और जैक्सन। सैमुएल ने कहा, \"जैक्सन एक शूरवीर है या जैक्सन एक धूर्त है\"। अबिगेल ने कहा, \"सैमुएल एक शूरवीर है यदि और केवल यदि सैमुएल एक धूर्त है।\" जैक्सन ने कहा, \"सैमुएल एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक शूरवीर है  \n(2) अबिगेल एक धूर्त है  \n(3) जैक्सन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ओलिवर, सोफिया, और अलेक्जेंडर। ओलिवर ने टिप्पणी की, \"सोफिया एक शूरवीर है और अलेक्जेंडर एक धूर्त है\"। सोफिया के अनुसार, \"ओलिवर एक शूरवीर है या अलेक्जेंडर एक धूर्त है\"। \"ओलिवर एक धूर्त है और ओलिवर एक शूरवीर है\" - अलेक्जेंडर। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिवर एक शूरवीर है  \n(2) सोफिया एक शूरवीर है  \n(3) अलेक्जेंडर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: मैथ्यू, नूह, और शार्लट। मैथ्यू ने आपको बताया कि अगर नूह एक धूर्त है तो मैथ्यू एक शूरवीर है। नूह ने टिप्पणी की, \"मैथ्यू एक धूर्त है यदि और केवल यदि नूह एक शूरवीर है\"। शार्लट ने टिप्पणी की, \"मैथ्यू एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक धूर्त है  \n(2) नूह एक धूर्त है  \n(3) शार्लट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एवरी, औरोरा, और नूह। \"नूह एक धूर्त है यदि और केवल यदि औरोरा एक शूरवीर है,\" एवरी ने कहा। \"औरोरा एक शूरवीर है यदि और केवल यदि नूह एक शूरवीर है\" - औरोरा। नूह ने कहा कि औरोरा एक धूर्त है और एवरी एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक शूरवीर है  \n(2) औरोरा एक धूर्त है  \n(3) नूह एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ईथन, एवा, और पेनलोप। ईथन के शब्दों में: \"पेनलोप एक शूरवीर है\"। एवा ने कहा कि पेनलोप एक धूर्त है और ईथन एक धूर्त है। जैसे पेनलोप ने कहा, \"ईथन एक धूर्त है यदि और केवल यदि एवा एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक शूरवीर है  \n(2) एवा एक धूर्त है  \n(3) पेनलोप एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: विक्टोरिया, अलेक्जेंडर, और एम्मा। विक्टोरिया को यह कहते हुए सुना गया, \"अलेक्जेंडर एक शूरवीर है यदि और केवल यदि एम्मा एक शूरवीर है।\" \"विक्टोरिया एक धूर्त है और एम्मा एक शूरवीर है,\" अलेक्जेंडर ने कहा। एम्मा ने कहा, \"एम्मा एक शूरवीर है और अलेक्जेंडर एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विक्टोरिया एक शूरवीर है  \n(2) अलेक्जेंडर एक धूर्त है  \n(3) एम्मा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: आरिया, याकूब, और जैक्सन। आरिया ने कहा कि याकूब एक धूर्त है। याकूब ने कहा कि जैक्सन एक शूरवीर है या जैक्सन एक धूर्त है। जैक्सन के एक बयान में: \"आरिया एक धूर्त है यदि और केवल यदि याकूब एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) आरिया एक धूर्त है  \n(2) याकूब एक शूरवीर है  \n(3) जैक्सन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: नूह, हेनरी, और शार्लट। नूह ने कहा, \"शार्लट एक धूर्त है और हेनरी एक धूर्त है।\" \"हेनरी एक शूरवीर है यदि और केवल यदि नूह एक धूर्त है,\" हेनरी ने कहा। शार्लट ने टिप्पणी की, \"हेनरी एक शूरवीर है और हेनरी एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक धूर्त है  \n(2) हेनरी एक शूरवीर है  \n(3) शार्लट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ओलिविया, लोगन, और ऐडन। ओलिविया ने कहा, \"अगर ओलिविया एक शूरवीर है तो लोगन एक शूरवीर है\"। लोगन के अनुसार, \"ओलिविया एक धूर्त है यदि और केवल यदि ऐडन एक शूरवीर है\"। जैसे ऐडन ने कहा, \"अगर लोगन एक शूरवीर है तो ओलिविया एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ओलिविया एक शूरवीर है  \n(2) लोगन एक शूरवीर है  \n(3) ऐडन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: हेनरी, एवा, और विलियम। हेनरी ने कहा कि विलियम एक शूरवीर है और विलियम एक धूर्त है। एवा ने टिप्पणी की, \"विलियम एक धूर्त है यदि और केवल यदि विलियम एक शूरवीर है।\" \"हेनरी एक शूरवीर है और एवा एक धूर्त है,\" विलियम ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हेनरी एक धूर्त है  \n(2) एवा एक धूर्त है  \n(3) विलियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ओवेन, विक्टोरिया, और राइली। ओवेन ने कहा, \"राइली एक शूरवीर है और विक्टोरिया एक शूरवीर है\"। विक्टोरिया ने asserted किया: \"ओवेन एक धूर्त है और राइली एक शूरवीर है\"। राइली ने टिप्पणी की, \"राइली एक शूरवीर है और विक्टोरिया एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ओवेन एक धूर्त है  \n(2) विक्टोरिया एक धूर्त है  \n(3) राइली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: विलियम, मिया, और एमिली। विलियम ने टिप्पणी की, \"अगर एमिली एक धूर्त है तो एमिली एक शूरवीर है\"। मिया ने कहा, \"विलियम एक धूर्त है\"। एमिली के अनुसार, \"मिया एक शूरवीर है यदि और केवल यदि विलियम एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक धूर्त है  \n(2) मिया एक शूरवीर है  \n(3) एमिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: अलेक्जेंडर, सोफिया, और लिली। अलेक्जेंडर के अनुसार, \"लिली एक धूर्त है यदि और केवल यदि सोफिया एक धूर्त है\"। सोफिया के अनुसार, \"अलेक्जेंडर एक धूर्त है या लिली एक शूरवीर है\"। \"अलेक्जेंडर एक शूरवीर है या सोफिया एक शूरवीर है,\" लिली ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अलेक्जेंडर एक शूरवीर है  \n(2) सोफिया एक शूरवीर है  \n(3) लिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: विक्टोरिया, विलियम, और मिया। विक्टोरिया ने आपको बताया कि मिया एक शूरवीर है और विलियम एक शूरवीर है। विलियम ने कहा, \"विक्टोरिया एक धूर्त है यदि और केवल यदि विक्टोरिया एक शूरवीर है\"। मिया ने कहा, \"विलियम एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विक्टोरिया एक धूर्त है  \n(2) विलियम एक धूर्त है  \n(3) मिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: हेनरी, लोगन, और लियम। \"अगर लोगन एक धूर्त है तो लियम एक धूर्त है,\" हेनरी ने दावा किया। लोगन ने कहा कि हेनरी एक शूरवीर है या हेनरी एक धूर्त है। लियम के अनुसार, \"अगर लोगन एक शूरवीर है तो हेनरी एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हेनरी एक शूरवीर है  \n(2) लोगन एक शूरवीर है  \n(3) लियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: आरिया, एवा, और ओलिविया। आरिया ने कहा, \"अगर एवा एक शूरवीर है तो ओलिविया एक धूर्त है।\" \"ओलिविया एक धूर्त है\" - एवा। ओलिविया ने कहा, \"एवा एक धूर्त है यदि और केवल यदि ओलिविया एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) आरिया एक शूरवीर है  \n(2) एवा एक धूर्त है  \n(3) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एवरी, स्कारलेट, और ओलिवर। एवरी के एक बयान में: \"अगर एवरी एक शूरवीर है तो ओलिवर एक धूर्त है\"। स्कारलेट ने कहा, \"एवरी एक शूरवीर नहीं है\"। ओलिवर ने कहा, \"एवरी एक धूर्त है और एवरी एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक शूरवीर है  \n(2) स्कारलेट एक धूर्त है  \n(3) ओलिवर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एवा, एवलिन, और अमेलिया। \"अगर एवा एक शूरवीर है तो एवलिन एक धूर्त है,\" एवा ने घोषणा की। एवलिन ने कहा, \"एवा एक शूरवीर नहीं है।\" अमेलिया ने कहा कि एवा एक धूर्त है और एवलिन एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक शूरवीर है  \n(2) एवलिन एक धूर्त है  \n(3) अमेलिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एवरी, ल्यूक, और हेनरी। एवरी ने कहा, \"एवरी एक शूरवीर है यदि और केवल यदि हेनरी एक शूरवीर है।\" ल्यूक ने आपको बताया कि हेनरी एक धूर्त है। \"यदि ल्यूक एक धूर्त है तो एवरी एक धूर्त है,\" हेनरी ने घोषणा की। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एवरी एक धूर्त है  \n(2) ल्यूक एक धूर्त है  \n(3) हेनरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: मेसन, हेनरी, और हार्पर। मेसन ने टिप्पणी की, \"हार्पर एक शूरवीर है यदि और केवल यदि मेसन एक शूरवीर है\"। हेनरी के अनुसार, \"यदि हार्पर एक शूरवीर है तो मेसन एक धूर्त है\"। हार्पर को यह कहते हुए सुना गया, \"मेसन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) हेनरी एक शूरवीर है  \n(3) हार्पर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एम्मा, स्कारलेट, और विक्टोरिया। \"विक्टोरिया शूरवीर नहीं है,\" एम्मा ने दावा किया। स्कारलेट ने आपको बताया कि एम्मा एक धूर्त है और स्कारलेट एक शूरवीर है। विक्टोरिया के एक बयान में: \"स्कारलेट शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एम्मा एक धूर्त है  \n(2) स्कारलेट एक धूर्त है  \n(3) विक्टोरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: सैमुएल, शार्लट, और जेम्स। सैमुएल ने कहा कि शार्लट एक शूरवीर है यदि और केवल यदि शार्लट एक धूर्त है। \"सैमुएल एक धूर्त नहीं है,\" शार्लट ने दावा किया। जैसा कि जेम्स ने कहा, \"शार्लट एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक धूर्त है  \n(2) शार्लट एक धूर्त है  \n(3) जेम्स एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ज़ोई, हार्पर, और क्लोई। जैसे ज़ोई ने कहा, \"हार्पर एक शूरवीर है और क्लोई एक धूर्त है\"। जैसे हार्पर ने कहा, \"क्लोई एक शूरवीर नहीं है\"। \"ज़ोई एक शूरवीर है यदि और केवल यदि हार्पर एक शूरवीर है,\" क्लोई ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ज़ोई एक धूर्त है  \n(2) हार्पर एक धूर्त है  \n(3) क्लोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: सैमुएल, अमेलिया, और एलिज़ाबेथ। सैमुएल ने टिप्पणी की, \"अमेलिया एक शूरवीर नहीं है\"। अमेलिया ने टिप्पणी की, \"एलिज़ाबेथ एक धूर्त नहीं है\"। \"अमेलिया एक शूरवीर है यदि और केवल यदि सैमुएल एक धूर्त है,\" एलिज़ाबेथ ने दावा किया। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सैमुएल एक धूर्त है  \n(2) अमेलिया एक शूरवीर है  \n(3) एलिज़ाबेथ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: बेंजामिन, डैनियल, और हार्पर। बेंजामिन के अनुसार, \"हार्पर एक धूर्त है और डैनियल एक धूर्त है\"। डैनियल ने कहा, \"बेंजामिन एक धूर्त है या हार्पर एक धूर्त है\"। हार्पर ने कहा, \"डैनियल एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक धूर्त है  \n(2) डैनियल एक शूरवीर है  \n(3) हार्पर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ईथन, एवरी, और लियम। \"लियम एक धूर्त है यदि और केवल यदि लियम एक शूरवीर है,\" ईथन ने घोषणा की। एवरी ने कहा, \"लियम एक धूर्त है या ईथन एक धूर्त है।\" लियम ने कहा कि ईथन एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक धूर्त है  \n(2) एवरी एक शूरवीर है  \n(3) लियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: सोफिया, मिया, और एमिली। सोफिया के शब्दों में: \"मिया एक धूर्त है या मिया एक शूरवीर है\"। मिया ने कहा, \"मिया एक शूरवीर है या सोफिया एक शूरवीर है\"। एमिली के शब्दों में: \"सोफिया एक धूर्त है या सोफिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) मिया एक शूरवीर है  \n(3) एमिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: याकूब, एलिज़ाबेथ, और जैक्सन। याकूब ने कहा कि याकूब एक शूरवीर है यदि और केवल यदि जैक्सन एक शूरवीर है। \"यदि जैक्सन एक धूर्त है तो जैक्सन एक शूरवीर है,\" एलिज़ाबेथ ने दावा किया। \"एलिज़ाबेथ एक शूरवीर है यदि और केवल यदि याकूब एक धूर्त है,\" जैक्सन ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) याकूब एक धूर्त है  \n(2) एलिज़ाबेथ एक शूरवीर है  \n(3) जैक्सन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: पेनलोप, स्कारलेट, और मैथ्यू। पेनलोप ने कहा, \"स्कारलेट एक धूर्त है यदि और केवल यदि मैथ्यू एक धूर्त है\"। स्कारलेट ने कहा, \"मैथ्यू एक शूरवीर है या पेनलोप एक शूरवीर है\"। मैथ्यू ने कहा कि स्कारलेट एक धूर्त नहीं है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक शूरवीर है  \n(2) स्कारलेट एक शूरवीर है  \n(3) मैथ्यू एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: हार्पर, एवा, और लुकास। हार्पर को यह कहते हुए सुना गया, \"एवा एक धूर्त है यदि और केवल यदि लुकास एक शूरवीर है\"। एवा ने कहा कि लुकास एक धूर्त है और हार्पर एक धूर्त है। लुकास के एक बयान में: \"एवा एक धूर्त है या हार्पर एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक शूरवीर है  \n(2) एवा एक धूर्त है  \n(3) लुकास एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ज़ोई, मेसन, और राइली। ज़ोई ने कहा, \"मेसन एक धूर्त है यदि और केवल यदि राइली एक धूर्त है\"। जैसे मेसन ने कहा, \"मेसन एक शूरवीर है और राइली एक शूरवीर है\"। राइली को यह कहते हुए सुना गया, \"ज़ोई एक धूर्त है या मेसन एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ज़ोई एक धूर्त है  \n(2) मेसन एक धूर्त है  \n(3) राइली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: अमेलिया, ल्यूक, और अबिगेल। \"अबिगेल एक धूर्त है या ल्यूक एक धूर्त है\" - अमेलिया। \"अमेलिया एक धूर्त है या ल्यूक एक शूरवीर है,\" ल्यूक ने दावा किया। अबिगेल ने कहा, \"यदि अबिगेल एक शूरवीर है तो ल्यूक एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक शूरवीर है  \n(2) ल्यूक एक धूर्त है  \n(3) अबिगेल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: अमेलिया, लोगन, और याकूब। \"अगर लोगन एक धूर्त है तो याकूब एक शूरवीर है,\" अमेलिया ने घोषणा की। लोगन ने आपको बताया कि अगर अमेलिया एक धूर्त है तो याकूब एक धूर्त है। याकूब ने टिप्पणी की, \"अमेलिया एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक शूरवीर है  \n(2) लोगन एक शूरवीर है  \n(3) याकूब एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: विलियम, मैथ्यू, और स्कारलेट। विलियम ने कहा: \"मैथ्यू एक धूर्त है यदि और केवल यदि स्कारलेट एक धूर्त है\"। मैथ्यू ने कहा: \"स्कारलेट एक धूर्त है और विलियम एक शूरवीर है\"। स्कारलेट ने आपको बताया कि स्कारलेट एक शूरवीर है यदि और केवल यदि मैथ्यू एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक धूर्त है  \n(2) मैथ्यू एक धूर्त है  \n(3) स्कारलेट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: हार्पर, मेसन, और राइली। हार्पर को यह कहते हुए सुना गया, \"मेसन एक शूरवीर है या मेसन एक धूर्त है\"। मेसन के अनुसार, \"राइली एक शूरवीर है और हार्पर एक धूर्त है\"। \"अगर राइली एक शूरवीर है तो हार्पर एक शूरवीर है,\" राइली ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक शूरवीर है  \n(2) मेसन एक धूर्त है  \n(3) राइली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एमिली, ल्यूक, और जैक। एमिली के अनुसार, \"ल्यूक एक शूरवीर है या ल्यूक एक धूर्त है\"। ल्यूक के अनुसार, \"एमिली एक शूरवीर है और एमिली एक धूर्त है\"। जैक के अनुसार, \"ल्यूक एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक शूरवीर है  \n(2) ल्यूक एक धूर्त है  \n(3) जैक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: जेम्स, ओवेन, और लोगन। जेम्स के शब्दों में: \"ओवेन एक शूरवीर है यदि और केवल यदि लोगन एक धूर्त है\"। जैसे ओवेन ने कहा, \"जेम्स एक धूर्त है यदि और केवल यदि ओवेन एक शूरवीर है\"। लोगन के शब्दों में: \"ओवेन एक शूरवीर है या ओवेन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक धूर्त है  \n(2) ओवेन एक शूरवीर है  \n(3) लोगन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: पेनलोप, एवरी, और यूसुफ। पेनलोप ने आपको बताया कि यूसुफ एक शूरवीर है। \"एवरी एक शूरवीर है या यूसुफ एक धूर्त है,\" एवरी ने घोषणा की। \"अगर यूसुफ एक शूरवीर है तो एवरी एक धूर्त है,\" यूसुफ ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक शूरवीर है  \n(2) एवरी एक धूर्त है  \n(3) यूसुफ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: शार्लट, स्कारलेट, और क्लोई। शार्लट ने कहा कि स्कारलेट एक शूरवीर है यदि और केवल यदि स्कारलेट एक धूर्त है। स्कारलेट को यह कहते हुए सुना गया, \"शार्लट एक शूरवीर है यदि और केवल यदि क्लोई एक शूरवीर है\"। क्लोई के अनुसार, \"क्लोई एक शूरवीर है या स्कारलेट एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक धूर्त है  \n(2) स्कारलेट एक धूर्त है  \n(3) क्लोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एम्मा, हेनरी, और इसाबेला। \"हेनरी एक शूरवीर है\" - एम्मा। हेनरी ने कहा, \"एम्मा एक धूर्त है या एम्मा एक शूरवीर है\"। \"हेनरी एक धूर्त है,\" इसाबेला ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एम्मा एक शूरवीर है  \n(2) हेनरी एक शूरवीर है  \n(3) इसाबेला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: नूह, राइली, और औरोरा। नूह ने कहा कि राइली एक धूर्त है और राइली एक शूरवीर है। राइली ने कहा कि औरोरा एक शूरवीर है और नूह एक शूरवीर है। औरोरा ने आपको बताया कि नूह एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक धूर्त है  \n(2) राइली एक धूर्त है  \n(3) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: पेनलोप, औरोरा, और लियम। \"लियम एक धूर्त है\" - पेनलोप। औरोरा ने कहा कि लियम एक शूरवीर नहीं है। \"पेनलोप एक धूर्त है और पेनलोप एक शूरवीर है\" - लियम। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक शूरवीर है  \n(2) औरोरा एक शूरवीर है  \n(3) लियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ज़ोई, नूह, और डैनियल। ज़ोई ने कहा: \"ज़ोई एक शूरवीर है\"। नूह के शब्दों में: \"ज़ोई एक धूर्त है या डैनियल एक शूरवीर है\"। \"नूह एक धूर्त है,\" डैनियल ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ज़ोई एक धूर्त है  \n(2) नूह एक शूरवीर है  \n(3) डैनियल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ओलिविया, स्कारलेट, और डैनियल। ओलिविया ने कहा, \"डैनियल शूरवीर नहीं है।\" स्कारलेट के अनुसार, \"अगर स्कारलेट शूरवीर है तो ओलिविया धूर्त है।\" डैनियल ने कहा, \"डैनियल शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक धूर्त है  \n(2) स्कारलेट एक शूरवीर है  \n(3) डैनियल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ओलिवर, ईथन, और डैनियल। \"अगर ओलिवर एक शूरवीर है तो डैनियल एक शूरवीर है\" - ओलिवर। ईथन ने कहा: \"ईथन एक शूरवीर है\"। डैनियल ने कहा, \"ओलिवर एक धूर्त है या ईथन एक शूरवीर है।\" तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ओलिवर एक शूरवीर है  \n(2) ईथन एक शूरवीर है  \n(3) डैनियल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: नूह, माइकल, और लियम। नूह ने कहा, \"अगर माइकल एक धूर्त है तो लियम एक धूर्त है\"। माइकल ने टिप्पणी की, \"माइकल एक शूरवीर है यदि और केवल यदि लियम एक शूरवीर है\"। जैसा कि लियम ने कहा, \"नूह एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक धूर्त है  \n(2) माइकल एक धूर्त है  \n(3) लियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एम्मा, इसाबेला, और औरोरा। एम्मा के अनुसार, \"अगर एम्मा एक शूरवीर है तो इसाबेला एक धूर्त है\"। इसाबेला ने कहा कि इसाबेला एक शूरवीर है। औरोरा के एक बयान में: \"औरोरा एक शूरवीर है और एम्मा एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एम्मा एक शूरवीर है  \n(2) इसाबेला एक धूर्त है  \n(3) औरोरा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एवा, विलियम, और औरोरा। एवा ने कहा, \"विलियम एक शूरवीर है यदि और केवल यदि विलियम एक धूर्त है।\" \"एवा एक धूर्त है,\" विलियम ने कहा। औरोरा ने कहा कि विलियम एक धूर्त है या एवा एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक धूर्त है  \n(2) विलियम एक शूरवीर है  \n(3) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एला, सोफिया, और डेविड। \"सोफिया एक शूरवीर है,\" एला ने कहा। सोफिया ने कहा, \"अगर डेविड एक धूर्त है तो डेविड एक शूरवीर है।\" डेविड के शब्दों में: \"एला एक धूर्त है या एला एक शूरवीर है।\" तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एला एक शूरवीर है  \n(2) सोफिया एक शूरवीर है  \n(3) डेविड एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: मैथ्यू, स्कारलेट, और ईथन। मैथ्यू ने आपको बताया कि मैथ्यू एक शूरवीर है और स्कारलेट एक शूरवीर है। स्कारलेट ने कहा, \"मैथ्यू एक धूर्त है और ईथन एक शूरवीर है।\" जैसे कि ईथन ने कहा, \"मैथ्यू एक शूरवीर है।\" तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) मैथ्यू एक धूर्त है  \n(2) स्कारलेट एक धूर्त है  \n(3) ईथन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: लुकास, एवा, और सेबेस्टियन। \"एवा शूरवीर नहीं है,\" लुकास ने कहा। एवा को यह कहते हुए सुना गया, \"एवा शूरवीर है यदि और केवल यदि सेबेस्टियन धूर्त है।\" सेबेस्टियन को यह कहते हुए सुना गया, \"लुकास शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक धूर्त है  \n(2) एवा एक शूरवीर है  \n(3) सेबेस्टियन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: याकूब, सेबेस्टियन, और लुकास। याकूब ने कहा कि सेबेस्टियन एक धूर्त नहीं है। \"याकूब एक शूरवीर है और याकूब एक धूर्त है,\" सेबेस्टियन ने कहा। लुकास ने कहा, \"सेबेस्टियन एक धूर्त है या याकूब एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) याकूब एक धूर्त है  \n(2) सेबेस्टियन एक धूर्त है  \n(3) लुकास एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: राइली, विलियम, और डैनियल। राइली ने टिप्पणी की, \"राइली एक शूरवीर है यदि और केवल यदि डैनियल एक शूरवीर है।\" \"राइली एक धूर्त नहीं है,\" विलियम ने घोषित किया। \"विलियम एक धूर्त नहीं है,\" डैनियल ने घोषित किया। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) राइली एक शूरवीर है  \n(2) विलियम एक शूरवीर है  \n(3) डैनियल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: इसाबेला, विक्टोरिया, और जैक्सन। इसाबेला ने कहा, \"विक्टोरिया एक धूर्त नहीं है\"। \"जैक्सन एक शूरवीर है यदि और केवल यदि इसाबेला एक धूर्त है\" - विक्टोरिया। जैक्सन ने asserted किया: \"जैक्सन एक शूरवीर है यदि और केवल यदि विक्टोरिया एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक धूर्त है  \n(2) विक्टोरिया एक धूर्त है  \n(3) जैक्सन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: इसाबेला, अबिगेल, और मैथ्यू। \"अबिगेल एक शूरवीर है और मैथ्यू एक धूर्त है,\" इसाबेला ने घोषणा की। \"इसाबेला एक धूर्त है यदि और केवल यदि इसाबेला एक शूरवीर है,\" अबिगेल ने घोषणा की। मैथ्यू ने कहा कि यदि इसाबेला एक धूर्त है तो अबिगेल एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक धूर्त है  \n(2) अबिगेल एक धूर्त है  \n(3) मैथ्यू एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ग्रेस, ओवेन, और जैक। ग्रेस ने कहा कि ओवेन एक धूर्त है। ओवेन ने कहा, \"जैक एक शूरवीर है।\" जैक ने कहा, \"ओवेन एक धूर्त है यदि और केवल यदि ग्रेस एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक धूर्त है  \n(2) ओवेन एक शूरवीर है  \n(3) जैक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: यूसुफ, अमेलिया, और ओलिविया। यूसुफ ने कहा, \"ओलिविया एक शूरवीर है यदि और केवल यदि ओलिविया एक धूर्त है।\" अमेलिया ने कहा, \"यूसुफ एक शूरवीर है।\" ओलिविया को यह कहते हुए सुना गया, \"अमेलिया एक शूरवीर नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) यूसुफ एक धूर्त है  \n(2) अमेलिया एक धूर्त है  \n(3) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ओलिविया, हेनरी, और अमेलिया। \"ओलिविया एक शूरवीर है\" - ओलिविया। हेनरी ने कहा, \"अमेलिया एक धूर्त है यदि और केवल यदि ओलिविया एक धूर्त है\"। अमेलिया ने टिप्पणी की, \"यदि हेनरी एक धूर्त है तो ओलिविया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक शूरवीर है  \n(2) हेनरी एक शूरवीर है  \n(3) अमेलिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ईथन, लुकास, और विलियम। ईथन ने कहा, \"लुकास एक शूरवीर है और विलियम एक शूरवीर है\"। लुकास के एक बयान में: \"ईथन एक धूर्त है और विलियम एक धूर्त है\"। \"अगर ईथन एक शूरवीर है तो लुकास एक धूर्त है,\" विलियम ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक धूर्त है  \n(2) लुकास एक धूर्त है  \n(3) विलियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: लियम, इसाबेला, और एवलिन। लियम ने कहा, \"इसाबेला एक धूर्त है और लियम एक शूरवीर है।\" इसाबेला के अनुसार, \"एवलिन एक शूरवीर नहीं है।\" \"लियम एक धूर्त है,\" एवलिन ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक धूर्त है  \n(2) इसाबेला एक धूर्त है  \n(3) एवलिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ओवेन, अलेक्जेंडर, और नूह। \"अलेक्जेंडर एक शूरवीर है,\" ओवेन ने घोषणा की। अलेक्जेंडर ने कहा कि अगर ओवेन एक धूर्त है तो नूह एक धूर्त है। नूह ने कहा कि अलेक्जेंडर एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओवेन एक शूरवीर है  \n(2) अलेक्जेंडर एक शूरवीर है  \n(3) नूह एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: विलियम, शार्लट, और यूसुफ। विलियम के शब्दों में: \"शार्लट एक शूरवीर है और शार्लट एक धूर्त है\"। शार्लट ने कहा, \"यूसुफ एक शूरवीर है और विलियम एक शूरवीर है\"। \"शार्लट एक शूरवीर नहीं है,\" यूसुफ ने उल्लेख किया। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) विलियम एक धूर्त है  \n(2) शार्लट एक धूर्त है  \n(3) यूसुफ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: जैक्सन, लिली, और सेबेस्टियन। जैक्सन ने टिप्पणी की, \"सेबेस्टियन एक शूरवीर है और जैक्सन एक शूरवीर है\"। \"जैक्सन एक धूर्त है यदि और केवल यदि जैक्सन एक शूरवीर है,\" लिली ने दावा किया। सेबेस्टियन को यह कहते हुए सुना गया, \"जैक्सन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक धूर्त है  \n(2) लिली एक धूर्त है  \n(3) सेबेस्टियन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: क्लोई, अलेक्जेंडर, और ईथन। क्लोई के अनुसार, \"अलेक्जेंडर एक धूर्त है और अलेक्जेंडर एक शूरवीर है\"। अलेक्जेंडर ने कहा, \"अलेक्जेंडर एक शूरवीर है या क्लोई एक धूर्त है\"। ईथन ने कहा: \"क्लोई एक धूर्त है और अलेक्जेंडर एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) क्लोई एक धूर्त है  \n(2) अलेक्जेंडर एक शूरवीर है  \n(3) ईथन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एमिली, एला, और ओलिविया। एमिली ने कहा, \"एला एक शूरवीर है\"। एला के शब्दों में: \"एमिली एक धूर्त है और ओलिविया एक धूर्त है\"। ओलिविया को यह कहते हुए सुना गया, \"एला एक धूर्त है और ओलिविया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक धूर्त है  \n(2) एला एक धूर्त है  \n(3) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: बेंजामिन, शार्लट, और ओवेन। बेंजामिन ने कहा, \"शार्लट एक शूरवीर है या शार्लट एक धूर्त है।\" \"बेंजामिन एक धूर्त है यदि और केवल यदि ओवेन एक धूर्त है\" - शार्लट। \"शार्लट एक धूर्त है या ओवेन एक शूरवीर है\" - ओवेन। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) बेंजामिन एक शूरवीर है  \n(2) शार्लट एक शूरवीर है  \n(3) ओवेन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: लियम, बेंजामिन, और हेनरी। लियम ने कहा, \"अगर बेंजामिन एक शूरवीर है तो हेनरी एक धूर्त है\"। बेंजामिन को यह कहते हुए सुना गया, \"हेनरी एक धूर्त है और हेनरी एक शूरवीर है\"। हेनरी ने कहा, \"लियम एक शूरवीर है यदि और केवल यदि बेंजामिन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक शूरवीर है  \n(2) बेंजामिन एक धूर्त है  \n(3) हेनरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: डेविड, नूह, और औरोरा। \"नूह एक धूर्त है यदि और केवल यदि औरोरा एक धूर्त है\" - डेविड। नूह के अनुसार, \"डेविड एक धूर्त है यदि और केवल यदि नूह एक शूरवीर है\"। औरोरा ने कहा, \"यदि डेविड एक शूरवीर है तो औरोरा एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक धूर्त है  \n(2) नूह एक धूर्त है  \n(3) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ऐडन, याकूब, और बेंजामिन। ऐडन ने कहा: \"याकूब एक धूर्त है\"। याकूब ने आपको बताया कि ऐडन एक शूरवीर है या याकूब एक शूरवीर है। बेंजामिन के शब्दों में: \"ऐडन एक धूर्त है या बेंजामिन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक धूर्त है  \n(2) याकूब एक शूरवीर है  \n(3) बेंजामिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: सैमुएल, डैनियल, और ओवेन। \"सैमुएल एक शूरवीर है यदि और केवल यदि ओवेन एक शूरवीर है\" - सैमुएल। डैनियल ने कहा: \"ओवेन एक धूर्त है\"। ओवेन ने कहा, \"डैनियल एक शूरवीर है या सैमुएल एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक धूर्त है  \n(2) डैनियल एक धूर्त है  \n(3) ओवेन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ईथन, सोफिया, और डेविड। ईथन के अनुसार, \"अगर सोफिया एक शूरवीर है तो डेविड एक शूरवीर है\"। सोफिया के अनुसार, \"डेविड एक शूरवीर है यदि और केवल यदि ईथन एक धूर्त है\"। डेविड के शब्दों में: \"सोफिया एक धूर्त है या सोफिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक शूरवीर है  \n(2) सोफिया एक धूर्त है  \n(3) डेविड एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: शार्लट, लोगन, और डेविड। शार्लट ने कहा, \"शार्लट एक शूरवीर है और लोगन एक शूरवीर है।\" लोगन के अनुसार, \"शार्लट एक शूरवीर है या डेविड एक शूरवीर है।\" डेविड ने कहा: \"शार्लट एक शूरवीर है यदि और केवल यदि लोगन एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक शूरवीर है  \n(2) लोगन एक शूरवीर है  \n(3) डेविड एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: विलियम, ओलिवर, और आरिया। विलियम के अनुसार, \"अगर विलियम एक शूरवीर है तो आरिया एक शूरवीर है\"। ओलिवर के एक बयान में: \"विलियम एक धूर्त है या आरिया एक धूर्त है\"। आरिया ने आपको बताया कि अगर विलियम एक धूर्त है तो विलियम एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) ओलिवर एक धूर्त है  \n(3) आरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: सोफिया, अमेलिया, और हार्पर। सोफिया ने कहा, \"अगर हार्पर एक धूर्त है तो अमेलिया एक धूर्त है\"। अमेलिया ने कहा, \"हार्पर एक धूर्त है\"। हार्पर ने कहा कि अमेलिया एक शूरवीर है यदि और केवल यदि सोफिया एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) अमेलिया एक शूरवीर है  \n(3) हार्पर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: लोगन, जेम्स, और लुकास। \"लोगन एक शूरवीर है और लुकास एक धूर्त है,\" लोगन ने दावा किया। जेम्स के शब्दों में: \"लोगन एक धूर्त नहीं है\"। लुकास ने कहा, \"लोगन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक धूर्त है  \n(2) जेम्स एक धूर्त है  \n(3) लुकास एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: इसाबेला, ज़ोई, और अमेलिया। इसाबेला ने कहा, \"अगर अमेलिया एक धूर्त है तो इसाबेला एक शूरवीर है\"। ज़ोई ने आपको बताया कि इसाबेला एक शूरवीर नहीं है। जैसे अमेलिया ने कहा, \"ज़ोई एक शूरवीर है या ज़ोई एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक शूरवीर है  \n(2) ज़ोई एक धूर्त है  \n(3) अमेलिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: हार्पर, जैक्सन, और ग्रेस। हार्पर के अनुसार, \"हार्पर एक शूरवीर है यदि और केवल यदि जैक्सन एक शूरवीर है\"। जैक्सन के अनुसार, \"यदि हार्पर एक शूरवीर है तो हार्पर एक धूर्त है\"। \"जैक्सन एक धूर्त है और जैक्सन एक शूरवीर है,\" ग्रेस ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक धूर्त है  \n(2) जैक्सन एक शूरवीर है  \n(3) ग्रेस एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ग्रेस, सेबेस्टियन, और माइकल। ग्रेस के शब्दों में: \"अगर माइकल एक धूर्त है तो माइकल एक शूरवीर है\"। सेबेस्टियन ने कहा, \"ग्रेस एक धूर्त नहीं है\"। माइकल ने कहा, \"माइकल एक शूरवीर है यदि और केवल यदि ग्रेस एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक शूरवीर है  \n(2) सेबेस्टियन एक शूरवीर है  \n(3) माइकल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: सोफिया, मेसन, और एवा। सोफिया ने आपको बताया कि मेसन एक शूरवीर नहीं है। मेसन ने कहा: \"सोफिया एक धूर्त है और एवा एक शूरवीर है\"। \"सोफिया एक शूरवीर है और मेसन एक धूर्त है,\" एवा ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) मेसन एक धूर्त है  \n(3) एवा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: जैक, अमेलिया, और ओलिविया। जैक के अनुसार, \"ओलिविया एक धूर्त है और जैक एक शूरवीर है\"। \"जैक एक शूरवीर नहीं है,\" अमेलिया ने दावा किया। ओलिविया ने कहा कि अगर जैक एक धूर्त है तो अमेलिया एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक एक धूर्त है  \n(2) अमेलिया एक शूरवीर है  \n(3) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: क्लोई, ओलिवर, और जैक। क्लोई ने कहा कि ओलिवर एक धूर्त नहीं है। ओलिवर के एक बयान में: \"क्लोई एक धूर्त नहीं है\"। जैक ने कहा, \"अगर जैक एक शूरवीर है तो ओलिवर एक शूरवीर है।\" तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) क्लोई एक शूरवीर है  \n(2) ओलिवर एक शूरवीर है  \n(3) जैक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एम्मा, ल्यूक, और एला। एम्मा ने कहा: \"ल्यूक एक शूरवीर है या ल्यूक एक धूर्त है\"। ल्यूक के अनुसार, \"अगर एम्मा एक शूरवीर है तो एला एक शूरवीर है\"। एला ने टिप्पणी की, \"अगर एम्मा एक धूर्त है तो ल्यूक एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एम्मा एक शूरवीर है  \n(2) ल्यूक एक शूरवीर है  \n(3) एला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ल्यूक, माइकल, और एलिज़ाबेथ। \"एलिज़ाबेथ एक शूरवीर है,\" ल्यूक ने कहा। माइकल ने टिप्पणी की, \"ल्यूक एक शूरवीर है\"। एलिज़ाबेथ को यह कहते हुए सुना गया, \"माइकल एक धूर्त है यदि और केवल यदि ल्यूक एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) माइकल एक शूरवीर है  \n(3) एलिज़ाबेथ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एवा, डेविड, और अमेलिया। एवा ने कहा, \"डेविड एक धूर्त है या डेविड एक शूरवीर है\"। डेविड ने कहा कि एवा एक शूरवीर है और अमेलिया एक शूरवीर है। अमेलिया ने टिप्पणी की, \"डेविड एक शूरवीर है और डेविड एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक शूरवीर है  \n(2) डेविड एक धूर्त है  \n(3) अमेलिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: बेंजामिन, मिया, और याकूब। बेंजामिन के एक बयान में: \"मिया एक धूर्त है और मिया एक शूरवीर है\"। मिया ने कहा: \"बेंजामिन एक शूरवीर है और याकूब एक धूर्त है\"। याकूब के शब्दों में: \"बेंजामिन एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक धूर्त है  \n(2) मिया एक धूर्त है  \n(3) याकूब एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एवरी, लिली, और पेनलोप। \"लिली शूरवीर नहीं है,\" एवरी ने घोषणा की। लिली ने कहा कि पेनलोप एक धूर्त है और एवरी एक धूर्त है। पेनलोप ने कहा कि अगर लिली एक धूर्त है तो एवरी एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक शूरवीर है  \n(2) लिली एक धूर्त है  \n(3) पेनलोप एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: याकूब, मेसन, और एला। याकूब ने कहा, \"मेसन एक शूरवीर है यदि और केवल यदि याकूब एक शूरवीर है\"। मेसन ने कहा, \"एला एक धूर्त नहीं है\"। एला के अनुसार, \"याकूब एक शूरवीर है और एला एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) याकूब एक शूरवीर है  \n(2) मेसन एक शूरवीर है  \n(3) एला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: लोगन, हेनरी, और ग्रेस। लोगन ने कहा, \"अगर हेनरी एक शूरवीर है तो ग्रेस एक धूर्त है।\" हेनरी के एक बयान में: \"लोगन एक धूर्त है।\" ग्रेस ने कहा, \"अगर हेनरी एक शूरवीर है तो लोगन एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक शूरवीर है  \n(2) हेनरी एक धूर्त है  \n(3) ग्रेस एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: मिया, लिली, और क्लोई। मिया के अनुसार, \"मिया एक शूरवीर है यदि और केवल यदि लिली एक धूर्त है\"। लिली के अनुसार, \"यदि क्लोई एक धूर्त है तो मिया एक धूर्त है\"। क्लोई को यह कहते हुए सुना गया, \"मिया एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक शूरवीर है  \n(2) लिली एक धूर्त है  \n(3) क्लोई एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: लुकास, ल्यूक, और औरोरा। \"लुकास एक शूरवीर है या औरोरा एक शूरवीर है,\" लुकास ने दावा किया। ल्यूक ने कहा, \"औरोरा एक शूरवीर है और लुकास एक शूरवीर है\"। औरोरा ने कहा, \"अगर लुकास एक धूर्त है तो ल्यूक एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक शूरवीर है  \n(2) ल्यूक एक शूरवीर है  \n(3) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: क्लोई, सेबेस्टियन, और मैथ्यू। क्लोई ने कहा कि सेबेस्टियन एक धूर्त है और क्लोई एक शूरवीर है। जैसे सेबेस्टियन ने कहा, \"मैथ्यू एक धूर्त है यदि और केवल यदि सेबेस्टियन एक शूरवीर है\"। मैथ्यू ने आपको बताया कि क्लोई एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) क्लोई एक शूरवीर है  \n(2) सेबेस्टियन एक धूर्त है  \n(3) मैथ्यू एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: हेनरी, डेविड, और औरोरा। हेनरी ने कहा, \"औरोरा एक शूरवीर है या हेनरी एक शूरवीर है।\" \"हेनरी एक शूरवीर नहीं है,\" डेविड ने कहा। औरोरा के शब्दों में: \"औरोरा एक शूरवीर है यदि और केवल यदि हेनरी एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हेनरी एक धूर्त है  \n(2) डेविड एक शूरवीर है  \n(3) औरोरा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: स्कारलेट, बेंजामिन, और एमिली। स्कारलेट ने कहा, \"बेंजामिन एक शूरवीर है\"। \"अगर स्कारलेट एक शूरवीर है तो एमिली एक धूर्त है\" - बेंजामिन। एमिली ने कहा, \"अगर बेंजामिन एक शूरवीर है तो एमिली एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) स्कारलेट एक शूरवीर है  \n(2) बेंजामिन एक शूरवीर है  \n(3) एमिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: नूह, यूसुफ, और सोफिया। नूह ने कहा कि सोफिया एक शूरवीर है और नूह एक शूरवीर है। यूसुफ को यह कहते हुए सुना गया, \"अगर यूसुफ एक शूरवीर है तो सोफिया एक धूर्त है।\" \"सोफिया एक शूरवीर है यदि और केवल यदि नूह एक धूर्त है,\" सोफिया ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक धूर्त है  \n(2) यूसुफ एक शूरवीर है  \n(3) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: लोगन, ईथन, और जैक। जैसे लोगन ने कहा, \"अगर जैक एक धूर्त है तो ईथन एक धूर्त है\"। ईथन ने कहा: \"जैक एक धूर्त है और ईथन एक शूरवीर है\"। जैक ने आपको बताया कि ईथन एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक शूरवीर है  \n(2) ईथन एक धूर्त है  \n(3) जैक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: अमेलिया, लियम, और इसाबेला। अमेलिया ने कहा, \"इसाबेला धूर्त नहीं है।\" \"इसाबेला धूर्त है या अमेलिया शूरवीर है,\" लियम ने दावा किया। इसाबेला ने कहा, \"लियम धूर्त नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक शूरवीर है  \n(2) लियम एक शूरवीर है  \n(3) इसाबेला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: बेंजामिन, ओवेन, और जैक्सन। बेंजामिन ने आपको बताया कि जैक्सन एक शूरवीर है या जैक्सन एक धूर्त है। ओवेन ने कहा कि जैक्सन एक शूरवीर नहीं है। जैक्सन ने टिप्पणी की, \"बेंजामिन एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) बेंजामिन एक शूरवीर है  \n(2) ओवेन एक धूर्त है  \n(3) जैक्सन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: याकूब, अमेलिया, और बेंजामिन। याकूब के अनुसार, \"अगर अमेलिया एक धूर्त है तो बेंजामिन एक धूर्त है\"। अमेलिया ने टिप्पणी की, \"याकूब एक धूर्त है या याकूब एक शूरवीर है\"। बेंजामिन ने नोट किया, \"अमेलिया एक शूरवीर है यदि और केवल यदि अमेलिया एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) याकूब एक शूरवीर है  \n(2) अमेलिया एक शूरवीर है  \n(3) बेंजामिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: सोफिया, शार्लट, और ऐडन। \"ऐडन एक धूर्त है और ऐडन एक शूरवीर है\" - सोफिया। शार्लट ने टिप्पणी की, \"सोफिया एक शूरवीर नहीं है\"। \"ऐडन एक शूरवीर है और शार्लट एक धूर्त है,\" ऐडन ने घोषित किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) शार्लट एक शूरवीर है  \n(3) ऐडन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: मिया, लुकास, और ग्रेस। मिया ने कहा, \"मिया एक शूरवीर है यदि और केवल यदि लुकास एक शूरवीर है।\" \"मिया एक शूरवीर नहीं है,\" लुकास ने दावा किया। ग्रेस ने कहा कि लुकास एक धूर्त है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) मिया एक धूर्त है  \n(2) लुकास एक शूरवीर है  \n(3) ग्रेस एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: लोगन, लियम, और सेबेस्टियन। लोगन के शब्दों में: \"अगर सेबेस्टियन एक शूरवीर है तो लियम एक धूर्त है।\" \"लोगन एक शूरवीर है यदि और केवल यदि सेबेस्टियन एक धूर्त है,\" लियम ने कहा। \"लोगन एक शूरवीर है,\" सेबेस्टियन ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक शूरवीर है  \n(2) लियम एक धूर्त है  \n(3) सेबेस्टियन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एलिज़ाबेथ, सैमुएल, और लिली। एलिज़ाबेथ ने टिप्पणी की, \"अगर सैमुएल एक धूर्त है तो सैमुएल एक शूरवीर है\"। सैमुएल ने कहा, \"एलिज़ाबेथ एक शूरवीर है या एलिज़ाबेथ एक धूर्त है\"। लिली के अनुसार, \"एलिज़ाबेथ एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक शूरवीर है  \n(2) सैमुएल एक शूरवीर है  \n(3) लिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: याकूब, जेम्स, और सोफिया। याकूब ने कहा, \"जेम्स एक शूरवीर है।\" जेम्स के एक बयान में: \"सोफिया एक शूरवीर है।\" जैसा कि सोफिया ने कहा, \"जेम्स एक धूर्त है या जेम्स एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) याकूब एक शूरवीर है  \n(2) जेम्स एक शूरवीर है  \n(3) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एवा, ग्रेस, और डैनियल। \"एवा एक शूरवीर है यदि और केवल यदि ग्रेस एक शूरवीर है\" - एवा। \"एवा एक शूरवीर नहीं है,\" ग्रेस ने घोषणा की। \"एवा एक शूरवीर है या एवा एक धूर्त है\" - डैनियल। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एवा एक धूर्त है  \n(2) ग्रेस एक शूरवीर है  \n(3) डैनियल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: अबिगेल, सेबेस्टियन, और विक्टोरिया। \"अगर अबिगेल एक शूरवीर है तो सेबेस्टियन एक शूरवीर है\" - अबिगेल। \"अगर सेबेस्टियन एक शूरवीर है तो विक्टोरिया एक शूरवीर है\" - सेबेस्टियन। विक्टोरिया ने कहा कि अबिगेल एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अबिगेल एक शूरवीर है  \n(2) सेबेस्टियन एक शूरवीर है  \n(3) विक्टोरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एवलिन, अलेक्जेंडर, और जैक्सन। एवलिन को यह कहते हुए सुना गया, \"जैक्सन एक शूरवीर है या एवलिन एक शूरवीर है\"। \"एवलिन एक धूर्त है और एवलिन एक शूरवीर है,\" अलेक्जेंडर ने कहा। जैक्सन के एक बयान में: \"अलेक्जेंडर एक शूरवीर है या एवलिन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक शूरवीर है  \n(2) अलेक्जेंडर एक धूर्त है  \n(3) जैक्सन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: अमेलिया, मैथ्यू, और क्लोई। अमेलिया ने कहा, \"मैथ्यू एक धूर्त है यदि और केवल यदि क्लोई एक शूरवीर है।\" मैथ्यू ने कहा, \"क्लोई एक शूरवीर है या अमेलिया एक धूर्त है।\" \"यदि मैथ्यू एक शूरवीर है तो क्लोई एक शूरवीर है,\" क्लोई ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक धूर्त है  \n(2) मैथ्यू एक शूरवीर है  \n(3) क्लोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: डैनियल, इसाबेला, और ओलिविया। \"इसाबेला एक शूरवीर है यदि और केवल यदि इसाबेला एक धूर्त है,\" डैनियल ने कहा। इसाबेला ने कहा, \"यदि डैनियल एक शूरवीर है तो ओलिविया एक धूर्त है।\" ओलिविया ने कहा: \"इसाबेला एक धूर्त है यदि और केवल यदि डैनियल एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक धूर्त है  \n(2) इसाबेला एक शूरवीर है  \n(3) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: डैनियल, इसाबेला, और मैथ्यू। डैनियल के अनुसार, \"इसाबेला एक शूरवीर है यदि और केवल यदि इसाबेला एक धूर्त है\"। इसाबेला के अनुसार, \"डैनियल एक धूर्त है और मैथ्यू एक शूरवीर है\"। मैथ्यू के शब्दों में: \"डैनियल एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक धूर्त है  \n(2) इसाबेला एक धूर्त है  \n(3) मैथ्यू एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: मैथ्यू, ओलिविया, और ईथन। मैथ्यू को यह कहते हुए सुना गया, \"अगर ईथन एक शूरवीर है तो ओलिविया एक धूर्त है\"। ओलिविया ने कहा, \"ईथन एक शूरवीर नहीं है\"। \"मैथ्यू एक धूर्त है और ईथन एक शूरवीर है\" - ईथन। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक शूरवीर है  \n(2) ओलिविया एक शूरवीर है  \n(3) ईथन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: डेविड, इसाबेला, और माइकल। डेविड ने कहा, \"अगर माइकल एक शूरवीर है तो माइकल एक धूर्त है।\" इसाबेला ने कहा, \"माइकल एक धूर्त है या माइकल एक शूरवीर है।\" माइकल ने कहा, \"माइकल एक शूरवीर है यदि और केवल यदि डेविड एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक धूर्त है  \n(2) इसाबेला एक शूरवीर है  \n(3) माइकल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ईथन, जैक्सन, और स्कारलेट। ईथन के एक बयान में: \"स्कारलेट एक शूरवीर है\"। जैक्सन ने कहा, \"अगर ईथन एक शूरवीर है तो स्कारलेट एक धूर्त है\"। स्कारलेट ने आपको बताया कि जैक्सन एक धूर्त है और ईथन एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक धूर्त है  \n(2) जैक्सन एक शूरवीर है  \n(3) स्कारलेट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: डैनियल, मिया, और औरोरा। डैनियल के अनुसार, \"औरोरा एक शूरवीर है और मिया एक धूर्त है\"। मिया ने कहा: \"औरोरा एक शूरवीर है या डैनियल एक धूर्त है\"। \"मिया एक धूर्त है यदि और केवल यदि मिया एक शूरवीर है,\" औरोरा ने कहा। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) डैनियल एक धूर्त है  \n(2) मिया एक शूरवीर है  \n(3) औरोरा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ओवेन, जैक, और जैक्सन। ओवेन को यह कहते हुए सुना गया, \"जैक्सन एक शूरवीर है या ओवेन एक शूरवीर है\"। जैक ने कहा, \"जैक्सन एक शूरवीर है या जैक्सन एक धूर्त है\"। जैक्सन ने कहा, \"अगर जैक एक धूर्त है तो ओवेन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओवेन एक शूरवीर है  \n(2) जैक एक शूरवीर है  \n(3) जैक्सन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: हार्पर, एला, और डेविड। \"एला एक धूर्त है यदि और केवल यदि हार्पर एक शूरवीर है,\" हार्पर ने कहा। एला के एक बयान में: \"हार्पर एक शूरवीर है\"। \"यदि डेविड एक शूरवीर है तो एला एक धूर्त है,\" डेविड ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक धूर्त है  \n(2) एला एक धूर्त है  \n(3) डेविड एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एवा, हार्पर, और बेंजामिन। \"हार्पर एक धूर्त है या बेंजामिन एक धूर्त है\" - एवा। \"हार्पर एक शूरवीर है यदि और केवल यदि बेंजामिन एक शूरवीर है\" - हार्पर। \"एवा एक शूरवीर है,\" बेंजामिन ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक शूरवीर है  \n(2) हार्पर एक धूर्त है  \n(3) बेंजामिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: जैक्सन, एवरी, और मैथ्यू। जैक्सन के अनुसार, \"मैथ्यू एक शूरवीर है या जैक्सन एक शूरवीर है\"। एवरी ने आपको बताया कि जैक्सन एक धूर्त नहीं है। मैथ्यू ने कहा: \"एवरी एक शूरवीर है या जैक्सन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक शूरवीर है  \n(2) एवरी एक शूरवीर है  \n(3) मैथ्यू एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एम्मा, हार्पर, और विलियम। एम्मा ने कहा कि विलियम शूरवीर नहीं है। हार्पर ने कहा, \"अगर हार्पर शूरवीर है तो विलियम शूरवीर है।\" \"हार्पर शूरवीर है\" - विलियम। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एम्मा एक धूर्त है  \n(2) हार्पर एक शूरवीर है  \n(3) विलियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एवा, अमेलिया, और विलियम। एवा ने कहा: \"अगर अमेलिया एक धूर्त है तो विलियम एक धूर्त है।\" \"विलियम एक धूर्त है और एवा एक धूर्त है,\" अमेलिया ने घोषणा की। विलियम ने कहा, \"अमेलिया एक शूरवीर नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक धूर्त है  \n(2) अमेलिया एक धूर्त है  \n(3) विलियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: याकूब, ज़ोई, और सेबेस्टियन। याकूब ने कहा: \"सेबेस्टियन धूर्त नहीं है\"। \"सेबेस्टियन एक शूरवीर है और याकूब एक धूर्त है,\" ज़ोई ने दावा किया। जैसे सेबेस्टियन ने कहा, \"ज़ोई एक धूर्त है और ज़ोई एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) याकूब एक धूर्त है  \n(2) ज़ोई एक धूर्त है  \n(3) सेबेस्टियन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: सोफिया, विलियम, और मेसन। \"अगर विलियम एक धूर्त है तो विलियम एक शूरवीर है\" - सोफिया। विलियम ने कहा: \"अगर सोफिया एक शूरवीर है तो मेसन एक धूर्त है\"। जैसा कि मेसन ने कहा, \"मेसन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) विलियम एक शूरवीर है  \n(3) मेसन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: अमेलिया, ल्यूक, और मैथ्यू। अमेलिया के एक बयान में: \"ल्यूक धूर्त नहीं है\"। \"अमेलिया एक शूरवीर है और अमेलिया एक धूर्त है,\" ल्यूक ने घोषित किया। मैथ्यू ने नोट किया, \"अगर अमेलिया एक शूरवीर है तो ल्यूक एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक धूर्त है  \n(2) ल्यूक एक धूर्त है  \n(3) मैथ्यू एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: स्कारलेट, एवलिन, और ज़ोई। स्कारलेट ने कहा, \"एवलिन एक धूर्त है और ज़ोई एक धूर्त है।\" एवलिन के शब्दों में: \"ज़ोई एक धूर्त है।\" ज़ोई ने कहा, \"अगर स्कारलेट एक शूरवीर है तो स्कारलेट एक धूर्त है।\" तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) स्कारलेट एक धूर्त है  \n(2) एवलिन एक धूर्त है  \n(3) ज़ोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एवलिन, बेंजामिन, और सोफिया। एवलिन ने कहा, \"बेंजामिन एक धूर्त नहीं है\"। बेंजामिन ने कहा कि सोफिया एक शूरवीर है यदि और केवल यदि एवलिन एक धूर्त है। सोफिया ने कहा, \"सोफिया एक शूरवीर है यदि और केवल यदि एवलिन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक शूरवीर है  \n(2) बेंजामिन एक शूरवीर है  \n(3) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एम्मा, एवरी, और एलिज़ाबेथ। एम्मा ने कहा, \"अगर एवरी एक धूर्त है तो एवरी एक शूरवीर है\"। एवरी के एक बयान में: \"अगर एवरी एक शूरवीर है तो एम्मा एक शूरवीर है\"। \"एलिज़ाबेथ एक शूरवीर है और एवरी एक धूर्त है\" - एलिज़ाबेथ। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एम्मा एक शूरवीर है  \n(2) एवरी एक शूरवीर है  \n(3) एलिज़ाबेथ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: माइकल, राइली, और सोफिया। माइकल के एक बयान में: \"सोफिया एक धूर्त है या राइली एक धूर्त है\"। राइली ने कहा, \"सोफिया एक धूर्त है\"। सोफिया ने कहा, \"अगर राइली एक धूर्त है तो सोफिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक शूरवीर है  \n(2) राइली एक धूर्त है  \n(3) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: सोफिया, स्कारलेट, और शार्लट। सोफिया ने कहा, \"अगर सोफिया एक शूरवीर है तो शार्लट एक शूरवीर है।\" जैसे कि स्कारलेट ने कहा, \"सोफिया एक शूरवीर है।\" शार्लट ने आपको बताया कि सोफिया एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) स्कारलेट एक शूरवीर है  \n(3) शार्लट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: मिया, हार्पर, और ओलिवर। \"मिया एक शूरवीर है,\" मिया ने घोषणा की। हार्पर ने कहा कि अगर हार्पर एक शूरवीर है तो ओलिवर एक धूर्त है। ओलिवर ने कहा, \"हार्पर एक शूरवीर है और मिया एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक धूर्त है  \n(2) हार्पर एक शूरवीर है  \n(3) ओलिवर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: माइकल, एम्मा, और एवलिन। माइकल ने आपको बताया कि एवलिन एक धूर्त नहीं है। \"एवलिन एक शूरवीर है और माइकल एक शूरवीर है\" - एम्मा। एवलिन ने कहा, \"एम्मा एक शूरवीर है यदि और केवल यदि एम्मा एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक धूर्त है  \n(2) एम्मा एक धूर्त है  \n(3) एवलिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ऐडन, अमेलिया, और ईथन। \"ईथन एक शूरवीर है और अमेलिया एक धूर्त है\" - ऐडन। अमेलिया के एक बयान में: \"अमेलिया एक शूरवीर है यदि और केवल यदि ईथन एक धूर्त है\"। ईथन ने कहा, \"अमेलिया एक शूरवीर है और ऐडन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक धूर्त है  \n(2) अमेलिया एक धूर्त है  \n(3) ईथन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: हेनरी, डैनियल, और अबिगेल। हेनरी ने कहा, \"डैनियल शूरवीर नहीं है\"। डैनियल ने कहा, \"अगर अबिगेल शूरवीर है तो हेनरी शूरवीर है\"। जैसा कि अबिगेल ने कहा, \"डैनियल धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हेनरी एक धूर्त है  \n(2) डैनियल एक शूरवीर है  \n(3) अबिगेल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: जैक, एमिली, और ऐडन। जैक ने कहा: \"एमिली धूर्त नहीं है\"। \"एमिली एक शूरवीर है या ऐडन एक धूर्त है\" - एमिली। ऐडन ने आपको बताया कि ऐडन एक शूरवीर है यदि और केवल यदि एमिली एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक एक धूर्त है  \n(2) एमिली एक धूर्त है  \n(3) ऐडन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ईथन, माइकल, और लोगन। ईथन ने कहा, \"अगर लोगन एक शूरवीर है तो ईथन एक शूरवीर है\"। माइकल के एक बयान में: \"ईथन एक शूरवीर है\"। लोगन के एक बयान में: \"ईथन एक धूर्त है यदि और केवल यदि माइकल एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक शूरवीर है  \n(2) माइकल एक शूरवीर है  \n(3) लोगन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: सोफिया, जैक्सन, और ल्यूक। सोफिया ने कहा कि ल्यूक एक शूरवीर है। जैक्सन ने आपको बताया कि अगर सोफिया एक धूर्त है तो ल्यूक एक धूर्त है। ल्यूक के एक बयान में: \"सोफिया एक धूर्त है यदि और केवल यदि सोफिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) जैक्सन एक शूरवीर है  \n(3) ल्यूक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: जैक्सन, ज़ोई, और सोफिया। \"ज़ोई एक शूरवीर है,\" जैक्सन ने दावा किया। ज़ोई ने कहा कि जैक्सन एक धूर्त है या ज़ोई एक शूरवीर है। सोफिया ने कहा कि ज़ोई एक शूरवीर है और जैक्सन एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक शूरवीर है  \n(2) ज़ोई एक शूरवीर है  \n(3) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एवा, नूह, और सेबेस्टियन। एवा के शब्दों में: \"एवा एक शूरवीर है\"। नूह ने कहा, \"एवा एक धूर्त है या सेबेस्टियन एक धूर्त है\"। सेबेस्टियन ने कहा: \"नूह एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक धूर्त है  \n(2) नूह एक शूरवीर है  \n(3) सेबेस्टियन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: मेसन, मैथ्यू, और एम्मा। मेसन ने कहा, \"एम्मा एक धूर्त है या मैथ्यू एक शूरवीर है।\" जैसे मैथ्यू ने कहा, \"अगर एम्मा एक धूर्त है तो मेसन एक शूरवीर है।\" \"मैथ्यू एक शूरवीर है,\" एम्मा ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक शूरवीर है  \n(2) मैथ्यू एक शूरवीर है  \n(3) एम्मा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: सैमुएल, ईथन, और स्कारलेट। सैमुएल ने कहा कि स्कारलेट एक धूर्त है यदि और केवल यदि ईथन एक धूर्त है। ईथन ने कहा, \"सैमुएल एक धूर्त है\"। स्कारलेट ने कहा कि स्कारलेट एक शूरवीर है यदि और केवल यदि ईथन एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक शूरवीर है  \n(2) ईथन एक धूर्त है  \n(3) स्कारलेट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: एलिज़ाबेथ, स्कारलेट, और जेम्स। एलिज़ाबेथ के शब्दों में: \"जेम्स एक शूरवीर नहीं है\"। \"अगर जेम्स एक शूरवीर है तो एलिज़ाबेथ एक धूर्त है,\" स्कारलेट ने घोषणा की। जेम्स ने कहा, \"स्कारलेट एक शूरवीर है और स्कारलेट एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक शूरवीर है  \n(2) स्कारलेट एक शूरवीर है  \n(3) जेम्स एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: लुकास, एम्मा, और ज़ोई। लुकास के शब्दों में: \"ज़ोई धूर्त नहीं है\"। एम्मा ने कहा कि ज़ोई शूरवीर नहीं है। ज़ोई ने कहा: \"एम्मा धूर्त है और लुकास धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक धूर्त है  \n(2) एम्मा एक शूरवीर है  \n(3) ज़ोई एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: जैक्सन, एम्मा, और सैमुएल। जैक्सन ने कहा, \"सैमुएल एक शूरवीर है या जैक्सन एक शूरवीर है\"। एम्मा के एक बयान में: \"एम्मा एक शूरवीर है यदि और केवल यदि जैक्सन एक धूर्त है\"। सैमुएल के शब्दों में: \"जैक्सन एक धूर्त है और एम्मा एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक धूर्त है  \n(2) एम्मा एक शूरवीर है  \n(3) सैमुएल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ओवेन, विक्टोरिया, और लियम। ओवेन ने कहा: \"विक्टोरिया एक धूर्त है और विक्टोरिया एक शूरवीर है\"। विक्टोरिया ने कहा, \"ओवेन एक धूर्त है और लियम एक धूर्त है\"। लियम ने कहा कि विक्टोरिया एक धूर्त है और विक्टोरिया एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओवेन एक धूर्त है  \n(2) विक्टोरिया एक शूरवीर है  \n(3) लियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 3 निवासियों से मिलते हैं: ओलिविया, जैक, और याकूब। ओलिविया ने कहा, \"अगर जैक एक धूर्त है तो याकूब एक धूर्त है।\" जैक के एक बयान में: \"याकूब एक शूरवीर है और याकूब एक धूर्त है।\" याकूब ने टिप्पणी की, \"अगर जैक एक शूरवीर है तो ओलिविया एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक धूर्त है  \n(2) जैक एक धूर्त है  \n(3) याकूब एक शूरवीर है"
    }
]