[
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أوليفر وإيثان. أخبرك أوليفر أن أوليفر فارس أو إيثان محتال. في تصريح لإيثان: \"أوليفر فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفر فارس  \n(2) إيثان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: مايكل ويعقوب. قال مايكل: \"يعقوب محتال.\" أعلن يعقوب: \"مايكل محتال إذا وفقط إذا كان مايكل فارساً.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل فارس  \n(2) يعقوب محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أميليا وهاربر. سُمعت أميليا تقول: \"هاربر فارس أو هاربر محتال\". \"أميليا فارس وأميليا محتال\"، ادعى هاربر. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا فارس  \n(2) هاربر محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: لوغان وليلي. قال لوغان: \"ليلي ليست محتالة\". وأعربت ليلي عن أن لوغان محتال وليلي فارسة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان محتالة\n(2) ليلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: جاك وإيفلين. في كلمات جاك: \"إيفلين فارس أو إيفلين محتالة\". أكدت إيفلين: \"إذا كان جاك محتالاً، فإن إيفلين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاك فارس  \n(2) إيفلين فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: صموئيل وآريا. في كلمات صموئيل: \"آريا فارس إذا وفقط إذا كانت آريا محتالة\". علقّت آريا، \"صموئيل محتال أو صموئيل فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صموئيل محتال  \n(2) آريا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: دانيال، وليام. في تصريح لدانيال: \"ويليام محتال إذا وفقط إذا كان دانيال فارساً\". قال ويليام: \"دانيال فارس أو ويليام فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال محتال  \n(2) ليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: آفا، وهنري. أخبرتك آفا أن هنري فارس أو هنري محتال. \"آفا فارس إذا وفقط إذا كانت آفا محتالة\"، ادعى هنري. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا فارس  \n(2) هنري محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: بينيلوب وإسكندر. أكدت بينيلوب: \"إذا كانت بينيلوب فارساً، فإن إسكندر فارس\". وفقاً لإسكندر، \"بينيلوب فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب هي فارس  \n(2) إسكندر هو فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: رايلي وصوفيا. قال رايلي: \"صوفيا فارس إذا وفقط إذا كانت صوفيا محتالة\". وأشارت صوفيا: \"رايلي محتال أو صوفيا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) رايلي محتالة  \n(2) صوفيا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: ليام وبنيامين. قال ليام إنه إذا كان بنيامين محتالًا، فإن ليام فارس. \"ليام فارس أو ليام محتال\"، أعلن بنيامين. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام فارس  \n(2) بنيامين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: سكارليت وآريا. \"آريا محتالة وآريا فارس\"، ذكرت سكارليت. \"سكارليت فارس إذا وفقط إذا كانت سكارليت محتالة\" - آريا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سكارليت محتالة  \n(2) آريا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: هاربر، ولوك. سمع هاربر يقول: \"لوك فارس\". \"هاربر فارس إذا وفقط إذا كان لوك فارس\"، أعلن لوك. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر فارس  \n(2) لوك فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: آفا وشارلوت. أكدت آفا أن شارلوت محتالة. وأكدت شارلوت: \"آفا فارس إذا وفقط إذا كانت شارلوت فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا فارس  \n(2) شارلوت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: يوسف وصموئيل. علق يوسف قائلاً: \"صموئيل فارس وصموئيل محتال\". عبر صموئيل عن أن يوسف فارس إذا وفقط إذا كان يوسف محتالًا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف محتال  \n(2) صموئيل محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: سباستيان وبنيامين. \"إذا كان سباستيان فارسًا، فإن بنيامين محتال\" - ادعى سباستيان. \"سباستيان فارس وبنيامين محتال\" - بنيامين. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سباستيان فارس  \n(2) بنيامين محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أميليا ويعقوب. قالت أميليا إن يعقوب فارس وإن يعقوب محتال. علق يعقوب قائلاً: \"إذا كانت أميليا محتالة، فإن أميليا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا محتالة  \n(2) يعقوب محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: أبيجيل وهاربر. أكدت أبيجيل: \"إذا كانت أبيجيل فارساً، فإن هاربر فارس\". وفقاً لهاربر، \"أبيجيل فارس أو هاربر فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أبيجيل فارس  \n(2) هاربر فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: سكارليت ويوسف. \"سكارليت فارس إذا وفقط إذا كان يوسف محتالاً\"، ادعت سكارليت. سمع يوسف يقول، \"إذا كانت سكارليت محتالاً، فإن يوسف فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سكارليت محتالة  \n(2) يوسف محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: دانيال ورايلي. وفقاً لدانيال، \"رايلي ليس فارساً\". \"دانيال هو فارس إذا وفقط إذا كانت رايلي فارساً\"، أعلنت رايلي. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال فارس  \n(2) رايلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: إليزابيث وأوليفر. قالت إليزابيث: \"أوليفر ليس محتالًا\". علق أوليفر: \"أوليفر فارس أو إليزابيث محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث فارس  \n(2) أوليفر فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: دانيال وأبيجيل. وفقًا لدانيال، \"أبيجيل محتالة وأبيجيل فارسة\". لاحظت أبيجيل، \"دانيال فارس أو دانيال محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال محتال  \n(2) أبيجيل فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: صوفيا، ولوغان. \"لوغان فارس أو لوغان محتال\"، أعلنت صوفيا. \"صوفيا فارس أو صوفيا محتال\"، ادعى لوغان. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) لوغان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: شارلوت وإسكندر. قالت شارلوت: \"إذا كان إسكندر فارسًا، فإن إسكندر محتال.\" أعلن إسكندر: \"شارلوت فارس أو إسكندر فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت محتالة  \n(2) إسكندر فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: شارلوت وأيدن. أخبرتك شارلوت أن أيدن محتال. قال أيدن: \"شارلوت محتالة أو شارلوت فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت محتالة  \n(2) أيدن فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: شارلوت وسكارليت. \"سكارليت فارس وسكارليت محتالة\" - شارلوت. قالت سكارليت، \"سكارليت فارس وشارلوت فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت محتالة  \n(2) سكارليت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أوليفيا وهنري. أكدت أوليفيا: \"هنري فارس أو هنري محتال\". بكلمات هنري: \"أوليفيا محتالة وأوليفيا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا فارس  \n(2) هنري محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: دانيال وليلي. سمع دانيال يقول: \"إذا كانت ليلي فارساً، فإن ليلي محتالة\". سمع ليلي يقول: \"ليلي فارس أو دانيال فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال محتال  \n(2) ليلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: جاك وبنيامين. قال لك جاك إن بنيامين فارس أو جاك فارس. علق بنيامين قائلاً: \"إذا كان جاك فارساً، فإن جاك محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاك فارس  \n(2) بنيامين محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: دانيال وصموئيل. قال دانيال: \"صموئيل محتال أو صموئيل فارس.\" قال صموئيل إن صموئيل فارس أو دانيال فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال فارس  \n(2) صموئيل فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: ليام وآريا. \"آريا ليست محتالة\" - ليام. أكدت آريا: \"آريا فارس إذا وفقط إذا كان ليام فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام فارس  \n(2) آريا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: ويليام، ونوح. أعرب ويليام عن أن نوح محتال أو نوح فارس. في تصريح من نوح: \"ويليام فارس إذا وفقط إذا كان ويليام محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام فارس  \n(2) نوح محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: ميا وآريا. \"ميا فارس أو آريا فارس\"، أعلنت ميا. قالت آريا، \"إذا كانت ميا فارسًا، فإن ميا محتالة.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا فارس  \n(2) آريا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: أورورا وشارلوت. قالت أورورا: \"شارلوت فارس إذا وفقط إذا كانت أورورا فارساً\". كما قالت شارلوت: \"إذا كانت شارلوت فارساً، فإن أورورا فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أورورا فارس  \n(2) شارلوت فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: كلوي ويعقوب. قالت كلوي: \"يعقوب فارس ويعقوب محتال\". أكد يعقوب: \"كلوي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) كلوي محتالة  \n(2) يعقوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: ليام ولوغان. سمع ليام يقول: \"ليام فارس إذا وفقط إذا كان لوغان محتالًا\". قال لوغان: \"ليام ليس محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام محتار  \n(2) لوغان محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: صموئيل، وإيزابيلا. \"إيزابيلا فارس\" - صموئيل. قالت إيزابيلا إن صموئيل محتال وإيزابيلا فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صموئيل محتال  \n(2) إيزابيلا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: بنيامين وليلي. في كلمات بنيامين: \"إذا كانت ليلي محتالة، فإن ليلي فارس\". \"بنيامين محتال وبنيامين فارس\"، أعلنت ليلي. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين محتالة\n(2) ليلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: مايسون وزوي. لاحظ مايسون: \"زوي فارس وزوي محتالة\". أكدت زوي: \"مايسون فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايسون محتالة\n(2) زوي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: صوفيا وشارلوت. علقت صوفيا، \"إذا كانت صوفيا فارساً، فإن شارلوت محتالة\". \"صوفيا محتالة وصوفيا فارس\" - شارلوت. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) شارلوت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: ويليام، وداوود. كما قال ويليام: \"داوود محتال وداوود فارس\". علق داوود: \"إذا كان ويليام فارسًا، فإن داوود فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام محتال  \n(2) داوود فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: صوفيا، ونوح. \"إذا كانت صوفيا فارسة، فإن نوح محتال\" - صوفيا. لاحظ نوح، \"إذا كانت صوفيا فارسة، فإن نوح فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) نوح محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: شارلوت، وإيفلين. قالت شارلوت: \"إذا كانت شارلوت فارساً، فإن إيفلين فارس.\" قالت إيفلين: \"إيفلين فارس إذا وفقط إذا كانت شارلوت فارساً.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت فارس  \n(2) إيفلين فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: دانيال، وجاك. أعرب دانيال عن أنه إذا كان دانيال فارسًا، فإن جاك فارس. \"جاك فارس\"، ذكر جاك. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال فارس  \n(2) جاك فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: إيفلين وهاربر. \"هاربر ليست فارساً\"، ذكرت إيفلين. في كلمات هاربر: \"إيفلين محتالة إذا وفقط إذا كانت إيفلين فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين فارس  \n(2) هاربر محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: أفري ومايكل. \"أفري فارس إذا وفقط إذا كان مايكل محتالاً\"، ذكر أفري. \"أفري ليس فارساً\"، أعلن مايكل. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري فارس  \n(2) مايكل محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: إليزابيث وأورورا. وفقاً لإليزابيث، \"إليزابيث فارس إذا وفقط إذا كانت أورورا فارسة\". قالت أورورا، \"إليزابيث فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث فارس  \n(2) أورورا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: رايلي وبنيامين. كما قالت رايلي: \"رايلي فارس أو بنيامين محتال\". أكد بنيامين: \"رايلي محتال إذا وفقط إذا كان بنيامين فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) رايلي محتال  \n(2) بنيامين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: بينيلوب وأوليفر. قالت بينيلوب إن أوليفر محتال إذا وفقط إذا كانت بينيلوب فارسة. عبر أوليفر عن أنه إذا كانت بينيلوب محتالة، فإن بينيلوب فارسة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب محتالة  \n(2) أوليفر محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: كلوي وجيمس. كما قالت كلوي، \"جيمس محتال\". وفقاً لجيمس، \"كلوي محتالة إذا وفقط إذا كان جيمس فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) كلوي محتالة  \n(2) جيمس فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: هنري، وداوود. \"داوود محتال وداوود فارس\"، ذكر هنري. في تصريح لداوود: \"هنري محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هنري محتال  \n(2) داوود فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: إيفلين وإليزابيث. أخبرتك إيفلين أن إيفلين هي فارس إذا وفقط إذا كانت إليزابيث محتالة. \"إيفلين فارس\" - إليزابيث. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين محتالة\n(2) إليزابيث محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: جاكسون وإليزابيث. كما قال جاكسون، \"إليزابيث محتالة وجاكسون فارس\". \"إذا كان جاكسون محتالاً، فإن جاكسون فارس\"، أعلنت إليزابيث. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون محتالة\n(2) إليزابيث محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أيدن وإيما. قال أيدن: \"أيدن فارس وإيما فارس\". \"إذا كانت إيما فارسة، فإن أيدن فارس\" - إيما. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن فارس  \n(2) إيما فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: سباستيان وآفا. في تصريح لسباستيان: \"آفا فارس\". \"إذا كان سباستيان فارساً، فإن آفا فارس\"، أعلنت آفا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سباستيان فارس  \n(2) آفا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: جيمس وأوليفر. جيمس أكد: \"إذا كان أوليفر محتالًا، فإن أوليفر فارس\". أوليفر أخبرك أن جيمس فارس أو جيمس محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس فارس  \n(2) أوليفر فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: رايلي وماثيو. \"ماثيو محتال أو ماثيو فارس\"، ادعت رايلي. علق ماثيو، \"إذا كانت رايلي محتالة، فإن ماثيو فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) رايلي فارس  \n(2) ماثيو فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: جاكسون ومايكل. قال جاكسون: \"إذا كان جاكسون فارسًا، فإن مايكل محتال\". لاحظ مايكل: \"جاكسون ليس فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون فارس  \n(2) مايكل محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: بينيلوب وإسكندر. قالت بينيلوب: \"إسكندر فارس.\" أعلن إسكندر: \"بينيلوب محتالة إذا وفقط إذا كانت بينيلوب فارسًا.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب محتالة  \n(2) إسكندر محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: آريا، ونوح. \"نوح ليس فارساً\"، ذكرت آريا. \"آريا محتالة إذا وفقط إذا كان نوح فارساً\"، أعلن نوح. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آريا محتالة  \n(2) نوح فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: نوح، وجاكسون. قال نوح: \"جاكسون محتال إذا وفقط إذا كان نوح فارساً\". أخبرك جاكسون أنه إذا كان نوح فارساً، فإن نوح محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح فارس  \n(2) جاكسون محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: آفا وإيثان. أكدت آفا: \"آفا فارس إذا وفقط إذا كان إيثان محتالًا\". قال إيثان: \"إيثان فارس أو آفا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا فارس  \n(2) إيثان محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أبيجيل، وفيكتوريا. قالت أبيجيل: \"إذا كانت فيكتوريا محتالة، فإن فيكتوريا فارس\". في بيان من فيكتوريا: \"فيكتوريا فارس وأبيجيل محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أبيجيل محتالة\n(2) فيكتوريا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: يوسف، وجاكسون. \"إذا كان جاكسون فارسًا، فإن يوسف فارس\" - يوسف. \"إذا كان جاكسون فارسًا، فإن يوسف فارس\" - ادعى جاكسون. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف فارس  \n(2) جاكسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: نوح وشارلوت. أخبرك نوح أن شارلوت فارس وأن نوح فارس. سُمعت شارلوت تقول: \"شارلوت فارس إذا وفقط إذا كان نوح فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح فارس  \n(2) شارلوت فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: أفري، وكلوي. قالت أفري إن كلوي فارس، وكلوي محتالة. \"أفري ليست فارساً\"، ذكرت كلوي. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري محتالة  \n(2) كلوي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: إيفلين وآفا. \"إذا كانت إيفلين فارساً، فإن آفا فارساً\"، ادعت إيفلين. أخبرتك آفا أن آفا فارس أو إيفلين فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين فارس  \n(2) آفا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: ماثيو، وفيكتوريا. في كلمات ماثيو: \"فيكتوريا ليست فارسًا\". في كلمات فيكتوريا: \"فيكتوريا فارس ومايثيو فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ماثيو فارس  \n(2) فيكتوريا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: دانيال، وويليام. \"ويليام فارس أو دانيال فارس\"، أعلن دانيال. أعرب ويليام عن أن دانيال فارس أو دانيال محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال فارس  \n(2) ويليام فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: لوك وإسكندر. قال لوك: \"إذا كان لوك فارسًا، فإن إسكندر محتال.\" قال إسكندر: \"إسكندر فارس ولوك فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) إسكندر محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: ميا وصموئيل. عبرت ميا عن أن ميا فارس وصمويل فارس. عبر صموئيل عن أن ميا فارس وأن ميا محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا محتالة  \n(2) صموئيل محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: ليام، وهنري. وفقاً لليام، \"ليام فارس إذا وفقط إذا كان هنري فارساً\". قال هنري، \"ليام ليس محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام فارس  \n(2) هنري فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: أوليفيا ويوسف. \"إذا كان يوسف فارساً، فإن أوليفيا فارس\" - أوليفيا. علق يوسف، \"أوليفيا محتالة إذا وفقط إذا كانت أوليفيا فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا فارس  \n(2) يوسف محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: جاك، وجاكسون. \"جاك فارس وجاكسون محتال\"، ادعى جاك. أخبرك جاكسون أن جاك ليس محتالًا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاك محتال  \n(2) جاكسون محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: إيفلين وإيثان. في تصريح من إيفلين: \"إيفلين فارس إذا وفقط إذا كان إيثان محتالًا\". كما قال إيثان: \"إيثان فارس إذا وفقط إذا كانت إيفلين محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين محتالة  \n(2) إيثان محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أفري وأورورا. علقت أفري، \"إذا كانت أورورا فارسة، فإن أفري فارسة\". وفقًا لأورورا، \"أفري فارسة وأفري محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري فارس  \n(2) أورورا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: إيزابيلا وإيفلين. في تصريح من إيزابيلا: \"إيفلين ليست فارسًا\". قالت إيفلين: \"إيزابيلا محتالة أو إيزابيلا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا محتالة\n(2) إيفلين فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: صموئيل وسكارليت. \"إذا كانت سكارليت محتالة، فإن صموئيل فارس\"، أعلن صموئيل. \"صموئيل ليس فارساً\"، أعلنت سكارليت. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صموئيل فارس  \n(2) سكارليت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: جيمس وصموئيل. جيمس أعرب عن أن صموئيل فارس أو جيمس فارس. \"جيمس محتال أو جيمس فارس\"، ادعى صموئيل. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس فارس  \n(2) صموئيل فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: هاربر وزوي. علق هاربر قائلاً: \"زوي محتالة إذا وفقط إذا كانت زوي فارسة\". سُمعت زوي تقول: \"هاربر محتال أو هاربر فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر محتالة  \n(2) زوي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: رايلي وإليزابيث. قالت رايلي: \"إذا كانت إليزابيث محتالة، فإن إليزابيث فارس\". قالت إليزابيث: \"رايلي محتالة أو رايلي فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) رايلي فارس  \n(2) إليزابيث فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: هاربر وإليزابيث. قالت هاربر: \"إليزابيث فارس وإليزابيث محتالة\". وفقاً لإليزابيث، \"إليزابيث فارس أو هاربر محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر محتالة  \n(2) إليزابيث فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أفري، وليام. في كلمات أفري: \"أفري فارس أو وليام فارس\". في تصريح وليام: \"وليام فارس إذا وفقط إذا كان أفري محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري محتال  \n(2) ليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: صوفيا وإيميلي. في كلمات صوفيا: \"إذا كانت إيميلي فارسة، فإن إيميلي محتالة\". قالت إيميلي: \"إذا كانت صوفيا محتالة، فإن إيميلي فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا محتالة  \n(2) إميلي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: إيلا ويعقوب. \"يعقوب محتـال\"، أعلنت إيلا. أكد يعقوب: \"إذا كان يعقوب فارسًا، فإن إيلا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا محتالة  \n(2) يعقوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: جاك وآريا. \"إذا كان جاك فارسًا، فإن آريا محتالة\"، أعلن جاك. أخبرتك آريا أن جاك محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاك فارس  \n(2) آريا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: آفا، ولوكاس. أخبرتك آفا أن لوكاس فارس. \"لوكاس فارس وآفا محتالة\"، ذكر لوكاس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا محتالة  \n(2) لوكاس محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: مايسون وأوليفر. \"أوليفر محتال إذا وفقط إذا كان أوليفر فارسًا\"، ذكر مايسون. \"مايسون فارس إذا وفقط إذا كان مايسون محتالًا\"، أعلن أوليفر. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايسون محتال  \n(2) أوليفر محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أميليا، وأورورا. \"أورورا ليست محتالة\"، ذكرت أميليا. قالت أورورا، \"أميليا محتالة أو أميليا فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا فارس  \n(2) أورورا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: أميليا ويعقوب. \"يعقوب فارس ومحتال\"، أعلنت أميليا. في تصريح ليعقوب: \"إذا كانت أميليا فارسة، فإن يعقوب فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا محتالة  \n(2) يعقوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: سكارليت، وويليام. في كلمات سكارليت: \"ويليام فارس إذا وفقط إذا كان ويليام محتالاً\". تم سماع ويليام يقول: \"إذا كانت سكارليت محتالاً، فإن سكارليت فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سكارليت محتالة  \n(2) ويليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: مايسون، وهاربر. في تصريح لمايسون: \"هاربر محتال ومايسون فارس\". هاربر صرح، \"مايسون فارس أو مايسون محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايسون محتال  \n(2) هاربر فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: لوك وغريس. أخبرك لوك أن غريس محتالة أو غريس فارسة. أكدت غريس: \"إذا كانت غريس فارسة، فإن لوك فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) غريس فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أفري وجيمس. أفري قال: \"جيمس محتال\". جيمس علق: \"جيمس فارس وأفري فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري فارس  \n(2) جيمس محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: جاكسون، وليلي. قال جاكسون: \"ليلي محتالة أو جاكسون فارس.\" قالت ليلي: \"جاكسون فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون فارس  \n(2) ليلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أوين وسكارليت. أوين أعرب عن أن أوين فارس وسكارليت محتالة. سكاريت قالت إنه إذا كانت سكاريت فارسة، فإن أوين محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين محتال  \n(2) سكارليت فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: إيما وإيزابيلا. وفقاً لإيما، \"إذا كانت إيزابيلا فارسة، فإن إيما فارسة\". قالت إيزابيلا، \"إذا كانت إيما محتالة، فإن إيما فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما فارس  \n(2) إيزابيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: نوح وماثيو. \"ماثيو فارس\"، ذكر نوح. علق ماثيو، \"نوح فارس إذا وفقط إذا كان نوح محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح محتال  \n(2) ماثيو محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: ليام، وداوود. قال ليام إن داوود محتال أو ليام فارس. أكد داوود: \"إذا كان داوود فارسًا، فإن ليام فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام فارس  \n(2) داوود فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: إليزابيث، ونوح. أخبرتك إليزابيث أن إليزابيث هي فارس إذا وفقط إذا كان نوح محتالًا. \"إليزابيث محتالة\"، ادعى نوح. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث فارس  \n(2) نوح محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: أوليفيا، وجاك. \"إذا كان جاك فارساً، فإن أوليفيا فارساً\"، ادعت أوليفيا. قال جاك: \"أوليفيا فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا فارس  \n(2) جاك فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: إيثان وإليزابيث. قال إيثان: \"إليزابيث محتالة وإليزابيث فارس.\" قالت إليزابيث: \"إيثان فارس وإليزابيث فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان محتال  \n(2) إليزابيث محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: ليام، ونوح. قال ليام: \"إذا كان نوح محتالاً، فإن ليام فارس\". عبّر نوح عن أنه إذا كان نوح فارساً، فإن ليام فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام فارس  \n(2) نوح فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: إيزابيلا وإيما. \"إيما فارس أو إيما محتال\"، ادعت إيزابيلا. أخبرتك إيما أن إيزابيلا فارس أو إيما فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا فارس  \n(2) إيما فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: داوود وآفا. \"آفا محتالة إذا وفقط إذا كانت آفا فارسة\"، أعلن داوود. أكدت آفا: \"داوود فارس وآفا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود محتال  \n(2) آفا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: لوغان وإيلا. لاحظ لوغان، \"إذا كان لوغان فارساً، فإن إيلا محتالة\". \"إيلا فارس و لوغان محتال\"، أعلنت إيلا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان فارس  \n(2) إيلا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: صوفيا وآريا. في كلمات صوفيا: \"آريا محتالة إذا وفقط إذا كانت آريا فارسة\". في كلمات آريا: \"صوفيا محتالة وصوفيا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا محتالة  \n(2) آريا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: سباستيان وآفا. كما قال سباستيان، \"آفا فارس إذا وفقط إذا كان سباستيان فارساً\". وفقاً لآفا، \"آفا فارس إذا وفقط إذا كان سباستيان فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سباستيان فارس  \n(2) آفا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: لوكاس وسباستيان. قال لوكاس: \"سباستيان محتال ولوكاس فارس\". كما قال سباستيان: \"لوكاس فارس إذا وفقط إذا كان سباستيان فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس فارس  \n(2) سباستيان محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: ماثيو وإليزابيث. في كلمات ماثيو: \"ماثيو فارس إذا وفقط إذا كانت إليزابيث فارسة\". إليزابيث قالت: \"إذا كان ماثيو فارساً، فإن ماثيو محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ماثيو محتال  \n(2) إليزابيث فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: إيلا وإيزابيلا. أخبرتك إيلا أن إيزابيلا محتالة. قالت إيزابيلا إن إيلا فارس إذا وفقط إذا كانت إيلا محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا فارس  \n(2) إيزابيلا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أبيجيل وإيزابيلا. قالت أبيجيل: \"إيزابيلا فارس أو أبيجيل فارس.\" قالت إيزابيلا: \"أبيجيل ليست فارسًا.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أبيجيل فارس  \n(2) إيزابيلا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أيدن، وفيكتوريا. أيدن قال: \"إذا كانت فيكتوريا محتالة، فإن فيكتوريا فارس\". فيكتوريا أكدت: \"إذا كانت فيكتوريا فارسة، فإن أيدن فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن فارس  \n(2) فيكتوريا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: أميليا وأوليفيا. كما قالت أميليا، \"إذا كانت أميليا فارساً، فإن أوليفيا محتالة\". قالت أوليفيا، \"أوليفيا فارس إذا وفقط إذا كانت أميليا فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا فارس  \n(2) أوليفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: إيفلين وأوليفيا. قالت إيفلين: \"أوليفيا فارس\". في تصريح من أوليفيا: \"إيفلين محتالة أو أوليفيا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين فارس  \n(2) أوليفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: إيثان ولوكاس. في تصريح من إيثان: \"لوكاس محتال إذا وفقط إذا كان إيثان فارساً\". قال لوكاس: \"إيثان فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان محتال  \n(2) لوكاس محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: إيفلين، وليام. قالت إيفلين: \"إيفلين فارس إذا وفقط إذا كان ليام محتالاً\". وفي تصريح لليام: \"ليام فارس أو إيفلين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين محتالة\n(2) ليام محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: فيكتوريا وأبيجيل. أكدت فيكتوريا: \"إذا كانت أبيجيل محتالة، فإن أبيجيل فارس\". \"أبيجيل فارس إذا وفقط إذا كانت فيكتوريا فارسة\"، أعلنت أبيجيل. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) فيكتوريا فارس  \n(2) أبيجيل فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: ويليام وشارلوت. علق ويليام قائلاً: \"إذا كان ويليام فارسًا، فإن شارلوت محتالة\". في بيان لشارلوت: \"ويليام فارس وشارلوت فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام فارس  \n(2) شارلوت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: إيلا وسكارليت. تم سماع إيلا تقول: \"سكارليت محتالة أو سكارليت فارس\". \"إيلا فارس أو إيلا محتالة\"، ذكرت سكارليت. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا فارس  \n(2) سكارليت فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: صوفيا، وكلوي. قالت صوفيا: \"إذا كانت صوفيا فارسًا، فإن كلوي فارس\". عبرت كلوي عن أن صوفيا محتالة أو صوفيا فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) كلوي فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: أوليفيا وإيلا. سُمعت أوليفيا تقول: \"إذا كانت أوليفيا فارسة، فإن إيلا فارسة\". أخبرتك إيلا أنه إذا كانت إيلا فارسة، فإن أوليفيا فارسة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا فارس  \n(2) إيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: بنيامين، وبينيلوب. قال بنيامين: \"بينيلوب فارس إذا وفقط إذا كان بنيامين فارسًا\". أخبرتك بينيلوب أن بينيلوب فارس وبنيامين فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين فارس  \n(2) بينيلوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: هنري وبنيامين. هنري أعرب عن أن هنري هو فارس إذا وفقط إذا كان بنيامين فارساً. بكلمات بنيامين: \"هنري محتال وبنيامين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هنري محتال  \n(2) بنيامين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: داوود، ونوح. أخبرك داوود أن نوح فارس إذا وفقط إذا كان نوح محتالًا. عبر نوح عن أن داوود فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود محتار  \n(2) نوح محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: بنيامين ويعقوب. قال بنيامين إن يعقوب محتال أو بنيامين فارس. لاحظ يعقوب: \"يعقوب فارس إذا وفقط إذا كان بنيامين محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين محتال  \n(2) يعقوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: فيكتوريا وإليزابيث. وفقًا لفيكتوريا، \"إليزابيث فارس وفيكتوريا فارس\". لاحظت إليزابيث، \"فيكتوريا فارس إذا وفقط إذا كانت إليزابيث فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) فيكتوريا فارس  \n(2) إليزابيث فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: صوفيا وزوي. صوفيا قالت: \"زوي ليست محتالة\". زوي عبرت عن أن صوفيا فارس وصوفيا محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا محتالة\n(2) زوي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: شارلوت وزوي. قالت شارلوت: \"زوي فارس إذا وفقط إذا كانت زوي محتالة\". وفي تصريح من زوي: \"شارلوت ليست فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت محتالة  \n(2) زوي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: ويليام وبينيلوب. في تصريح من ويليام: \"بينيلوب محتالة إذا وفقط إذا كانت بينيلوب فارسة\". في تصريح من بينيلوب: \"ويليام محتال إذا وفقط إذا كان ويليام فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام محتار  \n(2) بينيلوب محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: هاربر، وأميليا. قالت هاربر: \"هاربر فارس أو أميليا محتالة.\" كما قالت أميليا: \"أميليا فارس إذا وفقط إذا كانت هاربر محتالة.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر محتالة  \n(2) أميليا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: لوغان وجيمس. علق لوغان قائلاً: \"جيمس محتال وجيمس فارس\". علق جيمس قائلاً: \"لوغان محتال أو لوغان فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان محتال  \n(2) جيمس فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: إيزابيلا، وأميليا. سُمعت إيزابيلا تقول: \"أميليا فارس إذا وفقط إذا كانت إيزابيلا فارسًا\". وأكدت أميليا: \"إيزابيلا محتالة إذا وفقط إذا كانت أميليا فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا محتالة  \n(2) أميليا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: جاكسون وهاربر. قال جاكسون: \"جاكسون فارس وهاربر فارس\". قالت هاربر إنه إذا كانت هاربر فارسًا، فإن جاكسون محتار. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون محتال  \n(2) هاربر فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: سكارليت ومايكل. سُمع سكارليت تقول: \"مايكل فارس ومايكل محتال\". \"إذا كان مايكل فارساً، فإن سكارليت محتالة\"، أعلن مايكل. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سكارليت محتالة  \n(2) مايكل فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: صوفيا ومايسون. \"مايسون محتال ومايسون فارس\"، ادعت صوفيا. قال مايسون: \"صوفيا فارس وصوفيا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا محتالة  \n(2) مايسون محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: غريس، وأميليا. في تصريح من غريس: \"أميليا محتالة إذا وفقط إذا كانت غريس فارسة\". أميليا أخبرتك أنه إذا كانت غريس فارسة، فإن أميليا فارسة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) غريس فارس  \n(2) أميليا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: غريس، وبينيلوب. قالت غريس: \"بينيلوب محتالة.\" وأشارت بينيلوب: \"غريس فارس أو بينيلوب فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) غريس محتالة\n(2) بينيلوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: سباستيان وأورورا. قال سباستيان: \"سباستيان فارس وأورورا محتالة\". قالت أورورا: \"سباستيان فارس أو سباستيان محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سباستيان محتال  \n(2) أورورا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أورورا ويعقوب. أخبرتك أورورا أن يعقوب فارس. وفقًا ليعقوب، \"إذا كان يعقوب فارسًا، فإن أورورا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أورورا فارس  \n(2) يعقوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: آفا وزوي. علقت آفا قائلة: \"آفا فارس إذا وفقط إذا كانت زوي فارسة\". وفي كلمات زوي: \"آفا محتالة إذا وفقط إذا كانت زوي فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا محتالة  \n(2) زوي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: بنيامين ويعقوب. في كلمات بنيامين: \"يعقوب فارس\". سمع يعقوب يقول: \"يعقوب فارس إذا وفقط إذا كان بنيامين محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين محتال  \n(2) يعقوب محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: لوك وأفري. أكد لوك: \"لوك فارس أو أفري محتال\". \"إذا كانت أفري فارسة، فإن لوك محتال\"، أعلنت أفري. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك محتال  \n(2) أفري فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: إيلا ويعقوب. قالت إيلا: \"إيلا فارس ويعقوب فارس\". أعرب يعقوب عن أن إيلا محتالة إذا وفقط إذا كانت إيلا فارسًا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا محتالة  \n(2) يعقوب محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: هنري وأيدن. هنري أعرب عن أن أيدن محتال إذا وفقط إذا كان هنري فارسًا. \"هنري ليس فارسًا\"، أعلن أيدن. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هنري فارس  \n(2) أيدن محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أوين، ولوك. \"أوين فارس أو لوك محتال\" - أوين. قال لوك: \"إذا كان لوك فارسًا، فإن أوين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين فارس  \n(2) لوك فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: لوكاس، وداوود. قال لوكاس: \"داوود محتال أو داوود فارس\". أعرب داوود عن أن لوكاس ليس محتالًا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس فارس  \n(2) داوود فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أوين، وسباستيان. علق أوين، \"سباستيان فارس أو سباستيان محتال\". عبر سباستيان عن أن أوين محتال أو أوين فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين فارس  \n(2) سباستيان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: زوي، وهنري. قالت زوي: \"زوي هي فارس إذا وفقط إذا كان هنري محتالًا\". قال هنري إن هنري هو فارس إذا وفقط إذا كانت زوي فارسًا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) زوي فارس  \n(2) هنري محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: إميلي وبنيامين. قالت إميلي: \"بنيامين ليس فارسًا\". أشار بنيامين: \"إميلي هي فارس إذا وفقط إذا كانت إميلي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي فارس  \n(2) بنيامين محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: ليلي، ولوغان. أخبرتك ليلي أن لوغان فارس أو ليلي فارس. \"ليلي محتالة إذا وفقط إذا كان لوغان فارساً\"، ادعى لوغان. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي محتالة\n(2) لوغان محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: أفري وإيثان. أفري أكد: \"إذا كان إيثان محتالاً، فإن إيثان فارس\". إيثان أشار، \"أفري محتال أو إيثان فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري فارس  \n(2) إيثان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: أميليا وإيزابيلا. أخبرتك أميليا أن أميليا هي فارس إذا وفقط إذا كانت إيزابيلا فارساً. قالت إيزابيلا: \"أميليا هي فارس وإيزابيلا هي فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا فارس  \n(2) إيزابيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: بنيامين وفيكتوريا. \"فيكتوريا ليست محتالة\"، ذكر بنيامين. عبرت فيكتوريا عن أنه إذا كانت فيكتوريا فارسة، فإن بنيامين هو فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين فارس  \n(2) فيكتوريا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: بينيلوب، وأميليا. كما قالت بينيلوب، \"إذا كانت بينيلوب فارساً، فإن أميليا فارساً\". أميليا صرحت، \"إذا كانت بينيلوب محتالة، فإن أميليا فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب هي فارس  \n(2) أميليا هي فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: شارلوت وصوفيا. علقت شارلوت، \"صوفيا محتالة إذا وفقط إذا كانت شارلوت فارسة\". وفقاً لصوفيا، \"شارلوت محتالة إذا وفقط إذا كانت صوفيا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت محتالة  \n(2) صوفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: لوكاس وجيمس. أكد لوكاس: \"لوكاس فارس إذا وفقط إذا كان جيمس فارسًا\". \"إذا كان جيمس فارسًا، فإن لوكاس فارس\"، أعلن جيمس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس فارس  \n(2) جيمس فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أفري، وليام. علقت أفري، \"ليام ليس فارسًا\". كما قال ليام، \"ليام فارس أو أفري فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري محتالة  \n(2) ليام فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: لوك وصموئيل. أعرب لوك عن أن صموئيل محتال إذا وفقط إذا كان لوك فارسًا. أخبرك صموئيل أن صموئيل فارس إذا وفقط إذا كان لوك فارسًا. إذن من هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) صموئيل محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: صوفيا وجيمس. \"جيمس فارس إذا وفقط إذا كانت صوفيا فارسًا\"، ادعت صوفيا. جيمس أكد: \"صوفيا ليست فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا محتالة  \n(2) جيمس فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: غريس وإليزابيث. قالت غريس: \"إليزابيث ليست محتالة\". وادعت إليزابيث: \"غريس محتالة وغريس فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) غريس محتالة\n(2) إليزابيث محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: سكارليت وأبيجيل. قالت سكارليت: \"أبيجيل فارس\". وفقاً لأبيجيل، \"سكارليت محتالة أو سكارليت فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سكارليت هي فارس  \n(2) أبيجيل هي فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: إيلا وإيفلين. \"إيفلين محتالة أو إيفلين فارسة\" - إيلا. أكدت إيفلين: \"إيلا ليست فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا فارس\n(2) إيفلين محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أوين وآريا. أوين أعرب عن أن آريا محتالة إذا وفقط إذا كانت آريا فارسة. آريا صرحت، \"أوين فارس أو أوين محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين محتال  \n(2) آريا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أوليفيا وإيزابيلا. قالت أوليفيا: \"إيزابيلا محتالة أو إيزابيلا فارسة\". قالت إيزابيلا إن أوليفيا فارسة أو إيزابيلا فارسة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا فارس  \n(2) إيزابيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: آريا، وإليزابيث. قالت آريا: \"إليزابيث ليست محتالة\". علقت إليزابيث: \"آريا محتالة إذا وفقط إذا كانت إليزابيث فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آريا محتالة  \n(2) إليزابيث محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: إيثان وأوليفيا. أخبرك إيثان أن أوليفيا محتالة إذا وفقط إذا كانت أوليفيا فارسة. \"إيثان محتال أو أوليفيا فارسة\"، ادعت أوليفيا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان محتال  \n(2) أوليفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: إيزابيلا وزوي. قالت إيزابيلا: \"إذا كانت زوي محتالة، فإن زوي فارس.\" وأشارت زوي: \"إيزابيلا محتالة وزوي فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا محتالة\n(2) زوي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: صوفيا وسكارليت. صوفيا أعربت عن أن سكارليت إما فارس أو محتالة. \"إذا كانت صوفيا محتالة، فإن صوفيا فارس\" - سكارليت. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) سكارليت فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: داوود وميا. كما قال داوود، \"ميا محتالة أو داوود فارس\". ميا أخبرتكم أن داوود فارس وأن داوود محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود فارس  \n(2) ميا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: فيكتوريا، وجاكسون. عبرت فيكتوريا عن أن جاكسون هو فارس إذا وفقط إذا كان جاكسون محتالًا. عبر جاكسون عن أن فيكتوريا هي فارس أو فيكتوريا هي محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) فيكتوريا محتالة  \n(2) جاكسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: زوي وإيلا. زوي أعربت عن أن زوي فارس وإيلا فارس. وفقاً لإيلا، \"إذا كانت زوي فارساً، فإن زوي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) زوي محتالة  \n(2) إيلا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: آفا وهاربر. قالت آفا: \"هاربر فارس إذا وفقط إذا كانت آفا فارساً\". وفقاً لهاربر، \"آفا فارس إذا وفقط إذا كان هاربر فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا فارس  \n(2) هاربر فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: إيلا وآريا. قالت إيلا: \"آريا فارس إذا وفقط إذا كانت آريا محتالة\". وأكدت آريا: \"إيلا فارس وإيلا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا محتالة  \n(2) آريا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: ويليام، وهنري. كما قال ويليام، \"ويليام فارس إذا وفقط إذا كان هنري محتالًا\". سمع هنري يقول، \"إذا كان ويليام محتالًا، فإن ويليام فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام محتار  \n(2) هنري محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: ويليام وآفا. كما قال ويليام، \"آفا محتالة أو آفا فارسة\". \"إذا كان ويليام فارسًا، فإن ويليام محتال\" - آفا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام فارس  \n(2) آفا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أوليفر ويعقوب. علق أوليفر، \"أوليفر فارس ومحتال يعقوب\". قال يعقوب، \"أوليفر فارس إذا وفقط إذا كان يعقوب فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفر فارس  \n(2) يعقوب محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: مايسون، وويليام. أخبرك مايسون أن ويليام محتال. في تصريح لويليام: \"مايسون فارس وويليام فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايسون فارس  \n(2) ويليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: آريا، وأورورا. \"أورورا فارس\" - آريا. \"آريا محتالة وآريا فارس\" - أعلنت أورورا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آريا محتالة  \n(2) أورورا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أوليفر وإيفلين. قال أوليفر: \"إذا كان أوليفر فارسًا، فإن إيفلين فارس\". \"أوليفر فارس وإيفلين فارس\" - إيفلين. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفر فارس  \n(2) إيفلين فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: صوفيا وإيفلين. \"إيفلين فارس أو إيفلين محتالة\" - صوفيا. في تصريح لإيفلين: \"إيفلين فارس وصوفيا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس\n(2) إيفلين محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: جاكسون وإيما. في تصريح من جاكسون: \"جاكسون فارس إذا وفقط إذا كانت إيما فارسة\". \"إيما فارسة إذا وفقط إذا كان جاكسون فارساً\" - إيما. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون فارس  \n(2) إيما فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: إميلي ومايسون. أعربت إميلي عن أن مايسون فارس وأن إميلي فارس. أكد مايسون: \"إذا كانت إميلي فارسًا، فإن إميلي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي محتالة  \n(2) مايسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: لوغان وشارلوت. كما قال لوغان، \"شارلوت محتالة إذا وفقط إذا كانت شارلوت فارسة\". لاحظت شارلوت، \"إذا كان لوغان فارسًا، فإن لوغان محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان محتال  \n(2) شارلوت فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: هاربر، وهنري. \"إذا كان هنري محتالًا، فإن هاربر فارس\" - هاربر. قال هنري: \"هنري فارس إذا وفقط إذا كان هاربر محتالًا.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر محتالة  \n(2) هنري محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: إيما وإيفلين. قالت إيما: \"إيفلين فارس إذا وفقط إذا كانت إيما فارسًا\". علقت إيفلين: \"إذا كانت إيما محتالة، فإن إيما فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما فارس  \n(2) إيفلين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: كلوي وإيثان. قالت كلوي إن إيثان فارس أو إيثان محتال. في كلمات إيثان: \"كلوي محتالة وإيثان فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) كلوي فارس  \n(2) إيثان محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: إليزابيث ومايكل. إليزابيث أخبرتك أن مايكل محتال ومايكل فارس. كما قال مايكل: \"إليزابيث ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث محتالة  \n(2) مايكل محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: كلوي وغريس. سُمعت كلوي تقول: \"كلوي فارس وغريس محتالة\". \"كلوي محتالة أو كلوي فارس\" - غريس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) كلوي محتالة\n(2) غريس فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: لوغان وإيميلي. أعرب لوغان عن أن لوغان فارس أو إيميلي محتالة. علقت إيميلي قائلة: \"لوغان محتال إذا وفقط إذا كان لوغان فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان فارس\n(2) إميلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: إيلا، ولوغان. أكدت إيلا: \"إيلا فارس إذا وفقط إذا كان لوغان فارساً\". بكلمات لوغان: \"لوغان فارس وإيلا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا محتالة  \n(2) لوغان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: صوفيا وإيلا. في كلمات صوفيا: \"إيلا محتالة إذا وفقط إذا كانت إيلا فارسة\". أخبرتك إيلا أنه إذا كانت صوفيا محتالة، فإن صوفيا فارسة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا محتالة\n(2) إيلا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: نوح وآفا. علق نوح، \"آفا ليست فارسًا\". قالت آفا، \"نوح فارس أو نوح محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح محتال  \n(2) آفا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: مايسون، وإيما. سمع مايسون يقول: \"مايسون فارس أو إيما محتالة\". لاحظت إيما: \"إذا كان مايسون محتالاً، فإن مايسون فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايسون فارس  \n(2) إيما فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: رايلي وإيثان. لاحظت رايلي، \"إيثان محتال إذا وفقط إذا كانت رايلي فارساً\". \"رايلي فارس إذا وفقط إذا كان إيثان فارساً\"، ذكر إيثان. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) رايلي فارس  \n(2) إيثان محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بسكانين: جيمس وسكارليت. قال جيمس: \"سكارليت محتالة أو جيمس فارس\". وفقاً لسكارليت، \"إذا كان جيمس محتالاً، فإن جيمس فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس فارس  \n(2) سكارليت فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: أوليفر وإيما. كما قال أوليفر: \"أوليفر فارس أو إيما محتالة\". \"أوليفر فارس إذا وفقط إذا كان أوليفر محتالًا\"، أعلنت إيما. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفر فارس  \n(2) إيما محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: إيما ورايلي. قالت إيما: \"إذا كانت إيما فارسًا، فإن رايلي فارس\". أخبرتك رايلي أنه إذا كانت إيما محتالة، فإن إيما فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما فارس  \n(2) رايلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: ليام وصموئيل. قال ليام: \"إذا كان صموئيل محتالًا، فإن صموئيل فارس.\" \"ليام فارس إذا وفقط إذا كان ليام محتالًا\"، ذكر صموئيل. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام محتار  \n(2) صموئيل محتار"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بسكانين: يعقوب وأوليفيا. قال يعقوب: \"يعقوب فارس أو أوليفيا فارس.\" وفقًا لأوليڤيا، \"إذا كانت أوليفيا فارسة، فإن يعقوب فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب فارس  \n(2) أوليفيا فارسة"
    }
]