[
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: مايكل، زوي، وإيثان. سمع مايكل يقول: \"إيثان فارس إذا وفقط إذا كان مايكل فارساً\". ذكرت زوي: \"زوي فارس أو إيثان فارس\". أكد إيثان: \"مايكل محتار إذا وفقط إذا كانت زوي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل فارس  \n(2) زوي فارسة  \n(3) إيثان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: مايكل، مايسون، ويعقوب. علق مايكل قائلاً: \"مايسون ليس فارسًا\". علق مايسون قائلاً: \"مايكل فارس ويعقوب محتال\". صرح يعقوب: \"إذا كان مايكل فارسًا، فإن يعقوب فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل فارس  \n(2) مايسون محتال  \n(3) يعقوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: لوكاس، هاربر، وأميليا. أعرب لوكاس عن أن هاربر ليس محتالًا. في تصريح لهاربر: \"هاربر فارس إذا وفقط إذا كانت أميليا محتالة\". كما قالت أميليا: \"هاربر ليس فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس فارس  \n(2) هاربر فارس  \n(3) أميليا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: أوين، يوسف، وصوفيا. قال أوين: \"يوسف فارس أو صوفيا فارس\". أعلن يوسف: \"أوين محتال إذا وفقط إذا كانت صوفيا فارس\". ادعت صوفيا: \"إذا كان يوسف محتالاً، فإن يوسف فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين محتال  \n(2) يوسف محتال  \n(3) صوفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: أبيجيل، سكارليت، وإيفلين. في كلمات أبيجيل: \"أبيجيل فارس إذا وفقط إذا كانت إيفلين فارسة\". علقت سكارليت، \"أبيجيل فارس\". وفقًا لإيفلين، \"سكارليت ليست فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أبيجيل محتالة  \n(2) سكارليت محتالة  \n(3) إيفلين فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: بينيلوب، ماثيو، وفيكتوريا. \"بينيلوب فارس وماثيو فارس\"، ادعت بينيلوب. سمع ماثيو يقول، \"فيكتوريا محتالة وفيكتوريا فارس\". قالت فيكتوريا إنه إذا كان ماثيو فارسًا، فإن ماثيو محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب محتالة  \n(2) ماثيو محتال  \n(3) فيكتوريا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: إميلي، ليام، وإليزابيث. وفقاً لإميلي، \"إليزابيث فارس أو إليزابيث محتالة\". ليام أخبرك أنه إذا كانت إليزابيث محتالة، فإن إميلي فارس. إليزابيث قالت، \"ليام محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي فارس  \n(2) ليام فارس  \n(3) إليزابيث محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: مايكل، آفا، وهنري. كما قال مايكل: \"آفا محتالة أو آفا فارسة\". \"مايكل ليس محتالًا\"، ذكرت آفا. في كلمات هنري: \"مايكل فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل فارس  \n(2) آفا فارس  \n(3) هنري فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: أوليفر، إسكندر، ومايسون. \"إسكندر محتال أو إسكندر فارس\" - أوليفر. \"مايسون ليس محتالاً\"، ذكر إسكندر. لاحظ مايسون، \"مايسون فارس أو أوليفر فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفر فارس  \n(2) إسكندر فارس  \n(3) مايسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: ليلي، صموئيل، وصوفيا. في تصريح ليلي: \"صوفيا فارس أو صموئيل فارس\". صرح صموئيل، \"صوفيا فارس أو ليلي محتالة\". كما قالت صوفيا، \"إذا كان صموئيل محتالاً، فإن صموئيل فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي فارس  \n(2) صموئيل فارس  \n(3) صوفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: شارلوت، لوك، وليام. أعربت شارلوت عن أن لوك هو محتـال إذا وفقط إذا كان ويليام محتـالًا. في كلمات لوك: \"شارلوت ليست فارسة\". \"شارلوت محتالة\"، أعلن ويليام. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت فارس  \n(2) لوك محتال  \n(3) ليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: سباستيان، ماثيو، ولوغان. سمع سباستيان يقول: \"لوغان محتال أو سباستيان فارس\". كما قال ماثيو: \"إذا كان لوغان فارسًا، فإن سباستيان محتال\". كما قال لوغان: \"ماثيو ليس محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سباستيان محتال  \n(2) ماثيو فارس  \n(3) لوغان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: ليلي، هاربر، ولوك. سُمعت ليلي تقول، \"هاربر محتال أو لوك فارس\". وفقًا لهاربر، \"إذا كانت ليلي محتالة، فإن لوك محتال\". قال لوك، \"ليلي فارس وليلي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي محتالة  \n(2) هاربر فارس  \n(3) لوك محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: جيمس، أبيجيل، وآفا. قال جيمس: \"أبيجيل فارس\". ادعت أبيجيل: \"أبيجيل فارس إذا وفقط إذا كان جيمس فارساً\". عبرت آفا عن أن أبيجيل ليست فارساً. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس فارس  \n(2) أبيجيل فارس  \n(3) آفا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: فيكتوريا، ويليام، وآريا. قالت فيكتوريا: \"آريا محتالة أو آريا فارسة\". أعرب ويليام عن أن فيكتوريا محتالة أو آريا محتالة. \"ويليام فارس أو ويليام محتال\"، أعلنت آريا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) فيكتوريا فارس  \n(2) ويليام محتال  \n(3) آريا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: سباستيان، شارلوت، ورايلي. قال سباستيان: \"رايلي محتال أو سباستيان فارس\". \"إذا كان سباستيان فارساً، فإن شارلوت فارس\" - شارلوت. في كلمات رايلي: \"سباستيان محتال إذا وفقط إذا كانت رايلي فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سباستيان محتال  \n(2) شارلوت فارس  \n(3) رايلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: أوين، يعقوب، وأميليا. قال أوين إن يعقوب ليس فارساً. قال يعقوب: \"إذا كانت أميليا محتالة، فإن أوين فارس.\" علقت أميليا: \"إذا كان أوين فارساً، فإن أوين محتال.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين محتال  \n(2) يعقوب فارس  \n(3) أميليا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: إسكندر، لوكاس، ودانيال. \"لوكاس ليس محتالًا\" - إسكندر. لوكاس أخبرك أن دانيال ليس محتالًا. \"لوكاس فارس إذا وفقط إذا كان دانيال فارسًا\" - دانيال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إسكندر فارس  \n(2) لوكاس فارس  \n(3) دانيال فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة من السكان: سباستيان، آريا، وبنيامين. قال سباستيان: \"آريا محتالة أو سباستيان فارس.\" قالت آريا: \"سباستيان ليس محتالاً.\" أعلن بنيامين: \"سباستيان فارس أو بنيامين فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سباستيان فارس  \n(2) آريا فارس  \n(3) بنيامين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: دانيال، إيثان، ورايلي. أخبرك دانيال أن إيثان محتال أو رايلي محتال. قال إيثان إن دانيال فارس. \"دانيال فارس إذا وفقط إذا كان دانيال محتالًا\" - رايلي. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال فارس  \n(2) إيثان فارس  \n(3) رايلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: إليزابيث، زوي، ومايسون. قالت إليزابيث: \"مايسون فارس أو زوي فارس\". لاحظت زوي: \"مايسون محتار إذا وفقط إذا كان مايسون فارس\". أعلن مايسون: \"إليزابيث محتالة أو إليزابيث فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث فارس  \n(2) زوي محتالة  \n(3) مايسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: هاربر، إميلي، وأبيجيل. علق هاربر، \"أبيجيل فارس وإميلي محتالة\". صرحت إميلي، \"أبيجيل فارس\". سُمعت أبيجيل تقول، \"هاربر محتال أو أبيجيل فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر محتالة  \n(2) إميلي فارسة  \n(3) أبيجيل فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: لوغان، لوكاس، وصوفيا. قال لوغان: \"صوفيا فارس\". قال لوكاس إنه إذا كانت صوفيا محتالة، فإن لوغان فارس. صرحت صوفيا: \"لوغان محتال إذا وفقط إذا كان لوكاس فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان محتال  \n(2) لوكاس محتال  \n(3) صوفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: شارلوت، ميا، وإيفلين. قالت شارلوت: \"إيفلين فارس أو ميا محتالة\". وفقاً لميا، \"شارلوت فارس\". قالت إيفلين: \"شارلوت محتالة إذا وفقط إذا كانت ميا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت فارس  \n(2) ميا فارس  \n(3) إيفلين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة من السكان: غريس، بينيلوب، وشارلوت. \"إذا كانت بينيلوب فارسًا، فإن بينيلوب محتالة\"، ادعت غريس. وفي كلمات بينيلوب: \"غريس محتالة أو غريس فارس\". أكدت شارلوت: \"بينيلوب محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) غريس محتالة  \n(2) بينيلوب فارسة  \n(3) شارلوت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: إليزابيث، سكارليت، وشارلوت. في تصريح من إليزابيث: \"شارلوت فارس\". قالت سكارليت: \"شارلوت محتالة\". علقت شارلوت: \"إليزابيث فارس أو سكارليت فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث فارس  \n(2) سكارليت محتالة  \n(3) شارلوت فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: أوليفيا، هاربر، وإيثان. قالت أوليفيا: \"أوليفيا فارس أو هاربر محتال\". صرح هاربر: \"إيثان محتال إذا وفقط إذا كانت أوليفيا فارس\". في تصريح لإيثان: \"هاربر فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا محتالة  \n(2) هاربر فارس  \n(3) إيثان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: إيفلين، يوسف، وإميلي. \"يوسف فارس إذا وفقط إذا كانت إميلي محتالة\" - إيفلين. يوسف أخبرك أن إميلي فارس. وفقاً لإميلي، \"يوسف فارس أو إيفلين محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين محتالة  \n(2) يوسف فارس  \n(3) إميلي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: سكارليت، آفا، وبنيامين. سُمع سكارليت تقول: \"بنيامين فارس\". عبرت آفا عن أن سكارليت محتالة وأن سكارليت فارس. في كلمات بنيامين: \"بنيامين فارس إذا وفقط إذا كانت سكارليت محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سكارليت محتالة  \n(2) آفا محتالة  \n(3) بنيامين محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: دانيال، إيزابيلا، وفيكتوريا. \"دانيال فارس إذا وفقط إذا كانت إيزابيلا فارسًا\"، أعلن دانيال. \"دانيال فارس\" - إيزابيلا. أخبرتك فيكتوريا أن إيزابيلا محتالة وأن إيزابيلا فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال فارس  \n(2) إيزابيلا فارس  \n(3) فيكتوريا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: ليام، لوك، وماثيو. قال ليام: \"ماثيو محتال إذا وفقط إذا كان لوك محتالاً\". قال لوك: \"إذا كان ماثيو فارساً، فإن ماثيو محتال\". أعلن ماثيو: \"لوك فارس أو لوك محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام محتال  \n(2) لوك محتال  \n(3) ماثيو فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: نوح، أميليا، وإيزابيلا. قال نوح: \"إيزابيلا فارس إذا وفقط إذا كانت إيزابيلا محتالة\". قالت أميليا: \"نوح ليس محتالاً\". قالت إيزابيلا: \"أميليا محتالة أو إيزابيلا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح محتال  \n(2) أميليا محتالة  \n(3) إيزابيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: رايلي، ميا، وماثيو. قالت رايلي: \"ميا محتالة أو ماثيو محتال\". وأكدت ميا: \"ماثيو فارس\". أعلن ماثيو: \"ماثيو فارس ورايلي فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) رايلي فارس  \n(2) ميا محتالة  \n(3) ماثيو محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: أورورا، شارلوت، وجاك. قالت أورورا: \"جاك فارس أو شارلوت محتالة\". وفقاً لشارلوت، \"أورورا ليست فارساً\". علق جاك: \"أورورا ليست فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أورورا فارس  \n(2) شارلوت محتالة  \n(3) جاك محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: سكارليت، يعقوب، وأيدن. قالت سكارليت: \"أيدن فارس أو سكارليت فارس\". \"أيدن فارس أو سكارليت فارس\" - يعقوب. \"سكارليت محتالة أو يعقوب فارس\" - أيدن. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سكارليت فارس  \n(2) يعقوب فارس  \n(3) أيدن فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: دانيال، صوفيا، وليام. في تصريح لدانيال: \"إذا كان ويليام فارسًا، فإن صوفيا فارس.\" \"ويليام محتال أو ويليام فارس\"، ذكرت صوفيا. وليام أكد: \"صوفيا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال فارس  \n(2) صوفيا فارسة  \n(3) ليام محتار"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة من السكان: أفري، فيكتوريا، وإيزابيلا. قالت أفري: \"إيزابيلا ليست محتالة\". أعلنت فيكتوريا: \"أفري ليست محتالة\". صرحت إيزابيلا: \"فيكتوريا فارس أو أفري محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري فارس  \n(2) فيكتوريا فارس  \n(3) إيزابيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: بنيامين، أوليفيا، ويوسف. قال لك بنيامين: \"إذا كانت أوليفيا فارسًا، فإن أوليفيا محتالة.\" أعلنت أوليفيا: \"يوسف فارس أو بنيامين فارس.\" أكد يوسف: \"يوسف فارس أو بنيامين فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين محتال  \n(2) أوليفيا فارسة  \n(3) يوسف فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: داوود، مايسون، وهاربر. قال داوود: \"إذا كان داوود فارساً، فإن مايسون فارس.\" وذكر مايسون: \"داوود فارس.\" سمع هاربر يقول: \"داوود فارس أو هاربر فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود فارس  \n(2) مايسون فارس  \n(3) هاربر فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: جيمس، صوفيا، وإيفلين. قال جيمس: \"إيفلين فارس أو إيفلين محتالة\". لاحظت صوفيا: \"صوفيا فارس وجيمس محتال\". في تصريح لإيفلين: \"صوفيا فارس وجيمس محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس فارس  \n(2) صوفيا محتالة  \n(3) إيفلين محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: أوين، ويليام، وأورورا. قال أوين: \"أورورا فارس أو ويليام فارس\". قال ويليام: \"إذا كان أوين فارسًا، فإن أوين محتال\". علقت أورورا: \"إذا كان ويليام فارسًا، فإن أوين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين فارس  \n(2) ويليام محتال  \n(3) أورورا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: نوح، يعقوب، وصوفيا. في تصريح من نوح: \"إذا كانت صوفيا فارسة، فإن يعقوب فارس\". يعقوب عبر عن أنه إذا كانت صوفيا محتالة، فإن نوح فارس. صوفيا قالت إن نوح فارس أو صوفيا فارسة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح فارس  \n(2) يعقوب فارس  \n(3) صوفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: شارلوت، هنري، ورايلي. قالت شارلوت: \"هنري فارس\". أكد هنري: \"شارلوت محتالة إذا وفقط إذا كان هنري فارساً\". علق رايلي: \"إذا كان هنري محتالاً، فإن شارلوت فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت محتالة  \n(2) هنري محتال  \n(3) رايلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: جاك، مايسون، ودانيال. قال جاك إن دانيال محتال إذا وفقط إذا كان دانيال فارسًا. علق مايسون، \"دانيال فارس إذا وفقط إذا كان مايسون فارسًا\". صرح دانيال، \"جاك فارس إذا وفقط إذا كان مايسون محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاك محتال  \n(2) مايسون فارس  \n(3) دانيال فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: لوكاس، إيفلين، وجاك. أخبرك لوكاس أن إيفلين فارس إذا وفقط إذا كان جاك فارسًا. في كلمات إيفلين: \"إيفلين فارس أو جاك فارس\". \"إذا كانت إيفلين فارسًا، فإن إيفلين محتالة\"، أعلن جاك. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس محتال  \n(2) إيفلين فارسة  \n(3) جاك محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: لوغان، مايكل، وإسكندر. قال لوغان: \"إسكندر محتال إذا وفقط إذا كان لوغان فارسًا\". صرح مايكل: \"لوغان محتال\". أعلن إسكندر: \"لوغان محتال ومايكل فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان فارس  \n(2) مايكل محتال  \n(3) إسكندر محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: لوك، زوي، وإليزابيث. قال لوك: \"إليزابيث ليست محتالة\". وأكدت زوي: \"إذا كانت إليزابيث فارسة، فإن لوك محتال\". وفقاً لإليزابيث، \"إليزابيث فارسة إذا وفقط إذا كانت زوي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) زوي محتالة  \n(3) إليزابيث فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: بنيامين، صوفيا، وصموئيل. علق بنيامين، \"صموئيل فارس إذا وفقط إذا كان صموئيل محتالاً\". قالت صوفيا، \"صموئيل محتال إذا وفقط إذا كان بنيامين محتالاً\". علق صموئيل، \"صوفيا فارس وبنيامين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين محتال  \n(2) صوفيا فارس  \n(3) صموئيل محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: ميا، أوليفر، وزوي. قالت ميا: \"زوي محتالة إذا وفقط إذا كانت ميا فارسة\". ادعى أوليفر: \"ميا محتالة\". قالت زوي إن أوليفر فارس أو زوي فارسة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا فارس  \n(2) أوليفر محتال  \n(3) زوي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: مايكل، ميا، وأيدن. أكد مايكل: \"أيدن فارس\". أخبرتك ميا أن مايكل محتال إذا وفقط إذا كانت ميا فارسة. \"ميا محتالة أو أيدن فارس\" - أيدن. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل محتال  \n(2) ميا فارس  \n(3) أيدن محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة من السكان: أورورا، هاربر، وأميليا. قالت أورورا: \"أميليا محتالة وهاربر محتالة\". أشار هاربر: \"إذا كانت أميليا محتالة، فإن أميليا فارس\". علقت أميليا: \"هاربر فارس وأورورا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أورورا فارس  \n(2) هاربر محتالة  \n(3) أميليا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: داوود، دانيال، وإيفلين. في كلمات داوود: \"دانيال فارس وإيفلين فارس\". علق دانيال، \"إيفلين فارس إذا وفقط إذا كان داوود فارس\". قالت إيفلين إن دانيال ليس محتالًا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود فارس  \n(2) دانيال فارس  \n(3) إيفلين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: جاكسون، أفري، ودانيال. في تصريح من جاكسون: \"إذا كان دانيال فارسًا، فإن أفري فارس.\" \"دانيال محتال أو أفري فارس\"، أعلن أفري. أخبرك دانيال أنه إذا كان دانيال فارسًا، فإن أفري محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون محتال  \n(2) أفري محتالة  \n(3) دانيال فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: يوسف، إيما، وغريس. قال يوسف لك إن إيما محتالة. \"غريس محتالة أو غريس فارسة\"، ادعت إيما. قالت غريس: \"إذا كانت إيما محتالة، فإن يوسف فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف محتال  \n(2) إيما فارس  \n(3) غريس فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: آفا، إيلا، وسباستيان. \"إيلا فارس وإيلا محتالة\" - آفا. كما قالت إيلا، \"آفا فارس وآفا محتالة\". قال سباستيان إن آفا محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا محتالة  \n(2) إيلا محتالة  \n(3) سباستيان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: زوي، جيمس، ويوسف. \"إذا كانت زوي فارسًا، فإن جيمس فارس\"، ادعت زوي. جيمس أكد: \"يوسف فارس\". سمع يوسف يقول: \"جيمس محتال أو يوسف فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) زوي فارس  \n(2) جيمس فارس  \n(3) يوسف فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: رايلي، صموئيل، وبينيلوب. قالت رايلي: \"بينيلوب فارس وصموئيل فارس.\" \"بينيلوب فارس إذا وفقط إذا كان صموئيل فارس\" - صموئيل. قالت بينيلوب إنه إذا كانت بينيلوب فارسًا، فإن رايلي فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) رايلي فارس  \n(2) صموئيل فارس  \n(3) بينيلوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: صموئيل، أبيجيل، وجاكسون. صرح صموئيل، \"جاكسون فارس أو جاكسون محتال\". قالت أبيجيل، \"صموئيل فارس إذا وفقط إذا كان صموئيل محتال\". كما قال جاكسون، \"صموئيل ليس محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صموئيل فارس  \n(2) أبيجيل محتالة  \n(3) جاكسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: أوليفر، صوفيا، وإسكندر. علق أوليفر قائلاً: \"صوفيا فارس وإسكندر محتال\". وفقاً لصوفيا، \"أوليفر فارس أو إسكندر محتال\". \"أوليفر محتال وأوليفر فارس\" - إسكندر. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفر فارس  \n(2) صوفيا فارس  \n(3) إسكندر محتار"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: ماثيو، نوح، وشارلوت. قال ماثيو لك: \"إذا كان نوح محتالاً، فإن ماثيو فارس\". علق نوح قائلاً: \"ماثيو محتال إذا وفقط إذا كان نوح فارس\". علقَت شارلوت: \"ماثيو فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ماثيو محتال  \n(2) نوح محتال  \n(3) شارلوت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: أفري، أورورا، ونوح. \"نوح محتال إذا وفقط إذا كانت أورورا فارسة\"، ذكرت أفري. \"أورورا فارسة إذا وفقط إذا كان نوح فارسًا\" - أورورا. قال نوح إن أورورا محتالة وأفري فارسة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري فارس  \n(2) أورورا محتالة  \n(3) نوح فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: إيثان، آفا، وبينيلوب. في كلمات إيثان: \"بينيلوب فارس\". عبرت آفا عن أن بينيلوب محتالة وأن إيثان محتال. كما قالت بينيلوب: \"إيثان محتال إذا وفقط إذا كانت آفا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان فارس  \n(2) آفا محتالة  \n(3) بينيلوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: فيكتوريا، إسكندر، وإيما. تم سماع فيكتوريا تقول: \"إسكندر فارس إذا وفقط إذا كانت إيما فارسة\". \"فيكتوريا محتالة وإيما فارسة\"، ذكر إسكندر. قالت إيما: \"إيما فارسة وإسكندر فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) فيكتوريا فارس  \n(2) إسكندر محتال  \n(3) إيما محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: آريا، يعقوب، وجاكسون. آريا أعربت عن أن يعقوب محتال. يعقوب قال إن جاكسون فارس أو جاكسون محتال. في تصريح لجاكسون: \"آريا محتالة إذا وفقط إذا كان يعقوب فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آريا محتالة  \n(2) يعقوب فارس  \n(3) جاكسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: نوح، هنري، وشارلوت. قال نوح: \"شارلوت محتالة وهنري محتال.\" ذكر هنري: \"هنري فارس إذا وفقط إذا كان نوح محتالًا.\" علقت شارلوت: \"هنري فارس وهنري محتال.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح محتال  \n(2) هنري فارس  \n(3) شارلوت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة من السكان: أوليفيا، لوغان، وأيدن. قالت أوليفيا: \"إذا كانت أوليفيا فارسًا، فإن لوغان فارس\". وفقًا لوغان، \"أوليفيا محتالة إذا وفقط إذا كان أيدن فارسًا\". كما قال أيدن: \"إذا كان لوغان فارسًا، فإن أوليفيا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا فارس  \n(2) لوغان فارس  \n(3) أيدن محتار"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: هنري، آفا، وويليام. قال هنري إن ويليام فارس وإن ويليام محتال. علقت آفا، \"ويليام محتال إذا وفقط إذا كان ويليام فارس\". \"هنري فارس وآفا محتالة\"، ادعى ويليام. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هنري محتال  \n(2) آفا محتالة  \n(3) ويليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: أوين، فيكتوريا، ورايلي. قال أوين: \"رايلي فارس وفيكتوريا فارس\". أكدت فيكتوريا: \"أوين محتال ورايلي فارس\". علق رايلي: \"رايلي فارس وفيكتوريا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين محتار  \n(2) فيكتوريا محتالة  \n(3) رايلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: ويليام، ميا، وإميلي. علق ويليام قائلاً: \"إذا كانت إميلي محتالة، فإن إميلي فارس\". قالت ميا: \"ويليام محتال\". وفقًا لإميلي، \"ميا فارس إذا وفقط إذا كان ويليام فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام محتال  \n(2) ميا فارس  \n(3) إميلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: إسكندر، صوفيا، وليلي. وفقًا لإسكندر، \"ليلي محتالة إذا وفقط إذا كانت صوفيا محتالة\". وفقًا لصوفيا، \"إسكندر محتال أو ليلي فارسة\". \"إسكندر فارس أو صوفيا فارسة\"، أعلنت ليلي. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إسكندر فارس  \n(2) صوفيا فارسة  \n(3) ليلي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: فيكتوريا، ويليام، وميا. قالت فيكتوريا إن ميا فارس ويليام فارس. علق ويليام، \"فيكتوريا محتالة إذا وفقط إذا كانت فيكتوريا فارسًا\". قالت ميا، \"ويليام محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) فيكتوريا محتالة  \n(2) ويليام محتال  \n(3) ميا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: هنري، لوغان، وليام. \"إذا كان لوغان محتالاً، فإن ليام محتال\"، ادعى هنري. قال لوغان إن هنري فارس أو هنري محتال. وفقاً لليام، \"إذا كان لوغان فارساً، فإن هنري فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هنري فارس  \n(2) لوغان فارس  \n(3) ليام فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: آريا، آفا، وأوليفيا. قالت آريا: \"إذا كانت آفا فارساً، فإن أوليفيا محتالة\". \"أوليفيا محتالة\" - آفا. قالت أوليفيا: \"آفا محتالة إذا وفقط إذا كانت أوليفيا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آريا فارس  \n(2) آفا محتالة  \n(3) أوليفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: أفري، سكارليت، وأوليفر. في تصريح من أفري: \"إذا كانت أفري فارسًا، فإن أوليفر محتال\". لاحظت سكارليت، \"أفري ليست فارسًا\". علق أوليفر، \"أفري محتالة وأفري فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري فارس  \n(2) سكارليت محتالة  \n(3) أوليفر محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: آفا، إيفلين، وأميليا. \"إذا كانت آفا فارسًا، فإن إيفلين محتالة\"، أعلنت آفا. علق إيفلين، \"آفا ليست فارسًا\". قالت أميليا إن آفا محتالة وإيفلين محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا فارس  \n(2) إيفلين محتالة  \n(3) أميليا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: أفري، لوك، وهنري. قالت أفري: \"أفري فارس إذا وفقط إذا كان هنري فارسًا.\" أخبرك لوك أن هنري محتال. \"إذا كان لوك محتالًا، فإن أفري محتالة,\" أعلن هنري. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري محتال  \n(2) لوك محتال  \n(3) هنري فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: مايسون، هنري، وهاربر. علق مايسون قائلاً: \"هاربر فارس إذا وفقط إذا كان مايسون فارساً\". وفقاً لهنري، \"إذا كان هاربر فارساً، فإن مايسون محتار\". سمع هاربر يقول: \"مايسون محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايسون محتال  \n(2) هنري فارس  \n(3) هاربر فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: إيما، سكارليت، وفيكتوريا. \"فيكتوريا ليست فارساً\"، ادعت إيما. أخبرتك سكارليت أن إيما محتالة وأن سكارليت فارس. في تصريح من فيكتوريا: \"سكارليت ليست فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما محتالة  \n(2) سكارليت محتالة  \n(3) فيكتوريا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة من السكان: صموئيل، شارلوت، وجيمس. قال صموئيل إن شارلوت فارس إذا وفقط إذا كانت شارلوت محتالة. \"صموئيل ليس محتالاً\"، ادعت شارلوت. كما قال جيمس، \"شارلوت ليست فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صموئيل محتال  \n(2) شارلوت محتالة  \n(3) جيمس فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: زوي، هاربر، وكلوي. كما قالت زوي: \"هاربر فارس وكلوي محتالة\". كما قالت هاربر: \"كلوي ليست فارسة\". \"زوي فارسة إذا وفقط إذا كانت هاربر فارسة\"، أعلنت كلوي. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) زوي محتالة  \n(2) هاربر محتالة  \n(3) كلوي فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: صموئيل، أميليا، وإليزابيث. علق صموئيل، \"أميليا ليست فارسة\". علقَت أميليا، \"إليزابيث ليست محتالة\". \"أميليا فارسة إذا وفقط إذا كان صموئيل محتالاً\"، ادعت إليزابيث. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صموئيل محتال  \n(2) أميليا فارسة  \n(3) إليزابيث فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: بنيامين، دانيال، وهاربر. وفقاً لبنيامين، \"هاربر محتالة ودانيال محتال\". أشار دانيال، \"بنيامين محتال أو هاربر محتالة\". كما قالت هاربر، \"دانيال ليس فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين محتال  \n(2) دانيال فارس  \n(3) هاربر محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: إيثان، أفري، وليام. قال إيثان: \"وليام محتال إذا وفقط إذا كان وليام فارساً.\" قالت أفري: \"وليام محتال أو إيثان محتال.\" قال وليام إن إيثان محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان محتال  \n(2) أفري فارس  \n(3) ليام فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: صوفيا، ميا، وإميلي. في كلمات صوفيا: \"ميا محتالة أو ميا فارسة\". قالت ميا: \"ميا فارسة أو صوفيا فارسة\". في كلمات إميلي: \"صوفيا محتالة أو صوفيا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) ميا فارس  \n(3) إميلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: يعقوب، إليزابيث، وجاكسون. قال يعقوب إن يعقوب فارس إذا وفقط إذا كان جاكسون فارساً. \"إذا كان جاكسون محتالكاً، فإن جاكسون فارس\"، ادعت إليزابيث. \"إليزابيث فارس إذا وفقط إذا كان يعقوب محتالكاً\"، ادعى جاكسون. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب محتال  \n(2) إليزابيث فارس  \n(3) جاكسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: بينيلوب، سكارليت، وماثيو. قالت بينيلوب: \"سكارليت محتالة إذا وفقط إذا كان ماثيو محتالاً\". علق سكارليت: \"ماثيو فارس أو بينيلوب فارس\". عبر ماثيو عن أن سكارليت ليست محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب فارس  \n(2) سكارليت فارس  \n(3) ماثيو فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: هاربر، آفا، ولوكاس. سمع هاربر يقول: \"آفا محتالة إذا وفقط إذا كان لوكاس فارساً\". قالت آفا إن لوكاس محتال وهاربر محتالة. في تصريح لوكاس: \"آفا محتالة أو هاربر فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر فارس  \n(2) آفا محتالة  \n(3) لوكاس فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: زوي، مايسون، ورايلي. قالت زوي: \"مايسون محتال إذا وفقط إذا كان رايلي محتالاً\". كما قال مايسون: \"مايسون فارس ورايلي فارس\". سمع رايلي يقول: \"زوي محتالة أو مايسون محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) زوي محتالة  \n(2) مايسون محتال  \n(3) رايلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: أميليا، لوك، وأبيجيل. \"أبيجيل محتالة أو لوك محتال\" - أميليا. \"أميليا محتالة أو لوك فارس\" ، ادعى لوك. قالت أبيجيل: \"إذا كانت أبيجيل فارسة، فإن لوك محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا فارس  \n(2) لوك محتال  \n(3) أبيجيل فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: أميليا، لوغان، ويعقوب. \"إذا كان لوغان محتالًا، فإن يعقوب فارس\"، أعلنت أميليا. أخبرك لوغان أنه إذا كانت أميليا محتالة، فإن يعقوب محتال. علق يعقوب، \"أميليا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا فارس  \n(2) لوغان فارس  \n(3) يعقوب محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: ويليام، ماثيو، وسكارليت. أكد ويليام: \"ماثيو محتال إذا وفقط إذا كانت سكارليت محتالة\". أكد ماثيو: \"سكارليت محتالة ويليام فارس\". أخبرتك سكارليت أن سكارليت فارس إذا وفقط إذا كان ماثيو محتالًا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام محتال  \n(2) ماثيو محتال  \n(3) سكارليت فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: هاربر، مايسون، ورايلي. سمع هاربر يقول: \"مايسون فارس أو مايسون محتال\". وفقاً لمايسون، \"رايلي فارس وهاربر محتال\". \"إذا كان رايلي فارس، فإن هاربر فارس\"، أعلن رايلي. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر فارس  \n(2) مايسون محتال  \n(3) رايلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: إميلي، لوك، وجاك. وفقًا لإميلي، \"لوك فارس أو لوك محتال\". وفقًا للوك، \"إميلي فارس وإميلي محتال\". كما قال جاك، \"لوك ليس محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي فارس  \n(2) لوك محتال  \n(3) جاك محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: جيمس، أوين، ولوغان. في كلمات جيمس: \"أوين فارس إذا وفقط إذا كان لوغان محتالاً\". كما قال أوين: \"جيمس محتال إذا وفقط إذا كان أوين فارساً\". في كلمات لوغان: \"أوين فارس أو أوين محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس محتال  \n(2) أوين فارس  \n(3) لوغان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: بينيلوب، أفري، ويوسف. أخبرتك بينيلوب أن يوسف فارس. \"أفري فارس أو يوسف محتال\"، أعلن أفري. \"إذا كان يوسف فارسًا، فإن أفري محتال\"، أعلن يوسف. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب فارس  \n(2) أفري محتالة  \n(3) يوسف فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: شارلوت، سكارليت، وكلوي. قالت شارلوت إن سكارليت فارس إذا وفقط إذا كانت سكارليت محتالة. سُمع سكارليت تقول: \"شارلوت فارس إذا وفقط إذا كانت كلوي فارسة\". وفقاً لكلوي، \"كلوي فارسة أو سكارليت فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت محتالة  \n(2) سكارليت محتالة  \n(3) كلوي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: إيما، هنري، وإيزابيلا. \"هنري فارس\" - قالت إيما. علق هنري، \"إيما محتالة أو إيما فارس\". \"هنري محتال\" - أعلنت إيزابيلا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما فارس  \n(2) هنري فارس  \n(3) إيزابيلا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: نوح، رايلي، وأورورا. أعرب نوح عن أن رايلي محتال وأن رايلي فارس. أعرب رايلي عن أن أورورا فارس وأن نوح فارس. أخبرتك أورورا أن نوح محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح محتال  \n(2) رايلي محتالة  \n(3) أورورا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: بينيلوب، أورورا، وليام. \"ويليام محتال\" - بينيلوب. أورورا عبرت عن أن ويليام ليس فارساً. \"بينيلوب محتالة وبينيلوب فارس\" - ويليام. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب فارس  \n(2) أورورا فارس  \n(3) ليام محتار"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: زوي، نوح، ودانيال. زوي أكدت: \"زوي فارس\". وفي كلمات نوح: \"زوي محتالة أو دانيال فارس\". \"نوح محتال\"، أعلن دانيال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) زوي محتالة  \n(2) نوح فارس  \n(3) دانيال محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: أوليفيا، سكارليت، ودانيال. قالت أوليفيا: \"دانيال ليس فارساً.\" وفقاً لسكارليت، \"إذا كانت سكارليت فارساً، فإن أوليفيا محتالة.\" صرح دانيال: \"دانيال فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا محتالة  \n(2) سكارليت فارسة  \n(3) دانيال فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: أوليفر، إيثان، ودانيال. قال أوليفر: \"إذا كان أوليفر فارسًا، فإن دانيال فارس.\" وأكد إيثان: \"إيثان فارس.\" وقال دانيال: \"أوليفر محتار أو إيثان فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفر فارس  \n(2) إيثان فارس  \n(3) دانيال فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: نوح، مايكل، وليام. قال نوح: \"إذا كان مايكل محتالاً، فإن وليام محتال\". علق مايكل: \"مايكل فارس إذا وفقط إذا كان وليام فارساً\". كما قال وليام: \"نوح محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح محتال  \n(2) مايكل محتال  \n(3) ليام فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: إيما، إيزابيلا، وأورورا. وفقاً لإيما، \"إذا كانت إيما فارساً، فإن إيزابيلا محتالة\". أعربت إيزابيلا عن أنها فارس. في بيان من أورورا: \"أورورا فارس وإيما محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما فارس \n(2) إيزابيلا محتالة \n(3)  أورورا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة من السكان: آفا، ويليام، وأورورا. قالت آفا: \"ويليام فارس إذا وفقط إذا كان ويليام محتالًا\". ذكر ويليام: \"آفا محتالة\". عبرت أورورا عن أن ويليام محتال أو آفا محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا محتالة  \n(2) ويليام فارس  \n(3) أورورا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: إيلا، صوفيا، وداوود. قالت إيلا: \"صوفيا فارس\". صرحت صوفيا: \"إذا كان داوود محتالًا، فإن داوود فارس\". وفي كلمات داوود: \"إيلا محتالة أو إيلا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا فارس  \n(2) صوفيا فارس  \n(3) داوود فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: ماثيو، سكارليت، وإيثان. قال لك ماثيو إن ماثيو فارس وسكارليت فارس. قالت سكارليت: \"ماثيو محتال وإيثان فارس.\" كما قال إيثان: \"ماثيو فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ماثيو محتال  \n(2) سكارليت محتالة  \n(3) إيثان محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: لوكاس، آفا، وسباستيان. قال لوكاس: \"آفا ليست فارسًا\". سُمعت آفا تقول: \"آفا فارس إذا وفقط إذا كان سباستيان محتالًا\". سُمِعَ سباستيان يقول: \"لوكاس فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس محتال  \n(2) آفا فارس  \n(3) سباستيان محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: يعقوب، سباستيان، ولوكاس. قال يعقوب إن سباستيان ليس محتالًا. \"يعقوب فارس ويعقوب محتال\"، ذكر سباستيان. قال لوكاس، \"سباستيان محتال أو يعقوب محتال.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب محتال  \n(2) سباستيان محتال  \n(3) لوكاس فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: رايلي، ويليام، ودانيال. علق رايلي، \"رايلي فارس إذا وفقط إذا كان دانيال فارساً\". \"رايلي ليس محتالاً\"، أعلن ويليام. \"ويليام ليس محتالاً\"، أعلن دانيال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) رايلي فارس  \n(2) ويليام فارس  \n(3) دانيال فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: إيزابيلا، فيكتوريا، وجاكسون. قالت إيزابيلا: \"فيكتوريا ليست محتالة\". \"جاكسون فارس إذا وفقط إذا كانت إيزابيلا محتالة\" - فيكتوريا. أكد جاكسون: \"جاكسون فارس إذا وفقط إذا كانت فيكتوريا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا محتالة  \n(2) فيكتوريا محتالة  \n(3) جاكسون محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: إيزابيلا، أبيجيل، وماثيو. \"أبيجيل فارس وماثيو محتال\"، أعلنت إيزابيلا. \"إيزابيلا محتالة إذا وفقط إذا كانت إيزابيلا فارساً\"، أعلنت أبيجيل. قال ماثيو إنه إذا كانت إيزابيلا محتالة، فإن أبيجيل محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا محتالة  \n(2) أبيجيل محتالة  \n(3) ماثيو فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: غريس، أوين، وجاك. قالت غريس إن أوين محتال. قال أوين: \"جاك فارس.\" كما قال جاك: \"أوين محتال إذا وفقط إذا كانت غريس فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) غريس محتالة  \n(2) أوين فارس  \n(3) جاك فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: يوسف، أميليا، وأوليفيا. قال يوسف: \"أوليفيا فارس إذا وفقط إذا كانت أوليفيا محتالة\". صرحت أميليا: \"يوسف فارس\". سُمعت أوليفيا تقول: \"أميليا ليست فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف محتال  \n(2) أميليا محتالة  \n(3) أوليفيا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: أوليفيا، هنري، وأميليا. \"أوليفيا فارس\" - أوليفيا. علق هنري، \"أميليا محتالة إذا وفقط إذا كانت أوليفيا محتالة\". علقت أميليا، \"إذا كان هنري محتالًا، فإن أوليفيا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا فارس  \n(2) هنري فارس  \n(3) أميليا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: إيثان، لوكاس، وويليام. قال إيثان: \"لوكاس فارس وويليام فارس\". في تصريح لوكاس: \"إيثان محتار وويليام محتار\". \"إذا كان إيثان فارسًا، فإن لوكاس محتال\"، ادعى ويليام. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان محتال  \n(2) لوكاس محتال  \n(3) ويليام فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: ليام، إيزابيلا، وإيفلين. قال ليام: \"إيزابيلا محتالة وليام فارس.\" وفقًا لإيزابيلا، \"إيفلين ليست فارسة\". أعلنت إيفلين: \"ليام محتال.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام محتال  \n(2) إيزابيلا محتالة  \n(3) إيفلين فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: أوين، إسكندر، ونوح. \"إسكندر فارس\"، أعلن أوين. قال إسكندر إنه إذا كان أوين محتالًا، فإن نوح محتال. عبر نوح عن أن إسكندر فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين فارس  \n(2) إسكندر فارس  \n(3) نوح فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: ويليام، شارلوت، ويوسف. في كلمات ويليام: \"شارلوت فارس وشارلوت محتالة\". قالت شارلوت: \"يوسف فارس ويليام فارس\". \"شارلوت ليست فارساً\"، ذكر يوسف. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام محتال  \n(2) شارلوت محتالة  \n(3) يوسف فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: جاكسون، ليلي، وسباستيان. علق جاكسون، \"سباستيان فارس وجاكسون فارس\". \"جاكسون محتال إذا وفقط إذا كان جاكسون فارس\"، ادعت ليلي. سمع سباستيان يقول، \"جاكسون محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون محتال  \n(2) ليلي محتالة  \n(3) سباستيان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: كلوي، إسكندر، وإيثان. وفقاً لكلوي، \"إسكندر محتال وإسكندر فارس\". أشار إسكندر، \"إسكندر فارس أو كلوي محتالة\". أكد إيثان: \"كلوي محتالة وإسكندر فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) كلوي محتالة  \n(2) إسكندر فارس  \n(3) إيثان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: إميلي، إيلا، وأوليفيا. قالت إميلي: \"إيلا فارس\". وفي كلمات إيلا: \"إميلي محتالة وأوليفيا محتالة\". سُمعت أوليفيا تقول: \"إيلا محتالة وأوليفيا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي محتالة  \n(2) إيلا محتالة  \n(3) أوليفيا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: بنيامين، شارلوت، وأوين. قال بنيامين: \"شارلوت فارس أو شارلوت محتالة.\" \"بنيامين محتال إذا وفقط إذا كان أوين محتالًا\" - شارلوت. \"شارلوت محتالة أو أوين فارس\" - أوين. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين فارس  \n(2) شارلوت فارس  \n(3) أوين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: ليام، بنيامين، وهنري. قال ليام: \"إذا كان بنيامين فارسًا، فإن هنري محتال\". سُمع بنيامين يقول: \"هنري محتال وهنري فارس\". أشار هنري: \"ليام فارس إذا وفقط إذا كان بنيامين محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام فارس  \n(2) بنيامين محتال  \n(3) هنري فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: داوود، نوح، وأورورا. \"نوح محتال إذا وفقط إذا كانت أورورا محتالة\" - داوود. وفقًا لنوح، \"داوود محتال إذا وفقط إذا كان نوح فارسًا\". أشارت أورورا، \"إذا كان داوود فارسًا، فإن أورورا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود محتال  \n(2) نوح محتال  \n(3) أورورا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: أيدن، يعقوب، وبنيامين. أيدن أكد: \"يعقوب محتال\". يعقوب أخبرك أن أيدن فارس أو يعقوب فارس. في كلمات بنيامين: \"أيدن محتال أو بنيامين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن محتال  \n(2) يعقوب فارس  \n(3) بنيامين فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: صموئيل، دانيال، وأوين. قال صموئيل: \"صموئيل فارس إذا وفقط إذا كان أوين فارساً\". أكد دانيال: \"أوين محتـال\". علق أوين، \"دانيال فارس أو صموئيل محتـال\". فمن هو الفارس ومن هو المحتـال؟",
        "solution_text_format": "(1) صموئيل محتال  \n(2) دانيال محتال  \n(3) أوين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: إيثان، صوفيا، وداوود. وفقًا لإيثان، \"إذا كانت صوفيا فارسًا، فإن داوود فارس\". كما قالت صوفيا، \"داوود فارس إذا وفقط إذا كان إيثان محتالًا\". في كلمات داوود: \"صوفيا محتالة أو صوفيا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان فارس  \n(2) صوفيا محتالة  \n(3) داوود فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: شارلوت، لوغان، وداوود. قالت شارلوت: \"شارلوت فارس ولوغان فارس.\" وفقاً لوغان، \"شارلوت فارس أو داوود فارس\". أكد داوود: \"شارلوت فارس إذا وفقط إذا كان لوغان فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت فارس  \n(2) لوغان فارس  \n(3) داوود فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: ويليام، أوليفر، وآريا. وفقًا لويليام، \"إذا كان ويليام فارسًا، فإن آريا فارسًا\". في تصريح من أوليفر: \"ويليام محتال أو آريا محتالة\". آريا أخبرتك أنه إذا كان ويليام محتالًا، فإن ويليام فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام فارس  \n(2) أوليفر محتال  \n(3) آريا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: صوفيا، أميليا، وهاربر. لاحظت صوفيا، \"إذا كان هاربر محتالاً، فإن أميليا محتالة\". عادت أميليا لتقول، \"هاربر محتال\". قال هاربر إن أميليا فارس إذا وفقط إذا كانت صوفيا فارساً. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا محتالة  \n(2) أميليا فارسة  \n(3) هاربر محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: لوغان، جيمس، ولوكاس. \"لوغان فارس ولوكاس محتال\"، ادعى لوغان. في كلمات جيمس: \"لوغان ليس محتالًا\". لوكاس أشار، \"لوغان فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان محتال  \n(2) جيمس محتال  \n(3) لوكاس محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: إيزابيلا، زوي، وأميليا. قالت إيزابيلا: \"إذا كانت أميليا محتالة، فإن إيزابيلا فارس\". أخبرتك زوي أن إيزابيلا ليست فارسًا. كما قالت أميليا: \"زوي فارس أو زوي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا فارس  \n(2) زوي محتالة  \n(3) أميليا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: هاربر، جاكسون، وغريس. وفقاً لهاربر، \"هاربر فارس إذا وفقط إذا كان جاكسون فارساً\". كما قال جاكسون، \"إذا كان هاربر فارساً، فإن هاربر محتال\". \"جاكسون محتال وجاكسون فارس\"، ادعت غريس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر محتالة  \n(2) جاكسون فارس  \n(3) غريس محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة من السكان: غريس، سباستيان، ومايكل. في كلمات غريس: \"إذا كان مايكل محتالاً، فإن مايكل فارس\". كما قال سباستيان: \"غريس ليست محتالة\". لاحظ مايكل: \"مايكل فارس إذا وفقط إذا كانت غريس فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) غريس فارس  \n(2) سباستيان فارس  \n(3) مايكل فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: صوفيا، مايسون، وآفا. أخبرتك صوفيا أن مايسون ليس فارساً. أكد مايسون: \"صوفيا محتالة وآفا فارسة\". ادعت آفا: \"صوفيا فارسة ومايسون محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) مايسون محتال  \n(3) آفا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: جاك، أميليا، وأوليفيا. وفقًا لجاك، \"أوليفيا محتالة وجاك فارس\". \"جاك ليس فارسًا\"، ادعت أميليا. قالت أوليفيا إنه إذا كان جاك محتالًا، فإن أميليا فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاك محتال  \n(2) أميليا فارس  \n(3) أوليفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: كلوي، أوليفر، وجاك. قالت كلوي إن أوليفر ليس محتالًا. في تصريح من أوليفر: \"كلوي ليست محتالة\". قال جاك: \"إذا كان جاك فارسًا، فإن أوليفر فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) كلوي فارس  \n(2) أوليفر فارس  \n(3) جاك فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: إيما، لوك، وإيلا. أكدت إيما: \"لوك فارس أو لوك محتال\". وفقًا للوك، \"إذا كانت إيما فارسة، فإن إيلا فارسة\". علقت إيلا، \"إذا كانت إيما محتالًا، فإن لوك فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما فارس  \n(2) لوك فارس  \n(3) إيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: لوك، مايكل، وإليزابيث. قال لوك: \"إليزابيث فارس\". علق مايكل: \"لوك فارس\". سُمعت إليزابيث تقول: \"مايكل محتال إذا وفقط إذا كان لوك محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) مايكل فارس  \n(3) إليزابيث فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: آفا، داوود، وأميليا. قالت آفا: \"داوود محتال أو داوود فارس\". قال داوود إن آفا فارس وأميليا فارس. علقَت أميليا: \"داوود فارس وداوود محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا فارس  \n(2) داوود محتال  \n(3) أميليا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: بنيامين، ميا، ويعقوب. في تصريح لبنيامين: \"ميا محتالة وميا فارسة\". أكدت ميا: \"بنيامين فارس ويعقوب محتال\". في كلمات يعقوب: \"بنيامين ليس فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين محتال  \n(2) ميا محتالة  \n(3) يعقوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: أفري، ليلي، وبينيلوب. \"ليلي ليست فارسًا\"، أعلنت أفري. قالت ليلي إن بينيلوب محتالة وأن أفري محتالة. عبرت بينيلوب عن أنه إذا كانت ليلي محتالة، فإن أفري محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري فارس  \n(2) ليلي محتالة  \n(3) بينيلوب محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: يعقوب، مايسون، وإيلا. قال يعقوب: \"مايسون فارس إذا وفقط إذا كان يعقوب فارساً\". صرح مايسون: \"إيلا ليست محتالة\". وفقاً لإيلا، \"يعقوب فارس وإيلا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب فارس  \n(2) مايسون فارس  \n(3) إيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: لوغان، هنري، وغريس. قال لوغان: \"إذا كان هنري فارسًا، فإن غريس محتالة\". وفي تصريح لهنري: \"لوغان محتال\". قالت غريس: \"إذا كان هنري فارسًا، فإن لوغان فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان فارس  \n(2) هنري محتال  \n(3) غريس فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: ميا، ليلي، وكلوي. وفقاً لميا، \"ميا فارس إذا وفقط إذا كانت ليلي محتالة\". وفقاً ليلي، \"إذا كانت كلوي محتالة، فإن ميا محتالة\". تم سماع كلوي تقول، \"ميا ليست فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا فارس  \n(2) ليلي محتال  \n(3) كلوي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: لوكاس، لوك، وأورورا. قال لوكاس: \"لوكاس فارس أو أورورا فارس\". صرح لوك: \"أورورا فارس ولوكاس فارس\". لاحظت أورورا: \"إذا كان لوكاس محتالاً، فإن لوك محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس فارس  \n(2) لوك فارس  \n(3) أورورا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: كلوي، سباستيان، وماثيو. قالت كلوي إن سباستيان محتال وكلوي فارس. كما قال سباستيان: \"ماثيو محتال إذا وفقط إذا كان سباستيان فارسًا\". أخبرك ماثيو أن كلوي محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) كلوي فارس  \n(2) سباستيان محتال  \n(3) ماثيو محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: هنري، داوود، وأورورا. قال هنري: \"أورورا فارس أو هنري فارس.\" \"هنري ليس فارساً\"، ذكر داوود. في كلمات أورورا: \"أورورا فارس إذا وفقط إذا كان هنري محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هنري محتال  \n(2) داوود فارس  \n(3) أورورا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: سكارليت، بنيامين، وإميلي. قالت سكارليت: \"بنيامين فارس\". قال بنيامين: \"إذا كانت سكارليت فارسًا، فإن إميلي محتالة\". قالت إميلي: \"إذا كان بنيامين فارسًا، فإن إميلي فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سكارليت فارس  \n(2) بنيامين فارس  \n(3) إميلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: نوح، يوسف، وصوفيا. أعرب نوح عن أن صوفيا فارس وأن نوح فارس. سُمع يوسف يقول: \"إذا كان يوسف فارساً، فإن صوفيا محتالة\". \"صوفيا فارس إذا وفقط إذا كان نوح محتالاً\"، أعلنت صوفيا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح محتال  \n(2) يوسف فارس  \n(3) صوفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: لوغان، إيثان، وجاك. كما قال لوغان: \"إذا كان جاك محتالاً، فإن إيثان محتال\". أكد إيثان: \"جاك محتال وإيثان فارس\". أخبرك جاك أن إيثان فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان فارس  \n(2) إيثان محتال  \n(3) جاك محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: أميليا، ليام، وإيزابيلا. قالت أميليا: \"إيزابيلا ليست محتالة\". ادعى ليام: \"إيزابيلا محتالة أو أميليا فارس\". قالت إيزابيلا: \"ليام ليس محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا فارس  \n(2) ليام فارس  \n(3) إيزابيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: بنيامين، أوين، وجاكسون. أخبرك بنيامين أن جاكسون فارس أو جاكسون محتال. عبر أوين عن أن جاكسون ليس فارسًا. علق جاكسون، \"بنيامين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين فارس  \n(2) أوين محتال  \n(3) جاكسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: يعقوب، أميليا، وبنيامين. وفقاً ليعقوب، \"إذا كانت أميليا محتالة، فإن بنيامين محتال\". أميليا علقت، \"يعقوب محتال أو يعقوب فارس\". بنيامين أشار، \"أميليا فارس إذا وفقط إذا كانت أميليا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب فارس  \n(2) أميليا فارس  \n(3) بنيامين محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: صوفيا، شارلوت، وأيدن. \"أيدن محتال وأيدن فارس\" - صوفيا. علقت شارلوت، \"صوفيا ليست فارسة\". \"أيدن فارس وشارلوت محتالة\"، أعلن أيدن. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا محتالة  \n(2) شارلوت فارسة  \n(3) أيدن محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: ميا، لوكاس، وغريس. قالت ميا: \"ميا فارس إذا وفقط إذا كان لوكاس فارساً\". ادعى لوكاس: \"ميا ليست فارساً\". أعربت غريس عن أن لوكاس محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا محتالة  \n(2) لوكاس فارس  \n(3) غريس محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: لوغان، ليام، وسباستيان. في كلمات لوغان: \"إذا كان سباستيان فارساً، فإن ليام محتال.\" \"لوغان فارس إذا وفقط إذا كان سباستيان محتالاً\"، ذكر ليام. \"لوغان فارس\"، أعلن سباستيان. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان فارس  \n(2) ليام محتال  \n(3) سباستيان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: إليزابيث، صموئيل، وليلي. علقت إليزابيث، \"إذا كان صموئيل محتالًا، فإن صموئيل فارس\". أشار صموئيل، \"إليزابيث فارس أو إليزابيث محتالة\". وفقًا لليلي، \"إليزابيث ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث فارس  \n(2) صموئيل فارس  \n(3) ليلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: يعقوب، جيمس، وصوفيا. قال يعقوب: \"جيمس فارس\". وفي تصريح لجيمس: \"صوفيا فارس\". كما قالت صوفيا: \"جيمس محتال أو جيمس فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب فارس  \n(2) جيمس فارس  \n(3) صوفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: آفا، غريس، ودانيال. \"آفا فارس إذا وفقط إذا كانت غريس فارسًا\" - آفا. \"آفا ليست فارسًا\" - أعلنت غريس. \"آفا فارس أو آفا محتال\" - دانيال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا محتالة  \n(2) غريس فارسة  \n(3) دانيال فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة من السكان: أبيجيل، سباستيان، وفيكتوريا. \"إذا كانت أبيجيل فارسًا، فإن سباستيان فارس\" - أبيجيل. \"إذا كان سباستيان فارسًا، فإن فيكتوريا فارس\" - سباستيان. قالت فيكتوريا إن أبيجيل فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أبيجيل فارس  \n(2) سباستيان فارس  \n(3) فيكتوريا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: إيفلين، إسكندر، وجاكسون. سُمعت إيفلين تقول: \"جاكسون فارس أو إيفلين فارس\". \"إيفلين محتالة وإيفلين فارس\"، ذكر إسكندر. في تصريح لجكسون: \"إسكندر فارس أو إيفلين محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين فارس  \n(2) إسكندر محتال  \n(3) جاكسون محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: أميليا، ماثيو، وكلوي. قالت أميليا: \"ماثيو محتال إذا وفقط إذا كانت كلوي فارسة.\" علق ماثيو: \"كلوي فارسة أو أميليا محتالة\". أعلنت كلوي: \"إذا كان ماثيو فارساً، فإن كلوي فارسة.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا محتالة  \n(2) ماثيو فارس  \n(3) كلوي فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: دانيال، إيزابيلا، وأوليفيا. قال دانيال: \"إيزابيلا فارس إذا وفقط إذا كانت إيزابيلا محتالة.\" قالت إيزابيلا: \"إذا كان دانيال فارسًا، فإن أوليفيا محتالة.\" وأكدت أوليفيا: \"إيزابيلا محتالة إذا وفقط إذا كان دانيال فارسًا.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال محتال  \n(2) إيزابيلا فارس  \n(3) أوليفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: دانيال، إيزابيلا، وماثيو. وفقًا لدانيال، \"إيزابيلا فارس إذا وفقط إذا كانت إيزابيلا محتالة\". كما قالت إيزابيلا، \"دانيال محتال وماثيو فارس\". في كلمات ماثيو: \"دانيال ليس محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال محتال  \n(2) إيزابيلا محتالة  \n(3) ماثيو محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: ماثيو، أوليفيا، وإيثان. سمع ماثيو يقول: \"إذا كان إيثان فارسًا، فإن أوليفيا محتالة\". صرحت أوليفيا: \"إيثان ليس فارسًا\". \"ماثيو محتال وإيثان فارس\" - إيثان. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ماثيو فارس  \n(2) أوليفيا فارس  \n(3) إيثان محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: داوود، إيزابيلا، ومايكل. قال داوود: \"إذا كان مايكل فارساً، فإن مايكل محتال\". قالت إيزابيلا: \"مايكل محتال أو مايكل فارس\". لاحظ مايكل: \"مايكل فارس إذا وفقط إذا كان داوود محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود محتال  \n(2) إيزابيلا فارس  \n(3) مايكل فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: إيثان، جاكسون، وسكارليت. في تصريح لإيثان: \"سكارليت فارس\". قال جاكسون: \"إذا كان إيثان فارسًا، فإن سكارليت محتالة\". أخبرتك سكارليت أن جاكسون محتال وإيثان محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان محتال  \n(2) جاكسون فارس  \n(3) سكارليت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: دانيال، ميا، وأورورا. وفقًا لدانيال، \"أورورا فارس وميا محتالة\". أكدت ميا: \"أورورا فارس أو دانيال محتال\". \"ميا محتالة إذا وفقط إذا كانت ميا فارسًا\"، ذكرت أورورا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال محتال  \n(2) ميا فارس  \n(3) أورورا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: أوين، جاك، وجاكسون. سُمع أوين يقول: \"جاكسون فارس أو أوين فارس\". علق جاك: \"جاكسون فارس أو جاكسون محتال\". أشار جاكسون: \"إذا كان جاك محتالًا، فإن أوين محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين فارس  \n(2) جاك فارس  \n(3) جاكسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: هاربر، إيلا، وداوود. \"إيلا محتالة إذا وفقط إذا كان هاربر فارساً\"، ذكر هاربر. في تصريح من إيلا: \"هاربر فارس\". \"إذا كان داوود فارساً، فإن إيلا محتالة\"، ذكر داوود. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر محتالة  \n(2) إيلا محتالة  \n(3) داوود فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: آفا، هاربر، وبنيامين. \"هاربر محتال أو بنيامين محتال\" - آفا. \"هاربر فارس إذا وفقط إذا كان بنيامين فارساً\" - هاربر. \"آفا فارس\" - أعلن بنيامين. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا فارس  \n(2) هاربر محتالة  \n(3) بنيامين فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: جاكسون، أفري، وماثيو. كما قال جاكسون: \"ماثيو فارس أو جاكسون فارس\". أفري أخبرك أن جاكسون ليس محتالاً. ماثيو أكد: \"أفري فارس أو جاكسون محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون فارس  \n(2) أفري فارس  \n(3) ماثيو فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: إيما، هاربر، وويليام. قالت إيما إن ويليام ليس فارسًا. أشار هاربر، \"إذا كان هاربر فارسًا، فإن ويليام فارس\". \"هاربر فارس\" - ويليام. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما محتالة  \n(2) هاربر فارس  \n(3) ويليام فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: آفا، أميليا، وويليام. أكدت آفا: \"إذا كانت أميليا محتالة، فإن ويليام محتال\". أعلنت أميليا: \"ويليام محتال وآفا محتالة\". قال ويليام: \"أميليا ليست فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا محتالة  \n(2) أميليا محتالة  \n(3) ويليام فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: يعقوب، زوي، وسباستيان. قال يعقوب: \"سباستيان ليس محتالاً\". \"سباستيان فارس ويعقوب محتال\"، ادعت زوي. كما قال سباستيان: \"زوي محتالة وزوي فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب محتال  \n(2) زوي محتالة  \n(3) سباستيان محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: صوفيا، ويليام، ومايسون. \"إذا كان ويليام محتالاً، فإن ويليام فارس\" - صوفيا. أكد ويليام: \"إذا كانت صوفيا فارسة، فإن مايسون محتال\". كما قال مايسون: \"مايسون فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) ويليام فارس  \n(3) مايسون محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: أميليا، لوك، وماثيو. في تصريح من أميليا: \"لوك ليس محتالاً\". \"أميليا فارس وأميليا محتالة\"، أعلن لوك. لاحظ ماثيو، \"إذا كانت أميليا فارساً، فإن لوك محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا محتالة  \n(2) لوك محتال  \n(3) ماثيو فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: سكارليت، إيفلين، وزوي. قالت سكارليت: \"إيفلين محتالة وزوي محتالة.\" وفي كلمات إيفلين: \"زوي محتالة\". قالت زوي: \"إذا كانت سكارليت فارسة، فإن سكارليت محتالة.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سكارليت محتالة  \n(2) إيفلين محتالة  \n(3) زوي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة من السكان: إيفلين، بنيامين، وصوفيا. قالت إيفلين: \"بنيامين ليس محتالاً\". عبّر بنيامين عن أن صوفيا هي فارس إذا وفقط إذا كانت إيفلين محتالة. قالت صوفيا: \"صوفيا هي فارس إذا وفقط إذا كانت إيفلين فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين فارس  \n(2) بنيامين فارس  \n(3) صوفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: إيما، أفري، وإليزابيث. قالت إيما: \"إذا كانت أفري محتالة، فإن أفري فارس\". في تصريح من أفري: \"إذا كانت أفري فارسة، فإن إيما فارسة\". \"إليزابيث فارسة وأفري محتالة\" - إليزابيث. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما فارس  \n(2) أفري فارس  \n(3) إليزابيث محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: مايكل، رايلي، وصوفيا. في تصريح لمايكل: \"صوفيا محتالة أو رايلي محتالة\". لاحظت رايلي، \"صوفيا محتالة\". لاحظت صوفيا، \"إذا كانت رايلي محتالة، فإن صوفيا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل فارس  \n(2) رايلي محتالة  \n(3) صوفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: صوفيا، سكارليت، وشارلوت. قالت صوفيا: \"إذا كانت صوفيا فارساً، فإن شارلوت فارس.\" كما قالت سكارليت: \"صوفيا فارس.\" أخبرتك شارلوت أن صوفيا فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) سكارليت فارس  \n(3) شارلوت فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: ميا، هاربر، وأوليفر. \"ميا فارس\"، أعلنت ميا. قال هاربر إنه إذا كان هاربر فارسًا، فإن أوليفر محتال. قال أوليفر، \"هاربر فارس وميا فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا محتالة  \n(2) هاربر فارس  \n(3) أوليفر محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: مايكل، إيما، وإيفلين. قال لك مايكل إن إيفلين ليست محتالة. \"إيفلين فارس ومايكل فارس\" - إيما. علقت إيفلين، \"إيما فارس إذا وفقط إذا كانت إيما محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل محتال  \n(2) إيما محتالة  \n(3) إيفلين محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: أيدن، أميليا، وإيثان. \"إيثان فارس وأميليا محتالة\" - أيدن. في تصريح من أميليا: \"أميليا فارس إذا وفقط إذا كان إيثان محتالاً\". علق إيثان، \"أميليا فارس وأيدن محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن محتال  \n(2) أميليا محتالة  \n(3) إيثان محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: هنري، دانيال، وأبيجيل. قال هنري: \"دانيال ليس فارساً\". صرح دانيال: \"إذا كانت أبيجيل فارساً، فإن هنري فارس\". كما قالت أبيجيل: \"دانيال محتـال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هنري محتال  \n(2) دانيال فارس  \n(3) أبيجيل محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: جاك، إميلي، وأيدن. أكد جاك: \"إميلي ليست محتالة\". \"إميلي فارس أو أيدن محتال\" - إميلي. أخبرك أيدن أن أيدن فارس إذا وفقط إذا كانت إميلي محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاك محتال  \n(2) إميلي محتالة  \n(3) أيدن فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة من السكان: إيثان، مايكل، ولوغان. قال إيثان: \"إذا كان لوغان فارساً، فإن إيثان فارس\". وفي تصريح لمايكل: \"إيثان فارس\". وفي تصريح لوغان: \"إيثان محتال إذا وفقط إذا كان مايكل فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان فارس  \n(2) مايكل فارس  \n(3) لوغان محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: صوفيا، جاكسون، ولوك. صوفيا أعربت عن أن لوك فارس. جاكسون أخبرك أنه إذا كانت صوفيا محتالة، فإن لوك محتال. في تصريح للوك: \"صوفيا محتالة إذا وفقط إذا كانت صوفيا فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا محتالة  \n(2) جاكسون فارس  \n(3) لوك محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: جاكسون، زوي، وصوفيا. \"زوي فارس\"، ادعى جاكسون. زوي عبرت عن أن جاكسون محتال أو زوي فارس. صوفيا قالت إن زوي فارس وجاكسون فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون فارس  \n(2) زوي فارس  \n(3) صوفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: آفا، نوح، وسباستيان. في كلمات آفا: \"آفا فارس\". علق نوح: \"آفا محتالة أو سباستيان محتال\". أكد سباستيان: \"نوح فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا محتالة  \n(2) نوح فارس  \n(3) سباستيان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: مايسون، ماثيو، وإيما. قال مايسون: \"إيما محتالة أو ماثيو فارس.\" كما قال ماثيو: \"إذا كانت إيما محتالة، فإن مايسون فارس.\" \"ماثيو فارس\"، أعلنت إيما. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايسون فارس  \n(2) ماثيو فارس  \n(3) إيما فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة من السكان: صموئيل، إيثان، وسكارليت. صموئيل أعرب عن أن سكارليت محتالة إذا وفقط إذا كان إيثان محتالًا. إيثان أشار، \"صموئيل محتال\". سكارليت أعربت عن أن سكارليت فارسة إذا وفقط إذا كان إيثان محتالًا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صموئيل فارس  \n(2) إيثان محتال  \n(3) سكارليت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: إليزابيث، سكارليت، وجيمس. في كلمات إليزابيث: \"جيمس ليس فارساً\". \"إذا كان جيمس فارساً، فإن إليزابيث محتالة\"، أعلنت سكارليت. علق جيمس، \"سكارليت فارس ومحتالة في نفس الوقت\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث فارس  \n(2) سكارليت فارس  \n(3) جيمس محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة سكان: لوكاس، إيما، وزوي. في كلمات لوكاس: \"زوي ليست محتالة\". أعربت إيما عن أن زوي ليست فارسة. زوي أكدت: \"إيما محتالة ولوكاس محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس محتال  \n(2) إيما فارس  \n(3) زوي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: جاكسون، إيما، وصموئيل. قال جاكسون: \"صموئيل فارس أو جاكسون فارس\". في تصريح من إيما: \"إيما فارس إذا وفقط إذا كان جاكسون محتالًا\". في كلمات صموئيل: \"جاكسون محتال وإيما محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون محتال  \n(2) إيما فارس  \n(3) صموئيل محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بثلاثة سكان: أوين، فيكتوريا، وليام. في تصريح لأوين: \"فيكتوريا محتالة وفيكتوريا فارسة\". لاحظت فيكتوريا، \"أوين محتال وليام محتال\". قال وليام إن فيكتوريا محتالة وفيكتوريا فارسة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين محتال  \n(2) فيكتوريا فارسة  \n(3) ليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بثلاثة من السكان: أوليفيا، جاك، ويعقوب. قالت أوليفيا: \"إذا كان جاك محتالاً، فإن يعقوب محتال.\" في تصريح لجاك: \"يعقوب فارس ويعقوب محتال.\" علق يعقوب: \"إذا كان جاك فارساً، فإن أوليفيا فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا محتالة  \n(2) جاك محتال  \n(3) يعقوب فارس"
    }
]