[
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：オリバーとイーサン。オリバーは「オリバーは騎士であるか、イーサンはならず者である」と言いました。イーサンの発言は「オリバーは騎士である」です。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリバーは騎士です  \n(2) イーサンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：マイケルとジェイコブ。マイケルは「ジェイコブはならず者だ」と言いました。「マイケルは騎士である場合に限り、マイケルはならず者だ」とジェイコブは宣言しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルは騎士です  \n(2) ジェイコブはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：アメリアとハーパー。アメリアは「ハーパーは騎士か、ハーパーはならず者です」と言っているのが聞かれました。「アメリアは騎士であり、アメリアはならず者です」とハーパーは主張しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアは騎士です  \n(2) ハーパーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ローガンとリリー。ローガンは「リリーはならず者ではない」と述べました。リリーは「ローガンはならず者で、私は騎士です」と表現しました。それでは、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) ローガンはならず者です。  \n(2) リリーはならず者です。"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ジャックとイヴリン。ジャックの言葉では、「イヴリンは騎士か、イヴリンはならず者です」。イヴリンはこう主張しました：「もしジャックがならず者なら、イヴリンは騎士です」。では、誰が騎士で誰がならず者ですか？",
        "solution_text_format": "(1) ジャックは騎士です  \n(2) イヴリンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：サミュエルとアリア。サミュエルの言葉では、「アリアは騎士である場合に限り、アリアはならず者である」と言っています。アリアは、「サミュエルはならず者であるか、サミュエルは騎士である」とコメントしました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルはならず者です  \n(2) アリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ダニエルとリアム。ダニエルの発言はこうです：「リアムはならず者である場合、そしてダニエルが騎士である場合に限り、リアムはならず者です」。リアムはこう言いました：「ダニエルは騎士であるか、リアムは騎士である」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルはならず者です。  \n(2) リアムはならず者です。"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エイヴァとヘンリー。エイヴァは、ヘンリーが騎士であるか、ヘンリーがならず者であると言いました。「エイヴァは騎士である場合に限り、エイヴァはならず者である」とヘンリーは主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァは騎士です  \n(2) ヘンリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ペネロペとアレクサンダー。ペネロペはこう主張しました：「もしペネロペが騎士なら、アレクサンダーは騎士です」。アレクサンダーによれば、「ペネロペは騎士です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペは騎士です  \n(2) アレクサンダーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ライリーとソフィア。「ソフィアは騎士である場合に限り、ソフィアはならず者である」 - ライリー。ソフィアは言いました、「ライリーはならず者であるか、ソフィアは騎士である」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ライリーはならず者です  \n(2) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：リアムとベンジャミン。リアムは「もしベンジャミンがならず者なら、リアムは騎士だ」と言いました。「リアムは騎士であるか、リアムはならず者である」とベンジャミンは宣言しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムは騎士です  \n(2) ベンジャミンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：スカーレットとアリア。「アリアはならず者であり、アリアは騎士です」とスカーレットは言いました。「スカーレットは騎士である場合に限り、スカーレットはならず者です」とアリアは言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) スカーレットはならず者です  \n(2) アリアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ハーパーとルーク。ハーパーは「ルークは騎士だ」と言っているのが聞かれました。「ハーパーは騎士であるのは、ルークが騎士である場合に限る」とルークは宣言しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーは騎士です  \n(2) ルークは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エイヴァとシャーロット。エイヴァはシャーロットがならず者であると表現しました。シャーロットは「エイヴァは騎士である場合に限り、シャーロットは騎士である」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァは騎士です  \n(2) シャーロットはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ジョセフとサミュエル。ジョセフは「サミュエルは騎士であり、サミュエルはならず者です」と言いました。サミュエルは「ジョセフは騎士である場合に限り、ジョセフはならず者です」と表現しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフはならず者です。  \n(2) サミュエルはならず者です。"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：セバスチャンとベンジャミン。「もしセバスチャンが騎士なら、ベンジャミンはならず者だ」とセバスチャンは主張しました。「セバスチャンは騎士で、セバスチャンはならず者だ」とベンジャミン。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) セバスチャンは騎士です  \n(2) ベンジャミンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：アメリアとジェイコブ。アメリアは、ジェイコブが騎士であり、ジェイコブがならず者であると言いました。ジェイコブは、「もしアメリアがならず者なら、アメリアは騎士です」とコメントしました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアはならず者です  \n(2) ジェイコブはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：アビゲイルとハーパー。アビゲイルは「もしアビゲイルが騎士なら、ハーパーは騎士です」と主張しました。ハーパーによれば、「アビゲイルは騎士か、ハーパーは騎士です」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アビゲイルは騎士です  \n(2) ハーパーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：スカーレットとジョセフ。「スカーレットは騎士であるのは、ジョセフがならず者である場合に限る」とスカーレットは主張しました。ジョセフは「もしスカーレットがならず者であれば、ジョセフは騎士である」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) スカーレットはならず者です。  \n(2) ジョセフはならず者です。"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ダニエルとライリー。ダニエルによれば、「ライリーは騎士ではない」とのことです。「ダニエルは騎士であるのは、ライリーが騎士である場合に限る」とライリーは宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルは騎士です  \n(2) ライリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エリザベスとオリバー。「オリバーはならず者ではない」とエリザベスが言いました。オリバーは「オリバーは騎士であるか、エリザベスはならず者である」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスは騎士です  \n(2) オリバーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ダニエルとアビゲイル。ダニエルによれば、「アビゲイルはならず者であり、アビゲイルは騎士です」。アビゲイルは、「ダニエルは騎士か、ダニエルはならず者です」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルはならず者です  \n(2) アビゲイルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ソフィアとローガン。「ローガンは騎士か、ローガンはならず者です」とソフィアは宣言しました。「ソフィアは騎士か、ソフィアはならず者です」とローガンは主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) ローガンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：シャーロットとアレクサンダー。シャーロットは言いました。「もしアレクサンダーが騎士なら、アレクサンダーはならず者です。」アレクサンダーは宣言しました。「シャーロットは騎士か、アレクサンダーは騎士です。」では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットはならず者です  \n(2) アレクサンダーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：シャーロットとエイデン。シャーロットは、エイデンがならず者であると言いました。エイデンは「シャーロットはならず者か、シャーロットは騎士です」と述べました。それでは、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) シャーロットはならず者です  \n(2) エイデンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：シャーロットとスカーレット。「スカーレットは騎士であり、スカーレットはならず者です」とシャーロットが言いました。スカーレットは、「スカーレットは騎士であり、シャーロットは騎士です」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットはならず者です  \n(2) スカーレットはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：オリビアとヘンリー。オリビアはこう主張しました：「ヘンリーは騎士か、ヘンリーはならず者です」。ヘンリーの言葉では：「オリビアはならず者で、オリビアは騎士です」。では、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) オリビアは騎士です  \n(2) ヘンリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ダニエルとリリー。ダニエルは「もしリリーが騎士なら、リリーはならず者だ」と言っているのが聞かれました。リリーは「リリーは騎士か、ダニエルは騎士だ」と言っているのが聞かれました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルはならず者です  \n(2) リリーは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ジャックとベンジャミン。ジャックは「ベンジャミンは騎士であるか、ジャックが騎士である」と言いました。ベンジャミンは「もしジャックが騎士なら、ジャックはならず者である」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャックは騎士です  \n(2) ベンジャミンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ダニエルとサミュエル。ダニエルは「サミュエルはならず者か、サミュエルは騎士です」と言いました。サミュエルは「サミュエルは騎士か、ダニエルは騎士です」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルは騎士です  \n(2) サミュエルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：リアムとアリア。「アリアはならず者ではない」とリアムが言いました。アリアはこう主張しました：「アリアは騎士であるのは、リアムが騎士である場合に限る」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムは騎士です  \n(2) アリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ウィリアムとノア。ウィリアムは、ノアがならず者であるか、ノアが騎士であると表現しました。ノアの発言では、「ウィリアムは騎士である場合に限り、ウィリアムはならず者である」と言っています。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムは騎士です  \n(2) ノアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ミアとアリア。「ミアは騎士か、アリアは騎士です」とミアは宣言しました。アリアは言いました。「もしミアが騎士なら、ミアはならず者です。」では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアは騎士です  \n(2) アリアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：オーロラとシャーロット。オーロラは「シャーロットは騎士であるのは、オーロラが騎士である場合に限る」と述べました。シャーロットは「もしシャーロットが騎士であれば、オーロラは騎士である」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーロラは騎士です  \n(2) シャーロットは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：クロエとジェイコブ。クロエは「ジェイコブは騎士であり、ジェイコブはならず者です」と述べました。ジェイコブは「クロエはならず者です」と主張しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) クロエはならず者です  \n(2) ジェイコブは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：リアムとローガン。リアムは「リアムは騎士であるのは、ローガンがならず者である場合に限る」と言っているのが聞かれました。ローガンは「リアムはならず者ではない」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムはならず者です  \n(2) ローガンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：サミュエルとイザベラ。「イザベラは騎士です」とサミュエルが言いました。イザベラは、サミュエルがならず者で、イザベラが騎士だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルはならず者です。  \n(2) イザベラはならず者です。"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ベンジャミンとリリー。ベンジャミンの言葉では、「もしリリーがならず者なら、リリーは騎士です。」と述べました。「ベンジャミンはならず者であり、ベンジャミンは騎士です」とリリーは宣言しました。では、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) ベンジャミンはならず者です。  \n(2) リリーはならず者です。"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：メイソンとゾーイ。メイソンは「ゾーイは騎士であり、ゾーイはならず者だ」と述べました。ゾーイは「メイソンは騎士だ」と主張しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) メイソンはならず者です  \n(2) ゾーイはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ソフィアとシャーロット。ソフィアは「もしソフィアが騎士なら、シャーロットはならず者です」とコメントしました。「ソフィアはならず者で、ソフィアは騎士です」とシャーロットが言いました。では、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) シャーロットはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ウィリアムとデイビッド。ウィリアムはこう言いました。「デイビッドはならず者で、デイビッドは騎士です」。デイビッドはこう言いました。「もしウィリアムが騎士なら、デイビッドは騎士です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムはならず者です  \n(2) デイビッドは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ソフィアとノア。「もしソフィアが騎士なら、ノアはならず者です」とソフィアが言いました。ノアは、「もしソフィアが騎士なら、ノアは騎士です」と指摘しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) ノアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：シャーロットとイヴリン。シャーロットは「もし私が騎士なら、イヴリンは騎士です」と述べました。イヴリンは「私が騎士であるのは、シャーロットが騎士である場合に限ります」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットは騎士です。  \n(2) イヴリンは騎士です。"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ダニエルとジャック。ダニエルは「もしダニエルが騎士なら、ジャックは騎士だ」と表現しました。「ジャックは騎士だ」とジャックは言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルは騎士です  \n(2) ジャックは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：イヴリンとハーパー。「ハーパーは騎士ではない」とイヴリンが言いました。ハーパーの言葉では、「イヴリンはならず者である場合に限り、イヴリンは騎士です」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンは騎士です  \n(2) ハーパーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エイブリーとマイケル。「エイブリーは騎士であるのは、マイケルがならず者である場合に限る」とエイブリーは言いました。「エイブリーは騎士ではない」とマイケルは宣言しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーは騎士です  \n(2) マイケルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エリザベスとオーロラ。エリザベスによれば、「エリザベスは騎士であるのは、オーロラが騎士である場合に限る」とのことです。オーロラは「エリザベスは騎士です」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスは騎士です  \n(2) オーロラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ライリーとベンジャミン。ライリーが言ったように、「ライリーは騎士であるか、ベンジャミンはならず者である」。ベンジャミンは主張しました：「ライリーはならず者である場合、かつてベンジャミンは騎士である」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ライリーはならず者です  \n(2) ベンジャミンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ペネロペとオリバー。ペネロペは、オリバーがならず者であるのは、ペネロペが騎士である場合に限ると言いました。オリバーは、ペネロペがならず者であれば、ペネロペは騎士であると表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペはならず者です  \n(2) オリバーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：クロエとジェームズ。クロエが言ったように、「ジェームズはならず者です」。ジェームズによれば、「クロエはならず者である場合、ジェームズは騎士である」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) クロエはならず者です  \n(2) ジェームズは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ヘンリーとデイビッド。「デイビッドはならず者で、デイビッドは騎士です」とヘンリーが言いました。デイビッドの発言では、「ヘンリーはならず者です」と言っています。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ヘンリーはならず者です  \n(2) デイビッドは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：イヴリンとエリザベス。イヴリンは、イヴリンが騎士であるのはエリザベスがならず者である場合に限るとあなたに言いました。「イヴリンは騎士です」 - エリザベス。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンはならず者です  \n(2) エリザベスはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ジャクソンとエリザベス。ジャクソンはこう言いました。「エリザベスはならず者で、ジャクソンは騎士です」。エリザベスは宣言しました。「もしジャクソンがならず者なら、ジャクソンは騎士です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンはならず者です。  \n(2) エリザベスはならず者です。"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エイデンとエマ。エイデンは「エイデンは騎士で、エマは騎士です」と述べました。「もしエマが騎士なら、エイデンは騎士です」とエマが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンは騎士です  \n(2) エマは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：セバスチャンとエイヴァ。セバスチャンの発言：「エイヴァは騎士です」。エイヴァは宣言しました。「もしセバスチャンが騎士なら、エイヴァは騎士です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) セバスチャンは騎士です  \n(2) エイヴァは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ジェームズとオリバー。ジェームズはこう主張しました：「もしオリバーがならず者なら、オリバーは騎士です」。オリバーはあなたに、ジェームズは騎士であるか、ジェームズはならず者であると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズは騎士です  \n(2) オリバーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ライリーとマシュー。「マシューはならず者か、マシューは騎士だ」とライリーは主張しました。マシューは言いました。「もしライリーがならず者なら、マシューは騎士です」。では、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) ライリーは騎士です  \n(2) マシューは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ジャクソンとマイケル。ジャクソンは「もしジャクソンが騎士なら、マイケルはならず者だ」と言いました。マイケルは「ジャクソンは騎士ではない」と指摘しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンは騎士です  \n(2) マイケルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ペネロペとアレクサンダー。ペネロペは「アレクサンダーは騎士です」と言いました。「ペネロペが騎士である場合に限り、ペネロペはならず者です」とアレクサンダーは宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペはならず者です  \n(2) アレクサンダーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：アリアとノア。「ノアは騎士ではない」とアリアが言いました。「アリアはノアが騎士である場合に限り、ならず者です」とノアが宣言しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アリアはならず者です  \n(2) ノアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ノアとジャクソン。ノアは「ジャクソンはならず者であるのは、ノアが騎士である場合に限る」と述べました。ジャクソンは「ノアが騎士であれば、ノアはならず者である」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアは騎士です  \n(2) ジャクソンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エイヴァとイーサン。エイヴァは「エイヴァは騎士であるのは、イーサンがならず者である場合に限る」と主張しました。イーサンは「イーサンは騎士であるか、エイヴァはならず者である」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァは騎士です  \n(2) イーサンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：アビゲイルとビクトリア。アビゲイルは「もしビクトリアがならず者なら、ビクトリアは騎士です」と述べました。ビクトリアの発言は「ビクトリアは騎士で、アビゲイルはならず者です」となっています。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アビゲイルはならず者です  \n(2) ビクトリアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ジョセフとジャクソン。「もしジャクソンが騎士なら、ジョセフは騎士です」とジョセフが言いました。「もしジャクソンが騎士なら、ジョセフは騎士です」とジャクソンも主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフは騎士です。  \n(2) ジャクソンは騎士です。"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ノアとシャーロット。ノアは、シャーロットが騎士であり、ノア自身も騎士であると言いました。シャーロットは、「ノアが騎士である場合に限り、シャーロットは騎士である」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアは騎士です  \n(2) シャーロットは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エイブリーとクロエ。エイブリーは、クロエが騎士であり、クロエがならず者であると言いました。「エイブリーは騎士ではない」とクロエは言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーはならず者です  \n(2) クロエは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：イヴリンとエイヴァ。「もしイヴリンが騎士なら、エイヴァは騎士です」とイヴリンは主張しました。エイヴァは、エイヴァが騎士であるか、イヴリンが騎士であると言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンは騎士です  \n(2) エイヴァは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：マシューとビクトリア。マシューの言葉では、「ビクトリアは騎士ではない」と言っています。ビクトリアの言葉では、「ビクトリアは騎士であり、マシューも騎士です」と言っています。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マシューは騎士です  \n(2) ビクトリアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ダニエルとウィリアム。ダニエルは「ウィリアムは騎士か、ダニエルは騎士だ」と宣言しました。ウィリアムは「ダニエルは騎士か、ダニエルはならず者だ」と表現しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルは騎士です  \n(2) ウィリアムは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ルークとアレクサンダー。ルークは「もしルークが騎士なら、アレクサンダーはならず者だ」と言いました。アレクサンダーは「アレクサンダーは騎士で、ルークも騎士だ」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) アレクサンダーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ミアとサミュエル。ミアは自分が騎士であり、サミュエルが騎士であると表現しました。サミュエルはミアが騎士であり、ミアがならず者であると表現しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアはならず者です  \n(2) サミュエルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：リアムとヘンリー。リアムによれば、「リアムは騎士であるのは、ヘンリーが騎士である場合に限る」と言っています。ヘンリーは「リアムはならず者ではない」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムは騎士です  \n(2) ヘンリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：オリビアとジョセフ。「もしジョセフが騎士なら、オリビアは騎士です」とオリビアが言いました。ジョセフは「オリビアが騎士であるとき、オリビアはならず者です」とコメントしました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアは騎士です  \n(2) ジョセフはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ジャックとジャクソン。ジャックは「ジャックは騎士で、ジャクソンはならず者だ」と主張しました。ジャクソンは「ジャックはならず者ではない」とあなたに言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャックはならず者です。  \n(2) ジャクソンはならず者です。"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：イヴリンとイーサン。イヴリンの発言はこうです：「イヴリンは騎士であるのは、イーサンがならず者である場合に限る」。イーサンはこう言いました：「イーサンは騎士であるのは、イヴリンがならず者である場合に限る」。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンはならず者です  \n(2) イーサンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エイブリーとオーロラ。エイブリーは「もしオーロラが騎士なら、エイブリーは騎士だ」とコメントしました。オーロラによれば、「エイブリーは騎士であり、エイブリーはならず者だ」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーは騎士です  \n(2) オーロラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：イザベラとイヴリン。イザベラの発言は「イヴリンは騎士ではない」です。イヴリンは「イザベラはならず者であるか、イザベラは騎士である」と述べました。それでは、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) イザベラはならず者です  \n(2) イヴリンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：サミュエルとスカーレット。「もしスカーレットがならず者なら、サミュエルは騎士だ」とサミュエルは宣言しました。「サミュエルは騎士ではない」とスカーレットは宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルは騎士です  \n(2) スカーレットはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ジェームズとサミュエル。ジェームズは、サミュエルが騎士であるか、ジェームズが騎士であると表現しました。「ジェームズはならず者であるか、ジェームズは騎士である」とサミュエルは主張しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズは騎士です  \n(2) サミュエルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ハーパーとゾーイ。ハーパーは「ゾーイはならず者であるのは、ゾーイが騎士である場合に限る」とコメントしました。ゾーイは「ハーパーはならず者であるか、ハーパーは騎士である」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーはならず者です  \n(2) ゾーイは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ライリーとエリザベス。ライリーは「もしエリザベスがならず者なら、エリザベスは騎士だ」と述べました。エリザベスは「ライリーはならず者か、ライリーは騎士だ」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ライリーは騎士です  \n(2) エリザベスは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ハーパーとエリザベス。ハーパーは「エリザベスは騎士であり、エリザベスはならず者です」と言いました。エリザベスによれば、「エリザベスは騎士であるか、ハーパーはならず者です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーはならず者です  \n(2) エリザベスは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エイブリーとリアム。エイブリーの言葉では、「エイブリーは騎士であるか、リアムは騎士である」と言っています。リアムの発言では、「リアムは騎士であるのは、エイブリーがならず者である場合に限る」と言っています。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーはならず者です  \n(2) リアムはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ソフィアとエミリー。ソフィアの言葉では、「もしエミリーが騎士なら、エミリーはならず者です」。エミリーは、「もしソフィアがならず者なら、エミリーは騎士です」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアはならず者です  \n(2) エミリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エラとジェイコブ。「ジェイコブはならず者だ」とエラは宣言しました。ジェイコブは主張しました：「もしジェイコブが騎士なら、エラはならず者です」。では、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) エラはならず者です  \n(2) ジェイコブは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ジャックとアリア。「もしジャックが騎士なら、アリアはならず者だ」とジャックは宣言しました。アリアは、ジャックがならず者だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャックは騎士です  \n(2) アリアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エイヴァとルーカス。エイヴァはルーカスが騎士だと言いました。「ルーカスは騎士で、エイヴァはならず者だ」とルーカスは言いました。では、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) エイヴァはならず者です  \n(2) ルーカスはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：メイソンとオリバー。「オリバーはならず者であるのは、オリバーが騎士である場合に限る」とメイソンは言いました。「メイソンは騎士であるのは、メイソンがならず者である場合に限る」とオリバーは宣言しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) メイソンはならず者です  \n(2) オリバーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：アメリアとオーロラ。「オーロラはならず者ではない」とアメリアが言いました。オーロラは「アメリアはならず者か、アメリアは騎士です」と言いました。それでは、誰が騎士で誰がならず者ですか？",
        "solution_text_format": "(1) アメリアは騎士です  \n(2) オーロラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：アメリアとジェイコブ。「ジェイコブは騎士であり、ジェイコブはならず者です」とアメリアは宣言しました。ジェイコブの発言では、「もしアメリアが騎士ならば、ジェイコブは騎士です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアはならず者です  \n(2) ジェイコブは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：スカーレットとウィリアム。スカーレットの言葉では、「ウィリアムはならず者である場合に限り、ウィリアムは騎士です」。ウィリアムは、「スカーレットがならず者であれば、スカーレットは騎士です」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) スカーレットはならず者です。  \n(2) ウィリアムはならず者です。"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：メイソンとハーパー。メイソンの発言はこうです：「ハーパーはならず者で、メイソンは騎士です」。ハーパーはこう述べました：「メイソンは騎士か、メイソンはならず者です」。では、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) メイソンはならず者です  \n(2) ハーパーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ルークとグレース。ルークは、グレースがならず者であるか、グレースが騎士であると言いました。グレースは「もしグレースが騎士なら、ルークは騎士です」と主張しました。それでは、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) グレースは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エイブリーとジェームズ。エイブリーは「ジェームズはならず者だ」と言いました。ジェームズは「ジェームズは騎士で、エイブリーも騎士だ」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーは騎士です  \n(2) ジェームズはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ジャクソンとリリー。「リリーはならず者か、ジャクソンは騎士だ」とジャクソンは宣言しました。リリーは「ジャクソンは騎士だ」と言いました。それでは、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) ジャクソンは騎士です  \n(2) リリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：オーウェンとスカーレット。オーウェンは、自分が騎士であり、スカーレットがならず者であると主張しました。スカーレットは、「もしスカーレットが騎士であれば、オーウェンはならず者である」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンはならず者です  \n(2) スカーレットは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エマとイザベラ。エマによれば、「もしイザベラが騎士なら、エマは騎士です」。イザベラは、「もしエマがならず者なら、エマは騎士です」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エマは騎士です  \n(2) イザベラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ノアとマシュー。「マシューは騎士です」とノアが言いました。マシューは「ノアは騎士であるのは、ノアがならず者である場合に限ります」とコメントしました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアはならず者です  \n(2) マシューはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：リアムとデイビッド。リアムは「デイビッドはならず者であるか、リアムは騎士である」と言いました。デイビッドは「もしデイビッドが騎士なら、リアムは騎士だ」と主張しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムは騎士です  \n(2) デイビッドは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エリザベスとノア。エリザベスは、ノアがならず者である限り、エリザベスは騎士であると言いました。「エリザベスはならず者だ」とノアは主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスは騎士です  \n(2) ノアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：オリビアとジャック。「もしジャックが騎士なら、オリビアは騎士です」とオリビアは主張しました。ジャックは「オリビアは騎士です」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアは騎士です  \n(2) ジャックは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：イーサンとエリザベス。「エリザベスはならず者で、エリザベスは騎士です」とイーサンが言いました。エリザベスは「イーサンは騎士で、エリザベスは騎士です」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンはならず者です  \n(2) エリザベスはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：リアムとノア。リアムは「もしノアがならず者なら、リアムは騎士だ」と言いました。ノアは「もしノアが騎士なら、リアムは騎士だ」と表現しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムは騎士です。  \n(2) ノアは騎士です。"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：イザベラとエマ。「エマは騎士か、エマはならず者です」とイザベラは主張しました。エマは、イザベラは騎士か、エマは騎士だと言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イザベラは騎士です  \n(2) エマは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：デイビッドとエイヴァ。「エイヴァはならず者であるのは、エイヴァが騎士である場合に限る」とデイビッドは宣言しました。エイヴァは「デイビッドは騎士であり、エイヴァは騎士である」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドはならず者です  \n(2) エイヴァはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ローガンとエラ。ローガンは「もしローガンが騎士なら、エラはならず者だ」と言いました。「エラは騎士で、ローガンはならず者だ」とエラは宣言しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンは騎士です  \n(2) エラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ソフィアとアリア。ソフィアの言葉では、「アリアは騎士である場合に限り、アリアはならず者です」と言います。アリアの言葉では、「ソフィアはならず者であり、ソフィアは騎士です」と言います。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアはならず者です  \n(2) アリアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：セバスチャンとエイヴァ。セバスチャンが言ったように、「エイヴァは騎士である場合に限り、セバスチャンは騎士である」。エイヴァによれば、「エイヴァは騎士である場合に限り、セバスチャンは騎士である」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) セバスチャンは騎士です  \n(2) エイヴァは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ルーカスとセバスチャン。ルーカスは「セバスチャンはならず者で、ルーカスは騎士だ」と述べました。セバスチャンは「ルーカスは騎士であるのは、セバスチャンが騎士である場合に限る」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスは騎士です  \n(2) セバスチャンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：マシューとエリザベス。マシューの言葉では、「マシューは騎士である場合に限り、エリザベスは騎士である」と言っています。エリザベスは、「もしマシューが騎士なら、マシューはならず者である」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マシューはならず者です  \n(2) エリザベスは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エラとイザベラ。エラは、イザベラがならず者だと言いました。イザベラは、エラがならず者である場合に限り、エラは騎士だと言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラは騎士です  \n(2) イザベラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：アビゲイルとイザベラ。アビゲイルは「イザベラは騎士か、アビゲイルが騎士です」と主張しました。イザベラは「アビゲイルは騎士ではありません」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アビゲイルは騎士です  \n(2) イザベラはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エイデンとビクトリア。エイデンは「もしビクトリアがならず者なら、ビクトリアは騎士だ」と述べました。ビクトリアは「もしビクトリアが騎士なら、エイデンは騎士だ」と主張しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンは騎士です。  \n(2) ビクトリアは騎士です。"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：アメリアとオリビア。アメリアはこう言いました。「もしアメリアが騎士なら、オリビアはならず者です。」オリビアは言いました。「オリビアが騎士であるのは、アメリアが騎士である場合に限ります。」では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアは騎士です  \n(2) オリビアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：イヴリンとオリビア。イヴリンは「オリビアは騎士です」と言いました。オリビアの発言では「イヴリンはならず者であるか、オリビアは騎士です」と言っています。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンは騎士です  \n(2) オリビアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：イーサンとルーカス。イーサンの発言はこうです：「ルーカスはならず者であるのは、イーサンが騎士である場合に限る。」ルーカスは言いました、「イーサンは騎士です。」では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンはならず者です  \n(2) ルーカスはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：イヴリンとリアム。イヴリンは「イヴリンは騎士であるのは、リアムがならず者である場合に限る」と述べました。リアムの発言は「リアムは騎士であるか、イヴリンは騎士である」です。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンはならず者です  \n(2) リアムはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ビクトリアとアビゲイル。ビクトリアはこう主張しました：「もしアビゲイルがならず者なら、アビゲイルは騎士です」。アビゲイルは宣言しました。「ビクトリアが騎士である場合に限り、アビゲイルは騎士です」。さて、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ビクトリアは騎士です  \n(2) アビゲイルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ウィリアムとシャーロット。ウィリアムは「もしウィリアムが騎士なら、シャーロットはならず者だ」とコメントしました。シャーロットの発言では「ウィリアムは騎士で、シャーロットも騎士だ」と言っています。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムは騎士です  \n(2) シャーロットはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エラとスカーレット。エラは「スカーレットはならず者か、スカーレットは騎士です」と言っているのが聞かれました。「エラは騎士か、エラはならず者です」とスカーレットは言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラは騎士です  \n(2) スカーレットは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ソフィアとクロエ。ソフィアは「もしソフィアが騎士なら、クロエは騎士です」と言いました。クロエは、ソフィアがならず者であるか、ソフィアが騎士であると表現しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) クロエは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：オリビアとエラ。オリビアは「もしオリビアが騎士なら、エラは騎士です」と言っているのが聞かれました。エラは「もしエラが騎士なら、オリビアは騎士です」とあなたに言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアは騎士です  \n(2) エラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ベンジャミンとペネロペ。ベンジャミンは「ペネロペは騎士であるのは、ベンジャミンが騎士である場合に限る」と述べました。ペネロペは、ペネロペが騎士であり、ベンジャミンも騎士であると言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンは騎士です  \n(2) ペネロペは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ヘンリーとベンジャミン。ヘンリーは、ヘンリーが騎士であるのはベンジャミンが騎士である場合に限ると表現しました。ベンジャミンの言葉では、「ヘンリーはならず者で、ベンジャミンは騎士です」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ヘンリーはならず者です  \n(2) ベンジャミンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：デイビッドとノア。デイビッドは、ノアが騎士であるのはノアがならず者である場合に限るとあなたに言いました。ノアはデイビッドが騎士であると表現しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドはならず者です  \n(2) ノアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ベンジャミンとジェイコブ。ベンジャミンは「ジェイコブはならず者であるか、ベンジャミンは騎士である」と言いました。ジェイコブは「ジェイコブは騎士であるのは、ベンジャミンがならず者である場合に限る」と述べました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンはならず者です  \n(2) ジェイコブは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ビクトリアとエリザベス。ビクトリアによれば、「エリザベスは騎士であり、ビクトリアも騎士です」。エリザベスは、「ビクトリアはエリザベスが騎士である場合に限り騎士です」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ビクトリアは騎士です  \n(2) エリザベスは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ソフィアとゾーイ。ソフィアは「ゾーイはならず者ではない」と述べました。ゾーイはソフィアが騎士であり、ソフィアがならず者であると表現しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアはならず者です  \n(2) ゾーイはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：シャーロットとゾーイ。シャーロットは「ゾーイはならず者である場合に限り、ゾーイは騎士である」と言いました。ゾーイの発言は「シャーロットは騎士ではない」です。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットはならず者です  \n(2) ゾーイは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ウィリアムとペネロペ。ウィリアムの発言：「ペネロペは騎士である場合に限り、ペネロペはならず者です」。ペネロペの発言：「ウィリアムは騎士である場合に限り、ウィリアムはならず者です」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムはならず者です。  \n(2) ペネロペはならず者です。"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ハーパーとアメリア。ハーパーは「ハーパーは騎士であるか、アメリアはならず者である」と言いました。アメリアは「アメリアは騎士であるのは、ハーパーがならず者である場合に限る」と述べました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーはならず者です  \n(2) アメリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ローガンとジェームズ。ローガンは「ジェームズはならず者で、ジェームズは騎士だ」とコメントしました。ジェームズは「ローガンはならず者か、ローガンは騎士だ」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンはならず者です  \n(2) ジェームズは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：イザベラとアメリア。イザベラは「アメリアは騎士であるのは、イザベラが騎士である場合に限る」と言っているのが聞かれました。アメリアは「イザベラがならず者であるのは、アメリアが騎士である場合に限る」と主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イザベラはならず者です  \n(2) アメリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ジャクソンとハーパー。ジャクソンは「ジャクソンは騎士で、ハーパーは騎士です」と言いました。ハーパーは「もしハーパーが騎士なら、ジャクソンはならず者です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンはならず者です  \n(2) ハーパーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：スカーレットとマイケル。スカーレットは「マイケルは騎士であり、マイケルはならず者です」と言っているのが聞かれました。「もしマイケルが騎士なら、スカーレットはならず者です」とマイケルは宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) スカーレットはならず者です  \n(2) マイケルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ソフィアとメイソン。「メイソンはならず者で、メイソンは騎士です」とソフィアは主張しました。メイソンは「ソフィアは騎士で、ソフィアはならず者です」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアはならず者です  \n(2) メイソンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：グレースとアメリア。グレースの発言はこうです：「アメリアはならず者である場合、グレースは騎士である」。アメリアはあなたに、もしグレースが騎士であればアメリアも騎士であると言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) グレースは騎士です  \n(2) アメリアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：グレースとペネロペ。グレースは「ペネロペはならず者だ」と言いました。ペネロペは「グレースは騎士か、ペネロペは騎士だ」と述べました。それでは、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) グレースはならず者です  \n(2) ペネロペは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：セバスチャンとオーロラ。セバスチャンは「セバスチャンは騎士で、オーロラはならず者だ」と言いました。オーロラは「セバスチャンは騎士か、セバスチャンはならず者だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) セバスチャンはならず者です  \n(2) オーロラは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：オーロラとジェイコブ。オーロラは、ジェイコブが騎士であると言いました。ジェイコブによれば、「もしジェイコブが騎士なら、オーロラは騎士です」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーロラは騎士です  \n(2) ジェイコブは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エイヴァとゾーイ。エイヴァは「エイヴァは騎士であるのは、ゾーイが騎士である場合に限る」とコメントしました。ゾーイの言葉では「エイヴァはならず者であるのは、ゾーイが騎士である場合に限る」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァはならず者です  \n(2) ゾーイは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ベンジャミンとジェイコブ。ベンジャミンの言葉では、「ジェイコブは騎士です」。ジェイコブは、「ジェイコブは騎士であるのは、ベンジャミンがならず者である場合に限る」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンはならず者です。  \n(2) ジェイコブはならず者です。"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ルークとエイブリー。ルークは「ルークは騎士か、エイブリーはならず者だ」と主張しました。「もしエイブリーが騎士なら、ルークはならず者だ」とエイブリーは宣言しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークはならず者です  \n(2) エイブリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エラとジェイコブ。エラは「エラは騎士で、ジェイコブも騎士です」と言いました。ジェイコブは、エラが騎士である場合に限り、エラはならず者であると表現しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラはならず者です  \n(2) ジェイコブはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ヘンリーとエイデン。ヘンリーは、エイデンがならず者であるのは、ヘンリーが騎士である場合に限ると表現しました。「ヘンリーは騎士ではない」とエイデンは宣言しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ヘンリーは騎士です  \n(2) エイデンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：オーウェンとルーク。「オーウェンは騎士か、ルークはならず者です」 - オーウェン。ルークは「もしルークが騎士なら、オーウェンは騎士です」と述べました。それでは、誰が騎士で誰がならず者ですか？",
        "solution_text_format": "(1) オーウェンは騎士です  \n(2) ルークは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ルーカスとデイビッド。ルーカスは「デイビッドはならず者か、デイビッドは騎士だ」と言いました。デイビッドはルーカスがならず者ではないと表現しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスは騎士です  \n(2) デイビッドは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：オーウェンとセバスチャン。オーウェンは「セバスチャンは騎士か、セバスチャンはならず者だ」とコメントしました。セバスチャンは「オーウェンはならず者か、オーウェンは騎士だ」と表現しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンは騎士です  \n(2) セバスチャンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ゾーイとヘンリー。ゾーイは「ゾーイは騎士であるのは、ヘンリーがならず者である場合に限る」と述べました。ヘンリーは「ヘンリーは騎士であるのは、ゾーイが騎士である場合に限る」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ゾーイは騎士です  \n(2) ヘンリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エミリーとベンジャミン。エミリーは「ベンジャミンは騎士ではない」と述べました。ベンジャミンは「エミリーは騎士である場合に限り、エミリーはならず者である」と指摘しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーは騎士です  \n(2) ベンジャミンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：リリーとローガン。リリーは、ローガンが騎士であるか、リリーが騎士であると言いました。「リリーはならず者であるのは、ローガンが騎士である場合に限る」とローガンは主張しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーはならず者です。  \n(2) ローガンはならず者です。"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エイブリーとイーサン。エイブリーは「もしイーサンがならず者なら、イーサンは騎士だ」と主張しました。イーサンは「エイブリーはならず者か、イーサンは騎士だ」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーは騎士です  \n(2) イーサンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：アメリアとイザベラ。アメリアは、「アメリアは騎士であるのはイザベラが騎士である場合に限る」と言いました。イザベラは「アメリアは騎士であり、イザベラも騎士である」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアは騎士です  \n(2) イザベラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ベンジャミンとビクトリア。「ビクトリアはならず者ではない」とベンジャミンが言いました。ビクトリアは、「もしビクトリアが騎士なら、ベンジャミンは騎士です」と表現しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンは騎士です  \n(2) ビクトリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ペネロペとアメリア。ペネロペはこう言いました。「もし私が騎士なら、アメリアも騎士です。」アメリアはこう述べました。「もしペネロペがならず者なら、私は騎士です。」さて、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) ペネロペは騎士です  \n(2) アメリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：シャーロットとソフィア。シャーロットは「ソフィアはならず者であるのは、シャーロットが騎士である場合に限る」とコメントしました。ソフィアによれば、「シャーロットはならず者であるのは、ソフィアが騎士である場合に限る」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットはならず者です  \n(2) ソフィアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ルーカスとジェームズ。ルーカスは「ルーカスは騎士であるのは、ジェームズが騎士である場合に限る」と主張しました。「もしジェームズが騎士であれば、ルーカスは騎士です」とジェームズは宣言しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスは騎士です  \n(2) ジェームズは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エイブリーとリアム。エイブリーは「リアムは騎士ではない」とコメントしました。リアムは「リアムは騎士であるか、エイブリーは騎士である」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーはならず者です  \n(2) リアムは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ルークとサミュエル。ルークは、サミュエルがならず者であるのはルークが騎士である場合に限ると表現しました。サミュエルは、サミュエルが騎士であるのはルークが騎士である場合に限るとあなたに言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) サミュエルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ソフィアとジェームズ。「ジェームズは騎士であるのは、ソフィアが騎士である場合に限る」とソフィアは主張しました。ジェームズは「ソフィアは騎士ではない」と主張しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアはならず者です  \n(2) ジェームズは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：グレースとエリザベス。グレースは「エリザベスはならず者ではない」と述べました。「グレースはならず者であり、グレースは騎士である」とエリザベスは主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) グレースはならず者です  \n(2) エリザベスはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：スカーレットとアビゲイル。スカーレットは「アビゲイルは騎士です」と言いました。アビゲイルによれば、「スカーレットはならず者であるか、スカーレットは騎士です」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) スカーレットは騎士です。  \n(2) アビゲイルは騎士です。"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エラとイヴリン。「イヴリンはならず者か、イヴリンは騎士です」 - エラ。イヴリンは主張しました：「エラは騎士ではありません」。では、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) エラは騎士です  \n(2) イヴリンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：オーウェンとアリア。オーウェンは、アリアが騎士である場合に限り、アリアはならず者であると表現しました。アリアは「オーウェンは騎士であるか、オーウェンはならず者である」と述べました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンはならず者です  \n(2) アリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：オリビアとイザベラ。オリビアは「イザベラはならず者か、イザベラは騎士です」と言いました。イザベラは「オリビアは騎士か、イザベラは騎士です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアは騎士です  \n(2) イザベラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：アリアとエリザベス。アリアは「エリザベスはならず者ではない」と言いました。エリザベスは「アリアはならず者である場合に限り、エリザベスは騎士である」とコメントしました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アリアはならず者です  \n(2) エリザベスはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：イーサンとオリビア。イーサンは、オリビアが騎士である場合に限り、オリビアはならず者であると言いました。「イーサンはならず者であるか、オリビアは騎士である」とオリビアは主張しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンはならず者です  \n(2) オリビアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：イザベラとゾーイ。「もしゾーイがならず者なら、ゾーイは騎士だ」とイザベラは主張しました。ゾーイは「イザベラはならず者で、ゾーイは騎士だ」と指摘しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イザベラはならず者です  \n(2) ゾーイはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ソフィアとスカーレット。ソフィアは、スカーレットが騎士であるか、スカーレットがならず者であると表現しました。「もしソフィアがならず者なら、ソフィアは騎士です」とスカーレットは言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) スカーレットは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：デイビッドとミア。デイビッドが言ったように、「ミアはならず者か、デイビッドは騎士です」。ミアはあなたに、デイビッドは騎士であり、デイビッドはならず者だと言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドは騎士です  \n(2) ミアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ビクトリアとジャクソン。ビクトリアは、ジャクソンが騎士であるのは、ジャクソンがならず者である場合に限ると表現しました。ジャクソンは、ビクトリアが騎士であるか、ビクトリアがならず者であると表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ビクトリアはならず者です  \n(2) ジャクソンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ゾーイとエラ。ゾーイは自分が騎士であり、エラも騎士であると主張しました。エラによれば、「もしゾーイが騎士なら、ゾーイはならず者です」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ゾーイはならず者です  \n(2) エラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エイヴァとハーパー。エイヴァは「ハーパーは騎士であるのは、エイヴァが騎士である場合に限る」と述べました。ハーパーによれば、「エイヴァは騎士であるのは、ハーパーが騎士である場合に限る」とのことです。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァは騎士です  \n(2) ハーパーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エラとアリア。エラは「アリアは騎士である場合に限り、アリアはならず者である」と言いました。アリアは「エラは騎士であり、エラはならず者である」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラはならず者です  \n(2) アリアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ウィリアムとヘンリー。ウィリアムはこう言いました。「ウィリアムは騎士であるのは、ヘンリーがならず者である場合に限る」。ヘンリーはこう言っているのが聞かれました。「もしウィリアムがならず者であれば、ウィリアムは騎士である」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムはならず者です  \n(2) ヘンリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ウィリアムとエイヴァ。ウィリアムが言ったように、「エイヴァはならず者か、エイヴァは騎士です」。 「もしウィリアムが騎士なら、ウィリアムはならず者です」とエイヴァが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムは騎士です  \n(2) エイヴァはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：オリバーとジェイコブ。オリバーは「オリバーは騎士で、ジェイコブはならず者だ」とコメントしました。ジェイコブは「オリバーが騎士であるのは、ジェイコブが騎士である場合に限る」と述べました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリバーは騎士です  \n(2) ジェイコブはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：メイソンとウィリアム。メイソンはウィリアムがならず者であると言いました。ウィリアムの発言はこうです：「メイソンは騎士で、ウィリアムは騎士です」。では、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) メイソンは騎士です  \n(2) ウィリアムはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：アリアとオーロラ。「オーロラは騎士です」とアリアが言いました。「アリアはならず者であり、アリアは騎士です」とオーロラが宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アリアはならず者です  \n(2) オーロラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：オリバーとイヴリン。オリバーは「もしオリバーが騎士なら、イヴリンは騎士です」と述べました。「オリバーは騎士で、イヴリンは騎士です」とイヴリン。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリバーは騎士です  \n(2) イヴリンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ソフィアとイヴリン。「イヴリンは騎士か、イヴリンはならず者です」 - ソフィア。イヴリンの発言では、「イヴリンは騎士で、ソフィアはならず者です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) イヴリンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ジャクソンとエマ。ジャクソンの発言：「ジャクソンは騎士であるのは、エマが騎士である場合に限る」。エマの発言：「エマは騎士であるのは、ジャクソンが騎士である場合に限る」。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンは騎士です  \n(2) エマは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エミリーとメイソン。エミリーは、メイソンが騎士であり、エミリーも騎士であると表現しました。メイソンはこう主張しました：「もしエミリーが騎士なら、エミリーはならず者です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーはならず者です  \n(2) メイソンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ローガンとシャーロット。ローガンが言ったように、「シャーロットは騎士である場合に限り、シャーロットはならず者です」。シャーロットは、「もしローガンが騎士なら、ローガンはならず者です」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンはならず者です  \n(2) シャーロットは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ハーパーとヘンリー。「もしヘンリーがならず者なら、ハーパーは騎士です」とハーパーが言いました。ヘンリーは「ヘンリーは騎士であるのは、ハーパーがならず者である場合に限ります」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーはならず者です  \n(2) ヘンリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エマとイヴリン。エマは「イヴリンは騎士であるのは、エマが騎士である場合に限る」と述べました。イヴリンは「もしエマがならず者であれば、エマは騎士である」とコメントしました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エマは騎士です  \n(2) イヴリンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：クロエとイーサン。クロエは「イーサンは騎士か、イーサンはならず者だ」と言いました。イーサンの言葉では、「クロエはならず者で、イーサンは騎士だ」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) クロエは騎士です  \n(2) イーサンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エリザベスとマイケル。エリザベスは、マイケルがならず者であり、マイケルが騎士であると言いました。マイケルは「エリザベスはならず者ではない」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスはならず者です  \n(2) マイケルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：クロエとグレース。クロエは「クロエは騎士で、グレースはならず者です」と言っているのが聞かれました。「クロエはならず者か、クロエは騎士です」とグレースが言いました。では、誰が騎士で誰がならず者ですか？",
        "solution_text_format": "(1) クロエはならず者です  \n(2) グレースは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ローガンとエミリー。ローガンは「ローガンは騎士であるか、エミリーはならず者である」と表現しました。エミリーは「ローガンが騎士である場合に限り、ローガンはならず者である」と述べました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンは騎士です  \n(2) エミリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エラとローガン。エラはこう主張しました：「エラは騎士であるのは、ローガンが騎士である場合に限る」。ローガンの言葉では：「ローガンは騎士であり、エラはならず者である」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラはならず者です  \n(2) ローガンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ソフィアとエラ。ソフィアの言葉では、「エラはならず者である場合に限り、エラは騎士である」と言っています。エラは、もしソフィアがならず者であれば、ソフィアは騎士であると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアはならず者です  \n(2) エラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ノアとエイヴァ。ノアは「エイヴァは騎士ではない」とコメントしました。エイヴァは「ノアは騎士か、ノアはならず者だ」と言いました。それでは、誰が騎士で誰がならず者でしょうか？",
        "solution_text_format": "(1) ノアはならず者です  \n(2) エイヴァは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：メイソンとエマ。メイソンは「メイソンは騎士か、エマはならず者だ」と言っているのが聞かれました。エマは「もしメイソンがならず者なら、メイソンは騎士だ」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) メイソンは騎士です  \n(2) エマは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ライリーとイーサン。ライリーは「イーサンはならず者である場合に限り、ライリーは騎士である」と述べました。「ライリーは騎士である場合に限り、イーサンは騎士である」とイーサンは言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ライリーは騎士です  \n(2) イーサンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ジェームズとスカーレット。ジェームズは「スカーレットはならず者か、ジェームズは騎士だ」と言いました。スカーレットによれば、「もしジェームズがならず者なら、ジェームズは騎士だ」とのことです。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズは騎士です  \n(2) スカーレットは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：オリバーとエマ。オリバーはこう言いました。「オリバーは騎士であるか、エマはならず者である。」エマは宣言しました。「オリバーは騎士であるのは、オリバーがならず者である場合に限る。」では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリバーは騎士です  \n(2) エマはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：エマとライリー。エマは「もし私が騎士なら、ライリーは騎士です」と言いました。ライリーは「もしエマがならず者なら、エマは騎士です」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エマは騎士です  \n(2) ライリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：リアムとサミュエル。リアムは「もしサミュエルがならず者なら、サミュエルは騎士だ」と言いました。「リアムは騎士である場合に限り、リアムはならず者だ」とサミュエルは言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムはならず者です  \n(2) サミュエルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは2人の住人に出会います：ジェイコブとオリビア。ジェイコブは「ジェイコブは騎士か、オリビアは騎士です」と言いました。オリビアによれば、「もしオリビアが騎士なら、ジェイコブは騎士です」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブは騎士です  \n(2) オリビアは騎士です"
    }
]