[
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：迈克尔、佐伊和伊森。迈克尔被听到说：“伊森是骑士当且仅当迈克尔是骑士。”佐伊提到：“佐伊是骑士或者伊森是骑士。”伊森断言：“迈克尔是无赖当且仅当佐伊是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是一名骑士  \n(2) 佐伊是一名骑士  \n(3) 伊森是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：迈克尔、梅森和雅各布。迈克尔评论道：“梅森不是骑士。”梅森评论道：“迈克尔是骑士，雅各布是无赖。”雅各布声明：“如果迈克尔是骑士，那么雅各布就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是一名骑士  \n(2) 梅森是一个无赖  \n(3) 雅各布是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：卢卡斯、哈珀和阿梅莉亚。卢卡斯表示哈珀不是无赖。在哈珀的陈述中：“哈珀是骑士当且仅当阿梅莉亚是无赖。”阿梅莉亚说：“哈珀不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是一名骑士  \n(2) 哈珀是一名骑士  \n(3) 阿梅莉亚是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：欧文、约瑟夫和索菲娅。欧文说：“约瑟夫是骑士或者索菲娅是骑士。”约瑟夫宣称：“当且仅当索菲娅是骑士时，欧文就是无赖。”索菲娅声称：“如果约瑟夫是无赖，那么约瑟夫就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是无赖  \n(2) 约瑟夫是无赖  \n(3) 索菲娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：阿比盖尔、斯嘉丽和伊芙琳。在阿比盖尔的话中：“阿比盖尔是骑士当且仅当伊芙琳是骑士。”斯嘉丽说道：“阿比盖尔是骑士。”根据伊芙琳的说法：“斯嘉丽不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是无赖  \n(2) 斯嘉丽是无赖  \n(3) 伊芙琳是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：佩内洛普、马修和维多利亚。佩内洛普声称：“佩内洛普是骑士，马修是骑士。”马修被听到说：“维多利亚是无赖，维多利亚是骑士。”维多利亚说，如果马修是骑士，那么马修就是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是无赖  \n(2) 马修是无赖  \n(3) 维多利亚是骑士"
    },
    {
        "quiz": "一个非常特别的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：艾米莉、利亚姆和伊丽莎白。根据艾米莉的说法，“伊丽莎白是骑士或者伊丽莎白是无赖”。利亚姆告诉你，如果伊丽莎白是无赖，那么艾米莉就是骑士。伊丽莎白说：“利亚姆是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是骑士  \n(2) 利亚姆是骑士  \n(3) 伊丽莎白是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：迈克尔、艾娃和亨利。迈克尔说：“艾娃是无赖或者艾娃是骑士。”艾娃提到：“迈克尔不是无赖。”在亨利的话中：“迈克尔是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是一名骑士  \n(2) 艾娃是一名骑士  \n(3) 亨利是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：奥利弗、亚历山大和梅森。奥利弗说：“亚历山大是无赖或者亚历山大是骑士。”亚历山大提到：“梅森不是无赖。”梅森则指出：“梅森是骑士或者奥利弗是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利弗是一名骑士  \n(2) 亚历山大是一名骑士  \n(3) 梅森是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：莉莉、塞缪尔和索菲娅。莉莉的陈述是：“索菲娅是骑士或者塞缪尔是骑士。”塞缪尔说：“索菲娅是骑士或者莉莉是无赖。”索菲娅则说：“如果塞缪尔是无赖，那么塞缪尔就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是骑士  \n(2) 塞缪尔是骑士  \n(3) 索菲娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：夏洛特、卢克和利亚姆。夏洛特表示，卢克是无赖当且仅当利亚姆是无赖。卢克说：“夏洛特不是骑士。”利亚姆宣称：“夏洛特是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是一名骑士  \n(2) 卢克是一个无赖  \n(3) 利亚姆是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：塞巴斯蒂安、马修和洛根。塞巴斯蒂安被听到说：“洛根是无赖或者塞巴斯蒂安是骑士。”马修说：“如果洛根是骑士，那么塞巴斯蒂安就是无赖。”洛根说：“马修不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞巴斯蒂安是无赖  \n(2) 马修是骑士  \n(3) 洛根是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：莉莉、哈珀和卢克。莉莉被听到说：“哈珀是无赖或者卢克是骑士。”根据哈珀的说法：“如果莉莉是无赖，那么卢克就是无赖。”卢克说：“莉莉是骑士，莉莉是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是无赖  \n(2) 哈珀是骑士  \n(3) 卢克是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：詹姆斯、阿比盖尔和艾娃。詹姆斯说：“阿比盖尔是骑士。”阿比盖尔声称：“当且仅当詹姆斯是骑士时，阿比盖尔才是骑士。”艾娃表示阿比盖尔不是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是一名骑士  \n(2) 阿比盖尔是一名骑士  \n(3) 艾娃是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：维多利亚、威廉和阿丽亚。维多利亚说：“阿丽亚是无赖或者阿丽亚是骑士。”威廉表示维多利亚是无赖或者阿丽亚是无赖。“威廉是骑士或者威廉是无赖，”阿丽亚宣称。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 维多利亚是一名骑士  \n(2) 威廉是一个无赖  \n(3) 阿丽亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：塞巴斯蒂安、夏洛特和赖利。塞巴斯蒂安说：“赖利是无赖或者塞巴斯蒂安是骑士。”夏洛特说：“如果塞巴斯蒂安是骑士，那么夏洛特就是骑士。”赖利说：“当且仅当赖利是骑士时，塞巴斯蒂安是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞巴斯蒂安是无赖  \n(2) 夏洛特是骑士  \n(3) 赖利是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：欧文、雅各布和阿梅莉亚。欧文说雅各布不是骑士。雅各布说：“如果阿梅莉亚是无赖，那么欧文就是骑士。”阿梅莉亚评论道：“如果欧文是骑士，那么欧文就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是无赖  \n(2) 雅各布是骑士  \n(3) 阿梅莉亚是骑士"
    },
    {
        "quiz": "一个非常特别的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：亚历山大、卢卡斯和丹尼尔。“卢卡斯不是无赖”——亚历山大。卢卡斯告诉你丹尼尔不是无赖。“卢卡斯是骑士当且仅当丹尼尔是骑士”——丹尼尔。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亚历山大是一名骑士  \n(2) 卢卡斯是一名骑士  \n(3) 丹尼尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：塞巴斯蒂安、阿丽亚和本杰明。塞巴斯蒂安声称：“阿丽亚是无赖或者塞巴斯蒂安是骑士。”阿丽亚说：“塞巴斯蒂安不是无赖。”本杰明宣称：“塞巴斯蒂安是骑士或者本杰明是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞巴斯蒂安是一名骑士  \n(2) 阿丽亚是一名骑士  \n(3) 本杰明是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：丹尼尔、伊森和赖利。丹尼尔告诉你，伊森是无赖或者赖利是无赖。伊森告诉你，丹尼尔是骑士。“丹尼尔是骑士当且仅当丹尼尔是无赖”——赖利。那谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是一名骑士  \n(2) 伊森是一名骑士  \n(3) 赖利是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：伊丽莎白、佐伊和梅森。伊丽莎白说：“梅森是骑士或者佐伊是骑士。”佐伊指出：“梅森是无赖当且仅当梅森是骑士。”梅森宣称：“伊丽莎白是无赖或者伊丽莎白是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是一名骑士  \n(2) 佐伊是一名无赖  \n(3) 梅森是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：哈珀、艾米莉和阿比盖尔。哈珀评论道：“阿比盖尔是骑士，艾米莉是无赖。”艾米莉说：“阿比盖尔是骑士。”阿比盖尔被听到说：“哈珀是无赖或者阿比盖尔是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是无赖  \n(2) 艾米莉是骑士  \n(3) 阿比盖尔是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：洛根、卢卡斯和索菲娅。洛根说：“索菲娅是骑士。”卢卡斯说，如果索菲娅是无赖，那么洛根就是骑士。索菲娅声明：“洛根是无赖当且仅当卢卡斯是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是无赖  \n(2) 卢卡斯是无赖  \n(3) 索菲娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：夏洛特、米娅和伊芙琳。夏洛特说：“伊芙琳是骑士或者米娅是无赖。”根据米娅的说法，“夏洛特是骑士。”伊芙琳说：“夏洛特是无赖当且仅当米娅是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是一名骑士  \n(2) 米娅是一名骑士  \n(3) 伊芙琳是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：格蕾丝、佩内洛普和夏洛特。格蕾丝声称：“如果佩内洛普是骑士，那么佩内洛普就是无赖。”佩内洛普说：“格蕾丝是无赖或者格蕾丝是骑士。”夏洛特断言：“佩内洛普是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是无赖  \n(2) 佩内洛普是骑士  \n(3) 夏洛特是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三位居民：伊丽莎白、斯嘉丽和夏洛特。伊丽莎白说：“夏洛特是骑士。”斯嘉丽说：“夏洛特是无赖。”夏洛特评论道：“伊丽莎白是骑士或者斯嘉丽是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是一名骑士  \n(2) 斯嘉丽是一个无赖  \n(3) 夏洛特是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：奥利维亚、哈珀和伊森。奥利维亚说：“奥利维亚是骑士或者哈珀是无赖。”哈珀声明：“如果且仅如果奥利维亚是骑士，那么伊森就是无赖。”伊森的陈述是：“哈珀是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是无赖  \n(2) 哈珀是骑士  \n(3) 伊森是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：伊芙琳、约瑟夫和艾米莉。“约瑟夫是骑士当且仅当艾米莉是无赖”——伊芙琳说。约瑟夫告诉你艾米莉是骑士。根据艾米莉的说法，“约瑟夫是骑士或者伊芙琳是无赖”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是无赖  \n(2) 约瑟夫是骑士  \n(3) 艾米莉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：斯嘉丽、艾娃和本杰明。斯嘉丽被听到说：“本杰明是骑士。”艾娃表示斯嘉丽是无赖，而斯嘉丽是骑士。在本杰明的话中：“本杰明是骑士当且仅当斯嘉丽是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 斯嘉丽是无赖  \n(2) 艾娃是无赖  \n(3) 本杰明是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：丹尼尔、伊莎贝拉和维多利亚。“丹尼尔是骑士当且仅当伊莎贝拉是骑士，”丹尼尔宣称。“丹尼尔是骑士”——伊莎贝拉。维多利亚告诉你，伊莎贝拉是无赖，而伊莎贝拉是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是一名骑士  \n(2) 伊莎贝拉是一名骑士  \n(3) 维多利亚是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：利亚姆、卢克和马修。利亚姆说道：“马修是无赖当且仅当卢克是无赖。”卢克说道：“如果马修是骑士，那么马修就是无赖。”马修宣称：“卢克是骑士或者卢克是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是无赖  \n(2) 卢克是无赖  \n(3) 马修是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：诺亚、阿梅莉亚和伊莎贝拉。诺亚说：“伊莎贝拉是骑士当且仅当伊莎贝拉是无赖。”阿梅莉亚说：“诺亚不是无赖。”伊莎贝拉说：“阿梅莉亚是无赖或者伊莎贝拉是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是无赖  \n(2) 阿梅莉亚是无赖  \n(3) 伊莎贝拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：赖利、米娅和马修。赖利说：“米娅是无赖或者马修是无赖。”米娅声称：“马修是骑士。”马修宣称：“马修是骑士，赖利是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是一名骑士  \n(2) 米娅是一名无赖  \n(3) 马修是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：奥萝拉、夏洛特和杰克。奥萝拉说：“杰克是骑士或者夏洛特是无赖。”根据夏洛特的说法，“奥萝拉不是骑士。”杰克评论道：“奥萝拉不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥萝拉是一名骑士  \n(2) 夏洛特是一个无赖  \n(3) 杰克是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：斯嘉丽、雅各布和艾登。斯嘉丽说：“艾登是骑士或者斯嘉丽是骑士。” “艾登是骑士或者斯嘉丽是骑士” - 雅各布。“斯嘉丽是无赖或者雅各布是骑士” - 艾登。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 斯嘉丽是一名骑士  \n(2) 雅各布是一名骑士  \n(3) 艾登是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：丹尼尔、索菲娅和利亚姆。丹尼尔说：“如果利亚姆是骑士，那么索菲娅就是骑士。”索菲娅提到：“利亚姆是无赖或者利亚姆是骑士。”利亚姆声称：“索菲娅是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是一名骑士  \n(2) 索菲娅是一名骑士  \n(3) 利亚姆是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：艾弗里、维多利亚和伊莎贝拉。艾弗里说：“伊莎贝拉不是无赖。”维多利亚宣称：“艾弗里不是无赖。”伊莎贝拉则表示：“维多利亚是骑士或者艾弗里是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是一名骑士  \n(2) 维多利亚是一名骑士  \n(3) 伊莎贝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：本杰明、奥利维亚和约瑟夫。本杰明告诉你，如果奥利维亚是骑士，那么奥利维亚就是无赖。奥利维亚宣称：“约瑟夫是骑士或者本杰明是骑士。”约瑟夫断言：“约瑟夫是骑士或者本杰明是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是无赖  \n(2) 奥利维亚是骑士  \n(3) 约瑟夫是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：大卫、梅森和哈珀。大卫提到：“如果大卫是骑士，那么梅森就是骑士。”梅森说：“大卫是骑士。”哈珀被听到说：“大卫是骑士或者哈珀是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 大卫是一名骑士  \n(2) 梅森是一名骑士  \n(3) 哈珀是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：詹姆斯、索菲娅和伊芙琳。詹姆斯说：“伊芙琳是骑士或者伊芙琳是无赖。”索菲娅指出：“索菲娅是骑士而詹姆斯是无赖。”在伊芙琳的陈述中：“索菲娅是骑士而詹姆斯是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是一名骑士  \n(2) 索菲娅是一名无赖  \n(3) 伊芙琳是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：欧文、威廉和奥萝拉。欧文说：“奥萝拉是骑士或者威廉是骑士。”威廉说：“如果欧文是骑士，那么欧文就是无赖。”奥萝拉则说：“如果威廉是骑士，那么欧文就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是一名骑士  \n(2) 威廉是一个无赖  \n(3) 奥萝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：诺亚、雅各布和索菲娅。诺亚的陈述是：“如果索菲娅是骑士，那么雅各布就是骑士。”雅各布表示，如果索菲娅是无赖，那么诺亚就是骑士。索菲娅说诺亚是骑士或者索菲娅是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是骑士  \n(2) 雅各布是骑士  \n(3) 索菲娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：夏洛特、亨利和赖利。夏洛特说：“亨利是骑士。”亨利断言：“当且仅当亨利是骑士时，夏洛特才是无赖。”赖利评论道：“如果亨利是无赖，那么夏洛特就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是无赖  \n(2) 亨利是无赖  \n(3) 赖利是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：杰克、梅森和丹尼尔。杰克说，如果且仅如果丹尼尔是骑士，那么丹尼尔就是无赖。梅森评论道：“如果且仅如果梅森是骑士，那么丹尼尔就是骑士。”丹尼尔声明：“如果且仅如果梅森是无赖，那么杰克就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克是一个无赖  \n(2) 梅森是一个骑士  \n(3) 丹尼尔是一个骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：卢卡斯、伊芙琳和杰克。卢卡斯告诉你，伊芙琳是骑士当且仅当杰克是骑士。伊芙琳说：“伊芙琳是骑士或者杰克是骑士。”杰克宣称：“如果伊芙琳是骑士，那么伊芙琳就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是无赖  \n(2) 伊芙琳是骑士  \n(3) 杰克是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：洛根、迈克尔和亚历山大。洛根说：“如果且仅如果洛根是骑士，亚历山大就是无赖。”迈克尔声明：“洛根是无赖。”亚历山大宣称：“洛根是无赖，迈克尔是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是一名骑士  \n(2) 迈克尔是一个无赖  \n(3) 亚历山大是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：卢克、佐伊和伊丽莎白。卢克说：“伊丽莎白不是无赖。”佐伊断言：“如果伊丽莎白是骑士，那么卢克就是无赖。”根据伊丽莎白的说法：“当且仅当佐伊是无赖时，伊丽莎白才是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 佐伊是一名无赖  \n(3) 伊丽莎白是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：本杰明、索菲娅和塞缪尔。本杰明评论道：“塞缪尔是骑士当且仅当塞缪尔是无赖。”索菲娅说：“塞缪尔是无赖当且仅当本杰明是无赖。”塞缪尔则说道：“索菲娅是骑士，而本杰明是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是无赖  \n(2) 索菲娅是骑士  \n(3) 塞缪尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：米娅、奥利弗和佐伊。米娅说：“如果且仅如果米娅是骑士，佐伊就是无赖。”奥利弗声称：“米娅是无赖。”佐伊说奥利弗是骑士或者佐伊是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是一名骑士  \n(2) 奥利弗是一名无赖  \n(3) 佐伊是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：迈克尔、米娅和艾登。迈克尔声称：“艾登是骑士。”米娅告诉你，只有当米娅是骑士时，迈克尔才是无赖。“米娅是无赖或者艾登是骑士。”——艾登。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是无赖  \n(2) 米娅是骑士  \n(3) 艾登是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：奥萝拉、哈珀和阿梅莉亚。奥萝拉说：“阿梅莉亚是无赖，哈珀是无赖。”哈珀指出：“如果阿梅莉亚是无赖，那么阿梅莉亚就是骑士。”阿梅莉亚评论道：“哈珀是骑士，奥萝拉是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥萝拉是一名骑士  \n(2) 哈珀是一个无赖  \n(3) 阿梅莉亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：大卫、丹尼尔和伊芙琳。大卫说：“丹尼尔是骑士，伊芙琳是骑士。”丹尼尔评论道：“伊芙琳是骑士当且仅当大卫是骑士。”伊芙琳说丹尼尔不是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）大卫是骑士  \n（2）丹尼尔是骑士  \n（3）伊芙琳是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：杰克逊、艾弗里和丹尼尔。杰克逊说：“如果丹尼尔是骑士，那么艾弗里就是骑士。”艾弗里宣称：“丹尼尔是无赖或者艾弗里是骑士。”丹尼尔告诉你：“如果丹尼尔是骑士，那么艾弗里就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是一个无赖  \n(2) 艾弗里是一个无赖  \n(3) 丹尼尔是一个骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：约瑟夫、艾玛和格蕾丝。约瑟夫告诉你艾玛是一个无赖。艾玛声称：“格蕾丝是一个无赖或者格蕾丝是一个骑士。”格蕾丝说：“如果艾玛是一个无赖，那么约瑟夫就是一个骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是一个无赖  \n(2) 艾玛是一个骑士  \n(3) 格蕾丝是一个骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：艾娃、艾拉和塞巴斯蒂安。艾娃说：“艾拉是骑士，艾拉是无赖。”艾拉则说：“艾娃是骑士，艾娃是无赖。”塞巴斯蒂安说艾娃是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是无赖  \n(2) 艾拉是无赖  \n(3) 塞巴斯蒂安是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：佐伊、詹姆斯和约瑟夫。佐伊声称：“如果佐伊是骑士，那么詹姆斯就是骑士。”詹姆斯断言：“约瑟夫是骑士。”约瑟夫被听到说：“詹姆斯是无赖或者约瑟夫是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佐伊是一名骑士  \n(2) 詹姆斯是一名骑士  \n(3) 约瑟夫是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：赖利、塞缪尔和佩内洛普。赖利说：“佩内洛普是骑士，塞缪尔是骑士。”塞缪尔说：“佩内洛普是骑士当且仅当塞缪尔是骑士。”佩内洛普说，如果佩内洛普是骑士，那么赖利就是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是一名骑士  \n(2) 塞缪尔是一名骑士  \n(3) 佩内洛普是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：塞缪尔、阿比盖尔和杰克逊。塞缪尔说：“杰克逊是骑士或者杰克逊是无赖。”阿比盖尔说：“当且仅当塞缪尔是无赖时，塞缪尔是骑士。”杰克逊则说：“塞缪尔不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是一名骑士  \n(2) 阿比盖尔是一名无赖  \n(3) 杰克逊是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：奥利弗、索菲娅和亚历山大。奥利弗评论道：“索菲娅是骑士，亚历山大是无赖。”根据索菲娅的说法，“奥利弗是骑士或者亚历山大是无赖。”亚历山大说：“奥利弗是无赖，奥利弗是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利弗是一名骑士  \n(2) 索菲娅是一名骑士  \n(3) 亚历山大是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：马修、诺亚和夏洛特。马修告诉你，如果诺亚是无赖，那么马修就是骑士。诺亚评论道：“马修是无赖当且仅当诺亚是骑士。”夏洛特评论道：“马修是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是无赖  \n(2) 诺亚是无赖  \n(3) 夏洛特是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：艾弗里、奥萝拉和诺亚。艾弗里提到：“诺亚是无赖当且仅当奥萝拉是骑士。”奥萝拉说：“奥萝拉是骑士当且仅当诺亚是骑士。”诺亚说奥萝拉是无赖，而艾弗里是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是一名骑士  \n(2) 奥萝拉是一个无赖  \n(3) 诺亚是一名骑士"
    },
    {
        "quiz": "一个非常特别的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：伊森、艾娃和佩内洛普。伊森说：“佩内洛普是骑士。”艾娃表示佩内洛普是无赖，伊森也是无赖。佩内洛普则说：“伊森是无赖当且仅当艾娃是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是一名骑士  \n(2) 艾娃是一个无赖  \n(3) 佩内洛普是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：维多利亚、亚历山大和艾玛。维多利亚被听到说：“亚历山大是骑士当且仅当艾玛是骑士。”亚历山大提到：“维多利亚是无赖，艾玛是骑士。”艾玛说：“艾玛是骑士，亚历山大是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 维多利亚是一名骑士  \n(2) 亚历山大是一个无赖  \n(3) 艾玛是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：阿丽亚、雅各布和杰克逊。阿丽亚表示雅各布是一个无赖。雅各布说杰克逊是一个骑士或者杰克逊是一个无赖。在杰克逊的陈述中：“阿丽亚是一个无赖当且仅当雅各布是一个骑士”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿丽亚是无赖  \n(2) 雅各布是骑士  \n(3) 杰克逊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：诺亚、亨利和夏洛特。诺亚说：“夏洛特是无赖，亨利是无赖。”亨利提到：“亨利是骑士当且仅当诺亚是无赖。”夏洛特评论道：“亨利是骑士，亨利是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是无赖  \n(2) 亨利是骑士  \n(3) 夏洛特是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：奥利维亚、洛根和艾登。奥利维亚说：“如果奥利维亚是骑士，那么洛根就是骑士。”根据洛根的说法，“当且仅当艾登是骑士时，奥利维亚才是无赖。”艾登则说：“如果洛根是骑士，那么奥利维亚就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是一名骑士  \n(2) 洛根是一名骑士  \n(3) 艾登是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：亨利、艾娃和威廉。亨利说威廉是骑士，而威廉是无赖。艾娃评论道：“威廉是无赖当且仅当威廉是骑士。”威廉声称：“亨利是骑士，艾娃是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是无赖  \n(2) 艾娃是无赖  \n(3) 威廉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：欧文、维多利亚和赖利。欧文说：“赖利是骑士，维多利亚是骑士。”维多利亚声称：“欧文是无赖，赖利是骑士。”赖利评论道：“赖利是骑士，维多利亚是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是无赖  \n(2) 维多利亚是无赖  \n(3) 赖利是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：威廉、米娅和艾米莉。威廉评论道：“如果艾米莉是无赖，那么艾米莉就是骑士。”米娅则说：“威廉是无赖。”根据艾米莉的说法：“米娅是骑士当且仅当威廉是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是无赖  \n(2) 米娅是骑士  \n(3) 艾米莉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：亚历山大、索菲娅和莉莉。亚历山大说：“莉莉是无赖当且仅当索菲娅是无赖。”索菲娅说：“亚历山大是无赖或者莉莉是骑士。”莉莉宣称：“亚历山大是骑士或者索菲娅是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亚历山大是一名骑士  \n(2) 索菲娅是一名骑士  \n(3) 莉莉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：维多利亚、威廉和米娅。维多利亚告诉你米娅是骑士，威廉也是骑士。威廉说：“维多利亚是无赖当且仅当维多利亚是骑士。”米娅说：“威廉是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 维多利亚是无赖  \n(2) 威廉是无赖  \n(3) 米娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：亨利、洛根和利亚姆。亨利声称：“如果洛根是无赖，那么利亚姆就是无赖。”洛根说亨利是骑士或者亨利是无赖。根据利亚姆的说法：“如果洛根是骑士，那么亨利就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是一名骑士  \n(2) 洛根是一名骑士  \n(3) 利亚姆是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：阿丽亚、艾娃和奥利维亚。阿丽亚说：“如果艾娃是骑士，那么奥利维亚就是无赖。”艾娃说：“奥利维亚是无赖。”奥利维亚说：“如果且仅如果奥利维亚是骑士，那么艾娃就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿丽亚是一名骑士  \n(2) 艾娃是一个无赖  \n(3) 奥利维亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：艾弗里、斯嘉丽和奥利弗。艾弗里的陈述是：“如果艾弗里是骑士，那么奥利弗就是无赖。”斯嘉丽指出：“艾弗里不是骑士。”奥利弗则说：“艾弗里是无赖，艾弗里是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是一名骑士  \n(2) 斯嘉丽是一个无赖  \n(3) 奥利弗是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：艾娃、伊芙琳和阿梅莉亚。艾娃宣称：“如果艾娃是骑士，那么伊芙琳就是无赖。”伊芙琳说道：“艾娃不是骑士。”阿梅莉亚说艾娃是无赖，伊芙琳也是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是一名骑士  \n(2) 伊芙琳是一个无赖  \n(3) 阿梅莉亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：艾弗里、卢克和亨利。艾弗里说：“当且仅当亨利是骑士时，艾弗里才是骑士。”卢克告诉你亨利是无赖。“如果卢克是无赖，那么艾弗里就是无赖，”亨利宣称。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是无赖  \n(2) 卢克是无赖  \n(3) 亨利是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：梅森、亨利和哈珀。梅森评论道：“哈珀是骑士当且仅当梅森是骑士。”根据亨利的说法，“如果哈珀是骑士，那么梅森就是无赖。”哈珀被听到说：“梅森是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是一个无赖  \n(2) 亨利是一个骑士  \n(3) 哈珀是一个骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：艾玛、斯嘉丽和维多利亚。艾玛声称：“维多利亚不是骑士。”斯嘉丽告诉你，艾玛是无赖，而斯嘉丽是骑士。在维多利亚的陈述中：“斯嘉丽不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是无赖  \n(2) 斯嘉丽是无赖  \n(3) 维多利亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：塞缪尔、夏洛特和詹姆斯。塞缪尔说，夏洛特是骑士当且仅当夏洛特是无赖。“塞缪尔不是无赖，”夏洛特声称。正如詹姆斯所说，“夏洛特不是骑士”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是无赖  \n(2) 夏洛特是无赖  \n(3) 詹姆斯是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：佐伊、哈珀和克洛伊。佐伊说：“哈珀是骑士，克洛伊是无赖。”哈珀说：“克洛伊不是骑士。”克洛伊宣称：“只有当哈珀是骑士时，佐伊才是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佐伊是无赖  \n(2) 哈珀是无赖  \n(3) 克洛伊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：塞缪尔、阿梅莉亚和伊丽莎白。塞缪尔评论道：“阿梅莉亚不是骑士。”阿梅莉亚评论道：“伊丽莎白不是无赖。”伊丽莎白声称：“阿梅莉亚是骑士当且仅当塞缪尔是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是一个无赖  \n(2) 阿梅莉亚是一个骑士  \n(3) 伊丽莎白是一个骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：本杰明、丹尼尔和哈珀。根据本杰明的说法，“哈珀是无赖，丹尼尔是无赖”。丹尼尔指出，“本杰明是无赖或者哈珀是无赖”。正如哈珀所说，“丹尼尔不是骑士”。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是无赖  \n(2) 丹尼尔是骑士  \n(3) 哈珀是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：伊森、艾弗里和利亚姆。伊森宣称：“利亚姆是无赖当且仅当利亚姆是骑士。”艾弗里说：“利亚姆是无赖或者伊森是无赖。”利亚姆说伊森是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是无赖  \n(2) 艾弗里是骑士  \n(3) 利亚姆是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三位居民：索菲娅、米娅和艾米莉。索菲娅说：“米娅是无赖或者米娅是骑士。”米娅说：“米娅是骑士或者索菲娅是骑士。”艾米莉说：“索菲娅是无赖或者索菲娅是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 米娅是一名骑士  \n(3) 艾米莉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：雅各布、伊丽莎白和杰克逊。雅各布说，雅各布是骑士当且仅当杰克逊是骑士。“如果杰克逊是无赖，那么杰克逊就是骑士，”伊丽莎白声称。“伊丽莎白是骑士当且仅当雅各布是无赖，”杰克逊声称。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 雅各布是无赖  \n(2) 伊丽莎白是骑士  \n(3) 杰克逊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：佩内洛普、斯嘉丽和马修。佩内洛普指出：“斯嘉丽是无赖当且仅当马修是无赖。”斯嘉丽评论道：“马修是骑士或者佩内洛普是骑士。”马修表示斯嘉丽不是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是一名骑士  \n(2) 斯嘉丽是一名骑士  \n(3) 马修是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：哈珀、艾娃和卢卡斯。哈珀被听到说：“艾娃是无赖当且仅当卢卡斯是骑士。”艾娃说卢卡斯是无赖，哈珀是无赖。在卢卡斯的陈述中：“艾娃是无赖或者哈珀是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是骑士  \n(2) 艾娃是无赖  \n(3) 卢卡斯是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：佐伊、梅森和赖利。佐伊说：“梅森是无赖当且仅当赖利是无赖。”梅森则说：“梅森是骑士，赖利是骑士。”赖利被听到说：“佐伊是无赖或者梅森是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佐伊是无赖  \n(2) 梅森是无赖  \n(3) 赖利是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：阿梅莉亚、卢克和阿比盖尔。阿梅莉亚说：“阿比盖尔是无赖或者卢克是无赖。”卢克声称：“阿梅莉亚是无赖或者卢克是骑士。”阿比盖尔说：“如果阿比盖尔是骑士，那么卢克就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是一名骑士  \n(2) 卢克是一个无赖  \n(3) 阿比盖尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：阿梅莉亚、洛根和雅各布。阿梅莉亚宣称：“如果洛根是无赖，那么雅各布就是骑士。”洛根告诉你：“如果阿梅莉亚是无赖，那么雅各布就是无赖。”雅各布评论道：“阿梅莉亚是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是一名骑士  \n(2) 洛根是一名骑士  \n(3) 雅各布是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：威廉、马修和斯嘉丽。威廉声称：“马修是无赖当且仅当斯嘉丽是无赖。”马修声称：“斯嘉丽是无赖，威廉是骑士。”斯嘉丽告诉你，斯嘉丽是骑士当且仅当马修是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是无赖  \n(2) 马修是无赖  \n(3) 斯嘉丽是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：哈珀、梅森和赖利。哈珀被听到说：“梅森是骑士或者梅森是无赖。”根据梅森的说法，“赖利是骑士而哈珀是无赖。”赖利宣称：“如果赖利是骑士，那么哈珀就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是一名骑士  \n(2) 梅森是一个无赖  \n(3) 赖利是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：艾米莉、卢克和杰克。根据艾米莉的说法，“卢克是骑士或者卢克是无赖”。根据卢克的说法，“艾米莉是骑士并且艾米莉是无赖”。正如杰克所说，“卢克不是无赖”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是骑士  \n(2) 卢克是无赖  \n(3) 杰克是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：詹姆斯、欧文和洛根。詹姆斯说：“欧文是骑士当且仅当洛根是无赖。”欧文则说：“詹姆斯是无赖当且仅当欧文是骑士。”洛根说：“欧文是骑士或者欧文是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）詹姆斯是无赖  \n（2）欧文是骑士  \n（3）洛根是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：佩内洛普、艾弗里和约瑟夫。佩内洛普告诉你，约瑟夫是骑士。“艾弗里是骑士或者约瑟夫是无赖，”艾弗里宣称。“如果约瑟夫是骑士，那么艾弗里就是无赖，”约瑟夫宣称。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是一名骑士  \n(2) 艾弗里是一个无赖  \n(3) 约瑟夫是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：夏洛特、斯嘉丽和克洛伊。夏洛特说，斯嘉丽是骑士当且仅当斯嘉丽是无赖。斯嘉丽被听到说：“夏洛特是骑士当且仅当克洛伊是骑士。”根据克洛伊的说法，“克洛伊是骑士或者斯嘉丽是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是无赖  \n(2) 斯嘉丽是无赖  \n(3) 克洛伊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：艾玛、亨利和伊莎贝拉。“亨利是骑士，”艾玛说。亨利说道：“艾玛是无赖或者艾玛是骑士。”伊莎贝拉宣称：“亨利是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是骑士  \n(2) 亨利是骑士  \n(3) 伊莎贝拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：诺亚、赖利和奥萝拉。诺亚表示赖利是无赖，而赖利是骑士。赖利表示奥萝拉是骑士，而诺亚是骑士。奥萝拉告诉你诺亚是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是无赖  \n(2) 赖利是无赖  \n(3) 奥萝拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：佩内洛普、奥萝拉和利亚姆。“利亚姆是个无赖”——佩内洛普。奥萝拉表示利亚姆不是骑士。“佩内洛普是个无赖，而佩内洛普是个骑士”——利亚姆。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是一名骑士  \n(2) 奥萝拉是一名骑士  \n(3) 利亚姆是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：佐伊、诺亚和丹尼尔。佐伊声称：“佐伊是骑士。”诺亚说：“佐伊是无赖或者丹尼尔是骑士。”丹尼尔宣称：“诺亚是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佐伊是无赖  \n(2) 诺亚是骑士  \n(3) 丹尼尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：奥利维亚、斯嘉丽和丹尼尔。奥利维亚说：“丹尼尔不是骑士。”根据斯嘉丽的说法，“如果斯嘉丽是骑士，那么奥利维亚就是无赖。”丹尼尔声明：“丹尼尔是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是无赖  \n(2) 斯嘉丽是骑士  \n(3) 丹尼尔是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：奥利弗、伊森和丹尼尔。奥利弗说：“如果奥利弗是骑士，那么丹尼尔就是骑士。”伊森声称：“伊森是骑士。”丹尼尔说：“奥利弗是无赖或者伊森是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利弗是一名骑士  \n(2) 伊森是一名骑士  \n(3) 丹尼尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：诺亚、迈克尔和利亚姆。诺亚说：“如果迈克尔是无赖，那么利亚姆就是无赖。”迈克尔评论道：“当且仅当利亚姆是骑士时，迈克尔才是骑士。”利亚姆则说：“诺亚是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是无赖  \n(2) 迈克尔是无赖  \n(3) 利亚姆是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：艾玛、伊莎贝拉和奥萝拉。根据艾玛的说法，“如果艾玛是骑士，那么伊莎贝拉就是无赖”。伊莎贝拉表示她是骑士。在奥萝拉的陈述中：“奥萝拉是骑士，而艾玛是无赖”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是骑士  \n(2) 伊莎贝拉是无赖  \n(3) 奥萝拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：艾娃、威廉和奥萝拉。艾娃说：“威廉是骑士当且仅当威廉是无赖。”威廉提到：“艾娃是无赖。”奥萝拉表示威廉是无赖或者艾娃是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是无赖  \n(2) 威廉是骑士  \n(3) 奥萝拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：艾拉、索菲娅和大卫。艾拉提到：“索菲娅是骑士。”索菲娅说：“如果大卫是无赖，那么大卫就是骑士。”大卫的话是：“艾拉是无赖或者艾拉是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是一名骑士  \n(2) 索菲娅是一名骑士  \n(3) 大卫是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：马修、斯嘉丽和伊森。马修告诉你，马修是骑士，斯嘉丽是骑士。斯嘉丽说：“马修是无赖，伊森是骑士。”伊森则说：“马修是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是无赖  \n(2) 斯嘉丽是无赖  \n(3) 伊森是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：卢卡斯、艾娃和塞巴斯蒂安。卢卡斯提到：“艾娃不是骑士。”艾娃被听到说：“艾娃是骑士当且仅当塞巴斯蒂安是无赖。”塞巴斯蒂安被听到说：“卢卡斯是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是无赖  \n(2) 艾娃是骑士  \n(3) 塞巴斯蒂安是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：雅各布、塞巴斯蒂安和卢卡斯。雅各布说塞巴斯蒂安不是无赖。“雅各布是骑士，而雅各布是无赖，”塞巴斯蒂安提到。卢卡斯说：“塞巴斯蒂安是无赖或者雅各布是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 雅各布是无赖  \n(2) 塞巴斯蒂安是无赖  \n(3) 卢卡斯是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：赖利、威廉和丹尼尔。赖利评论道：“赖利是骑士当且仅当丹尼尔是骑士。”威廉宣称：“威廉不是无赖。”丹尼尔宣称：“丹尼尔不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是一名骑士  \n(2) 威廉是一名骑士  \n(3) 丹尼尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：伊莎贝拉、维多利亚和杰克逊。伊莎贝拉说：“维多利亚不是无赖。”维多利亚说：“杰克逊是骑士当且仅当伊莎贝拉是无赖。”杰克逊断言：“杰克逊是骑士当且仅当维多利亚是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是无赖  \n(2) 维多利亚是无赖  \n(3) 杰克逊是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：伊莎贝拉、阿比盖尔和马修。伊莎贝拉宣称：“阿比盖尔是骑士，而马修是无赖。”阿比盖尔宣称：“如果且仅如果伊莎贝拉是骑士，那么伊莎贝拉就是无赖。”马修说：“如果伊莎贝拉是无赖，那么阿比盖尔就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是无赖  \n(2) 阿比盖尔是无赖  \n(3) 马修是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：格蕾丝、欧文和杰克。格蕾丝说欧文是一个无赖。欧文说：“杰克是一个骑士。”杰克则说：“欧文是无赖当且仅当格蕾丝是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是无赖  \n(2) 欧文是骑士  \n(3) 杰克是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：约瑟夫、阿梅莉亚和奥利维亚。约瑟夫说：“奥利维亚是骑士当且仅当奥利维亚是无赖。”阿梅莉亚声明：“约瑟夫是骑士。”奥利维亚被听到说：“阿梅莉亚不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是无赖  \n(2) 阿梅莉亚是无赖  \n(3) 奥利维亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：奥利维亚、亨利和阿梅莉亚。“奥利维亚是骑士”——奥利维亚说。亨利评论道：“阿梅莉亚是无赖当且仅当奥利维亚是无赖。”阿梅莉亚则说：“如果亨利是无赖，那么奥利维亚就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是骑士  \n(2) 亨利是骑士  \n(3) 阿梅莉亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：伊森、卢卡斯和威廉。伊森说：“卢卡斯是骑士，威廉是骑士。”卢卡斯的陈述是：“伊森是无赖，威廉是无赖。”威廉声称：“如果伊森是骑士，那么卢卡斯就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是无赖  \n(2) 卢卡斯是无赖  \n(3) 威廉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：利亚姆、伊莎贝拉和伊芙琳。利亚姆说：“伊莎贝拉是无赖，而利亚姆是骑士。”根据伊莎贝拉的说法，“伊芙琳不是骑士。”伊芙琳宣称：“利亚姆是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是无赖  \n(2) 伊莎贝拉是无赖  \n(3) 伊芙琳是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：欧文、亚历山大和诺亚。“亚历山大是骑士，”欧文宣称。亚历山大说，如果欧文是无赖，那么诺亚就是无赖。诺亚表示亚历山大是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是一名骑士  \n(2) 亚历山大是一名骑士  \n(3) 诺亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：威廉、夏洛特和约瑟夫。在威廉的话中：“夏洛特是骑士，夏洛特是无赖。”夏洛特声明：“约瑟夫是骑士，威廉是骑士。”约瑟夫提到：“夏洛特不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是无赖  \n(2) 夏洛特是无赖  \n(3) 约瑟夫是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：杰克逊、莉莉和塞巴斯蒂安。杰克逊评论道：“塞巴斯蒂安是骑士，而杰克逊是骑士。”莉莉声称：“杰克逊是无赖当且仅当杰克逊是骑士。”塞巴斯蒂安被听到说：“杰克逊是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是无赖  \n(2) 莉莉是无赖  \n(3) 塞巴斯蒂安是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：克洛伊、亚历山大和伊森。根据克洛伊的说法，“亚历山大是无赖，而亚历山大是骑士”。亚历山大指出，“亚历山大是骑士或者克洛伊是无赖”。伊森声称：“克洛伊是无赖，而亚历山大是骑士”。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 克洛伊是无赖  \n(2) 亚历山大是骑士  \n(3) 伊森是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：艾米莉、艾拉和奥利维亚。艾米莉说：“艾拉是骑士。”艾拉则说：“艾米莉是无赖，奥利维亚是无赖。”奥利维亚被听到说：“艾拉是无赖，奥利维亚是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是无赖  \n(2) 艾拉是无赖  \n(3) 奥利维亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：本杰明、夏洛特和欧文。本杰明说：“夏洛特是骑士或者夏洛特是无赖。”夏洛特说：“本杰明是无赖当且仅当欧文是无赖。”欧文说：“夏洛特是无赖或者欧文是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是一名骑士  \n(2) 夏洛特是一名骑士  \n(3) 欧文是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：利亚姆、本杰明和亨利。利亚姆说：“如果本杰明是骑士，那么亨利就是无赖。”本杰明被听到说：“亨利是无赖，亨利是骑士。”亨利指出：“利亚姆是骑士当且仅当本杰明是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是一名骑士  \n(2) 本杰明是一个无赖  \n(3) 亨利是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：大卫、诺亚和奥萝拉。“诺亚是无赖当且仅当奥萝拉是无赖”——大卫说。根据诺亚的说法，“大卫是无赖当且仅当诺亚是骑士”。奥萝拉指出，“如果大卫是骑士，那么奥萝拉就是骑士”。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 大卫是无赖  \n(2) 诺亚是无赖  \n(3) 奥萝拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：艾登、雅各布和本杰明。艾登声称：“雅各布是一个无赖。”雅各布告诉你，艾登是一个骑士或者雅各布是一个骑士。在本杰明的话中：“艾登是一个无赖或者本杰明是一个骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是无赖  \n(2) 雅各布是骑士  \n(3) 本杰明是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：塞缪尔、丹尼尔和欧文。塞缪尔说：“如果且仅如果欧文是骑士，那么塞缪尔就是骑士。”丹尼尔断言：“欧文是无赖。”欧文则评论道：“丹尼尔是骑士或者塞缪尔是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是无赖  \n(2) 丹尼尔是无赖  \n(3) 欧文是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：伊森、索菲娅和大卫。根据伊森的说法，“如果索菲娅是骑士，那么大卫就是骑士”。索菲娅则说：“大卫是骑士当且仅当伊森是无赖”。大卫说：“索菲娅是无赖或者索菲娅是骑士”。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是一名骑士  \n(2) 索菲娅是一个无赖  \n(3) 大卫是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：夏洛特、洛根和大卫。夏洛特说：“夏洛特是骑士，洛根是骑士。”根据洛根的说法：“夏洛特是骑士或者大卫是骑士。”大卫断言：“夏洛特是骑士当且仅当洛根是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是一名骑士  \n(2) 洛根是一名骑士  \n(3) 大卫是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：威廉、奥利弗和阿丽亚。威廉说：“如果威廉是骑士，那么阿丽亚就是骑士。”奥利弗的陈述是：“威廉是无赖或者阿丽亚是无赖。”阿丽亚告诉你，如果威廉是无赖，那么威廉就是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 奥利弗是一个无赖  \n(3) 阿丽亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：索菲娅、阿梅莉亚和哈珀。索菲娅说：“如果哈珀是无赖，那么阿梅莉亚就是无赖。”阿梅莉亚则说：“哈珀是无赖。”哈珀说，如果且仅如果索菲娅是骑士，那么阿梅莉亚就是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 阿梅莉亚是骑士  \n(3) 哈珀是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：洛根、詹姆斯和卢卡斯。洛根声称：“洛根是骑士，卢卡斯是无赖。”詹姆斯说：“洛根不是无赖。”卢卡斯指出：“洛根是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是无赖  \n(2) 詹姆斯是无赖  \n(3) 卢卡斯是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：伊莎贝拉、佐伊和阿梅莉亚。伊莎贝拉说：“如果阿梅莉亚是无赖，那么伊莎贝拉就是骑士。”佐伊告诉你，伊莎贝拉不是骑士。阿梅莉亚说：“佐伊是骑士或者佐伊是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是一名骑士  \n(2) 佐伊是一名无赖  \n(3) 阿梅莉亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：哈珀、杰克逊和格蕾丝。根据哈珀的说法，“哈珀当且仅当杰克逊是骑士时才是骑士”。杰克逊则说：“如果哈珀是骑士，那么哈珀就是无赖。”格蕾丝声称：“杰克逊是无赖，杰克逊是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是无赖  \n(2) 杰克逊是骑士  \n(3) 格蕾丝是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：格蕾丝、塞巴斯蒂安和迈克尔。格蕾丝说：“如果迈克尔是无赖，那么迈克尔就是骑士。”塞巴斯蒂安说：“格蕾丝不是无赖。”迈克尔则指出：“迈克尔是骑士当且仅当格蕾丝是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是一名骑士  \n(2) 塞巴斯蒂安是一名骑士  \n(3) 迈克尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：索菲娅、梅森和艾娃。索菲娅告诉你梅森不是骑士。梅森声称：“索菲娅是无赖，艾娃是骑士。”艾娃则声称：“索菲娅是骑士，梅森是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是骑士  \n(2) 梅森是无赖  \n(3) 艾娃是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：杰克、阿梅莉亚和奥利维亚。杰克说：“奥利维亚是无赖，而杰克是骑士。”阿梅莉亚声称：“杰克不是骑士。”奥利维亚说，如果杰克是无赖，那么阿梅莉亚就是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克是一个无赖  \n(2) 阿梅莉亚是一个骑士  \n(3) 奥利维亚是一个骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：克洛伊、奥利弗和杰克。克洛伊说奥利弗不是无赖。在奥利弗的陈述中：“克洛伊不是无赖。”杰克说：“如果杰克是骑士，那么奥利弗就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 克洛伊是一名骑士  \n(2) 奥利弗是一名骑士  \n(3) 杰克是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：艾玛、卢克和艾拉。艾玛声称：“卢克是骑士或者卢克是无赖。”根据卢克的说法，“如果艾玛是骑士，那么艾拉就是骑士。”艾拉评论道：“如果艾玛是无赖，那么卢克就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是骑士  \n(2) 卢克是骑士  \n(3) 艾拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：卢克、迈克尔和伊丽莎白。卢克提到：“伊丽莎白是骑士。”迈克尔评论道：“卢克是骑士。”伊丽莎白被听到说：“如果且仅如果卢克是无赖，迈克尔就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 迈克尔是一名骑士  \n(3) 伊丽莎白是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：艾娃、大卫和阿梅莉亚。艾娃说：“大卫是无赖或者大卫是骑士。”大卫说艾娃是骑士，阿梅莉亚是骑士。阿梅莉亚评论道：“大卫是骑士和大卫是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是一名骑士  \n(2) 大卫是一个无赖  \n(3) 阿梅莉亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：本杰明、米娅和雅各布。本杰明说：“米娅是无赖，米娅是骑士。”米娅声称：“本杰明是骑士，雅各布是无赖。”雅各布说：“本杰明不是骑士。”那么谁是骑士，谁是无赖？",
        "solution_text_format": "(1) 本杰明是无赖  \n(2) 米娅是无赖  \n(3) 雅各布是骑士"
    },
    {
        "quiz": "一个非常特别的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：艾弗里、莉莉和佩内洛普。艾弗里宣称：“莉莉不是骑士。”莉莉说佩内洛普是无赖，艾弗里也是无赖。佩内洛普表示，如果莉莉是无赖，那么艾弗里就是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是一名骑士  \n(2) 莉莉是一名无赖  \n(3) 佩内洛普是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：雅各布、梅森和艾拉。雅各布说：“梅森是骑士当且仅当雅各布是骑士。”梅森声明：“艾拉不是无赖。”根据艾拉的说法：“雅各布是骑士，艾拉是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）雅各布是一名骑士  \n（2）梅森是一名骑士  \n（3）艾拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：洛根、亨利和格蕾丝。洛根说：“如果亨利是骑士，那么格蕾丝就是无赖。”亨利的陈述是：“洛根是无赖。”格蕾丝说：“如果亨利是骑士，那么洛根就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是一名骑士  \n(2) 亨利是一个无赖  \n(3) 格蕾丝是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：米娅、莉莉和克洛伊。米娅说：“米娅是骑士当且仅当莉莉是无赖。”莉莉说：“如果克洛伊是无赖，那么米娅就是无赖。”克洛伊被听到说：“米娅不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是骑士  \n(2) 莉莉是无赖  \n(3) 克洛伊是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：卢卡斯、卢克和奥萝拉。卢卡斯声称：“卢卡斯是骑士或者奥萝拉是骑士。”卢克说：“奥萝拉是骑士，卢卡斯是骑士。”奥萝拉指出：“如果卢卡斯是无赖，那么卢克就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是一名骑士  \n(2) 卢克是一名骑士  \n(3) 奥萝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：克洛伊、塞巴斯蒂安和马修。克洛伊表示塞巴斯蒂安是无赖，而她自己是骑士。塞巴斯蒂安说：“马修是无赖当且仅当塞巴斯蒂安是骑士。”马修告诉你克洛伊是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 克洛伊是骑士  \n(2) 塞巴斯蒂安是无赖  \n(3) 马修是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：亨利、大卫和奥萝拉。亨利说：“奥萝拉是骑士，或者亨利是骑士。”大卫提到：“亨利不是骑士。”在奥萝拉的话中：“当且仅当亨利是无赖时，奥萝拉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是无赖  \n(2) 大卫是骑士  \n(3) 奥萝拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：斯嘉丽、本杰明和艾米莉。斯嘉丽说：“本杰明是骑士。”本杰明说：“如果斯嘉丽是骑士，那么艾米莉就是无赖。”艾米莉说：“如果本杰明是骑士，那么艾米莉就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 斯嘉丽是一名骑士  \n(2) 本杰明是一名骑士  \n(3) 艾米莉是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：诺亚、约瑟夫和索菲娅。诺亚表示索菲娅是骑士，而诺亚也是骑士。约瑟夫被听到说：“如果约瑟夫是骑士，那么索菲娅就是无赖。”索菲娅宣称：“当且仅当诺亚是无赖时，索菲娅才是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是一个无赖  \n(2) 约瑟夫是一个骑士  \n(3) 索菲娅是一个无赖"
    },
    {
        "quiz": "一个非常特别的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：洛根、伊森和杰克。正如洛根所说：“如果杰克是无赖，那么伊森就是无赖。”伊森声称：“杰克是无赖，而伊森是骑士。”杰克告诉你伊森是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是一名骑士  \n(2) 伊森是一个无赖  \n(3) 杰克是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：阿梅莉亚、利亚姆和伊莎贝拉。阿梅莉亚说：“伊莎贝拉不是无赖。”利亚姆声称：“伊莎贝拉是无赖或者阿梅莉亚是骑士。”伊莎贝拉说：“利亚姆不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是一名骑士  \n(2) 利亚姆是一名骑士  \n(3) 伊莎贝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：本杰明、欧文和杰克逊。本杰明告诉你，杰克逊是骑士或者杰克逊是无赖。欧文表示杰克逊不是骑士。杰克逊评论道：“本杰明是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是一名骑士  \n(2) 欧文是一个无赖  \n(3) 杰克逊是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：雅各布、阿梅莉亚和本杰明。雅各布说：“如果阿梅莉亚是无赖，那么本杰明就是无赖。”阿梅莉亚评论道：“雅各布是无赖或者雅各布是骑士。”本杰明指出：“阿梅莉亚是骑士当且仅当阿梅莉亚是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 雅各布是一名骑士  \n(2) 阿梅莉亚是一名骑士  \n(3) 本杰明是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：索菲娅、夏洛特和艾登。索菲娅说：“艾登是无赖，艾登是骑士。”夏洛特评论道：“索菲娅不是骑士。”艾登宣称：“艾登是骑士，夏洛特是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 夏洛特是骑士  \n(3) 艾登是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：米娅、卢卡斯和格蕾丝。米娅说：“米娅是骑士当且仅当卢卡斯是骑士。”卢卡斯声称：“米娅不是骑士。”格蕾丝表示卢卡斯是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是一个无赖  \n(2) 卢卡斯是一个骑士  \n(3) 格蕾丝是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：洛根、利亚姆和塞巴斯蒂安。洛根说：“如果塞巴斯蒂安是骑士，那么利亚姆就是无赖。”利亚姆提到：“当且仅当塞巴斯蒂安是无赖时，洛根才是骑士。”塞巴斯蒂安宣称：“洛根是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是一名骑士  \n(2) 利亚姆是一个无赖  \n(3) 塞巴斯蒂安是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：伊丽莎白、塞缪尔和莉莉。伊丽莎白评论道：“如果塞缪尔是无赖，那么塞缪尔就是骑士。”塞缪尔指出：“伊丽莎白是骑士或者伊丽莎白是无赖。”根据莉莉的说法，“伊丽莎白不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是一名骑士  \n(2) 塞缪尔是一名骑士  \n(3) 莉莉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：雅各布、詹姆斯和索菲娅。雅各布说：“詹姆斯是骑士。”詹姆斯的陈述是：“索菲娅是骑士。”索菲娅则说：“詹姆斯是无赖或者詹姆斯是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 雅各布是一名骑士  \n(2) 詹姆斯是一名骑士  \n(3) 索菲娅是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：艾娃、格蕾丝和丹尼尔。“艾娃是骑士当且仅当格蕾丝是骑士”——艾娃说。“艾娃不是骑士，”格蕾丝宣称。“艾娃是骑士或者艾娃是无赖”——丹尼尔说。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是无赖  \n(2) 格蕾丝是骑士  \n(3) 丹尼尔是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：阿比盖尔、塞巴斯蒂安和维多利亚。“如果阿比盖尔是骑士，那么塞巴斯蒂安就是骑士。”——阿比盖尔。“如果塞巴斯蒂安是骑士，那么维多利亚就是骑士。”——塞巴斯蒂安。维多利亚说阿比盖尔是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是一名骑士  \n(2) 塞巴斯蒂安是一名骑士  \n(3) 维多利亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：伊芙琳、亚历山大和杰克逊。伊芙琳被听到说：“杰克逊是骑士或者伊芙琳是骑士。”亚历山大提到：“伊芙琳是无赖并且伊芙琳是骑士。”在杰克逊的陈述中：“亚历山大是骑士或者伊芙琳是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是一名骑士  \n(2) 亚历山大是一个无赖  \n(3) 杰克逊是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：阿梅莉亚、马修和克洛伊。阿梅莉亚说：“马修是无赖当且仅当克洛伊是骑士。”马修则说：“克洛伊是骑士或者阿梅莉亚是无赖。”克洛伊宣称：“如果马修是骑士，那么克洛伊就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是无赖  \n(2) 马修是骑士  \n(3) 克洛伊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：丹尼尔、伊莎贝拉和奥利维亚。丹尼尔提到：“伊莎贝拉是骑士当且仅当伊莎贝拉是无赖。”伊莎贝拉说：“如果丹尼尔是骑士，那么奥利维亚就是无赖。”奥利维亚断言：“伊莎贝拉是无赖当且仅当丹尼尔是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）丹尼尔是无赖  \n（2）伊莎贝拉是骑士  \n（3）奥利维亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：丹尼尔、伊莎贝拉和马修。根据丹尼尔的说法，“伊莎贝拉是骑士当且仅当伊莎贝拉是无赖”。伊莎贝拉则说：“丹尼尔是无赖，马修是骑士”。在马修的话中：“丹尼尔不是无赖”。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是无赖  \n(2) 伊莎贝拉是无赖  \n(3) 马修是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：马修、奥利维亚和伊森。马修被听到说：“如果伊森是骑士，那么奥利维亚就是无赖。”奥利维亚声明：“伊森不是骑士。”伊森说：“马修是无赖，伊森是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是一名骑士  \n(2) 奥利维亚是一名骑士  \n(3) 伊森是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：大卫、伊莎贝拉和迈克尔。大卫说：“如果迈克尔是骑士，那么迈克尔就是无赖。”伊莎贝拉说：“迈克尔是无赖或者迈克尔是骑士。”迈克尔则说：“当且仅当大卫是无赖时，迈克尔是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 大卫是无赖  \n(2) 伊莎贝拉是骑士  \n(3) 迈克尔是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：伊森、杰克逊和斯嘉丽。伊森的陈述是：“斯嘉丽是骑士。”杰克逊说：“如果伊森是骑士，那么斯嘉丽就是无赖。”斯嘉丽告诉你杰克逊是无赖，伊森是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是无赖  \n(2) 杰克逊是骑士  \n(3) 斯嘉丽是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：丹尼尔、米娅和奥萝拉。根据丹尼尔的说法，“奥萝拉是骑士，米娅是无赖”。米娅声称：“奥萝拉是骑士或者丹尼尔是无赖”。“米娅是无赖当且仅当米娅是骑士，”奥萝拉提到。所以谁是骑士，谁是无赖？",
        "solution_text_format": "(1) 丹尼尔是无赖  \n(2) 米娅是骑士  \n(3) 奥萝拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：欧文、杰克和杰克逊。欧文被听到说：“杰克逊是骑士或者欧文是骑士。”杰克评论道：“杰克逊是骑士或者杰克逊是无赖。”杰克逊指出：“如果杰克是无赖，那么欧文就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）欧文是一名骑士  \n（2）杰克是一名骑士  \n（3）杰克逊是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：哈珀、艾拉和大卫。哈珀提到：“艾拉是无赖当且仅当哈珀是骑士。”艾拉的陈述是：“哈珀是骑士。”大卫提到：“如果大卫是骑士，那么艾拉就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是无赖  \n(2) 艾拉是无赖  \n(3) 大卫是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：艾娃、哈珀和本杰明。“哈珀是无赖或者本杰明是无赖，”艾娃说。“哈珀是骑士当且仅当本杰明是骑士，”哈珀说。“艾娃是骑士，”本杰明宣称。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是一名骑士  \n(2) 哈珀是一名无赖  \n(3) 本杰明是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：杰克逊、艾弗里和马修。杰克逊说：“马修是骑士或者杰克逊是骑士。”艾弗里告诉你杰克逊不是无赖。马修声称：“艾弗里是骑士或者杰克逊是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是一名骑士  \n(2) 艾弗里是一名骑士  \n(3) 马修是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：艾玛、哈珀和威廉。艾玛说威廉不是骑士。哈珀指出：“如果哈珀是骑士，那么威廉就是骑士。”威廉说：“哈珀是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是无赖  \n(2) 哈珀是骑士  \n(3) 威廉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：艾娃、阿梅莉亚和威廉。艾娃声称：“如果阿梅莉亚是无赖，那么威廉就是无赖。”阿梅莉亚宣称：“威廉是无赖，艾娃是无赖。”威廉说：“阿梅莉亚不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是无赖  \n(2) 阿梅莉亚是无赖  \n(3) 威廉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：雅各布、佐伊和塞巴斯蒂安。雅各布声称：“塞巴斯蒂安不是无赖。”佐伊则声称：“塞巴斯蒂安是骑士，而雅各布是无赖。”塞巴斯蒂安说：“佐伊是无赖，而佐伊是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 雅各布是无赖  \n(2) 佐伊是无赖  \n(3) 塞巴斯蒂安是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：索菲娅、威廉和梅森。索菲娅说：“如果威廉是无赖，那么威廉就是骑士。”威廉声称：“如果索菲娅是骑士，那么梅森就是无赖。”梅森则说：“梅森是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 威廉是一名骑士  \n(3) 梅森是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：阿梅莉亚、卢克和马修。阿梅莉亚说：“卢克不是无赖。”卢克宣称：“阿梅莉亚是骑士，阿梅莉亚是无赖。”马修指出：“如果阿梅莉亚是骑士，那么卢克就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是无赖  \n(2) 卢克是无赖  \n(3) 马修是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：斯嘉丽、伊芙琳和佐伊。斯嘉丽说：“伊芙琳是无赖，佐伊是无赖。”伊芙琳说：“佐伊是无赖。”佐伊说：“如果斯嘉丽是骑士，那么斯嘉丽就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 斯嘉丽是无赖  \n(2) 伊芙琳是无赖  \n(3) 佐伊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：伊芙琳、本杰明和索菲娅。伊芙琳说：“本杰明不是无赖。”本杰明表示：“索菲娅是骑士当且仅当伊芙琳是无赖。”索菲娅说：“索菲娅是骑士当且仅当伊芙琳是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是一名骑士  \n(2) 本杰明是一名骑士  \n(3) 索菲娅是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：艾玛、艾弗里和伊丽莎白。艾玛说：“如果艾弗里是无赖，那么艾弗里就是骑士。”艾弗里的陈述是：“如果艾弗里是骑士，那么艾玛就是骑士。”伊丽莎白说：“伊丽莎白是骑士，艾弗里是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是骑士  \n(2) 艾弗里是骑士  \n(3) 伊丽莎白是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：迈克尔、赖利和索菲娅。迈克尔说：“索菲娅是无赖或者赖利是无赖。”赖利说：“索菲娅是无赖。”索菲娅说：“如果赖利是无赖，那么索菲娅就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是一名骑士  \n(2) 赖利是一个无赖  \n(3) 索菲娅是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：索菲娅、斯嘉丽和夏洛特。索菲娅说：“如果索菲娅是骑士，那么夏洛特就是骑士。”斯嘉丽说：“索菲娅是骑士。”夏洛特告诉你索菲娅是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 斯嘉丽是一名骑士  \n(3) 夏洛特是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：米娅、哈珀和奥利弗。米娅宣称：“米娅是骑士。”哈珀说：“如果哈珀是骑士，那么奥利弗就是无赖。”奥利弗说：“哈珀是骑士，米娅是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是无赖  \n(2) 哈珀是骑士  \n(3) 奥利弗是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：迈克尔、艾玛和伊芙琳。迈克尔告诉你伊芙琳不是无赖。“伊芙琳是骑士，而迈克尔也是骑士”——艾玛说。伊芙琳评论道：“艾玛是骑士当且仅当艾玛是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是无赖  \n(2) 艾玛是无赖  \n(3) 伊芙琳是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：艾登、阿梅莉亚和伊森。“伊森是骑士，而阿梅莉亚是无赖。”——艾登。阿梅莉亚的陈述是：“阿梅莉亚是骑士当且仅当伊森是无赖。”伊森则说：“阿梅莉亚是骑士，而艾登是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是无赖  \n(2) 阿梅莉亚是无赖  \n(3) 伊森是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：亨利、丹尼尔和阿比盖尔。亨利说：“丹尼尔不是骑士。”丹尼尔声明：“如果阿比盖尔是骑士，那么亨利就是骑士。”阿比盖尔则说：“丹尼尔是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是一个无赖  \n(2) 丹尼尔是一个骑士  \n(3) 阿比盖尔是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：杰克、艾米莉和艾登。杰克声称：“艾米莉不是无赖。”艾米莉说：“艾米莉是骑士或者艾登是无赖。”艾登告诉你，只有当艾米莉是无赖时，艾登才是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克是一个无赖  \n(2) 艾米莉是一个无赖  \n(3) 艾登是一个骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：伊森、迈克尔和洛根。伊森说：“如果洛根是骑士，那么伊森就是骑士。”迈克尔的陈述是：“伊森是骑士。”洛根的陈述是：“如果且仅如果迈克尔是骑士，伊森就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是一名骑士  \n(2) 迈克尔是一名骑士  \n(3) 洛根是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：索菲娅、杰克逊和卢克。索菲娅表示卢克是骑士。杰克逊告诉你，如果索菲娅是无赖，那么卢克就是无赖。在卢克的陈述中：“索菲娅是无赖当且仅当索菲娅是骑士”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 杰克逊是骑士  \n(3) 卢克是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：杰克逊、佐伊和索菲娅。杰克逊声称：“佐伊是骑士。”佐伊表示杰克逊是无赖或者佐伊是骑士。索菲娅说佐伊是骑士，杰克逊是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是一名骑士  \n(2) 佐伊是一名骑士  \n(3) 索菲娅是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：艾娃、诺亚和塞巴斯蒂安。艾娃说：“艾娃是骑士。”诺亚则说：“艾娃是无赖或者塞巴斯蒂安是无赖。”塞巴斯蒂安声称：“诺亚是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是无赖  \n(2) 诺亚是骑士  \n(3) 塞巴斯蒂安是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：梅森、马修和艾玛。梅森说：“艾玛是无赖或者马修是骑士。”马修说：“如果艾玛是无赖，那么梅森就是骑士。”艾玛宣称：“马修是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是一名骑士  \n(2) 马修是一名骑士  \n(3) 艾玛是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：塞缪尔、伊森和斯嘉丽。塞缪尔表示，如果且仅如果伊森是无赖，那么斯嘉丽就是无赖。伊森说：“塞缪尔是无赖。”斯嘉丽表示，如果且仅如果伊森是无赖，那么斯嘉丽就是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是一名骑士  \n(2) 伊森是一名无赖  \n(3) 斯嘉丽是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：伊丽莎白、斯嘉丽和詹姆斯。伊丽莎白说：“詹姆斯不是骑士。”斯嘉丽宣称：“如果詹姆斯是骑士，那么伊丽莎白就是无赖。”詹姆斯则说道：“斯嘉丽是骑士，而斯嘉丽是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是一名骑士  \n(2) 斯嘉丽是一名骑士  \n(3) 詹姆斯是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了三个居民：卢卡斯、艾玛和佐伊。卢卡斯说：“佐伊不是无赖。”艾玛表示佐伊不是骑士。佐伊声称：“艾玛是无赖，卢卡斯是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是无赖  \n(2) 艾玛是骑士  \n(3) 佐伊是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：杰克逊、艾玛和塞缪尔。杰克逊说：“塞缪尔是骑士或者杰克逊是骑士。”艾玛的陈述是：“当且仅当杰克逊是无赖时，艾玛是骑士。”塞缪尔的话是：“杰克逊是无赖，艾玛是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是一个无赖  \n(2) 艾玛是一个骑士  \n(3) 塞缪尔是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：欧文、维多利亚和利亚姆。欧文的陈述是：“维多利亚是无赖，维多利亚是骑士。”维多利亚指出：“欧文是无赖，利亚姆是无赖。”利亚姆说维多利亚是无赖，维多利亚是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是无赖  \n(2) 维多利亚是骑士  \n(3) 利亚姆是无赖"
    },
    {
        "quiz": "一个非常特别的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了三个居民：奥利维亚、杰克和雅各布。奥利维亚说：“如果杰克是无赖，那么雅各布就是无赖。”杰克的陈述是：“雅各布是骑士，而雅各布是无赖。”雅各布评论道：“如果杰克是骑士，那么奥利维亚就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是无赖  \n(2) 杰克是无赖  \n(3) 雅各布是骑士"
    }
]