[
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: أورورا، إيثان، نوح، آريا، وأبيجيل. قالت أورورا: \"أبيجيل ليست محتالة\". علق إيثان: \"أبيجيل محتالة أو آريا محتالة\". وفقاً لنوح، \"آريا محتالة\". أخبرتك آريا أن أورورا محتالة إذا وفقط إذا كان نوح فارساً. قالت أبيجيل إن نوح فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أورورا فارس  \n(2) إيثان فارس  \n(3) نوح فارس  \n(4) آريا محتالة  \n(5) أبيجيل فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة من السكان: أبيجيل، مايسون، إليزابيث، إميلي، وصوفيا. \"صوفيا محتالة أو إليزابيث فارس\"، أعلنت أبيجيل. \"صوفيا فارس\"، ذكر مايسون. \"أبيجيل ليست فارسة\"، ادعت إليزابيث. في تصريح من إميلي: \"أبيجيل فارس أو إليزابيث فارس\". كما قالت صوفيا: \"إذا كانت إميلي فارسة، فإن إميلي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أبيجيل فارس  \n(2) مايسون محتال  \n(3) إليزابيث محتالة  \n(4) إميلي فارسة  \n(5) صوفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: بينيلوب، لوكاس، أميليا، إميلي، وزوي. أكدت بينيلوب: \"لوكاس فارس أو أميليا فارس\". في تصريح لوكاس: \"إذا كان لوكاس فارساً، فإن زوي محتالة\". علقت أميليا، \"إميلي محتالة\". لاحظت إميلي، \"بينيلوب محتالة وزوي محتالة\". أخبرتك زوي أن إميلي فارس وإميلي محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب فارس  \n(2) لوكاس فارس  \n(3) أميليا فارس  \n(4) إميلي محتالة  \n(5) زوي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: ويليام، يعقوب، أيدن، آريا، ولوغان. في تصريح لويليام: \"إذا كان أيدن فارسًا، فإن آريا محتالة\". سمع يعقوب يقول: \"لوغان محتال ويعقوب فارس\". قال أيدن: \"آريا محتالة أو ويليام فارس\". أخبرتك آريا أن ويليام محتال. صرح لوغان: \"يعقوب فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام فارس  \n(2) يعقوب محتال  \n(3) أيدن فارس  \n(4) آريا محتالة  \n(5) لوغان محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: لوكاس، إسكندر، هنري، أيدن، وسباستيان. علق لوكاس، \"هنري فارس\". \"أيدن فارس\"، ذكر إسكندر. كما قال هنري، \"سباستيان فارس وهنري فارس\". \"لوكاس ليس فارساً\"، أعلن أيدن. أكد سباستيان: \"لوكاس محتار أو أيدن فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس محتال  \n(2) إسكندر فارس  \n(3) هنري محتال  \n(4) أيدن فارس  \n(5) سباستيان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: أميليا، زوي، أوين، صموئيل، وآريا. كما قالت أميليا، \"زوي محتالة وأوين محتال\". زوي عبرت عن أن أميليا فارس وآريا فارس. سمع أوين يقول، \"صموئيل فارس وأميليا محتالة\". \"إذا كانت آريا فارسًا، فإن زوي فارس\"، أعلن صموئيل. علق آريا، \"زوي فارس إذا وفقط إذا كان أوين محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا فارس  \n(2) زوي محتالة  \n(3) أوين محتال  \n(4) صموئيل فارس  \n(5) آريا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: دانيال، مايسون، آريا، ليام، ومايكل. قال دانيال: \"مايكل محتال.\" وأكد مايسون: \"ليام محتال.\" \"إذا كان مايسون محتالًا، فإن مايكل محتال\" - آريا. قال ليام: \"مايسون محتال إذا وفقط إذا كان مايسون فارسًا.\" \"آريا ليست فارسة\" - مايكل. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال فارس  \n(2) مايسون فارس  \n(3) آريا فارس  \n(4) ليام محتال  \n(5) مايكل محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: آفا، أبيجيل، هاربر، بينيلوب، وإيثان. أخبرتك آفا أن إيثان فارس وأبيجيل محتالة. سُمع أبيجيل تقول: \"أبيجيل فارس أو بينيلوب محتالة\". وفقاً لهاربر، \"إذا كان هاربر فارساً، فإن أبيجيل فارس\". \"أبيجيل ليست محتالة\"، ادعت بينيلوب. أخبرك إيثان أنه إذا كانت آفا فارساً، فإن أبيجيل محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا محتالة  \n(2) أبيجيل فارسة  \n(3) هاربر فارسة  \n(4) بينيلوب فارسة  \n(5) إيثان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: داوود، إيفلين، جيمس، غريس، ومايسون. لاحظ داوود، \"إيفلين محتالة أو إيفلين فارسة\". عبرت إيفلين عن أن غريس محتالة ومايسون فارس. عبر جيمس عن أن داوود ليس فارسًا. في كلمات غريس: \"إذا كان داوود محتالًا، فإن جيمس محتال\". علق مايسون، \"غريس فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود فارس  \n(2) إيفلين محتالة  \n(3) جيمس محتال  \n(4) غريس فارسة  \n(5) مايسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: آريا، جاكسون، إيثان، أوين، وهنري. علقت آريا، \"أوين فارس أو آريا فارس\". علق جاكسون، \"إذا كان إيثان فارساً، فإن آريا فارس\". \"آريا محتالة إذا وفقط إذا كان أوين محتالاً\"، أعلن إيثان. سمع أوين يقول، \"إذا كان هنري فارساً، فإن هنري محتال\". \"جاكسون محتال إذا وفقط إذا كان أوين محتالاً\"، ذكر هنري. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آريا محتالة  \n(2) جاكسون محتال  \n(3) إيثان فارس  \n(4) أوين محتال  \n(5) هنري فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: ليام، أبيجيل، أوليفر، شارلوت، ويوسف. وفقًا ليام، \"شارلوت فارس ويوسف محتال\". قالت أبيجيل، \"شارلوت محتالة أو ليام فارس.\" وفقًا لأوليفر، \"شارلوت فارس\". أخبرتك شارلوت أن ليام محتال. بكلمات يوسف: \"ليام ليس فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام محتال  \n(2) أبيجيل محتالة  \n(3) أوليفر فارس  \n(4) شارلوت فارسة  \n(5) يوسف فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: إيلا، فيكتوريا، رايلي، أفري، وصوفيا. أكدت إيلا: \"إيلا فارس أو فيكتوريا محتالة\". أكدت فيكتوريا: \"إذا كانت فيكتوريا فارسة، فإن رايلي فارس\". أكدت رايلي: \"إيلا ليست فارسة\". \"صوفيا فارسة أو إيلا محتالة\"، أعلنت أفري. صوفيا عبرت أنه إذا كانت فيكتوريا محتالة، فإن رايلي محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا محتالة  \n(2) فيكتوريا فارسة  \n(3) رايلي فارسة  \n(4) أفري فارسة  \n(5) صوفيا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: يوسف، مايكل، إليزابيث، لوكاس، وآريا. قال يوسف: \"لوكاس محتال وإليزابيث محتالة\". قال مايكل: \"إليزابيث محتالة وإليزابيث فارس\". بكلمات إليزابيث: \"مايكل ليس محتالاً\". علق لوكاس: \"مايكل ليس فارساً\". أكدت آريا: \"آريا فارس ويوسف فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف محتال  \n(2) مايكل محتال  \n(3) إليزابيث محتالة  \n(4) لوكاس فارس  \n(5) آريا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: إسكندر، جيمس، آفا، لوغان، وغريس. أخبرك إسكندر أنه إذا كانت غريس فارسًا، فإن لوغان فارس. لاحظ جيمس، \"آفا محتالة أو لوغان فارس\". وفقًا لآفا، \"جيمس محتال إذا وفقط إذا كان إسكندر فارسًا\". أعلن لوغان، \"إسكندر محتال إذا وفقط إذا كان جيمس فارسًا\". أعلنت غريس، \"آفا محتالة وآفا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إسكندر فارس  \n(2) جيمس فارس  \n(3) آفا محتالة  \n(4) لوغان محتال  \n(5) غريس محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: إيفلين، كلوي، ماثيو، ويليام، وصوفيا. عبرت إيفلين عن أن كلوي محتالة أو ويليام فارس. أكدت كلوي: \"ماثيو فارس أو ماثيو محتال\". \"ويليام ليس فارساً\"، ادعى ماثيو. وفقاً لويليام، \"ماثيو محتال إذا وفقط إذا كانت إيفلين محتالة\". في كلمات صوفيا: \"ماثيو فارس إذا وفقط إذا كان ماثيو محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين محتالة  \n(2) كلوي فارسة  \n(3) ماثيو فارس  \n(4) ويليام محتال  \n(5) صوفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: داوود، شارلوت، جاكسون، صموئيل، وأفري. سمع داوود يقول: \"إذا كان صموئيل فارسًا، فإن شارلوت محتالة\". قالت شارلوت إن داوود محتال إذا وفقط إذا كانت أفري محتالة. علق جاكسون: \"شارلوت محتالة أو أفري محتالة\". \"إذا كان جاكسون محتالًا، فإن داوود فارس\" - صموئيل. وفقًا لأفري، \"شارلوت محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود محتال  \n(2) شارلوت فارس  \n(3) جاكسون فارس  \n(4) صموئيل فارس  \n(5) أفري محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: ليام، إليزابيث، أيدن، ماثيو، وبنيامين. في كلمات ليام: \"أيدن فارس وبنيامين محتال\". في كلمات إليزابيث: \"ماثيو فارس إذا وفقط إذا كان ماثيو محتال\". في تصريح لأيدن: \"إذا كان ليام محتالًا، فإن ليام فارس\". \"ليام ليس فارسًا\"، أعلن ماثيو. وفقًا لبنيامين، \"أيدن فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام محتال  \n(2) إليزابيث محتالة  \n(3) أيدن محتال  \n(4) ماثيو فارس  \n(5) بنيامين محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: أيدن، شارلوت، إسكندر، لوكاس، وإميلي. \"إسكندر محتال أو إميلي فارس\" - أيدن. أخبرتك شارلوت أن أيدن ليس فارسًا. صرح إسكندر، \"أيدن محتال\". \"إذا كانت إميلي فارسًا، فإن شارلوت فارس\" - ادعى لوكاس. عبرت إميلي أنه إذا كانت شارلوت محتالة، فإن أيدن محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن فارس  \n(2) شارلوت محتالة  \n(3) إسكندر محتال  \n(4) لوكاس فارس  \n(5) إميلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: شارلوت، أوليفر، إيلا، رايلي، ودانيال. علقت شارلوت، \"أوليفر محتال\". قال أوليفر، \"دانيال ليس فارسًا\". \"شارلوت محتالة وشارلوت فارس\" - إيلا. أكد رايلي: \"إيلا محتالة أو شارلوت محتالة\". وفقًا لدانيال، \"أوليفر محتال إذا وفقط إذا كانت شارلوت فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت فارس  \n(2) أوليفر محتال  \n(3) إيلا محتالة  \n(4) رايلي فارس  \n(5) دانيال فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: إيثان، جيمس، إميلي، مايكل، وفيكتوريا. قال إيثان: \"إميلي محتالة أو مايكل فارس\". سمع جيمس يقول: \"إيثان فارس وإيثان محتال\". قالت إميلي: \"جيمس محتال\". أكد مايكل: \"إذا كانت إميلي فارسة، فإن إميلي محتالة\". وفقاً لفيكتوريا، \"إيثان محتال أو مايكل محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان محتال  \n(2) جيمس محتال  \n(3) إميلي فارس  \n(4) مايكل محتال  \n(5) فيكتوريا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: مايسون، أورورا، هنري، فيكتوريا، ودانيال. علق مايسون قائلاً: \"إذا كانت فيكتوريا فارساً، فإن أورورا فارساً\". أعربت أورورا عن أن دانيال فارس. وفي كلمات هنري: \"إذا كان مايسون محتالاً، فإن أورورا فارساً\". \"أورورا فارس ودانيال فارس\" - فيكتوريا. كما قال دانيال: \"هنري ليس فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايسون فارس  \n(2) أورورا محتالة  \n(3) هنري فارس  \n(4) فيكتوريا محتالة  \n(5) دانيال محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: جيمس، لوكاس، مايكل، إسكندر، وأورورا. قال جيمس: \"لوكاس فارس وأورورا فارس.\" \"إسكندر محتال أو لوكاس فارس\" - لوكاس. \"لوكاس محتال أو جيمس فارس\" - ادعى مايكل. في كلمات إسكندر: \"إذا كان لوكاس فارس، فإن مايكل محتال.\" قالت أورورا: \"إذا كانت أورورا فارس، فإن لوكاس فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس فارس  \n(2) لوكاس فارس  \n(3) مايكل فارس  \n(4) إسكندر محتال  \n(5) أورورا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: أميليا، زوي، أبيجيل، يعقوب، وصوفيا. قالت أميليا: \"يعقوب محتال إذا وفقط إذا كانت صوفيا فارسة\". قالت زوي: \"يعقوب محتال\". لاحظت أبيجيل: \"زوي فارسة إذا وفقط إذا كانت أميليا محتالة\". صرح يعقوب: \"إذا كانت زوي محتالة، فإن يعقوب فارس\". وفقًا لصوفيا، \"زوي ليست فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا محتالة  \n(2) زوي محتالة  \n(3) أبيجيل محتالة  \n(4) يعقوب فارس  \n(5) صوفيا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: صوفيا، ميا، إيفلين، شارلوت. في تصريح لصوفيا: \"إيفلين محتالة إذا وفقط إذا كانت ميا محتالة\". قالت ميا: \"إيفلين محتالة أو صوفيا فارس\". في تصريح لإميلي: \"ميا فارس أو إيفلين محتالة\". في كلمات إيفلين: \"إذا كانت شارلوت محتالة، فإن ميا فارس\". عبرت شارلوت عن أن صوفيا فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) ميا فارس  \n(3) إميلي فارس  \n(4) إيفلين فارس  \n(5) شارلوت فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: شارلوت، نوح، زوي، جاك، وميا. أخبرتك شارلوت أن ميا محتالة وأن نوح فارس. صرح نوح، \"شارلوت محتالة وزوي فارسة\". لاحظت زوي، \"نوح محتال وشارلوت فارسة\". \"ميا ليست فارسة\"، ذكر جاك. \"شارلوت محتالة وزوي فارسة\" - ميا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت محتالة  \n(2) نوح محتال  \n(3) زوي محتالة  \n(4) جاك فارس  \n(5) ميا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: أفري، جيمس، دانيال، إيلا، وويليام. قالت أفري: \"ويليام محتال\". سمع جيمس يقول: \"إيلا فارس أو ويليام محتال\". علق دانيال: \"إذا كانت أفري فارساً، فإن إيلا فارس\". في بيان من إيلا: \"دانيال محتال\". وفقاً لويليام: \"أفري محتالة أو دانيال محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري محتالة  \n(2) جيمس محتال  \n(3) دانيال فارس  \n(4) إيلا محتالة  \n(5) ويليام فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: جاك، ليام، إيثان، أميليا، وهاربر. كما قال جاك: \"إيثان محتال أو أميليا محتالة\". وفقاً ليام، \"إيثان فارس أو هاربر فارس\". في تصريح لإيثان: \"جاك ليس محتالاً\". في تصريح لأميليا: \"إذا كان ليام فارساً، فإن أميليا فارس\". في كلمات هاربر: \"إذا كان ليام محتالاً، فإن أميليا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاك فارس  \n(2) ليام فارس  \n(3) إيثان فارس  \n(4) أميليا محتالة  \n(5) هاربر فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: بينيلوب، مايكل، دانيال، ماثيو، وإيفلين. \"بينيلوب فارس ومايكل محتال\"، أعلنت بينيلوب. \"دانيال محتال أو دانيال فارس\"، أعلن مايكل. علق دانيال، \"بينيلوب محتالة أو إيفلين محتالة\". سمع ماثيو يقول، \"بينيلوب فارس إذا وفقط إذا كان دانيال فارس\". صرحت إيفلين، \"بينيلوب فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب محتالة  \n(2) مايكل فارس  \n(3) دانيال فارس  \n(4) ماثيو محتال  \n(5) إيفلين محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: سباستيان، نوح، بنيامين، هنري، وآفا. قال سباستيان إن آفا محتالة إذا وفقط إذا كانت آفا فارسة. علق نوح قائلاً: \"آفا محتالة\". سمع بنيامين يقول: \"آفا محتالة أو نوح فارس\". ذكر هنري: \"آفا محتالة\". ادعت آفا: \"سباستيان ليس محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سباستيان محتال  \n(2) نوح فارس  \n(3) بنيامين فارس  \n(4) هنري فارس  \n(5) آفا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: مايسون، ليام، أوين، إيزابيلا، وإميلي. علق مايسون قائلاً: \"ليام محتال وإميلي محتالة\". قال ليام: \"إميلي محتالة أو مايسون فارس\". علق أوين: \"ليام ليس فارساً\". وفقاً لإيزابيلا، \"إذا كان أوين فارساً، فإن ليام فارس\". أكدت إميلي: \"مايسون فارس أو مايسون محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايسون محتال  \n(2) ليام محتال  \n(3) أوين فارس  \n(4) إيزابيلا محتالة  \n(5) إميلي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: ليلي، ليام، إيلا، أيدن، وصموئيل. وفقاً ليلي، \"ليام فارس أو صموئيل محتال\". وفقاً ليام، \"إذا كانت إيلا محتالة، فإن ليلي محتالة\". \"ليام ليس محتالاً\"، ادعت إيلا. أيدن أشار، \"ليلي ليست محتالة\". صموئيل أكد: \"ليلي ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي فارس  \n(2) ليام فارس  \n(3) إيلا فارس  \n(4) أيدن فارس  \n(5) صموئيل فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: صوفيا، بنيامين، أوليفيا، يوسف، وإيزابيلا. \"صوفيا فارس إذا وفقط إذا كان بنيامين محتالاً\"، ذكرت صوفيا. \"أوليفيا محتالة\"، أعلن بنيامين. في كلمات أوليفيا: \"أوليفيا فارس إذا وفقط إذا كانت إيزابيلا فارسة\". \"إذا كانت أوليفيا فارسة، فإن بنيامين محتال\"، ذكر يوسف. \"صوفيا ليست فارسة\"، ذكرت إيزابيلا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا محتالة  \n(2) بنيامين محتال  \n(3) أوليفيا فارسة  \n(4) يوسف فارس  \n(5) إيزابيلا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: مايكل، ويليام، صوفيا، صموئيل، ورايلي. قال مايكل: \"صموئيل محتال وصوفيا محتالة\". سمع ويليام يقول: \"صموئيل فارس\". علقت صوفيا: \"مايكل محتال\". أكد صموئيل: \"مايكل محتال إذا وفقط إذا كانت صوفيا فارسة\". عبرت رايلي عن أن مايكل محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل محتال  \n(2) ويليام فارس  \n(3) صوفيا فارس  \n(4) صموئيل فارس  \n(5) رايلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: ليلي، لوك، سكارليت، جيمس، وبينيلوب. أخبرتك ليلي أن سكارليت ليست فارساً. قال لك لوك إن سكارليت ليست فارساً. \"جيمس فارس إذا وفقط إذا كان لوك محتالاً\"، ذكرت سكارليت. أعرب جيمس عن أن ليلي محتالة وأن لوك محتال. علق بينيلوب، \"لوك ليس محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي محتالة  \n(2) لوك محتال  \n(3) سكارليت فارسة  \n(4) جيمس فارس  \n(5) بينيلوب محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: غريس، ميا، أيدن، سباستيان، وإليزابيث. سُمعت غريس تقول، \"إذا كانت ميا محتالة، فإن أيدن محتال\". سُمعت ميا تقول، \"سباستيان فارس أو غريس محتالة\". أخبرك أيدن أن غريس محتالة وسباستيان محتال. \"ميا فارسة أو إليزابيث محتالة\"، ادعى سباستيان. لاحظت إليزابيث، \"سباستيان ليس محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) غريس فارس  \n(2) ميا فارس  \n(3) أيدن محتال  \n(4) سباستيان فارس  \n(5) إليزابيث فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: ليام، يعقوب، إميلي، إليزابيث، ومايسون. قال ليام: \"إذا كانت إميلي فارسًا، فإن ليام فارس\". أعلن يعقوب: \"إليزابيث فارس\". علقت إميلي: \"إليزابيث فارس\". ادعت إليزابيث: \"ليام محتار إذا وفقط إذا كان يعقوب فارسًا\". صرح مايسون: \"ليام محتال أو يعقوب فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام محتال  \n(2) يعقوب فارس  \n(3) إميلي فارس  \n(4) إليزابيث فارس  \n(5) مايسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: لوغان، جاكسون، كلوي، ليام، وإيزابيلا. سمع لوغان يقول: \"جاكسون فارس أو كلوي فارس\". أشار جاكسون: \"ليام محتال أو كلوي فارس\". عبرت كلوي عن أن إيزابيلا محتالة. علق ليام: \"كلوي فارس أو إيزابيلا فارس\". كما قالت إيزابيلا: \"لوغان فارس وكلوي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان فارس  \n(2) جاكسون فارس  \n(3) كلوي فارس  \n(4) ليام فارس  \n(5) إيزابيلا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: لوكاس، أبيجيل، أوليفيا، شارلوت، وماثيو. قال لوكاس: \"ماثيو فارس وشارلوت فارس\". علقت أبيجيل: \"إذا كانت أوليفيا فارسًا، فإن ماثيو فارس\". وفقًا لأوليفيا، \"إذا كان لوكاس فارسًا، فإن لوكاس محتال\". أكدت شارلوت: \"شارلوت فارس إذا وفقط إذا كان ماثيو محتالًا\". كما قال ماثيو: \"أبيجيل فارس أو شارلوت فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس محتال  \n(2) أبيجيل محتالة  \n(3) أوليفيا فارسة  \n(4) شارلوت محتالة  \n(5) ماثيو محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: لوكاس، غريس، صوفيا، لوك، وأوليفر. لوكاس قال: \"لوك فارس\". غريس صرحت: \"لوك ليس محتالاً\". صوفيا أعلنت: \"لوكاس محتال وغريس فارس\". لوك علق: \"لوكاس محتال ولوكاس فارس\". وفي كلمات أوليفر: \"صوفيا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس محتال  \n(2) غريس محتالة  \n(3) صوفيا محتالة  \n(4) لوك محتال  \n(5) أوليفر فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: جيمس، صوفيا، إيلا، رايلي، وهنري. جيمس أكد: \"هنري محتال وإيلا محتالة\". في تصريح لصوفيا: \"إذا كانت صوفيا فارسة، فإن إيلا محتالة\". في كلمات إيلا: \"هنري فارس إذا وفقط إذا كانت إيلا فارسة\". \"إذا كان جيمس فارسًا، فإن إيلا فارسة\" - رايلي. \"جيمس محتال\"، زعم هنري. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس محتال  \n(2) صوفيا فارس  \n(3) إيلا محتالة  \n(4) رايلي فارس  \n(5) هنري فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة من السكان: كلوي، جاك، ليلي، إسكندر، وويليام. علقت كلوي، \"ويليام محتال\". قال جاك، \"إسكندر محتال\". بكلمات ليلي: \"إذا كان ويليام فارسًا، فإن ويليام محتال\". \"ليلي محتالة إذا وفقط إذا كان جاك محتالًا\" - إسكندر. \"إسكندر فارس أو ليلي فارس\" - ادعى ويليام. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) كلوي محتالة  \n(2) جاك محتال  \n(3) ليلي محتالة  \n(4) إسكندر فارس  \n(5) ويليام فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة من السكان: صوفيا، جاكسون، نوح، إليزابيث، وأورورا. \"أورورا ليست محتالة\" - صوفيا. سمع جاكسون يقول: \"نوح محتال وأورورا محتالة\". في تصريح لنوح: \"إذا كان جاكسون محتالاً، فإن أورورا محتالة\". \"نوح فارس ونوح محتال\"، أعلنت إليزابيث. قالت أورورا إن إليزابيث فارس إذا وفقط إذا كان جاكسون فارساً. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) جاكسون محتال  \n(3) نوح محتال  \n(4) إليزابيث محتالة  \n(5) أورورا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: لوك، جيمس، ليلي، صموئيل، وهنري. قال لك لوك: \"إذا كان لوك فارساً، فإن هنري محتال\". كما قال جيمس: \"هنري ليس محتالاً\". صرحت ليلي: \"لوك فارس ولوك محتال\". وفقاً لصموئيل، \"صموئيل فارس إذا وفقط إذا كان جيمس محتالاً\". قال هنري: \"صموئيل محتال إذا وفقط إذا كان هنري فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) جيمس محتال  \n(3) ليلي محتالة  \n(4) صموئيل محتال  \n(5) هنري محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: صوفيا، مايسون، أوين، إميلي، وسباستيان. تم سماع صوفيا تقول: \"مايسون فارس أو سباستيان فارس\". قال مايسون: \"سباستيان محتال وإميلي محتالة.\" في كلمات أوين: \"إذا كانت إميلي محتالة، فإن صوفيا محتالة\". في كلمات إميلي: \"سباستيان محتال أو صوفيا فارس\". وفقًا لسباستيان، \"صوفيا محتالة أو سباستيان فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) مايسون محتال  \n(3) أوين فارس  \n(4) إميلي فارس  \n(5) سباستيان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: أميليا، سكارليت، فيكتوريا، لوكاس، وهنري. كما قالت أميليا: \"سكارليت فارس إذا وفقط إذا كانت سكارليت محتالة\". وفقاً لسكارليت، \"أميليا ليست محتالة\". في بيان من فيكتوريا: \"سكارليت محتالة أو فيكتوريا فارس\". لوكاس عبر عن أنه إذا كان هنري فارساً، فإن هنري محتال. \"سكارليت فارس وأميليا فارس\"، ذكر هنري. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا محتالة  \n(2) سكارليت محتالة  \n(3) فيكتوريا فارسة  \n(4) لوكاس فارس  \n(5) هنري محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة من السكان: إيفلين، كلوي، صوفيا، أبيجيل، وإيميلي. قالت إيفلين: \"كلوي فارس وصوفيا فارس\". كما قالت كلوي: \"إيميلي فارس إذا وفقط إذا كانت صوفيا محتالة\". علق صوفيا: \"أبيجيل فارس أو صوفيا فارس\". في كلمات أبيجيل: \"إذا كانت إيفلين محتالة، فإن إيميلي فارس\". علقت إيميلي: \"كلوي محتالة وأبيجيل محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين فارس  \n(2) كلوي فارس  \n(3) صوفيا فارس  \n(4) أبيجيل فارس  \n(5) إميلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: بنيامين، إسكندر، دانيال، أورورا، ويوسف. قال بنيامين: \"أورورا فارس\". أخبرك إسكندر أنه إذا كان يوسف محتالًا، فإن يوسف فارس. في تصريح لدانيال: \"بنيامين محتال أو دانيال فارس\". سُمع أورورا تقول: \"يوسف فارس إذا وفقط إذا كان بنيامين فارسًا\". \"دانيال محتال إذا وفقط إذا كانت أورورا محتالة\" - يوسف. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين فارس  \n(2) إسكندر فارس  \n(3) دانيال فارس  \n(4) أورورا فارس  \n(5) يوسف فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: صوفيا، إيلا، أوين، شارلوت، وكلوي. كما قالت صوفيا، \"شارلوت فارس أو أوين فارس\". سُمعت إيلا تقول، \"شارلوت محتالة وصوفيا محتالة\". علق أوين، \"شارلوت محتالة إذا وفقط إذا كانت كلوي فارس\". سُمعت شارلوت تقول، \"إذا كانت إيلا فارسًا، فإن شارلوت فارس\". علق كلوي، \"كلوي فارس إذا وفقط إذا كانت إيلا فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا محتالة  \n(2) إيلا فارسة  \n(3) أوين محتال  \n(4) شارلوت محتالة  \n(5) كلوي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: داوود، ويليام، أورورا، ليام، ولوغان. أخبرك داوود أن ويليام محتال أو أورورا محتالة. قال ويليام إنه إذا كان داوود محتالًا، فإن ليام فارس. \"داوود فارس إذا وفقط إذا كانت أورورا فارسة\"، ادعت أورورا. أخبرك ليام أن لوغان محتال. علق لوغان، \"ويليام فارس إذا وفقط إذا كان ويليام محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود فارس  \n(2) ويليام فارس  \n(3) أورورا محتالة  \n(4) ليام فارس  \n(5) لوغان محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: شارلوت، أبيجيل، غريس، ميا، وسكارليت. \"إذا كانت غريس محتالة، فإن ميا فارسة\" - شارلوت. \"سكارليت محتالة إذا وفقط إذا كانت ميا فارسة\" - أبيجيل. في تصريح من غريس: \"سكارليت محتالة\". \"غريس فارسة إذا وفقط إذا كانت سكارليت فارسة\"، ذكرت ميا. سكارليت أشارت، \"ميا ليست فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت محتالة  \n(2) أبيجيل فارسة  \n(3) غريس محتالة  \n(4) ميا محتالة  \n(5) سكارليت فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة من السكان: يوسف، ليلي، بنيامين، كلوي، وهاربر. \"يوسف فارس وكلوي محتالة\"، أعلن يوسف. \"إذا كانت ليلي فارسة، فإن يوسف محتال\"، ادعت ليلي. علق بنيامين، \"يوسف محتال إذا وفقط إذا كانت كلوي فارسة\". قالت كلوي، \"إذا كانت هاربر محتالة، فإن بنيامين فارس\". لاحظ هاربر، \"بنيامين ليس فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف محتال  \n(2) ليلي فارس  \n(3) بنيامين فارس  \n(4) كلوي فارس  \n(5) هاربر محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: سباستيان، أورورا، هنري، آفا، وإميلي. قال سباستيان: \"هنري محتال وأورورا فارس\". علقت أورورا: \"إذا كان هنري فارسًا، فإن آفا محتالة\". في كلمات هنري: \"إميلي ليست فارسة\". صرحت آفا: \"هنري فارس إذا وفقط إذا كانت أورورا محتالة\". أكدت إميلي: \"هنري فارس إذا وفقط إذا كانت أورورا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سباستيان محتال  \n(2) أورورا محتالة  \n(3) هنري فارس  \n(4) آفا فارسة  \n(5) إميلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: إيلا، زوي، لوغان، إميلي، ومايكل. قالت إيلا: \"زوي محتالة وزوي فارس\". عبرت زوي عن أن إيلا فارس وزوي فارس. أشار لوغان: \"إذا كانت إيلا محتالة، فإن زوي محتالة\". عبرت إميلي عن أن إيلا محتالة ومايكل فارس. قال مايكل: \"إذا كانت إميلي محتالة، فإن زوي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا محتالة  \n(2) زوي محتالة  \n(3) لوغان فارس  \n(4) إميلي فارسة  \n(5) مايكل فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: ماثيو، إيما، جاكسون، ويليام، وجاك. قال ماثيو: \"جاكسون فارس إذا وفقط إذا كان ويليام محتالًا\". سُمعت إيما تقول: \"ماثيو فارس\". علق جاكسون: \"إيما فارس وإيما محتالة\". كما قال ويليام: \"إذا كان جاك محتالًا، فإن إيما محتالة\". قال جاك: \"جاك فارس وويليام فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ماثيو فارس  \n(2) إيما فارس  \n(3) جاكسون محتال  \n(4) ويليام فارس  \n(5) جاك فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: نوح، آريا، جاكسون، أبيجيل، وزوي. سمع نوح يقول: \"زوي فارس ونوح فارس\". أخبرتك آريا أنه إذا كان نوح فارسًا، فإن جاكسون فارس. علق جاكسون: \"نوح محتار وآريا محتالة\". لاحظت أبيجيل: \"نوح فارس أو آريا فارس\". أعلنت زوي: \"آريا فارس ونوح محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح محتال  \n(2) آريا فارس  \n(3) جاكسون محتال  \n(4) أبيجيل فارس  \n(5) زوي فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: جاك، ميا، أورورا، ماثيو، ونوح. أكد جاك: \"إذا كان ماثيو محتالاً، فإن نوح محتال\". كما قالت ميا: \"ميا فارس وأورورا فارس\". في كلمات أورورا: \"ميا فارس\". كما قال ماثيو: \"إذا كان ماثيو فارساً، فإن ميا فارس\". في كلمات نوح: \"إذا كان جاك محتالاً، فإن ماثيو فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاك فارس  \n(2) ميا فارسة  \n(3) أورورا فارسة  \n(4) ماثيو فارس  \n(5) نوح فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: فيكتوريا، أوليفر، هنري، زوي، وأوين. علقت فيكتوريا، \"هنري محتال\". عبر أوليفر عن أن زوي محتالة أو أوين محتال. أشار هنري، \"إذا كان أوين فارسًا، فإن زوي محتالة\". قالت زوي إن أوليفر محتال وفيكتوريا فارس. علق أوين، \"إذا كان أوليفر محتالًا، فإن أوليفر فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) فيكتوريا محتالة  \n(2) أوليفر فارس  \n(3) هنري فارس  \n(4) زوي محتالة  \n(5) أوين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: مايسون، فيكتوريا، داوود، لوغان، وإسكندر. في تصريح لمايسون: \"إسكندر فارس وفيكتوريا فارس\". كما قالت فيكتوريا: \"فيكتوريا فارس وإسكندر محتـال\". داوود أكد: \"فيكتوريا فارس أو لوغان محتـال\". لوغان أكد: \"إذا كانت فيكتوريا محتـالة، فإن فيكتوريا فارس\". إسكندر أخبرك أن مايسون ليس فارسًا. فمن هو الفارس ومن هو المحتـال؟",
        "solution_text_format": "(1) مايسون محتال  \n(2) فيكتوريا محتالة  \n(3) داوود فارس  \n(4) لوغان محتال  \n(5) إسكندر فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: إيثان، صوفيا، داوود، إيفلين، ومايكل. قال إيثان إن صوفيا ليست محتالة. علقت صوفيا، \"إيفلين ليست فارسة\". \"إيثان فارس ومايكل محتال\" - داوود. في بيان لإيفلين: \"إيثان محتال إذا وفقط إذا كان داوود فارساً\". سمع مايكل يقول، \"إيثان ليس فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان فارس  \n(2) صوفيا فارس  \n(3) داوود فارس  \n(4) إيفلين محتالة  \n(5) مايكل محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: رايلي، أبيجيل، جيمس، أوين، ونوح. أخبرتك رايلي أن جيمس فارس أو أبيجيل فارس. صرحت أبيجيل، \"رايلي فارس أو رايلي محتال\". علق جيمس، \"نوح ليس محتالاً\". أعلن أوين، \"أبيجيل فارس\". قال نوح، \"أبيجيل فارس ورايلي فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) رايلي فارس  \n(2) أبيجيل فارس  \n(3) جيمس فارس  \n(4) أوين فارس  \n(5) نوح فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: أوليفيا، لوغان، نوح، ليلي، وميا. تم سماع أوليفيا تقول: \"ميا محتالة إذا وفقط إذا كانت ليلي فارسة\". صرح لوغان: \"ميا فارسة أو ليلي محتالة\". علق نوح: \"أوليفيا فارسة أو ميا فارسة\". وفقاً ليلي، \"إذا كانت أوليفيا محتالة فإن نوح فارس\". عبرت ميا عن أن ليلي محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا فارس  \n(2) لوغان محتار  \n(3) نوح فارس  \n(4) ليلي فارس  \n(5) ميا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: جاك، آفا، صوفيا، زوي، وداوود. \"داوود هو محتال إذا وفقط إذا كانت صوفيا فارسًا\" - جاك. كما قالت آفا، \"داوود هو محتال أو صوفيا فارس\". \"إذا كان جاك محتالًا، فإن آفا فارس\" ، ذكرت صوفيا. زوي عبرت عن أنه إذا كان داوود محتالًا، فإن داوود فارس. سمع داوود يقول، \"آفا ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاك محتال  \n(2) آفا فارس  \n(3) صوفيا فارس  \n(4) زوي فارس  \n(5) داوود فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: إيفلين، لوك، كلوي، ليلي، وإيما. أخبرتك إيفلين أن لوك محتال إذا وفقط إذا كان لوك فارسًا. قال لوك إن إيفلين محتالة إذا وفقط إذا كانت إيما محتالة. صرحت كلوي، \"ليلي محتالة\". علق ليلي، \"إيما محتالة أو كلوي محتالة\". عبرت إيما عن أن كلوي محتالة وليلي فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) Evelyn is a knave\n(2) Luke is a knave\n(3) Chloe is a knave\n(4) Lily is a knight\n(5) Emma is a knight"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: جاكسون، أفري، أوليفر، رايلي، وإليزابيث. وفقًا لجكسون، \"إليزابيث محتالة إذا وفقط إذا كانت إليزابيث فارسة\". أفري عبر عن أن أوليفر فارس إذا وفقط إذا كان جاكسون فارسًا. أوليفر علق، \"رايلي محتالة وإليزابيث فارسة\". سمع رايلي يقول، \"إليزابيث فارسة أو أفري فارس\". إليزابيث قالت، \"جاكسون محتال وأوليفر محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون محتال  \n(2) أفري فارس  \n(3) أوليفر محتال  \n(4) رايلي فارس  \n(5) إليزابيث فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: إميلي، نوح، آفا، هنري، وجيمس. قالت إميلي: \"نوح فارس وجيمس محتال\". أكد نوح: \"هنري محتال\". ادعت آفا: \"آفا فارس أو إميلي محتالة\". وفي كلمات هنري: \"هنري فارس أو نوح فارس\". وفقاً لجيمس، \"إميلي ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي محتالة  \n(2) نوح محتال  \n(3) آفا فارس  \n(4) هنري فارس  \n(5) جيمس محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: إيما، أوليفيا، صموئيل، غريس، وصوفيا. أكدت إيما: \"غريس محتالة أو غريس فارس\". قالت أوليفيا إن صوفيا ليست فارساً. أشار صموئيل، \"غريس فارس وصموئيل فارس\". صرحت غريس، \"صوفيا فارس\". في بيان من صوفيا: \"صموئيل ليس فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما فارس  \n(2) أوليفيا محتالة  \n(3) صموئيل محتال  \n(4) غريس فارس  \n(5) صوفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: إيثان، هنري، ويليام، أوليفر، وآفا. قال إيثان: \"آفا فارس أو أوليفر فارس\". قال هنري: \"أوليفر ليس محتالاً\". أكد ويليام: \"إيثان فارس إذا وفقط إذا كانت آفا فارساً\". كما قال أوليفر: \"آفا فارس أو هنري محتال\". وفقاً لآفا، \"هنري ليس محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان فارس  \n(2) هنري فارس  \n(3) ويليام فارس  \n(4) أوليفر فارس  \n(5) آفا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: صموئيل، هاربر، لوكاس، أوين، وكلوي. \"هاربر فارس\" - صموئيل. علق هاربر، \"صموئيل محتال أو لوكاس محتال\". \"صموئيل محتال وكلوي فارس\"، أعلن لوكاس. \"صموئيل محتال إذا وفقط إذا كان هاربر محتالاً\"، أعلن أوين. قالت كلوي، \"لوكاس محتال أو أوين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صموئيل فارس  \n(2) هاربر فارس  \n(3) لوكاس محتال  \n(4) أوين فارس  \n(5) كلوي فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: لوغان، ميا، إيزابيلا، مايكل، وأوليفر. قال لوغان: \"إيزابيلا محتالة ومايكل فارس.\" ذكرت ميا: \"أوليفر ليس فارسًا.\" أشارت إيزابيلا: \"أوليفر محتال إذا وفقط إذا كان أوليفر فارسًا.\" أخبرك مايكل أن ميا فارس وإيزابيلا محتالة. في تصريح من أوليفر: \"لوغان محتال إذا وفقط إذا كانت ميا محتالة.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان محتال  \n(2) ميا محتالة  \n(3) إيزابيلا محتالة  \n(4) مايكل محتال  \n(5) أوليفر فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: آريا، يعقوب، مايسون، إيزابيلا، وإيفلين. كما قالت آريا: \"يعقوب فارس وإيفلين محتالة\". علق يعقوب: \"مايسون محتال وإيفلين فارس\". أكد مايسون: \"إذا كانت إيزابيلا فارسة، فإن إيفلين محتالة\". ذكرت إيزابيلا: \"إيفلين فارس أو إيزابيلا فارسة\". صرحت إيفلين: \"مايسون فارس إذا وفقط إذا كان يعقوب محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آريا محتالة  \n(2) يعقوب فارس  \n(3) مايسون محتال  \n(4) إيزابيلا فارس  \n(5) إيفلين فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: صوفيا، ويليام، بينيلوب، ميا، وأوين. قالت صوفيا: \"أوين فارس إذا وفقط إذا كانت بينيلوب فارسة.\" وفقاً لويليام، \"إذا كانت صوفيا محتالة، فإن بينيلوب محتالة.\" عبرت بينيلوب عن أن ويليام ليس محتالاً. أكدت ميا: \"صوفيا محتالة أو ويليام فارس.\" علق أوين: \"ويليام ليس محتالاً.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) ويليام فارس  \n(3) بينيلوب فارس  \n(4) ميا فارس  \n(5) أوين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: هاربر، صوفيا، شارلوت، ليام، ومايسون. \"مايسون فارس إذا وفقط إذا كان ليام فارسًا\"، ذكرت هاربر. في تصريح لصوفيا: \"هاربر فارس إذا وفقط إذا كان مايسون محتالًا\". علقت شارلوت، \"هاربر محتال أو مايسون فارس\". في كلمات ليام: \"مايسون محتال وهاربر محتال\". أخبرك مايسون أن هاربر فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر محتال  \n(2) صوفيا محتالة  \n(3) شارلوت فارس  \n(4) ليام فارس  \n(5) مايسون محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: ماثيو، إيلا، رايلي، آفا، وأوليفيا. في تصريح لماثيو: \"إيلا محتالة إذا وفقط إذا كانت آفا محتالة\". علقت إيلا، \"رايلي ليست محتالة\". في كلمات رايلي: \"أوليفيا فارس\". وفقاً لآفا، \"آفا فارس إذا وفقط إذا كان ماثيو فارساً\". وفقاً لأوليفيا، \"إيلا محتالة أو إيلا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ماثيو فارس  \n(2) إيلا فارس  \n(3) رايلي فارس  \n(4) آفا فارس  \n(5) أوليفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: داوود، سباستيان، لوغان، زوي، وآفا. علق داوود قائلاً: \"زوي فارس ولوغان فارس\". علق سباستيان قائلاً: \"زوي فارس إذا وفقط إذا كان لوغان فارساً\". أخبرك لوغان أن آفا فارس وسباستيان فارس. \"إذا كانت زوي فارساً، فإن سباستيان فارس\"، ذكرت زوي. عبرت آفا عن أن زوي فارس إذا وفقط إذا كانت آفا فارساً. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود فارس  \n(2) سباستيان فارس  \n(3) لوغان فارس  \n(4) زوي فارس  \n(5) آفا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: يوسف، بنيامين، آفا، سكارليت، وهنري. أخبرك يوسف أن آفا محتالة وآفا فارس. أكد بنيامين: \"إذا كان هنري فارساً، فإن آفا محتالة\". كما قالت آفا: \"هنري فارس أو سكارليت محتالة\". أخبرتك سكارليت أن يوسف ليس محتالاً. أعلن هنري: \"بنيامين محتال إذا وفقط إذا كان هنري فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف محتال  \n(2) بنيامين محتال  \n(3) آفا فارس  \n(4) سكارليت محتالة  \n(5) هنري فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: هاربر، رايلي، لوغان، بنيامين، ويوسف. أكد هاربر: \"بنيامين محتال أو يوسف محتال\". في كلمات رايلي: \"إذا كان لوغان محتالاً، فإن بنيامين فارس\". لوغان أشار، \"بنيامين محتال ولوغان فارس\". بنيامين أشار، \"هاربر فارس\". وفقاً ليوسف، \"لوغان فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر فارس  \n(2) رايلي فارس  \n(3) لوغان محتال  \n(4) بنيامين فارس  \n(5) يوسف محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: لوكاس، ويليام، مايسون، هنري، ويوسف. سمع لوكاس يقول: \"يوسف محتال أو مايسون محتال\". أشار ويليام: \"يوسف محتال أو مايسون فارس\". كما قال مايسون: \"هنري ليس فارساً\". قال هنري إن يوسف فارس. عبر يوسف عن أنه إذا كان هنري فارساً، فإن مايسون محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس فارس  \n(2) ويليام محتال  \n(3) مايسون محتال  \n(4) هنري فارس  \n(5) يوسف فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: كلوي، مايكل، إيما، إيلا، وإسكندر. قالت كلوي إن إيلا فارس أو كلوي فارس. \"إذا كان إسكندر محتالًا، فإن كلوي محتالة\" - مايكل. في تصريح من إيما: \"إسكندر فارس أو إسكندر محتال\". لاحظت إيلا، \"إذا كان مايكل فارسًا، فإن إسكندر فارس\". أخبرك إسكندر أن إيما فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) كلوي فارس  \n(2) مايكل فارس  \n(3) إيما فارس  \n(4) إيلا فارس  \n(5) إسكندر فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: زوي، شارلوت، ميا، يعقوب، وأوين. \"إذا كانت ميا محتالة، فإن شارلوت فارس\"، ادعت زوي. وفقاً لشارلوت، \"يعقوب فارس إذا وفقط إذا كانت ميا محتالة\". ميا صرحت، \"أوين فارس\". يعقوب قال إن يعقوب فارس وزوي فارس. أوين صرح، \"زوي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) زوي فارس  \n(2) شارلوت فارس  \n(3) ميا محتالة  \n(4) يعقوب فارس  \n(5) أوين محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: لوكاس، إليزابيث، أورورا، أيدن، وصموئيل. قال لوكاس: \"إليزابيث ليست فارساً\". وفي كلمات إليزابيث: \"أورورا ليست فارساً\". وفقاً لأورورا، \"إذا كانت أورورا فارساً، فإن إليزابيث محتالة\". أيدن أكد: \"لوكاس محتال أو إليزابيث فارس\". سمع صموئيل يقول: \"إليزابيث ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس فارس  \n(2) إليزابيث محتالة  \n(3) أورورا فارس  \n(4) أيدن محتال  \n(5) صموئيل محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة من السكان: دانيال، فيكتوريا، بنيامين، ميا، وويليام. أكد دانيال: \"ميا فارس وبنيامين فارس\". قالت فيكتوريا: \"إذا كان بنيامين فارساً، فإن بنيامين محتال\". قال بنيامين: \"دانيال ليس محتالاً\". علقت ميا: \"فيكتوريا فارس إذا وفقط إذا كان دانيال فارساً\". قال ويليام: \"إذا كانت فيكتوريا محتالة، فإن ميا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال محتال  \n(2) فيكتوريا فارسة  \n(3) بنيامين محتال  \n(4) ميا محتالة  \n(5) ويليام فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: بنيامين، إميلي، جيمس، إيفلين، ولوكاس. \"إميلي محتالة أو إيفلين فارس\" - بنيامين. في تصريح من إميلي: \"إيفلين محتالة أو إميلي فارس\". وفقًا لجيمس، \"إميلي محتالة أو لوكاس فارس\". أكدت إيفلين: \"إذا كانت إميلي محتالة، فإن إميلي فارس\". في كلمات لوكاس: \"إميلي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين فارس  \n(2) إميلي فارس  \n(3) جيمس محتال  \n(4) إيفلين فارس  \n(5) لوكاس محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة من السكان: ليلي، لوغان، أميليا، ليام، وآفا. \"إذا كانت آفا فارساً، فإن أميليا فارساً\"، ادعت ليلي. \"أميليا فارس إذا وفقط إذا كانت آفا محتالة\"، ذكر لوغان. في كلمات أميليا: \"لوغان فارس إذا وفقط إذا كان ليام محتالاً\". ليام عبر عن أن ليلي فارس وآفا فارس. آفا عبرت أنه إذا كان لوغان فارساً، فإن ليلي فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي فارس  \n(2) لوغان محتال  \n(3) أميليا فارس  \n(4) ليام فارس  \n(5) آفا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: ميا، بينيلوب، هاربر، مايكل، وصوفيا. قالت ميا: \"ميا فارس أو صوفيا فارس\". أعلنت بينيلوب: \"إذا كانت ميا فارسًا، فإن هاربر فارس\". وفقًا لهاربر، \"إذا كان مايكل فارسًا، فإن ميا فارس\". كما قال مايكل: \"إذا كان هاربر محتالكًا، فإن بينيلوب فارس\". أكدت صوفيا: \"مايكل ليس محتالكًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا فارس  \n(2) بينيلوب فارس  \n(3) هاربر فارس  \n(4) مايكل فارس  \n(5) صوفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: أفري، كلوي، دانيال، أبيجيل، وإليزابيث. \"إذا كانت كلوي محتالة، فإن دانيال فارس\"، أعلن أفري. \"أفري محتالة ودانيال فارس\"، ادعت كلوي. \"إذا كانت إليزابيث محتالة، فإن كلوي فارس\"، ادعى دانيال. قالت أبيجيل، \"دانيال محتال إذا وفقط إذا كانت أفري محتالة\". \"أفري محتالة إذا وفقط إذا كانت إليزابيث فارس\" - إليزابيث. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري محتالة  \n(2) كلوي محتالة  \n(3) دانيال محتال  \n(4) أبيجيل فارس  \n(5) إليزابيث محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: سباستيان، زوي، إسكندر، رايلي، ونوح. كما قال سباستيان، \"إذا كان إسكندر محتالاً، فإن زوي محتالة\". \"نوح فارس أو سباستيان فارس\"، ادعت زوي. أشار إسكندر، \"إذا كان سباستيان محتالاً، فإن سباستيان فارس\". علق رايلي، \"سباستيان فارس\". صرح نوح، \"زوي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سباستيان فارس  \n(2) زوي فارس  \n(3) إسكندر فارس  \n(4) رايلي فارس  \n(5) نوح محتار"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: آفا، أوليفر، فيكتوريا، أميليا، ولوكاس. قالت آفا: \"أوليفر فارس وفيكتوريا محتالة\". قال أوليفر: \"لوكاس فارس إذا وفقط إذا كانت فيكتوريا فارسة\". علقت فيكتوريا: \"أميليا ليست فارسة\". أخبرتك أميليا أن آفا فارسة وفيكتوريا محتالة. وفي كلمات لوكاس: \"إذا كان لوكاس فارسًا، فإن فيكتوريا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا محتالة  \n(2) أوليفر فارس  \n(3) فيكتوريا فارسة  \n(4) أميليا محتالة  \n(5) لوكاس فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: فيكتوريا، مايسون، أبيجيل، صموئيل، وأورورا. أكدت فيكتوريا: \"فيكتوريا فارس إذا وفقط إذا كانت أبيجيل فارسة\". \"صموئيل محتار إذا وفقط إذا كانت فيكتوريا محتالة\" - مايسون. في بيان من أبيجيل: \"صموئيل فارس\". صرح صموئيل، \"فيكتوريا فارسة وأبيجيل فارسة\". أعربت أورورا عن أن صموئيل محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) فيكتوريا فارس  \n(2) مايسون فارس  \n(3) أبيجيل فارس  \n(4) صموئيل فارس  \n(5) أورورا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: صوفيا، بنيامين، يوسف، فيكتوريا، وإسكندر. صوفيا أكدت: \"يوسف ليس فارسًا\". قال بنيامين: \"يوسف محتار\". أخبرك يوسف أنه إذا كان إسكندر محتالًا، فإن صوفيا محتالة. وفي كلمات فيكتوريا: \"يوسف محتال وبنيامين محتال\". أشار إسكندر: \"فيكتوريا ليست فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا محتالة  \n(2) بنيامين محتال  \n(3) يوسف فارس  \n(4) فيكتوريا محتالة  \n(5) إسكندر فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: أبيجيل، إليزابيث، يوسف، بنيامين، وصوفيا. قالت أبيجيل: \"أبيجيل فارس وصوفيا فارس.\" كما قالت إليزابيث: \"أبيجيل فارس إذا وفقط إذا كانت أبيجيل محتالة.\" قال يوسف: \"بنيامين محتال أو أبيجيل فارس.\" أعلن بنيامين: \"صوفيا محتالة وصوفيا فارس.\" كما قالت صوفيا: \"يوسف محتال إذا وفقط إذا كانت أبيجيل فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أبيجيل محتالة  \n(2) إليزابيث محتالة  \n(3) يوسف فارس  \n(4) بنيامين محتال  \n(5) صوفيا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: إيزابيلا، إميلي، إيلا، صموئيل، وأميليا. قالت إيزابيلا: \"صموئيل فارس أو صموئيل محتال\". أعلنت إميلي: \"أميليا محتالة أو إيلا فارس\". لاحظت إيلا: \"إميلي ليست محتالة\". سمع صموئيل يقول: \"إيلا ليست محتالة\". أعلنت أميليا: \"صموئيل محتال وإيلا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا فارس  \n(2) إميلي فارس  \n(3) إيلا فارس  \n(4) صموئيل فارس  \n(5) أميليا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: ويليام، مايسون، يوسف، لوكاس، وفيكتوريا. قال ويليام: \"لوكاس محتال أو مايسون فارس\". أكد مايسون: \"فيكتوريا فارس\". قال يوسف: \"إذا كان مايسون محتالًا، فإن مايسون فارس\". أعلن لوكاس: \"فيكتوريا فارس وويليام فارس\". علقت فيكتوريا: \"إذا كان لوكاس فارسًا، فإن ويليام فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام فارس  \n(2) مايسون فارس  \n(3) يوسف فارس  \n(4) لوكاس فارس  \n(5) فيكتوريا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة من السكان: سكارليت، مايكل، إيثان، غريس، ويوسف. وفقاً لسكارليت، \"يوسف فارس إذا وفقط إذا كان إيثان فارساً\". \"إيثان فارس أو يوسف محتار\" - مايكل. \"سكارليت ليست فارساً\"، ادعى إيثان. غريس علقت، \"مايكل ليس فارساً\". \"إذا كانت سكارليت فارساً، فإن مايكل محتار\" - يوسف. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سكارليت فارس  \n(2) مايكل فارس  \n(3) إيثان محتال  \n(4) غريس محتالة  \n(5) يوسف محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: إسكندر، جيمس، صوفيا، كلوي، وميا. قال إسكندر: \"ميا فارس\". علق جيمس: \"كلوي محتالة أو إسكندر محتال\". أعلنت صوفيا: \"كلوي محتالة\". لاحظت كلوي: \"جيمس فارس وإسكندر فارس\". قالت ميا إن كلوي فارس إذا وفقط إذا كانت صوفيا فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إسكندر محتال  \n(2) جيمس فارس  \n(3) صوفيا فارس  \n(4) كلوي محتالة  \n(5) ميا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: زوي، صوفيا، مايكل، ماثيو، ولوغان. في كلمات زوي: \"لوغان فارس\". في كلمات صوفيا: \"لوغان فارس أو لوغان محتال\". \"ماثيو فارس\"، ادعى مايكل. \"إذا كانت زوي فارسًا، فإن صوفيا فارس\"، ذكر ماثيو. قال لوغان إن ماثيو محتال أو مايكل محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) زوي محتالة  \n(2) صوفيا فارسة  \n(3) مايكل فارس  \n(4) ماثيو فارس  \n(5) لوغان محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: جيمس، صوفيا، ليام، أيدن، وإيلا. كما قال جيمس، \"صوفيا فارس إذا وفقط إذا كانت صوفيا محتالة\". \"إيلا ليست فارسة\"، ادعت صوفيا. \"أيدن فارس\"، أعلن ليام. قال أيدن إن صوفيا فارس أو إيلا محتالة. علقت إيلا، \"ليام محتال وصوفيا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس محتال  \n(2) صوفيا فارسة  \n(3) ليام فارس  \n(4) أيدن فارس  \n(5) إيلا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: هاربر، إيزابيلا، ميا، إيما، وجيمس. كما قالت هاربر: \"إيزابيلا محتالة أو إيزابيلا فارسة\". صرحت إيزابيلا: \"هاربر فارسة أو جيمس فارس\". \"إيما ليست محتالة\"، ذكرت ميا. \"إذا كانت ميا محتالة، فإن هاربر فارس\"، ادعت إيما. جيمس أكد: \"إذا كانت إيزابيلا فارسة، فإن ميا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر فارس  \n(2) إيزابيلا فارس  \n(3) ميا فارس  \n(4) إيما فارس  \n(5) جيمس فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: أوين، فيكتوريا، نوح، رايلي، وليلي. قال أوين: \"أوين فارس إذا وفقط إذا كانت فيكتوريا فارسة.\" قالت فيكتوريا إنه إذا كان نوح فارساً، فإن نوح محتال. وفقاً لنوح، \"أوين محتال إذا وفقط إذا كانت رايلي محتالة\". قالت رايلي إن رايلي فارس وأن نوح فارس. قالت ليلي: \"إذا كان نوح فارساً، فإن أوين فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين فارس  \n(2) فيكتوريا فارسة  \n(3) نوح محتال  \n(4) رايلي محتالة  \n(5) ليلي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: إيما، ليام، ليلي، كلوي، وزوي. في كلمات إيما: \"ليام محتال وكلوي محتالة\". قال ليام إن زوي فارس. علقت ليلي، \"زوي ليست محتالة\". وفقاً لكلوي، \"ليام ليس محتالاً\". \"إذا كانت زوي فارساً، فإن ليام فارس\"، ادعت زوي. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما محتالة  \n(2) ليام فارس  \n(3) ليلي فارسة  \n(4) كلوي فارسة  \n(5) زوي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: إميلي، أورورا، زوي، أوليفيا، ونوح. سُمعت إميلي تقول: \"إذا كانت أورورا محتالة، فإن أوليفيا فارس\". قالت أورورا إن أوليفيا ليست فارسًا. في تصريح من زوي: \"أورورا محتالة إذا وفقط إذا كانت أوليفيا فارسًا\". قالت أوليفيا: \"إميلي فارس إذا وفقط إذا كان نوح محتالًا\". صرح نوح: \"أورورا فارس أو زوي فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي فارس  \n(2) أورورا فارس  \n(3) زوي فارس  \n(4) أوليفيا محتالة  \n(5) نوح فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: إميلي، أوليفر، إيزابيلا، أوليفيا، وسباستيان. في تصريح من إميلي: \"أوليفيا محتالة\". قال أوليفر: \"إيزابيلا محتالة\". عبرت إيزابيلا عن أن إميلي فارس إذا وفقط إذا كان أوليفر محتالاً. لاحظت أوليفيا: \"أوليفر فارس\". ذكر سباستيان: \"إذا كان سباستيان فارساً، فإن أوليفر محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي فارس  \n(2) أوليفر محتال  \n(3) إيزابيلا فارس  \n(4) أوليفيا محتالة  \n(5) سباستيان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: صوفيا، إميلي، آفا، داوود، وجاكسون. صرحت صوفيا: \"آفا فارس وصوفيا فارس\". لاحظت إميلي، \"صوفيا محتالة إذا وفقط إذا كانت آفا محتالة\". وفقاً لآفا، \"إميلي فارس أو صوفيا فارس\". أعرب داوود عن أن صوفيا محتالة وجاكسون فارس. سمع جاكسون يقول، \"إميلي فارس إذا وفقط إذا كانت صوفيا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) إميلي فارس  \n(3) آفا فارس  \n(4) داوود محتار  \n(5) جاكسون محتار"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: لوغان، أبيجيل، ليام، هنري، ونوح. قال لوغان: \"نوح ليس محتالًا\". علق أبيجيل: \"إذا كان لوغان فارسًا، فإن هنري فارس\". أعرب ليام عن أن \"إذا كان هنري فارسًا، فإن أبيجيل فارسًا\". في كلمات هنري: \"ليام فارس إذا وفقط إذا كانت أبيجيل محتالة\". \"إذا كان ليام فارسًا، فإن نوح فارس\" - نوح. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان محتال  \n(2) أبيجيل فارس  \n(3) ليام فارس  \n(4) هنري محتال  \n(5) نوح محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: آفا، إيزابيلا، زوي، ليلي، وإيما. \"آفا فارس أو ليلي فارس\"، ذكرت آفا. \"ليلي محتالة\"، أعلنت إيزابيلا. زوي أخبرتك أن إيزابيلا فارس إذا وفقط إذا كانت آفا محتالة. تم سماع ليلي تقول، \"آفا فارس أو إيما فارس\". \"زوي فارس\"، ذكرت إيما. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا فارس  \n(2) إيزابيلا محتالة  \n(3) زوي فارس  \n(4) ليلي فارس  \n(5) إيما فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: ويليام، آفا، أيدن، إسكندر، ولوك. أعرب ويليام عن أنه إذا كان إسكندر محتالاً، فإن ويليام فارس. أعربت آفا عن أنه إذا كان إسكندر فارساً، فإن إسكندر محتال. علق أيدن، \"آفا محتالة أو ويليام فارس\". كما قال إسكندر، \"أيدن محتال\". \"أيدن فارس\"، ذكر لوك. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام فارس  \n(2) آفا فارس  \n(3) أيدن فارس  \n(4) إسكندر محتال  \n(5) لوك فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: جاكسون، لوك، إميلي، يعقوب، وأورورا. علق جاكسون قائلاً: \"إميلي فارس أو لوك محتال\". سمع لوك يقول: \"أورورا فارس وأورورا محتالة\". في تصريح من إميلي: \"إذا كان يعقوب فارساً، فإن لوك محتال\". صرح يعقوب: \"إذا كانت إميلي فارساً، فإن جاكسون فارس\". قالت أورورا: \"جاكسون فارس أو إميلي فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون فارس  \n(2) لوك محتال  \n(3) إميلي فارس  \n(4) يعقوب فارس  \n(5) أورورا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: لوكاس، سباستيان، صموئيل، أميليا، وإيثان. سمع لوكاس يقول: \"إيثان ليس محتالاً\". أخبرك سباستيان أن إيثان فارس وأن سباستيان فارس. صرح صموئيل: \"إذا كان صموئيل فارساً، فإن سباستيان محتال\". في كلمات أميليا: \"إيثان ليس محتالاً\". \"سباستيان محتال\"، ذكر إيثان. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس فارس  \n(2) سباستيان محتال  \n(3) صموئيل فارس  \n(4) أميليا فارس  \n(5) إيثان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: أميليا، آفا، شارلوت، إيلا، وسباستيان. سُمعت أميليا تقول، \"سباستيان محتال إذا وفقط إذا كانت شارلوت محتالة\". لاحظت آفا، \"آفا فارس أو شارلوت محتالة\". صرحت شارلوت، \"سباستيان ليس فارساً\". \"أميليا محتالة وآفا فارس\"، ادعت إيلا. قال سباستيان، \"إذا كانت إيلا فارسة، فإن آفا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا محتالة  \n(2) آفا فارسة  \n(3) شارلوت محتالة  \n(4) إيلا فارسة  \n(5) سباستيان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: جاكسون، إليزابيث، سباستيان، ويليام، ولوكاس. أعرب جاكسون عن أن ويليام ليس محتالًا. لاحظت إليزابيث: \"ويليام فارس أو جاكسون فارس\". أعرب سباستيان أن جاكسون فارس إذا وفقط إذا كانت إليزابيث محتالة. بكلمات ويليام: \"لوكاس محتال وجاكسون فارس\". بكلمات لوكاس: \"ويليام فارس وإليزابيث فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون محتال  \n(2) إليزابيث محتالة  \n(3) سباستيان محتال  \n(4) ويليام محتال  \n(5) لوكاس محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: إميلي، إيزابيلا، صوفيا، صموئيل، وأميليا. كما قالت إميلي: \"صموئيل محتال أو إيزابيلا محتالة\". \"صموئيل ليس محتالًا\"، ذكرت إيزابيلا. قالت صوفيا إن إميلي محتالة وأميليا محتالة. في تصريح من صموئيل: \"إذا كان صموئيل فارسًا، فإن أميليا محتالة\". وفقًا لأميليا، \"إذا كانت إميلي محتالة، فإن إميلي فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي محتالة  \n(2) إيزابيلا فارسة  \n(3) صوفيا فارسة  \n(4) صموئيل فارس  \n(5) أميليا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: أوليفيا، إيزابيلا، نوح، كلوي، وأفري. قالت أوليفيا إن كلوي محتالة. في تصريح لإيزابيلا: \"نوح فارس إذا وفقط إذا كانت أفري محتالة\". قال نوح: \"أفري ليست محتالة\". كما قالت كلوي: \"إيزابيلا محتالة ونوح محتال\". وفي كلمات أفري: \"أوليفيا محتالة أو كلوي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا فارس  \n(2) إيزابيلا محتالة  \n(3) نوح فارس  \n(4) كلوي محتالة  \n(5) أفري فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: أوليفر، مايسون، إسكندر، إيزابيلا، ورايلي. قال أوليفر: \"رايلي محتالة.\" وذكر مايسون: \"إسكندر ليس فارسًا.\" ادعى إسكندر: \"رايلي محتالة إذا وفقط إذا كانت إيزابيلا محتالة.\" أكدت إيزابيلا: \"أوليفر محتال.\" في تصريح لرايلي: \"أوليفر فارس وأوليفر محتال.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفر فارس  \n(2) مايسون محتال  \n(3) إسكندر فارس  \n(4) إيزابيلا محتالة  \n(5) رايلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: سكارليت، لوك، كلوي، غريس، وجاك. قالت سكارليت إن كلوي محتالة إذا وفقط إذا كانت كلوي فارسة. قال لوك: إذا كان لوك فارساً، فإن غريس فارسة. علقت كلوي، \"لوك فارس أو غريس فارسة\". في بيان من غريس: \"جاك فارس أو غريس فارسة\". كما قال جاك، \"لوك محتال وغريس محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سكارليت محتالة  \n(2) لوك فارس  \n(3) كلوي فارس  \n(4) غريس فارس  \n(5) جاك محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: سباستيان، ماثيو، أوليفيا، مايسون، وبنيامين. قال سباستيان: \"إذا كان ماثيو فارساً، فإن أوليفيا فارس.\" ادعى ماثيو: \"مايسون محتال أو بنيامين محتال.\" في بيان من أوليفيا: \"سباستيان فارس أو بنيامين محتال.\" علق مايسون: \"سباستيان محتال.\" ذكر بنيامين: \"أوليفيا فارس أو أوليفيا محتالة.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سباستيان فارس  \n(2) ماثيو فارس  \n(3) أوليفيا فارس  \n(4) مايسون محتال  \n(5) بنيامين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: لوك، أوليفيا، آريا، هنري، وأميليا. \"هنري فارس وأوليفيا فارس\"، ادعى لوك. \"أميليا محتالة إذا وفقط إذا كانت آريا محتالة\" - أوليفيا. في كلمات آريا: \"لوك محتال إذا وفقط إذا كان هنري محتالًا\". أخبرك هنري أنه إذا كان لوك فارسًا، فإن آريا فارس. أميليا لاحظت، \"آريا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) أوليفيا فارسة  \n(3) آريا فارسة  \n(4) هنري فارس  \n(5) أميليا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: إيثان، مايسون، ويليام، يوسف، وأميليا. كما قال إيثان: \"إذا كان يوسف محتالًا، فإن مايسون محتال\". \"إيثان فارس إذا وفقط إذا كان إيثان محتالًا\"، ذكر مايسون. \"أميليا فارس إذا وفقط إذا كان ويليام فارسًا\"، أعلن ويليام. \"ويليام ليس محتالًا\"، ذكر يوسف. في كلمات أميليا: \"إيثان فارس ويوسف محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان فارس  \n(2) مايسون محتال  \n(3) ويليام محتال  \n(4) يوسف محتال  \n(5) أميليا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة من السكان: مايسون، أوليفر، هنري، ليلي، وليام. كما قال مايسون: \"ليلي ليست محتالة\". بكلمات أوليفر: \"ليلي محتالة أو ليام فارس\". هنري أكد: \"ليام فارس ومايسون فارس\". في تصريح ليلي: \"أوليفر محتال\". كما قال ليام: \"هنري محتال أو أوليفر محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايسون محتال  \n(2) أوليفر فارس  \n(3) هنري محتال  \n(4) ليلي محتالة  \n(5) ليام فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: أيدن، مايكل، كلوي، إسكندر، ونوح. وفقاً لأيدن، \"أيدن فارس أو إسكندر محتال\". \"أيدن فارس إذا وفقط إذا كانت كلوي فارساً\"، أعلن مايكل. قالت كلوي، \"مايكل فارس إذا وفقط إذا كان نوح محتالاً.\" في تصريح لإسكندر: \"كلوي فارس وكلوي محتالة\". وفقاً لنوح، \"مايكل محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن فارس  \n(2) مايكل فارس  \n(3) كلوي فارس  \n(4) إسكندر محتال  \n(5) نوح محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: صموئيل، ليلي، ماثيو، إيزابيلا، وشارلوت. صموئيل أكد: \"ماثيو ليس فارساً\". في تصريح ليلي: \"ماثيو فارس وصموئيل فارس\". ماثيو أخبرك أنه إذا كان صموئيل فارساً، فإن إيزابيلا فارس. تم سماع إيزابيلا تقول: \"إذا كانت شارلوت محتالة، فإن ماثيو محتال\". شارلوت قالت إن ليلي محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صموئيل محتال  \n(2) ليلي محتالة  \n(3) ماثيو فارس  \n(4) إيزابيلا فارسة  \n(5) شارلوت فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: يوسف، أفري، إيلا، فيكتوريا، وإيميلي. \"إذا كانت إيميلي فارساً، فإن إيلا فارساً\"، ذكر يوسف. كما قالت أفري: \"إيلا فارس وإيميلي فارس\". كما قالت إيلا: \"أفري محتالة إذا وفقط إذا كانت أفري فارساً\". \"إذا كانت إيميلي فارساً، فإن أفري محتالة\"، ادعت فيكتوريا. في بيان من إيميلي: \"أفري فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف فارس  \n(2) أفري محتالة  \n(3) إيلا محتالة  \n(4) فيكتوريا فارسة  \n(5) إميلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: غريس، صوفيا، إيفلين، أوليفر، وإيثان. قالت غريس إن صوفيا محتالة. علقت صوفيا، \"إيثان فارس\". أكدت إيفلين: \"إيثان فارس\". أشار أوليفر، \"صوفيا فارس وأوليفر فارس\". أعلن إيثان، \"إيفلين محتالة إذا وفقط إذا كان أوليفر محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) غريس محتالة  \n(2) صوفيا فارسة  \n(3) إيفلين فارسة  \n(4) أوليفر فارس  \n(5) إيثان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة من السكان: مايكل، جاكسون، إليزابيث، بينيلوب، وأوليفيا. \"أوليفيا ليست فارساً\"، ذكر مايكل. \"إليزابيث فارس أو أوليفيا فارس\" - جاكسون. إليزابيث لاحظت، \"إليزابيث فارس وجاكسون محتـال\". \"إذا كان مايكل محتـالاً، فإن أوليفيا فارس\"، ذكرت بينيلوب. \"بينيلوب محتـالة أو بينيلوب فارس\"، ادعت أوليفيا. فمن هو الفارس ومن هو المحتـال؟",
        "solution_text_format": "(1) مايكل محتال  \n(2) جاكسون فارس  \n(3) إليزابيث محتالة  \n(4) بينيلوب فارسة  \n(5) أوليفيا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: أورورا، نوح، داوود، أيدن، وشارلوت. وفقاً لأورورا، \"شارلوت محتالة أو أيدن فارس\". كما قال نوح، \"إذا كان داوود محتالاً، فإن شارلوت محتالة\". داوود عبر عن أنه إذا كانت أورورا محتالة، فإن أيدن فارس. \"أيدن فارس أو شارلوت فارس\"، أعلن أيدن. \"أيدن محتال إذا وفقط إذا كان داوود فارساً\"، ادعت شارلوت. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أورورا فارس  \n(2) نوح فارس  \n(3) داوود فارس  \n(4) أيدن فارس  \n(5) شارلوت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: صوفيا، أميليا، ليام، هاربر، وشارلوت. في تصريح لصوفيا: \"صوفيا فارس إذا وفقط إذا كانت أميليا محتالة\". كما قالت أميليا: \"هاربر فارس إذا وفقط إذا كان ليام فارسًا\". في تصريح ليام: \"إذا كانت صوفيا محتالة، فإن صوفيا فارس\". كما قالت هاربر: \"ليام فارس إذا وفقط إذا كانت شارلوت فارسًا\". عبرت شارلوت عن أنه إذا كان ليام فارسًا، فإن هاربر فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) أميليا محتالة  \n(3) ليام فارس  \n(4) هاربر محتالة  \n(5) شارلوت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: ليلي، لوغان، لوك، نوح، وأوليفر. كما قالت ليلي: \"لوغان محتـال\". \"ليلي فارس إذا وفقط إذا كان نوح محتـالًا\"، ذكر لوغان. كما قال لوك: \"لوغان فارس إذا وفقط إذا كان نوح محتـالًا\". وفقًا لنوح، \"إذا كان نوح فارسًا، فإن لوك فارس\". قال أوليفر إنه إذا كان لوغان محتـالًا، فإن لوك فارس. فمن هو الفارس ومن هو المحتـال؟",
        "solution_text_format": "(1) ليلي فارس  \n(2) لوغان محتار  \n(3) لوك فارس  \n(4) نوح فارس  \n(5) أوليفر فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة من السكان: غريس، إليزابيث، لوك، شارلوت، وإيما. قالت غريس: \"إذا كانت إيما فارسة، فإن إيما محتالة\". وفي تصريح إليزابيث: \"لوك محتال إذا وفقط إذا كانت إيما فارسة\". علق لوك: \"إيما ليست فارسة\". أكدت شارلوت: \"شارلوت فارسة وإليزابيث محتالة\". \"شارلوت فارسة\"، ذكرت إيما. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) غريس فارس  \n(2) إليزابيث فارس  \n(3) لوك فارس  \n(4) شارلوت محتالة  \n(5) إيما محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة من السكان: أيدن، بنيامين، إميلي، داوود، وأوين. أيدن قال: \"أوين فارس إذا وفقط إذا كان داوود فارسًا\". بنيامين أشار: \"إميلي فارس إذا وفقط إذا كان أوين فارسًا\". إميلي قالت: \"بنيامين ليس فارسًا\". داوود سمع وهو يقول: \"أوين فارس\". \"إميلي فارس أو أوين فارس\"، ادعى أوين. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن فارس  \n(2) بنيامين فارس  \n(3) إميلي محتالة  \n(4) داوود محتال  \n(5) أوين محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة من السكان: لوغان، إيزابيلا، لوك، إيثان، وصوفيا. قال لوغان: \"إيزابيلا فارس ولوك محتال\". وأشارت إيزابيلا: \"لوك محتال\". كما قال لوك: \"إذا كان لوك فارساً، فإن إيثان فارس\". وادعى إيثان: \"لوك فارس وصوفيا فارس\". وأشارت صوفيا: \"إيزابيلا ليست فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان محتار  \n(2) إيزابيلا محتالة  \n(3) لوك فارس  \n(4) إيثان فارس  \n(5) صوفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: إيفلين، يوسف، صوفيا، لوك، وجيمس. قالت إيفلين: \"يوسف محتال أو إيفلين فارس\". علق يوسف: \"إذا كان لوك محتالًا، فإن جيمس فارس\". أعلنت صوفيا: \"صوفيا فارس أو لوك فارس\". أكد لوك: \"إيفلين محتالة وصوفيا محتالة\". سمع جيمس يقول: \"إذا كانت إيفلين فارسًا، فإن يوسف محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين محتالة  \n(2) يوسف فارس  \n(3) صوفيا فارس  \n(4) لوك محتال  \n(5) جيمس فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: ليلي، رايلي، ويليام، آريا، وداوود. \"رايلي ليس فارسًا\"، ذكرت ليلي. في كلمات رايلي: \"داوود فارس\". سمع ويليام يقول: \"ليلي فارس\". في كلمات آريا: \"ليلي فارس إذا وفقط إذا كان ويليام فارسًا\". قال داوود إن آريا ليست محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي محتالة  \n(2) رايلي فارس  \n(3) ويليام محتال  \n(4) آريا فارس  \n(5) داوود فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: يعقوب، مايسون، لوكاس، بنيامين، وسباستيان. \"لوكاس فارس إذا وفقط إذا كان سباستيان محتالًا\" - يعقوب. مايسون أكد: \"مايسون فارس أو يعقوب محتال\". وفقًا للوكاس، \"سباستيان محتال ويعقوب محتال\". بنيامين علق، \"سباستيان ليس فارسًا\". سباستيان قال إن مايسون فارس إذا وفقط إذا كان يعقوب فارسًا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب فارس  \n(2) مايسون فارس  \n(3) لوكاس محتال  \n(4) بنيامين محتال  \n(5) سباستيان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: ميا، صموئيل، أميليا، صوفيا، وهنري. قالت ميا: \"صموئيل محتال إذا وفقط إذا كانت صوفيا محتالة\". كما قال صموئيل: \"أميليا فارس أو أميليا محتالة\". في تصريح لأميليا: \"هنري محتال\". قالت صوفيا: \"أميليا محتالة وصموئيل فارس\". قال هنري: \"صوفيا فارس وميا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا محتالة  \n(2) صموئيل فارس  \n(3) أميليا فارس  \n(4) صوفيا محتالة  \n(5) هنري محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة من السكان: أورورا، دانيال، بنيامين، إيزابيلا، وأيدن. \"أيدن ليس محتالًا\"، ادعت أورورا. سمع دانيال يقول، \"إيزابيلا محتالة إذا وفقط إذا كانت إيزابيلا فارسة\". وفقًا لبنيامين، \"إذا كان أيدن فارسًا، فإن دانيال فارس\". أعربت إيزابيلا عن أنه إذا كان دانيال محتالًا، فإن بنيامين فارس. أشار أيدن، \"دانيال محتال إذا وفقط إذا كان دانيال فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أورورا محتالة  \n(2) دانيال محتال  \n(3) بنيامين فارس  \n(4) إيزابيلا فارسة  \n(5) أيدن محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: إيما، لوغان، لوك، سكارليت، ولوكاس. \"لوكاس محتال وسكارليت محتالة\"، ادعت إيما. كما قال لوغان، \"إيما فارس إذا وفقط إذا كانت إيما محتالة\". \"لوغان محتال إذا وفقط إذا كانت سكارليت فارسة\" - لوك. سُمع سكارليت يقول، \"إذا كانت إيما فارسة، فإن لوغان فارس\". كما قال لوكاس، \"إيما فارسة وسكارليت محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما محتالة  \n(2) لوغان محتال  \n(3) لوك فارس  \n(4) سكارليت فارسة  \n(5) لوكاس محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: مايكل، إيلا، إليزابيث، جاك، وأبيجيل. قال مايكل: \"إليزابيث ليست محتالة\". وفي كلمات إيلا: \"جاك فارس إذا وفقط إذا كانت إيلا فارسة\". صرحت إليزابيث: \"إليزابيث فارسة أو جاك فارس\". قال جاك: \"إيلا ليست محتالة\". وفي كلمات أبيجيل: \"مايكل فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل فارس  \n(2) إيلا فارسة  \n(3) إليزابيث فارسة  \n(4) جاك فارس  \n(5) أبيجيل فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: ويليام، داوود، زوي، آفا، وصوفيا. قال ويليام: \"صوفيا محتالة وصوفيا فارس\". \"زوي فارس\" - داوود. صرحت زوي: \"صوفيا فارس إذا وفقط إذا كانت آفا فارس\". قالت آفا: \"داوود محتال أو زوي فارس\". سُمعت صوفيا تقول: \"إذا كانت آفا فارس، فإن آفا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام محتال  \n(2) داوود محتال  \n(3) زوي محتالة  \n(4) آفا فارس  \n(5) صوفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: أوليفيا، آفا، بنيامين، يوسف، وسكارليت. قالت أوليفيا: \"بنيامين فارس أو أوليفيا فارس\". علقت آفا: \"إذا كانت سكارليت محتالة، فإن آفا فارس\". قال بنيامين إنه إذا كان يوسف فارسًا، فإن سكارليت فارس. عبر يوسف عن أن آفا فارس إذا وفقط إذا كانت أوليفيا محتالة. سُمع سكارليت تقول: \"أوليفيا فارس إذا وفقط إذا كانت آفا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا فارس  \n(2) آفا فارس  \n(3) بنيامين فارس  \n(4) يوسف محتار  \n(5) سكارليت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: أيدن، داوود، بينيلوب، صوفيا، وسكارليت. أيدن أعرب عن أن بينيلوب محتالة وسكارليت محتالة. داوود قال إنه إذا كانت سكارليت محتالة، فإن داوود فارس. وفقاً لبينيلوب، \"إذا كانت سكارليت فارسة، فإن أيدن محتال\". وفقاً لصوفيا، \"بينيلوب محتالة وصوفيا فارسة\". سكارليت لاحظت، \"إذا كان داوود فارساً، فإن داوود محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن محتال  \n(2) داوود فارس  \n(3) بينيلوب فارس  \n(4) صوفيا محتالة  \n(5) سكارليت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: مايسون، يوسف، إيما، جاكسون، وإسكندر. قال مايسون: \"جاكسون فارس إذا وفقط إذا كان إسكندر فارساً\". \"إيما فارس ومايسون محتار\" - يوسف. سُمعت إيما تقول: \"إسكندر ليس فارساً\". \"إسكندر فارس إذا وفقط إذا كان يوسف فارساً\"، ادعى جاكسون. قال إسكندر إن مايسون محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايسون محتال  \n(2) يوسف محتال  \n(3) إيما محتالة  \n(4) جاكسون محتال  \n(5) إسكندر فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: دانيال، أبيجيل، يوسف، أميليا، وإيثان. قال دانيال: \"يوسف ليس فارسًا\". \"أميليا فارس وأبيجيل فارس\" - أبيجيل. علق يوسف: \"أميليا محتالة إذا وفقط إذا كانت أبيجيل فارسًا\". قالت أميليا: \"يوسف محتال ودانيال محتال\". في كلمات إيثان: \"أميليا فارس إذا وفقط إذا كان دانيال محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال فارس  \n(2) أبيجيل محتالة  \n(3) يوسف محتال  \n(4) أميليا محتالة  \n(5) إيثان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: ماثيو، آفا، بنيامين، لوكاس، ولوك. وفقاً لماثيو، \"آفا فارس إذا وفقط إذا كان لوكاس فارساً\". \"بنيامين فارس\" - آفا. سمع بنيامين يقول، \"آفا فارس أو ماثيو فارس\". في كلمات لوكاس: \"بنيامين فارس أو ماثيو فارس\". أكد لوك: \"بنيامين محتار إذا وفقط إذا كانت آفا فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ماثيو فارس  \n(2) آفا فارس  \n(3) بنيامين فارس  \n(4) لوكاس فارس  \n(5) لوك محتار"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: شارلوت، هاربر، إليزابيث، ويليام، وبينيلوب. قالت شارلوت إن إليزابيث فارس إذا وفقط إذا كانت بينيلوب فارسًا. \"شارلوت ليست فارسًا\" - هاربر. أخبرتك إليزابيث أن بينيلوب فارس وإليزابيث فارس. سمع ويليام يقول، \"إذا كانت شارلوت محتالة، فإن إليزابيث فارس.\" قالت بينيلوب، \"شارلوت محتالة إذا وفقط إذا كانت شارلوت فارسًا.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت فارس  \n(2) هاربر محتالة  \n(3) إليزابيث محتالة  \n(4) ويليام فارس  \n(5) بينيلوب محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تقابل 5 سكان: أيدن، إميلي، لوغان، يوسف، وزوي. أشار أيدن، \"زوي محتالة أو لوغان محتال\". \"إذا كانت إميلي فارسة، فإن زوي محتالة\"، أعلنت إميلي. في بيان من لوغان: \"إميلي ليست فارسة\". صرح يوسف، \"لوغان محتال أو لوغان فارس\". زوي أخبرتكم أن يوسف محتال وزوي فارسة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن فارس  \n(2) إميلي فارس  \n(3) لوغان محتال  \n(4) يوسف فارس  \n(5) زوي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: أفري، مايسون، إيفلين، إليزابيث، ولوغان. \"إذا كانت إليزابيث فارساً، فإن مايسون فارس\" - ذكرت أفري. أخبرك مايسون أنه إذا كان لوغان فارساً، فإن إيفلين محتالة. \"مايسون فارس وإليزابيث محتالة\" - إيفلين. بحسب كلمات إليزابيث: \"مايسون فارس ومايسون محتال\". وفقاً لوغان، \"إيفلين محتالة ومايسون فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري فارس  \n(2) مايسون فارس  \n(3) إيفلين فارس  \n(4) إليزابيث محتالة  \n(5) لوغان محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: صوفيا، هاربر، أبيجيل، أوليفر، وجاك. قالت صوفيا إن جاك ليس محتالًا. علق هاربر، \"أوليفر فارس وصوفيا فارس\". وفقًا لأبيجيل، \"هاربر فارس وصوفيا محتالة\". وفقًا لأوليفر، \"أبيجيل ليست فارسة\". أخبرك جاك أن جاك فارس وأبيجيل فارسة. إذن من هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا محتالة  \n(2) هاربر محتالة  \n(3) أبيجيل محتالة  \n(4) أوليفر فارس  \n(5) جاك محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: آريا، ميا، أفري، ويليام، وأيدن. قالت آريا لك إن ميا محتالة أو أفري محتالة. \"أيدن ليس محتالاً\"، ادعت ميا. علق أفري، \"آريا ليست محتالة\". \"ميا محتالة وأفري محتالة\"، أعلن ويليام. قال أيدن، \"إذا كانت آريا فارسة، فإن ويليام فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آريا فارس  \n(2) ميا محتالة  \n(3) أفري فارس  \n(4) ويليام محتال  \n(5) أيدن محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة من السكان: ليلي، هنري، يوسف، أميليا، وصوفيا. \"أميليا ليست فارساً\"، أعلنت ليلي. \"أميليا محتالة إذا وفقط إذا كانت ليلي محتالة\"، ادعى هنري. علق يوسف، \"هنري ليس فارساً\". عادت أميليا لتقول، \"إذا كان هنري محتالاً، فإن صوفيا فارس\". كما قالت صوفيا، \"يوسف محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي فارس  \n(2) هنري محتال  \n(3) يوسف فارس  \n(4) أميليا محتالة  \n(5) صوفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: جاكسون، رايلي، أيدن، صوفيا، وصموئيل. \"صوفيا محتالة إذا وفقط إذا كان صموئيل محتالًا\" - جاكسون. أخبرك رايلي أن جاكسون ليس فارسًا. قال أيدن إنه إذا كانت صوفيا محتالة، فإن رايلي محتال. عبرت صوفيا عن أن رايلي ليس فارسًا. أخبرك صموئيل أنه إذا كان جاكسون فارسًا، فإن جاكسون محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون محتال  \n(2) رايلي فارس  \n(3) أيدن محتال  \n(4) صوفيا محتالة  \n(5) صموئيل فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: هاربر، أوليفر، إيما، زوي، ولوك. هاربر عبر عن أن زوي فارس ولوك فارس. أوليفر صرح، \"زوي فارس أو لوك فارس\". إيما أخبرتكم أن لوك فارس وإيما فارس. كما قالت زوي، \"هاربر ليس فارسًا\". لوك قال إن هاربر فارس وإيما محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر محتالة  \n(2) أوليفر فارس  \n(3) إيما محتالة  \n(4) زوي فارس  \n(5) لوك محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: داوود، إيزابيلا، مايكل، سباستيان، وشارلوت. أكد داوود: \"مايكل فارس\". قالت إيزابيلا: \"داوود محتال وشارلوت محتالة.\" وفقًا لمايكل، \"سباستيان فارس إذا وفقط إذا كان مايكل فارسًا\". أشار سباستيان: \"مايكل ليس محتالًا\". صرحت شارلوت: \"إذا كانت شارلوت فارسًا، فإن سباستيان فارس أيضًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود فارس  \n(2) إيزابيلا محتالة  \n(3) مايكل فارس  \n(4) سباستيان فارس  \n(5) شارلوت فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: يعقوب، بينيلوب، إيثان، ماثيو، ونوح. علق يعقوب، \"إيثان محتال\". \"يعقوب فارس وإيثان محتال\"، ادعت بينيلوب. سمع إيثان يقول، \"إذا كانت بينيلوب محتالة، فإن ماثيو محتال\". سمع ماثيو يقول، \"يعقوب فارس أو نوح فارس\". ومن كلمات نوح: \"يعقوب فارس وإيثان فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب محتال  \n(2) بينيلوب محتالة  \n(3) إيثان فارس  \n(4) ماثيو محتال  \n(5) نوح محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: إيثان، أورورا، صوفيا، سكارليت، وجاك. علق إيثان قائلاً: \"سكارليت ليست فارسة\". قالت أورورا إن إيثان فارس وصوفيا فارسة. في تصريح لصوفيا: \"جاك فارس إذا وفقط إذا كانت أورورا محتالة\". أعلنت سكارليت: \"سكارليت فارسة أو جاك محتال\". علق جاك قائلاً: \"إذا كان إيثان فارسًا، فإن سكارليت محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان محتال  \n(2) أورورا محتالة  \n(3) صوفيا فارسة  \n(4) سكارليت فارسة  \n(5) جاك فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: ويليام، إيما، إيزابيلا، إيثان، وأميليا. قال ويليام: \"إذا كانت إيما فارسًا، فإن إيثان محتال\". أعلنت إيما: \"إذا كانت أميليا فارسًا، فإن ويليام فارس\". صرحت إيزابيلا: \"ويليام محتال وأميليا فارس\". أكد إيثان: \"إيثان فارس\". ادعت أميليا: \"إيثان فارس إذا وفقط إذا كانت إيما فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام فارس  \n(2) إيما فارس  \n(3) إيزابيلا محتالة  \n(4) إيثان محتال  \n(5) أميليا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: كلوي، صوفيا، أوليفر، أفري، وشارلوت. \"شارلوت محتالة أو أفري فارس\"، أعلنت كلوي. صوفيا صرحت، \"أفري محتالة وأوليفر محتال\". أوليفر صرح، \"كلوي فارس أو صوفيا فارس\". أفري لاحظت، \"أوليفر ليس محتالاً\". \"أوليفر فارس\" - شارلوت. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) كلوي فارس  \n(2) صوفيا محتالة  \n(3) أوليفر فارس  \n(4) أفري فارس  \n(5) شارلوت فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: بنيامين، ميا، إليزابيث، سباستيان، وداوود. قال بنيامين: \"إليزابيث محتالة أو إليزابيث فارس\". قالت ميا: \"بنيامين فارس وبنيامين محتال\". أعلنت إليزابيث: \"سباستيان محتال أو داوود فارس\". أكد سباستيان: \"ميا محتالة أو سباستيان فارس\". صرح داوود: \"ميا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين فارس  \n(2) ميا محتالة  \n(3) إليزابيث فارس  \n(4) سباستيان فارس  \n(5) داوود فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: جيمس، بنيامين، صوفيا، ماثيو، وجاك. \"جاك فارس أو ماثيو فارس\"، ادعى جيمس. \"ماثيو محتال أو جاك محتال\" - بنيامين. صوفيا أخبرتك أن جاك محتال. كما قال ماثيو: \"صوفيا محتالة إذا وفقط إذا كانت صوفيا فارسة\". في تصريح لجاك: \"ماثيو ليس فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس فارس  \n(2) بنيامين فارس  \n(3) صوفيا محتالة  \n(4) ماثيو محتال  \n(5) جاك فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: أميليا، سكارليت، ميا، أيدن، ومايكل. أخبرتك أميليا أنه إذا كانت ميا محتالة، فإن سكارليت محتالة. كما قالت سكارليت: \"ميا فارس وسكارليت فارس\". وفي كلمات ميا: \"أيدن ليس فارسًا\". وفي تصريح لأيدن: \"إذا كانت سكارليت فارسًا، فإن ميا فارسًا\". قال مايكل: \"إذا كانت سكارليت محتالة، فإن أيدن محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا فارس  \n(2) سكارليت محتالة  \n(3) ميا محتالة  \n(4) أيدن فارس  \n(5) مايكل محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: إيلا، صوفيا، جاك، ماثيو، وليام. أكدت إيلا: \"جاك ليس فارساً\". \"جاك فارس\"، ذكرت صوفيا. \"صوفيا فارس أو ماثيو محتـال\" - جاك. \"إيلا محتالة\"، أعلن ماثيو. قال ليام إن صوفيا محتالة وجاك محتـال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا محتالة  \n(2) صوفيا فارسة  \n(3) جاك فارس  \n(4) ماثيو فارس  \n(5) ليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: يوسف، دانيال، أوين، يعقوب، وآفا. لاحظ يوسف، \"إذا كانت آفا فارسة، فإن يعقوب محتال\". صرح دانيال، \"إذا كان يوسف فارساً، فإن أوين محتال\". علق أوين، \"يوسف فارس أو دانيال فارس\". سمع يعقوب يقول، \"دانيال فارس ويوسف محتال\". سمع آفا تقول، \"يعقوب فارس ودانيال محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف فارس  \n(2) دانيال محتال  \n(3) أوين فارس  \n(4) يعقوب محتال  \n(5) آفا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: يعقوب، غريس، جيمس، أوليفر، وإليزابيث. وفقاً ليعقوب، \"أوليفر فارس إذا وفقط إذا كان جيمس فارساً\". في تصريح من غريس: \"إذا كان يعقوب فارساً، فإن أوليفر محتال\". جيمس أشار، \"أوليفر محتال أو إليزابيث محتالة\". سمع أوليفر يقول، \"غريس ليست محتالة\". \"جيمس محتال أو أوليفر فارس\"، ادعت إليزابيث. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب محتال  \n(2) غريس فارس  \n(3) جيمس محتال  \n(4) أوليفر فارس  \n(5) إليزابيث فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: إميلي، بينيلوب، ويليام، سكارليت، وآفا. عبرت إميلي عن أن ويليام ليس فارساً. عبرت بينيلوب عن أن ويليام فارس أو سكارليت محتالة. \"بينيلوب محتالة إذا وفقط إذا كان ويليام فارساً\"، ادعى ويليام. كما قالت سكارليت، \"آفا محتالة\". لاحظت آفا، \"سكارليت فارس إذا وفقط إذا كانت سكارليت محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي فارس  \n(2) بينيلوب محتالة  \n(3) ويليام محتال  \n(4) سكارليت فارسة  \n(5) آفا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: شارلوت، إسكندر، إيلا، كلوي، وليلي. \"إيلا محتالة إذا وفقط إذا كانت كلوي محتالة\"، أعلنت شارلوت. \"كلوي ليست فارسة\"، ادعى إسكندر. أكدت إيلا: \"ليلي فارسة أو شارلوت فارسة\". كما قالت كلوي: \"إذا كان إسكندر محتالاً، فإن شارلوت محتالة\". علقت ليلي، \"كلوي ليست فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت محتالة  \n(2) إسكندر محتال  \n(3) إيلا محتالة  \n(4) كلوي فارس  \n(5) ليلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: هنري، أفري، كلوي، أوليفر، وإيفلين. سمع هنري يقول: \"كلوي فارس\". أفري قال إن إيفلين محتالة إذا وفقط إذا كانت إيفلين فارسة. قالت كلوي إن أفري محتالة. أخبرك أوليفر أن كلوي محتالة أو أفري فارس. \"كلوي فارس\"، ادعت إيفلين. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هنري فارس  \n(2) أفري محتالة  \n(3) كلوي فارس  \n(4) أوليفر محتال  \n(5) إيفلين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: ويليام، أميليا، يعقوب، أيدن، وصموئيل. قال لك ويليام: \"إذا كان صموئيل محتالًا، فإن يعقوب محتال\". أميليا لاحظت: \"صموئيل محتال أو ويليام محتال\". أكد يعقوب: \"صموئيل فارس أو صموئيل محتال\". في كلمات أيدن: \"إذا كانت أميليا محتالة، فإن أيدن فارس\". \"أيدن فارس\" - صموئيل. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام فارس  \n(2) أميليا محتالة  \n(3) يعقوب فارس  \n(4) أيدن فارس  \n(5) صموئيل فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: ليام، أوليفيا، إميلي، إيزابيلا، وإيفلين. وفقًا ليام، \"أوليفيا محتالة\". أوليفيا عبرت عن أن إميلي فارس. إميلي أخبرتكم أن أوليفيا فارس وإيفلين فارس. إيزابيلا قالت، \"أوليفيا محتالة وإميلي محتالة.\" \"إميلي فارس إذا وفقط إذا كانت إميلي محتالة\"، ادعت إيفلين. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام فارس  \n(2) أوليفيا محتالة  \n(3) إميلي محتالة  \n(4) إيزابيلا فارس  \n(5) إيفلين محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة من السكان: هنري، رايلي، إميلي، مايسون، وصموئيل. قال هنري إن مايسون فارس أو صموئيل محتال. في تصريح لرايلي: \"هنري محتال أو إميلي محتالة\". أكدت إميلي: \"هنري ليس محتالاً\". قال مايسون: \"إميلي فارس إذا وفقط إذا كان صموئيل محتالاً\". \"رايلي ليس محتالاً\" - صموئيل. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هنري فارس  \n(2) رايلي محتالة  \n(3) إميلي فارس  \n(4) مايسون فارس  \n(5) صموئيل محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: أوليفر، بينيلوب، أوليفيا، آفا، وصموئيل. وفقاً لأوليفر، \"بينيلوب ليست فارساً\". أخبرتك بينيلوب أن أوليفيا ليست فارساً. أكدت أوليفيا: \"آفا محتالة\". علق آفا، \"أوليفر محتال وأوليفيا فارسة\". صرح صموئيل: \"بينيلوب محتالة أو بينيلوب فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفر فارس  \n(2) بينيلوب محتالة  \n(3) أوليفيا فارس  \n(4) آفا محتالة  \n(5) صموئيل فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: أورورا، أوليفر، أبيجيل، لوك، ومايسون. قالت أورورا: \"أوليفر ليس فارساً\". علق أوليفر: \"إذا كان لوك محتالاً، فإن مايسون محتال\". وفقاً لأبيجيل، \"أورورا ليست فارساً\". قال لوك: \"إذا كان أوليفر فارساً، فإن أبيجيل محتالة\". ادعى مايسون: \"أورورا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أورورا محتالة  \n(2) أوليفر فارس  \n(3) أبيجيل فارس  \n(4) لوك محتال  \n(5) مايسون محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: أفري، سباستيان، لوغان، إيثان، وبينيلوب. كما قالت أفري، \"سباستيان فارس إذا وفقط إذا كان إيثان فارساً\". سباستيان عبر عن أن إيثان فارس. \"لوغان فارس وسباستيان فارس\"، ادعى لوغان. قال إيثان إن لوغان محتال إذا وفقط إذا كان لوغان فارساً. علقّت بينيلوب، \"إذا كان لوغان فارساً، فإن لوغان محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري فارس  \n(2) سباستيان محتال  \n(3) لوغان محتال  \n(4) إيثان محتال  \n(5) بينيلوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة من السكان: ميا، آفا، سكارليت، إميلي، وليلي. لاحظت ميا: \"إذا كانت إميلي فارسًا، فإن آفا محتالة\". أكدت آفا: \"ميا محتالة إذا وفقط إذا كانت إميلي محتالة\". سُمع سكارليت يقول: \"ليلي ليست محتالة\". كما قالت إميلي: \"ليلي ليست محتالة\". في بيان من ليلي: \"آفا ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا فارس  \n(2) آفا محتالة  \n(3) سكارليت محتالة  \n(4) إميلي محتالة  \n(5) ليلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: يعقوب، كلوي، بينيلوب، أفري، وسكارليت. علق يعقوب، \"بينيلوب محتالة\". قالت كلوي، \"سكارليت فارس أو أفري محتالة\". أكدت بينيلوب: \"أفري فارس إذا وفقط إذا كانت كلوي فارسة\". سمع أفري يقول، \"إذا كان يعقوب محتالًا، فإن بينيلوب محتالة\". كما قالت سكارليت، \"كلوي ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب فارس  \n(2) كلوي محتالة  \n(3) بينيلوب محتالة  \n(4) أفري فارس  \n(5) سكارليت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: لوك، جاكسون، لوكاس، شارلوت، ولوغان. قال لوك: \"شارلوت فارس أو لوك فارس\". ذكر جاكسون: \"لوغان محتار أو لوغان فارس\". قال لوكاس: \"لوغان فارس إذا وفقط إذا كانت شارلوت محتالة\". سُمعت شارلوت تقول: \"جاكسون فارس ولوك محتال\". ذكر لوغان: \"شارلوت فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) جاكسون فارس  \n(3) لوكاس محتال  \n(4) شارلوت محتالة  \n(5) لوغان محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: لوكاس، أورورا، نوح، بينيلوب، وبنيامين. قال لوكاس: \"أورورا فارس إذا وفقط إذا كانت بينيلوب فارسة\". في تصريح لأورورا: \"أورورا فارس وبينيلوب فارسة\". قال نوح إن لوكاس فارس أو بينيلوب فارسة. في تصريح لبينيلوب: \"لوكاس محتار إذا وفقط إذا كان لوكاس فارس\". سمع بنيامين يقول: \"لوكاس فارس ونوح محتار\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس فارس  \n(2) أورورا محتالة  \n(3) نوح فارس  \n(4) بينيلوب محتالة  \n(5) بنيامين محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: كلوي، رايلي، لوغان، أفري، وإيفلين. كما قالت كلوي: \"إيفلين فارس إذا وفقط إذا كانت رايلي فارسًا\". كما قالت رايلي: \"لوغان فارس أو إيفلين محتالة\". في كلمات لوغان: \"لوغان فارس إذا وفقط إذا كانت أفري محتالة\". علقت أفري: \"رايلي فارس ولوغان فارس\". قالت إيفلين: \"إذا كان لوغان فارسًا، فإن أفري فارس\". إذن، من هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) كلوي محتالة  \n(2) رايلي محتالة  \n(3) لوغان محتال  \n(4) أفري محتالة  \n(5) إيفلين فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: إليزابيث، إيما، ويليام، سباستيان، وهاربر. قالت إليزابيث: \"إيما محتالة وهاربر محتالة.\" ذكرت إيما: \"إليزابيث فارسة ويليام محتال.\" أعرب ويليام عن أن إليزابيث فارسة. علق سباستيان، \"إيما ليست فارسة.\" قال هاربر: \"إذا كانت إليزابيث محتالة، فإن سباستيان فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث محتالة  \n(2) إيما محتالة  \n(3) ويليام محتال  \n(4) سباستيان فارس  \n(5) هاربر فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: جاكسون، أميليا، آفا، ويليام، وجاك. قال جاكسون: \"إذا كانت آفا محتالة، فإن جاك فارس.\" أعلنت أميليا: \"جاك ليس محتالاً.\" لاحظت آفا: \"إذا كان جاك فارساً، فإن آفا فارس.\" عبر ويليام عن أن جاك محتال أو أن جاكسون فارس. في تصريح من جاك: \"إذا كان ويليام فارساً، فإن ويليام محتال.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون فارس  \n(2) أميليا محتالة  \n(3) آفا فارس  \n(4) ويليام فارس  \n(5) جاك محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: إيلا، أورورا، إليزابيث، إيفلين، ورايلي. \"إليزابيث ليست فارساً\"، أعلنت إيلا. \"رايلي محتال أو إيلا محتالة\"، أعلنت أورورا. \"أورورا محتالة ورايلي فارس\" - إليزابيث. لاحظت إيفلين، \"إليزابيث ليست محتالة\". قالت رايلي إنه إذا كانت أورورا فارساً، فإن إيلا محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا فارس  \n(2) أورورا فارس  \n(3) إليزابيث محتالة  \n(4) إيفلين محتالة  \n(5) رايلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة من السكان: مايسون، آفا، ويليام، لوك، ويعقوب. علق مايسون، \"ويليام ليس محتالًا\". وفقًا لآفا، \"يعقوب محتال\". في تصريح ويليام: \"يعقوب فارس إذا وفقط إذا كان ويليام فارسًا\". وفقًا للوك، \"ويليام فارس\". \"مايسون محتال\"، ادعى يعقوب. إذن من هو فارس ومن هو محتال؟",
        "solution_text_format": "(1) مايسون محتال  \n(2) آفا محتالة  \n(3) ويليام محتال  \n(4) لوك محتال  \n(5) يعقوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: يوسف، جاكسون، بنيامين، صموئيل، وأبيجيل. في كلمات يوسف: \"صموئيل محتال وجاكسون فارس\". وفقاً لجكسون، \"جاكسون فارس إذا وفقط إذا كان يوسف محتالاً\". أشار بنيامين، \"إذا كان صموئيل فارساً فإن جاكسون فارس\". قال صموئيل، \"جاكسون فارس وبنيامين محتال\". أخبرتك أبيجيل أن بنيامين ليس فارساً. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف محتال  \n(2) جاكسون محتال  \n(3) بنيامين فارس  \n(4) صموئيل محتال  \n(5) أبيجيل محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: ويليام، إيلا، جاكسون، هنري، وأورورا. قال ويليام: \"جاكسون محتال\". في تصريح من إيلا: \"هنري ليس فارساً\". علق جاكسون: \"أورورا فارس وإيلا فارس\". أشار هنري: \"ويليام فارس إذا وفقط إذا كانت إيلا فارساً\". علقت أورورا: \"هنري محتال أو جاكسون محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام محتال  \n(2) إيلا فارس  \n(3) جاكسون فارس  \n(4) هنري محتال  \n(5) أورورا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: هنري، يعقوب، جاكسون، شارلوت، وليلي. هنري أعرب عن أن يعقوب فارس. في كلمات يعقوب: \"إذا كانت ليلي فارسة، فإن جاكسون محتار\". في كلمات جاكسون: \"شارلوت محتالة إذا وفقط إذا كان جاكسون فارساً\". وفقاً لشارلوت، \"إذا كان جاكسون محتالاً، فإن يعقوب محتال\". ليلي أخبرتكم أن هنري محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هنري فارس  \n(2) يعقوب فارس  \n(3) جاكسون محتال  \n(4) شارلوت محتالة  \n(5) ليلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: إيما، دانيال، إيلا، يوسف، ولوغان. قالت إيما: \"إذا كانت إيلا فارساً، فإن إيلا محتالة\". وادعى دانيال: \"إيلا فارس ومحتالة في نفس الوقت\". أعلنت إيلا: \"إيما محتالة وإيما فارس\". أخبرك يوسف أنه إذا كانت إيما فارساً، فإن لوغان فارس. وفقاً للوغان، \"إيما ليست فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما فارس  \n(2) دانيال محتال  \n(3) إيلا محتالة  \n(4) يوسف محتال  \n(5) لوغان محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: صوفيا، أبيجيل، صموئيل، يعقوب، وغريس. في تصريح لصوفيا: \"أبيجيل محتالة إذا وفقط إذا كانت أبيجيل فارسة\". كما قالت أبيجيل: \"إذا كان صموئيل فارسًا، فإن غريس فارسة\". \"أبيجيل محتالة وصوفيا فارسة\" - صموئيل. علق يعقوب، \"إذا كانت أبيجيل فارسة، فإن صوفيا فارسة\". كما قالت غريس: \"أبيجيل محتالة إذا وفقط إذا كانت صوفيا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا محتالة  \n(2) أبيجيل فارسة  \n(3) صموئيل محتال  \n(4) يعقوب محتال  \n(5) غريس فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: جيمس، سكارليت، لوك، إيلا، ويعقوب. جيمس أكد: \"سكارليت محتالة\". \"لوك محتال\"، ذكرت سكارليت. قال لوك: \"إيلا محتالة وسكارليت فارس\". لاحظت إيلا: \"إذا كان جيمس محتالًا، فإن يعقوب فارس\". علق يعقوب: \"لوك محتال إذا وفقط إذا كان جيمس محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس محتال  \n(2) سكارليت فارسة  \n(3) لوك محتال  \n(4) إيلا فارسة  \n(5) يعقوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: إيثان، لوكاس، أفري، هاربر، وميا. علق إيثان قائلاً: \"لوكاس فارس وهاربر فارس\". سمع لوكاس يقول: \"أفري محتالة وميا فارس\". أكد أفري: \"إيثان فارس إذا وفقط إذا كان لوكاس فارس\". علق هاربر قائلاً: \"ميا فارس أو أفري فارس\". في تصريح لميا: \"إيثان محتال أو لوكاس محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان محتال  \n(2) لوكاس محتال  \n(3) أفري فارس  \n(4) هاربر فارس  \n(5) ميا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: ماثيو، إيزابيلا، إيما، أبيجيل، وهنري. قال ماثيو إنه إذا كانت إيزابيلا محتالة، فإن إيما محتالة. قالت إيزابيلا: \"هنري فارس إذا وفقط إذا كانت أبيجيل محتالة.\" قالت إيما إن أبيجيل محتالة إذا وفقط إذا كانت إيزابيلا محتالة. أكدت أبيجيل: \"ماثيو ليس محتالًا\". وفقًا لهنري، \"إذا كان هنري فارسًا، فإن أبيجيل فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ماثيو فارس  \n(2) إيزابيلا محتالة  \n(3) إيما محتالة  \n(4) أبيجيل فارس  \n(5) هنري فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: بينيلوب، آفا، غريس، أوليفيا، وأميليا. \"آفا فارس إذا وفقط إذا كانت غريس فارساً\"، أعلنت بينيلوب. قالت آفا إن أميليا فارس إذا وفقط إذا كانت أميليا محتالة. \"إذا كانت أوليفيا فارساً، فإن أميليا فارساً\"، ذكرت غريس. في كلمات أوليفيا: \"غريس فارس أو أوليفيا فارس\". قالت أميليا: \"أوليفيا محتالة إذا وفقط إذا كانت آفا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب هي فارس  \n(2) آفا هي محتالة  \n(3) غريس هي محتالة  \n(4) أوليفيا هي فارس  \n(5) أميليا هي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: آفا، هاربر، إميلي، أبيجيل، وسباستيان. سُمعت آفا تقول: \"هاربر محتالة وأبيجيل فارسة\". كما قالت هاربر: \"هاربر فارسة\". أكدت إميلي: \"أبيجيل محتالة إذا وفقط إذا كانت هاربر فارسة\". \"إذا كانت إميلي محتالة، فإن هاربر محتالة\"، أعلنت أبيجيل. قال سباستيان إن إميلي فارسة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا فارس  \n(2) هاربر محتالة  \n(3) إميلي فارس  \n(4) أبيجيل فارس  \n(5) سباستيان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: أفري، غريس، سكارليت، مايكل، وإليزابيث. في كلمات أفري: \"غريس فارس إذا وفقط إذا كانت إليزابيث محتالة\". كما قالت غريس: \"مايكل محتال إذا وفقط إذا كانت سكارليت محتالة\". \"سكارليت فارس أو إليزابيث محتالة\" - سكارليت. قال مايكل: \"غريس محتالة وسكارليت فارس\". سُمِعَت إليزابيث تقول: \"أفري محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري محتالة  \n(2) غريس فارسة  \n(3) سكارليت محتالة  \n(4) مايكل محتال  \n(5) إليزابيث فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: إيفلين، أبيجيل، إيثان، لوغان، وصوفيا. قالت إيفلين: \"لوغان فارس\". قالت أبيجيل: \"صوفيا فارس وإيفلين محتالة\". أعلن إيثان: \"لوغان محتال أو إيفلين محتالة\". قال لوغان: \"صوفيا فارس إذا وفقط إذا كان إيثان فارسًا\". أخبرتك صوفيا أن أبيجيل فارس أو لوغان محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين فارس  \n(2) أبيجيل محتالة  \n(3) إيثان محتال  \n(4) لوغان فارس  \n(5) صوفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: يعقوب، جاك، لوكاس، أفري، وليلي. قال يعقوب لك إن لوكاس فارس أو أفري فارس. أكد جاك: \"جاك فارس ويعقوب فارس\". وفقاً للوكاس، \"جاك ليس فارساً\". سمع أفري يقول: \"لوكاس محتار إذا وفقط إذا كان يعقوب محتالاً\". قالت ليلي إن أفري فارس إذا وفقط إذا كان لوكاس فارساً. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب فارس  \n(2) جاك محتال  \n(3) لوكاس فارس  \n(4) أفري فارس  \n(5) ليلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: أميليا، أفري، صوفيا، أورورا، ونوح. أميليا أخبرتك أنه إذا كانت أميليا فارسًا، فإن أورورا محتالة. أفري قال إن نوح فارس أو أورورا فارس. صوفيا سُمعت تقول: \"صوفيا فارس أو أورورا محتالة\". وفقًا لأورورا، \"أفري ليس محتالًا\". في بيان من نوح: \"أفري فارس إذا وفقط إذا كانت أميليا فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا فارس  \n(2) أفري محتالة  \n(3) صوفيا فارس  \n(4) أورورا محتالة  \n(5) نوح محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: رايلي، نوح، إيلا، إيزابيلا، وآفا. \"نوح فارس ومحتال\" - رايلي. سمع نوح يقول: \"إذا كانت إيزابيلا فارسًا، فإن رايلي فارس\". \"رايلي ليس فارسًا\"، ذكرت إيلا. كما قالت إيزابيلا: \"إيلا ليست فارسًا\". أكدت آفا: \"إيزابيلا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) رايلي محتالة  \n(2) نوح فارس  \n(3) إيلا فارس  \n(4) إيزابيلا محتالة  \n(5) آفا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: إليزابيث، لوك، إيما، رايلي، وصوفيا. قالت إليزابيث: \"رايلي فارس وإيما محتالة\". كما قال لوك: \"لوك فارس إذا وفقط إذا كانت إليزابيث محتالة\". صرحت إيما: \"رايلي محتالة إذا وفقط إذا كانت صوفيا محتالة\". أعلن رايلي: \"صوفيا ليست فارسًا\". علقت صوفيا: \"لوك محتالة أو إليزابيث فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث محتالة  \n(2) لوك محتال  \n(3) إيما محتالة  \n(4) رايلي محتالة  \n(5) صوفيا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: فيكتوريا، بينيلوب، إيثان، أورورا، وسباستيان. قالت فيكتوريا: \"أورورا فارس\". قالت بينيلوب: \"إيثان فارس أو سباستيان محتال\". في تصريح لإيثان: \"إذا كانت فيكتوريا فارساً، فإن بينيلوب محتالة\". قالت أورورا: \"بينيلوب محتالة وإيثان محتال\". \"بينيلوب فارس أو إيثان محتال\"، ادعى سباستيان. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) فيكتوريا محتالة  \n(2) بينيلوب فارسة  \n(3) إيثان فارس  \n(4) أورورا محتالة  \n(5) سباستيان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بخمسة سكان: إيلا، دانيال، هاربر، بنيامين، وميا. قالت إيلا: \"هاربر محتال وهاربر فارس.\" علق دانيال: \"إذا كانت إيلا فارساً، فإن دانيال فارس.\" قالت هاربر: \"إذا كان بنيامين محتالاً، فإن دانيال فارس.\" ادعى بنيامين: \"بنيامين فارس أو هاربر فارس.\" قالت ميا: \"بنيامين محتال إذا وفقط إذا كانت إيلا محتالة.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا محتالة  \n(2) دانيال فارس  \n(3) هاربر فارس  \n(4) بنيامين فارس  \n(5) ميا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: إميلي، إيما، سكارليت، أميليا، وأورورا. قالت إميلي: \"أورورا محتالة إذا وفقط إذا كانت إيما فارسة.\" قالت إيما: \"أورورا فارسة.\" علقت سكارليت: \"أميليا محتالة أو أميليا فارسة.\" في كلمات أميليا: \"أورورا محتالة إذا وفقط إذا كانت إميلي فارسة.\" في بيان من أورورا: \"إذا كانت سكارليت محتالة، فإن إيما محتالة.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي محتالة  \n(2) إيما فارسة  \n(3) سكارليت فارسة  \n(4) أميليا فارسة  \n(5) أورورا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: أفري، فيكتوريا، إيما، هاربر، وإيثان. أفري صرحت، \"فيكتوريا فارس\". \"هاربر فارس وإيثان فارس\"، ادعت فيكتوريا. وفقًا لإيما، \"هاربر فارس أو هاربر محتال\". في بيان من هاربر: \"فيكتوريا محتالة أو فيكتوريا فارس\". إيثان أكد: \"فيكتوريا فارس أو إيما فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري فارس  \n(2) فيكتوريا فارس  \n(3) إيما فارس  \n(4) هاربر فارس  \n(5) إيثان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: كلوي، أوين، ليام، مايسون، وبينيلوب. كما قالت كلوي: \"إذا كان مايسون فارسًا، فإن مايسون محتال\". وفقًا لأوين، \"ليام محتال إذا وفقط إذا كان مايسون محتالًا\". ليام أكد: \"مايسون فارس\". مايسون صرح، \"إذا كانت كلوي محتالة، فإن أوين فارس\". بينيلوب قالت إن مايسون فارس إذا وفقط إذا كان ليام فارسًا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) كلوي محتالة  \n(2) أوين فارس  \n(3) ليام فارس  \n(4) مايسون فارس  \n(5) بينيلوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بخمسة سكان: أوليفيا، شارلوت، سباستيان، مايسون، وإليزابيث. قالت أوليفيا إن مايسون فارس إذا وفقط إذا كان سباستيان فارسًا. في تصريح لشارلوت: \"مايسون محتال أو سباستيان محتال\". \"إذا كانت شارلوت فارسًا، فإن أوليفيا محتالة\"، ذكر سباستيان. عبر مايسون عن أن شارلوت محتالة إذا وفقط إذا كانت إليزابيث فارسًا. قالت إليزابيث: \"مايسون محتال إذا وفقط إذا كانت أوليفيا فارسًا.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا فارس  \n(2) شارلوت فارس  \n(3) سباستيان محتال  \n(4) مايسون محتال  \n(5) إليزابيث فارس"
    }
]