[
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：アレクサンダー、イーサン、エリザベス、ルーク、ノア、そしてマシュー。アレクサンダーによれば、「ノアはならず者です」。イーサンは、ルークがならず者であればマシューもならず者であると言いました。エリザベスは、ノアが騎士であるのはマシューがならず者である場合に限ると言いました。「ノアは騎士ではありません」とルークが言いました。ノアの発言では、「マシューはならず者ではありません」と言いました。マシューは、「アレクサンダーは騎士であるか、ルークはならず者である」と言っているのが聞かれました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アレクサンダーはならず者です  \n(2) イーサンはならず者です  \n(3) エリザベスはならず者です  \n(4) ルークはならず者です  \n(5) ノアは騎士です  \n(6) マシューは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ライリー、メイソン、ソフィア、アビゲイル、ダニエル、そしてマイケル。ライリーは「ソフィアは騎士だ」と主張しました。メイソンの発言では「ダニエルはならず者か、マイケルは騎士だ」と言いました。ソフィアは「メイソンは騎士である場合に限り、メイソンはならず者だ」と述べました。アビゲイルは「ダニエルは騎士か、ライリーはならず者だ」と言いました。ダニエルは「ライリーは騎士だ」と主張しました。マイケルは「ライリーはならず者である場合に限り、アビゲイルはならず者だ」と表現しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ライリーはならず者です  \n(2) メイソンは騎士です  \n(3) ソフィアはならず者です  \n(4) アビゲイルは騎士です  \n(5) ダニエルはならず者です  \n(6) マイケルはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：アメリア、オリバー、ルーカス、ベンジャミン、マイケル、そしてローガン。アメリアは「マイケルは騎士である場合に限り、ローガンは騎士です」と言いました。オリバーは「アメリアはならず者であるか、マイケルはならず者です」と指摘しました。ルーカスは、マイケルはならず者ではないと言いました。「ルーカスはならず者であり、アメリアはならず者です」とベンジャミンが言いました。「ベンジャミンはならず者であるか、ベンジャミンは騎士です」とマイケルが主張しました。ローガンは「アメリアは騎士であり、ベンジャミンは騎士です」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアはならず者です  \n(2) オリバーは騎士です  \n(3) ルーカスは騎士です  \n(4) ベンジャミンはならず者です  \n(5) マイケルは騎士です  \n(6) ローガンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ウィリアム、ジェイコブ、オーロラ、マシュー、ローガン、そしてグレース。ウィリアムは「ジェイコブは騎士か、ローガンは騎士だ」と言いました。ジェイコブは「ウィリアムは騎士である場合、マシューも騎士である」とあなたに言いました。オーロラは「もしジェイコブが騎士なら、グレースも騎士だ」と述べました。マシューは「ジェイコブはならず者か、グレースはならず者だ」と言いました。ローガンは「もしウィリアムがならず者なら、ジェイコブは騎士だ」と言いました。グレースによれば「ローガンは騎士だ」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムはならず者です  \n(2) ジェイコブはならず者です  \n(3) オーロラは騎士です  \n(4) マシューは騎士です  \n(5) ローガンはならず者です  \n(6) グレースはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ヘンリー、ルーカス、ペネロペ、グレース、エラ、そしてアレクサンダー。ヘンリーはこう言いました。「ペネロペは騎士か、エラはならず者です」。ルーカスは宣言しました。「ヘンリーはならず者ではありません」。ペネロペは主張しました。「もしアレクサンダーが騎士なら、エラは騎士です」。グレースの言葉では、「ルーカスは騎士です」。エラは「ルーカスは騎士であるのは、グレースがならず者である場合に限ります」と言いました。アレクサンダーは「ヘンリーはならず者です」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ヘンリーは騎士です  \n(2) ルーカスは騎士です  \n(3) ペネロペは騎士です  \n(4) グレースは騎士です  \n(5) エラはならず者です  \n(6) アレクサンダーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ベンジャミン、ゾーイ、サミュエル、マシュー、クロエ、そしてデイビッド。ベンジャミンは「ゾーイは騎士であるのは、クロエがならず者である場合に限る」と言っているのが聞かれました。ゾーイは「サミュエルは騎士ではない」と宣言しました。サミュエルは「サミュエルは騎士であるのは、クロエがならず者である場合に限る」と述べました。マシューは「サミュエルがならず者であれば、クロエもならず者である」と表現しました。クロエは「マシューは騎士であるのは、ベンジャミンが騎士である場合に限る」と言いました。デイビッドは「ベンジャミンは騎士であり、クロエはならず者である」とコメントしました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンはならず者です  \n(2) ゾーイはならず者です  \n(3) サミュエルは騎士です  \n(4) マシューは騎士です  \n(5) クロエはならず者です  \n(6) デイビッドはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ダニエル、マイケル、メイソン、マシュー、ベンジャミン、そしてリアム。「ベンジャミンはならず者ではない」とダニエルが言いました。マイケルは「もしマシューがならず者なら、メイソンはならず者だ」と言いました。「マイケルは騎士だ」とメイソンが言いました。「ダニエルは騎士ではない」とマシューが宣言しました。「メイソンはならず者であり、メイソンは騎士だ」とベンジャミンが言いました。リアムはメイソンがならず者であり、ダニエルがならず者だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルはならず者です  \n(2) マイケルは騎士です  \n(3) メイソンは騎士です  \n(4) マシューは騎士です  \n(5) ベンジャミンはならず者です  \n(6) リアムはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：イーサン、アビゲイル、ハーパー、スカーレット、エイヴァ、そしてオリバーです。イーサンによれば、「もしオリバーがならず者なら、ハーパーは騎士です」。アビゲイルは「スカーレットはイーサンがならず者である場合に限りならず者です」と主張しました。ハーパーはあなたにアビゲイルがならず者だと言いました。スカーレットは「イーサンは騎士ではありません」と指摘しました。「イーサンはならず者かハーパーがならず者です」とエイヴァが言いました。オリバーの言葉では、「アビゲイルはエイヴァがならず者である場合に限り騎士です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンは騎士です  \n(2) アビゲイルはならず者です  \n(3) ハーパーは騎士です  \n(4) スカーレットはならず者です  \n(5) エイヴァはならず者です  \n(6) オリバーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：イヴリン、ジャック、メイソン、オーロラ、ジャクソン、そしてジェームズ。イヴリンは、メイソンが騎士ではないと表現しました。ジャックの言葉では、「オーロラは騎士か、ジェームズは騎士です」。メイソンは、「ジェームズは騎士で、オーロラはならず者です」とコメントしました。オーロラの発言では、「イヴリンはならず者である場合、ジャクソンもならず者です」と述べました。ジャクソンは、「オーロラはならず者です」とコメントしました。ジェームズは、「メイソンは騎士です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンはならず者です  \n(2) ジャックは騎士です  \n(3) メイソンは騎士です  \n(4) オーロラはならず者です  \n(5) ジャクソンは騎士です  \n(6) ジェームズは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ハーパー、ジョセフ、マシュー、クロエ、エイブリー、そしてイーサン。「もしエイブリーが騎士なら、ジョセフは騎士だ」とハーパーが宣言しました。ジョセフは「イーサンは騎士だ」と言っているのが聞かれました。「もしハーパーがならず者なら、マシューは騎士だ」とマシューが言いました。クロエは「マシューは騎士で、イーサンは騎士だ」とコメントしました。エイブリーの発言では「クロエは騎士ではない」と言いました。イーサンは「クロエはならず者か、ハーパーは騎士だ」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーは騎士です  \n(2) ジョセフは騎士です  \n(3) マシューは騎士です  \n(4) クロエは騎士です  \n(5) エイブリーはならず者です  \n(6) イーサンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ソフィア、ゾーイ、リアム、アビゲイル、アリア、そしてシャーロット。ソフィアによれば、「リアムはならず者か、ゾーイはならず者です」。ゾーイは、アビゲイルは騎士ではないと言いました。リアムの言葉では、「ソフィアはならず者ではありません」。アビゲイルは、「リアムは騎士です」と述べました。「リアムが騎士であるならば、リアムはならず者です」 - アリア。シャーロットは、「アビゲイルは騎士であるならば、ソフィアはならず者です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) ゾーイはならず者です  \n(3) リアムは騎士です  \n(4) アビゲイルは騎士です  \n(5) アリアはならず者です  \n(6) シャーロットはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジャクソン、サミュエル、ソフィア、エイブリー、ダニエル、そしてオーウェン。ジャクソンは「エイブリーはサミュエルが騎士である限りならず者である」と主張しました。「もしソフィアがならず者なら、ダニエルは騎士だ」とサミュエルは宣言しました。ソフィアはサミュエルが騎士ではないと表現しました。エイブリーは「ダニエルはソフィアがならず者である限りならず者である」と表現しました。ダニエルの言葉では、「エイブリーはならず者であるか、ジャクソンはならず者である」と言いました。オーウェンはあなたにジャクソンが騎士ではないと言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンは騎士です  \n(2) サミュエルは騎士です  \n(3) ソフィアはならず者です  \n(4) エイブリーはならず者です  \n(5) ダニエルは騎士です  \n(6) オーウェンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：マシュー、アビゲイル、エリザベス、ダニエル、ルーカス、そしてアリアです。マシューの言葉では、「アリアが騎士なら、ルーカスはならず者です」。アビゲイルは、「エリザベスはならず者であるのは、マシューが騎士である場合に限ります」と述べました。エリザベスは、「マシューは騎士ではありません」と主張しました。ダニエルは、ルーカスはならず者か、アビゲイルは騎士だと言いました。ルーカスは、「マシューは騎士で、ルーカスは騎士です」と言いました。アリアによれば、「ダニエルは騎士であるのは、エリザベスがならず者である場合に限ります」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マシューは騎士です  \n(2) アビゲイルは騎士です  \n(3) エリザベスはならず者です  \n(4) ダニエルは騎士です  \n(5) ルーカスはならず者です  \n(6) アリアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：グレース、ソフィア、ジェームズ、ノア、アレクサンダー、そしてデイビッド。グレースによれば、「ジェームズは騎士か、デイビッドはならず者です」。ソフィアは「アレクサンダーは騎士ではありません」と宣言しました。「グレースはならず者で、デイビッドは騎士です」とジェームズが宣言しました。ノアは「グレースはならず者ではありません」と述べました。「ノアは騎士で、グレースはならず者です」とアレクサンダーが言いました。「ソフィアはならず者です」とデイビッドが言及しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) グレースは騎士です  \n(2) ソフィアは騎士です  \n(3) ジェームズはならず者です  \n(4) ノアは騎士です  \n(5) アレクサンダーはならず者です  \n(6) デイビッドはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ルーク、ソフィア、ライリー、クロエ、ウィリアム、そしてイヴリン。「ライリーは騎士であるのはウィリアムがならず者である場合に限る」とルークは主張しました。ソフィアによれば、「クロエはならず者ではない」とのことです。ライリーの言葉では、「ライリーは騎士であるのはクロエがならず者である場合に限る」と言っています。クロエの言葉では、「イヴリンは騎士ではない」と言っています。ウィリアムは、「イヴリンはならず者である」と指摘しました。イヴリンは、「イヴリンは騎士であるのはルークがならず者である場合に限る」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークはならず者です  \n(2) ソフィアはならず者です  \n(3) ライリーはならず者です  \n(4) クロエはならず者です  \n(5) ウィリアムはならず者です  \n(6) イヴリンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ペネロペ、ジャクソン、エイブリー、ビクトリア、シャーロット、そしてオーロラ。ペネロペは言いました、「ビクトリアは騎士か、ジャクソンはならず者です」。ジャクソンは「エイブリーが騎士なら、オーロラはならず者です」と言いました。エイブリーによれば、「ペネロペは騎士である場合に限り、オーロラはならず者です」。ビクトリアは「ビクトリアは騎士です」と述べました。シャーロットは「エイブリーはならず者である場合に限り、ペネロペはならず者です」と言いました。オーロラは「エイブリーは騎士です」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペはならず者です  \n(2) ジャクソンは騎士です  \n(3) エイブリーはならず者です  \n(4) ビクトリアはならず者です  \n(5) シャーロットは騎士です  \n(6) オーロラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ダニエル、グレース、ペネロペ、ライリー、リアム、そしてベンジャミン。ダニエルの発言によれば、「ライリーはならず者か、ライリーは騎士です」。グレースは「ペネロペはならず者ではありません」と宣言しました。ペネロペによると、「ライリーはならず者であり、ライリーは騎士です」。ライリーは「ペネロペは騎士であり、ベンジャミンはならず者です」と指摘しました。リアムは「もしグレースがならず者なら、ダニエルは騎士です」と言いました。ベンジャミンは「リアムはならず者です」と述べました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルは騎士です  \n(2) グレースはならず者です  \n(3) ペネロペはならず者です  \n(4) ライリーはならず者です  \n(5) リアムは騎士です  \n(6) ベンジャミンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：シャーロット、ジャクソン、イヴリン、エイデン、エミリー、そしてアメリア。シャーロットは「イヴリンは騎士ではない」と述べました。「シャーロットはならず者であるか、イヴリンは騎士である」とジャクソンは主張しました。イヴリンは「もしジャクソンがならず者なら、シャーロットは騎士です」と表現しました。エイデンは「エイデンは騎士であり、ジャクソンはならず者です」と言いました。「シャーロットはならず者ではない」とエミリーが言いました。アメリアは「エミリーは騎士であり、アメリアは騎士です」とあなたに伝えました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットはならず者です  \n(2) ジャクソンは騎士です  \n(3) イヴリンは騎士です  \n(4) エイデンはならず者です  \n(5) エミリーはならず者です  \n(6) アメリアはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジャクソン、ゾーイ、エミリー、ペネロペ、シャーロット、そしてサミュエル。ジャクソンは「ペネロペは騎士ではない」と言いました。ゾーイは「エミリーはならず者だ」と主張しました。エミリーによれば「ペネロペは騎士だ」とのことです。ペネロペは、ジャクソンがならず者であるか、シャーロットがならず者であると言いました。シャーロットは「ジャクソンはエミリーが騎士である場合に限り騎士だ」と述べました。サミュエルは「ジャクソンは騎士だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンはならず者です  \n(2) ゾーイはならず者です  \n(3) エミリーは騎士です  \n(4) ペネロペは騎士です  \n(5) シャーロットはならず者です  \n(6) サミュエルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：マイケル、アビゲイル、ジェームズ、ノア、エイヴァ、そしてオーウェン。マイケルは「エイヴァが騎士なら、ジェームズはならず者だ」と言いました。アビゲイルは「オーウェンはエイヴァがならず者である場合に限り、ならず者だ」と主張しました。ジェームズによれば「マイケルは騎士ではない」とのことです。「ジェームズはならず者か、エイヴァはならず者だ」とノアが言いました。エイヴァは「マイケルが騎士である場合に限り、マイケルはならず者だ」と表現しました。オーウェンは「マイケルは騎士ではない」とコメントしました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルは騎士です  \n(2) アビゲイルは騎士です  \n(3) ジェームズはならず者です  \n(4) ノアは騎士です  \n(5) エイヴァはならず者です  \n(6) オーウェンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ルーク、オーウェン、ヘンリー、エミリー、メイソン、そしてペネロペ。ルークの言葉によれば、「エミリーはならず者か、オーウェンはならず者です」。オーウェンは「メイソンは騎士であるのは、ルークが騎士である場合に限ります」と言いました。ヘンリーは「メイソンはならず者です」と言いました。エミリーは「メイソンは騎士であるのは、メイソンがならず者である場合に限ります」と言いました。メイソンは「ルークは騎士で、エミリーは騎士です」と述べました。ペネロペは「ルークは騎士か、ペネロペは騎士です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) オーウェンはならず者です  \n(3) ヘンリーは騎士です  \n(4) エミリーはならず者です  \n(5) メイソンはならず者です  \n(6) ペネロペは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ルーク、ライリー、アレクサンダー、ジェームズ、ルーカス、そしてマイケルです。「アレクサンダーはならず者だ」とルークは主張しました。ライリーの言葉では、「ジェームズは騎士だ」と言いました。アレクサンダーは「ライリーは騎士である場合、ライリーはならず者である」と言いました。ジェームズはマイケルが騎士だと言いました。ルーカスは「ライリーはならず者で、マイケルは騎士だ」と主張しました。マイケルの発言では、「ジェームズはならず者である場合、ライリーはならず者である」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) ライリーは騎士です  \n(3) アレクサンダーはならず者です  \n(4) ジェームズは騎士です  \n(5) ルーカスはならず者です  \n(6) マイケルは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：デイビッド、ヘンリー、アビゲイル、アメリア、ソフィア、そしてジェイコブ。デイビッドは「ヘンリーは騎士で、アメリアはならず者だ」と述べました。ヘンリーは「ソフィアは騎士で、アビゲイルはならず者だ」と言いました。アビゲイルによれば「ヘンリーは騎士で、ソフィアは騎士だ」とのことです。「ヘンリーは騎士ではない」とアメリアは主張しました。「もしヘンリーがならず者なら、デイビッドは騎士だ」とソフィアは言いました。「もしジェイコブが騎士なら、ソフィアはならず者だ」とジェイコブは宣言しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドはならず者です  \n(2) ヘンリーはならず者です  \n(3) アビゲイルはならず者です  \n(4) アメリアは騎士です  \n(5) ソフィアはならず者です  \n(6) ジェイコブは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：マイケル、ヘンリー、ウィリアム、ソフィア、イヴリン、そしてジェームズ。マイケルの発言では、「もしソフィアが騎士なら、イヴリンはならず者です」。ヘンリーの言葉では、「マイケルは騎士ではありません」。ウィリアムは、イヴリンが騎士であるか、ウィリアムが騎士であると表現しました。ソフィアは、「マイケルはならず者で、ヘンリーはならず者です」と言いました。「マイケルは騎士です」とイヴリンは宣言しました。ジェームズは、「ソフィアはならず者ではありません」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルは騎士です  \n(2) ヘンリーはならず者です  \n(3) ウィリアムは騎士です  \n(4) ソフィアはならず者です  \n(5) イヴリンは騎士です  \n(6) ジェームズはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ペネロペ、デイビッド、ジェームズ、ミア、ノア、そしてスカーレット。ペネロペは「ジェームズは騎士か、スカーレットはならず者です」と述べました。「もしノアが騎士なら、ペネロペは騎士です」とデイビッドが言いました。「もしミアが騎士なら、ペネロペはならず者です」とジェームズが言いました。ミアは「ノアはならず者ではありません」と言いました。「スカーレットはならず者で、ミアはならず者です」とノアが宣言しました。スカーレットの発言では「ミアは騎士ではありません」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペは騎士です  \n(2) デイビッドは騎士です  \n(3) ジェームズは騎士です  \n(4) ミアはならず者です  \n(5) ノアはならず者です  \n(6) スカーレットは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジョセフ、イザベラ、エラ、ダニエル、ローガン、そしてジェームズ。ジョセフは「ダニエルはならず者か、ローガンはならず者だ」とコメントしました。イザベラの発言では「ダニエルはならず者です」。エラによれば「ローガンは騎士である場合に限り、ローガンはならず者です」。ダニエルの発言では「ローガンはならず者で、エラは騎士です」。ローガンの言葉では「ダニエルは騎士です」。ジェームズは「もしジョセフが騎士ならば、ローガンはならず者です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフは騎士です  \n(2) イザベラは騎士です  \n(3) エラはならず者です  \n(4) ダニエルはならず者です  \n(5) ローガンはならず者です  \n(6) ジェームズは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジャック、ルーカス、メイソン、イーサン、アメリア、そしてリアム。ジャックの発言：「メイソンは騎士ではない」。ルーカスの発言：「リアムは騎士であるか、ジャックは騎士である」。メイソンの言葉：「アメリアは騎士である」。イーサンは宣言しました。「もしリアムが騎士なら、アメリアは騎士である」。アメリアは、「メイソンは騎士であるのは、ジャックがならず者である場合に限る」と言っているのが聞かれました。リアムは、「メイソンは騎士であるのは、ジャックが騎士である場合に限る」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャックはならず者です  \n(2) ルーカスはならず者です  \n(3) メイソンは騎士です  \n(4) イーサンは騎士です  \n(5) アメリアは騎士です  \n(6) リアムはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ヘンリー、ジャクソン、エミリー、ダニエル、マイケル、そしてマシュー。ヘンリーは「ジャクソンは騎士だ」とコメントしました。ジャクソンは「エミリーは騎士ではない」と言っているのが聞かれました。エミリーは「もしマシューがならず者なら、マシューは騎士だ」と述べました。ダニエルはヘンリーが騎士であり、マイケルも騎士であると表現しました。マイケルは「マイケルは騎士であり、ダニエルは騎士だ」と主張しました。マシューの発言では「ダニエルは騎士であり、エミリーはならず者だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ヘンリーは騎士です  \n(2) ジャクソンは騎士です  \n(3) エミリーはならず者です  \n(4) ダニエルはならず者です  \n(5) マイケルはならず者です  \n(6) マシューはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エイヴァ、ハーパー、ジェイコブ、シャーロット、エラ、そしてノア。エイヴァは「シャーロットはならず者か、ジェイコブはならず者だ」と言っているのが聞かれました。ハーパーは「ジェイコブは騎士か、シャーロットはならず者だ」と言いました。ジェイコブは「エラは騎士で、シャーロットは騎士だ」と主張しました。シャーロットの発言では「エイヴァは騎士ではない」と言いました。エラは「エイヴァは騎士で、ハーパーは騎士だ」と述べました。ノアは「もしエイヴァがならず者なら、ジェイコブは騎士だ」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァは騎士です  \n(2) ハーパーは騎士です  \n(3) ジェイコブはならず者です  \n(4) シャーロットはならず者です  \n(5) エラは騎士です  \n(6) ノアは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：イザベラ、リアム、エミリー、アビゲイル、クロエ、そしてソフィア。イザベラは「アビゲイルはならず者ではない」と言いました。リアムによれば、「アビゲイルは騎士か、アビゲイルはならず者です」。エミリーは「アビゲイルは騎士か、アビゲイルはならず者です」と主張しました。アビゲイルは「エミリーがならず者なら、クロエはならず者です」と言いました。クロエの発言では「リアムはならず者ではない」と言っています。ソフィアは「イザベラは騎士です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イザベラは騎士です  \n(2) リアムは騎士です  \n(3) エミリーは騎士です  \n(4) アビゲイルは騎士です  \n(5) クロエは騎士です  \n(6) ソフィアは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ビクトリア、グレース、ジャクソン、リアム、ヘンリー、そしてジョセフです。「リアムはならず者ではない」とビクトリアは主張しました。グレースは「ヘンリーが騎士なら、ビクトリアも騎士です」と指摘しました。ジャクソンは「ビクトリアがならず者なら、ヘンリーもならず者です」と主張しました。リアムは「ジョセフは騎士です」と言いました。「ジャクソンは騎士ではない」とヘンリーは主張しました。ジョセフは「リアムはならず者か、グレースは騎士です」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ビクトリアは騎士です  \n(2) グレースは騎士です  \n(3) ジャクソンは騎士です  \n(4) リアムは騎士です  \n(5) ヘンリーはならず者です  \n(6) ジョセフは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジェイコブ、アリア、アレクサンダー、イザベラ、オリビア、そしてベンジャミン。ジェイコブの言葉では、「オリビアは騎士であり、オリビアはならず者です」と言っています。「もしベンジャミンがならず者なら、オリビアは騎士です」とアリアが言いました。「ベンジャミンは、アレクサンダーが騎士である場合に限りならず者です」とアレクサンダーが言いました。イザベラは「アレクサンダーはならず者です」と主張しました。オリビアは「もしアレクサンダーがならず者なら、ジェイコブはならず者です」と言いました。ベンジャミンは「もしイザベラがならず者なら、イザベラは騎士です」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブはならず者です  \n(2) アリアは騎士です  \n(3) アレクサンダーは騎士です  \n(4) イザベラはならず者です  \n(5) オリビアは騎士です  \n(6) ベンジャミンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：アビゲイル、ウィリアム、イヴリン、サミュエル、ビクトリア、そしてソフィア。アビゲイルは「ビクトリアはならず者である場合に限り、ビクトリアは騎士である」とコメントしました。ウィリアムは「ソフィアはならず者だ」と主張しました。イヴリンは「ビクトリアはならず者である場合に限り、サミュエルはならず者だ」と表現しました。サミュエルは「イヴリンはならず者で、ウィリアムは騎士だ」と言いました。ビクトリアは「サミュエルはならず者で、ビクトリアは騎士だ」と述べました。ソフィアは「イヴリンはならず者か、ウィリアムは騎士だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アビゲイルはならず者です  \n(2) ウィリアムはならず者です  \n(3) イヴリンはならず者です  \n(4) サミュエルはならず者です  \n(5) ビクトリアは騎士です  \n(6) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ルーク、セバスチャン、ジョセフ、リリー、スカーレット、そしてジェームズ。「もしジェームズがならず者なら、ジョセフは騎士だ」とルークが言いました。セバスチャンはリリーが騎士ではないと表現しました。ジョセフは「もしスカーレットがならず者なら、リリーもならず者だ」とコメントしました。リリーは「ジョセフはならず者で、ルークは騎士だ」と述べました。スカーレットは「ジェームズはならず者で、ジョセフはならず者だ」と言いました。「スカーレットは騎士で、セバスチャンは騎士だ」とジェームズが宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) セバスチャンは騎士です  \n(3) ジョセフは騎士です  \n(4) リリーはならず者です  \n(5) スカーレットはならず者です  \n(6) ジェームズはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：グレース、ジャック、ダニエル、イヴリン、エラ、そしてミア。グレースは「もしイヴリンが騎士なら、エラはならず者です」と言いました。「エラは騎士ではない」とジャックは主張しました。ダニエルは「ダニエルは騎士であるのは、ジャックがならず者である場合に限る」と述べました。「ミアは騎士である場合に限り、ミアはならず者です」とイヴリンは主張しました。「ダニエルは騎士ではない」とエラは言いました。ミアは「ジャックはならず者であるか、ダニエルは騎士です」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) グレースは騎士です  \n(2) ジャックはならず者です  \n(3) ダニエルはならず者です  \n(4) イヴリンはならず者です  \n(5) エラは騎士です  \n(6) ミアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：リアム、ジョセフ、マイケル、ジェイコブ、エリザベス、そしてメイソン。リアムは「ジョセフは騎士で、マイケルは騎士だ」と言いました。「もしリアムがならず者なら、リアムは騎士だ」とジョセフは主張しました。マイケルは「ジョセフは騎士であるのは、ジェイコブがならず者である場合に限る」と述べました。ジェイコブの言葉では、「ジェイコブは騎士であるのは、マイケルがならず者である場合に限る」と言いました。エリザベスはリアムが騎士ではないと表現しました。「ジョセフは騎士であるのは、ジェイコブがならず者である場合に限る」とメイソンは主張しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムはならず者です  \n(2) ジョセフはならず者です  \n(3) マイケルはならず者です  \n(4) ジェイコブはならず者です  \n(5) エリザベスは騎士です  \n(6) メイソンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：リアム、イヴリン、イザベラ、ジャクソン、エイデン、そしてソフィア。リアムはイヴリンが騎士であると表現しました。イヴリンは「イヴリンは騎士であり、イザベラはならず者です」と述べました。イザベラは「もしソフィアがならず者なら、リアムは騎士です」と言いました。ジャクソンは「イヴリンはならず者であり、ソフィアは騎士です」と言いました。エイデンの言葉では「ジャクソンはならず者であり、イヴリンは騎士です」。ソフィアは「もしリアムが騎士なら、ジャクソンは騎士です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムはならず者です  \n(2) イヴリンはならず者です  \n(3) イザベラは騎士です  \n(4) ジャクソンは騎士です  \n(5) エイデンはならず者です  \n(6) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：アレクサンダー、ライリー、エイヴァ、シャーロット、アメリア、そしてオリビア。アレクサンダーによれば、「ライリーがならず者なら、アメリアもならず者です」。ライリーはこう主張しました：「エイヴァはシャーロットが騎士である場合に限り騎士です」。アエヴァはこう言いました：「シャーロットはならず者ではありません」。シャーロットの発言では、「アメリアは騎士ではありません」。アメリアは「オリビアは騎士であるか、エイヴァはならず者です」と述べました。オリビアは「ライリーはならず者であるか、アレクサンダーは騎士です」と主張しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アレクサンダーは騎士です  \n(2) ライリーは騎士です  \n(3) エイヴァはならず者です  \n(4) シャーロットはならず者です  \n(5) アメリアは騎士です  \n(6) オリビアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：オーウェン、ゾーイ、グレース、リリー、ルーカス、そしてソフィア。「もしリリーがならず者なら、リリーは騎士だ」とオーウェンは宣言しました。ゾーイは「リリーはならず者だ」とコメントしました。グレースの言葉では「ルーカスはならず者か、ゾーイはならず者だ」と言いました。「リリーが騎士であるならば、ルーカスはならず者だ」とリリーは言及しました。ルーカスは「もしオーウェンがならず者なら、オーウェンは騎士だ」とコメントしました。ソフィアは「リリーは騎士ではない」と主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンはならず者です  \n(2) ゾーイは騎士です  \n(3) グレースは騎士です  \n(4) リリーはならず者です  \n(5) ルーカスはならず者です  \n(6) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジェームズ、ソフィア、ライリー、ヘンリー、ジャクソン、そしてペネロペ。ジェームズの言葉では、「もしソフィアが騎士なら、ライリーはならず者だ」。ソフィアは「ペネロペは騎士ではない」と言いました。ライリーは「ジェームズはならず者ではない」と主張しました。「ライリーは騎士だ」とヘンリーが言いました。「ヘンリーはならず者で、ソフィアは騎士だ」とジャクソンが言いました。ペネロペは「ソフィアはライリーがならず者であるときに限り騎士だ」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズは騎士です  \n(2) ソフィアはならず者です  \n(3) ライリーは騎士です  \n(4) ヘンリーは騎士です  \n(5) ジャクソンはならず者です  \n(6) ペネロペは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：スカーレット、イザベラ、エイデン、アレクサンダー、ウィリアム、そしてジョセフ。スカーレットの言葉では、「アレクサンダーはウィリアムがならず者である場合に限り騎士です」。イザベラは「ウィリアムは騎士である場合に限りならず者です」と言いました。エイデンは「イザベラは騎士です」と主張しました。アレクサンダーの発言では、「スカーレットはならず者であるか、ウィリアムはならず者です」。ウィリアムは「エイデンはならず者ではありません」と述べました。「エイデンは騎士ではありません」とジョセフが言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) スカーレットは騎士です  \n(2) イザベラはならず者です  \n(3) エイデンはならず者です  \n(4) アレクサンダーは騎士です  \n(5) ウィリアムはならず者です  \n(6) ジョセフは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ダニエル、リリー、ソフィア、ルーク、ノア、そしてエイブリー。ダニエルの発言はこうです：「ルークは騎士か、ノアはならず者です」。リリーは「ダニエルはならず者か、ソフィアはならず者です」と宣言しました。ソフィアは「ノアは騎士か、ルークは騎士です」と言いました。ルークは「エイブリーは騎士で、ノアはならず者です」と指摘しました。ノアの言葉では「ルークは騎士です」。エイブリーは「ダニエルはならず者か、ソフィアは騎士です」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルは騎士です  \n(2) リリーは騎士です  \n(3) ソフィアはならず者です  \n(4) ルークはならず者です  \n(5) ノアはならず者です  \n(6) エイブリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ビクトリア、ハーパー、アレクサンダー、ジェームズ、リリー、そしてオリバー。ビクトリアは「アレクサンダーはならず者か、ジェームズは騎士です」と述べました。ハーパーによれば「リリーはならず者です」。アレクサンダーは「オリバーはならず者です」と言いました。ジェームズは「ジェームズは騎士で、オリバーは騎士です」と述べました。「オリバーは騎士で、ビクトリアはならず者です」とリリーが言いました。オリバーはアレクサンダーは騎士か、ジェームズは騎士だと表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ビクトリアは騎士です  \n(2) ハーパーは騎士です  \n(3) アレクサンダーはならず者です  \n(4) ジェームズは騎士です  \n(5) リリーはならず者です  \n(6) オリバーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：リアム、エラ、ソフィア、オーウェン、マイケル、そしてメイソン。リアムの言葉によれば、「ソフィアはならず者か、リアムは騎士です」。エラの言葉では、「ソフィアは騎士です」。ソフィアによれば、「リアムはならず者ではありません」。オーウェンは「マイケルは騎士ではありません」と主張しました。「リアムはならず者ではありません」とマイケル。メイソンは、マイケルはならず者か、マイケルは騎士だと言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムは騎士です  \n(2) エラは騎士です  \n(3) ソフィアは騎士です  \n(4) オーウェンはならず者です  \n(5) マイケルは騎士です  \n(6) メイソンは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：オリバー、ヘンリー、オリビア、オーウェン、セバスチャン、そしてアメリア。オリバーの発言：「オリビアはならず者ではない」。ヘンリーはオリビアがならず者だと表現しました。「アメリアはならず者で、オリバーはならず者です」とオリビアが言いました。オーウェンはアメリアは騎士ではないとあなたに言いました。セバスチャンは「オーウェンは騎士であるのは、オリビアが騎士である場合に限る」と述べました。アメリアは「アメリアは騎士であるのは、セバスチャンが騎士である場合に限る」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリバーはならず者です  \n(2) ヘンリーは騎士です  \n(3) オリビアはならず者です  \n(4) オーウェンはならず者です  \n(5) セバスチャンは騎士です  \n(6) アメリアは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：アビゲイル、クロエ、マイケル、デイビッド、イヴリン、そしてソフィア。アビゲイルは「デイビッドはならず者ではない」と言いました。クロエの言葉では「アビゲイルはソフィアが騎士である場合に限り騎士である」とのことです。マイケルは「ソフィアは騎士であるか、クロエはならず者である」とコメントしました。「クロエはならず者ではない」とデイビッドは主張しました。イヴリンは「デイビッドはソフィアがならず者である場合に限りならず者である」と言いました。ソフィアの発言では「デイビッドはならず者である」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アビゲイルはならず者です  \n(2) クロエはならず者です  \n(3) マイケルは騎士です  \n(4) デイビッドはならず者です  \n(5) イヴリンはならず者です  \n(6) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ルーク、エミリー、アレクサンダー、ベンジャミン、アリア、そしてイヴリン。ルークの発言では、「ベンジャミンは騎士です」。エミリーは「イヴリンは騎士であるか、アレクサンダーはならず者です」と言っているのが聞かれました。「もしルークが騎士なら、ルークはならず者です」とアレクサンダーが言いました。ベンジャミンによれば、「もしルークが騎士なら、エミリーは騎士です」。アリアはルークがならず者ではないと言いました。イヴリンは「エミリーは騎士ではありません」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) エミリーは騎士です  \n(3) アレクサンダーはならず者です  \n(4) ベンジャミンは騎士です  \n(5) アリアは騎士です  \n(6) イヴリンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：イーサン、エラ、クロエ、アリア、オーウェン、そしてシャーロット。イーサンは「アリアは騎士か、イーサンは騎士だ」と言いました。エラは「シャーロットはならず者ではない」と言っているのが聞かれました。クロエは「イーサンは騎士か、アリアは騎士だ」と言いました。アリアの言葉では、「クロエはならず者で、エラはならず者だ」と言いました。オーウェンの発言では、「クロエは騎士ではない」と言いました。シャーロットは「クロエはならず者ではない」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンは騎士です  \n(2) エラは騎士です  \n(3) クロエは騎士です  \n(4) アリアはならず者です  \n(5) オーウェンはならず者です  \n(6) シャーロットは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：オーロラ、ウィリアム、リアム、ローガン、ルーク、そしてペネロペです。「リアムはならず者ではない」とオーロラは主張しました。ウィリアムは、ローガンはならず者であるか、ルークは騎士であると言いました。リアムは、「ルークはならず者であるか、オーロラはならず者である」と述べました。ローガンは、「オーロラは騎士であるか、リアムは騎士である」と主張しました。ルークは、「ルークは騎士であるのは、リアムが騎士である場合に限る」とコメントしました。ペネロペの発言では、「リアムは騎士ではない」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーロラは騎士です  \n(2) ウィリアムはならず者です  \n(3) リアムは騎士です  \n(4) ローガンは騎士です  \n(5) ルークはならず者です  \n(6) ペネロペはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：グレース、シャーロット、ジャック、セバスチャン、アビゲイル、そしてミア。グレースの発言では、「ジャックがならず者なら、アビゲイルはならず者です」。シャーロットは「セバスチャンはならず者ではありません」と言いました。ジャックは「ミアは騎士です」と述べました。セバスチャンは、アビゲイルが騎士であるのはグレースが騎士である場合に限ると言いました。アビゲイルは「シャーロットはならず者であるか、シャーロットは騎士です」とコメントしました。ミアによれば、「アビゲイルは騎士であるか、グレースは騎士です」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) グレースは騎士です  \n(2) シャーロットは騎士です  \n(3) ジャックは騎士です  \n(4) セバスチャンは騎士です  \n(5) アビゲイルは騎士です  \n(6) ミアは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エイデン、ベンジャミン、ルーカス、ジョセフ、アリア、そしてジェームズ。エイデンは「ジェームズは騎士か、ベンジャミンは騎士だ」と言いました。ベンジャミンは「エイデンはならず者だ」と述べました。ルーカスは「ジェームズは騎士か、ジェームズはならず者だ」と言いました。「ベンジャミンはならず者ではない」とジョセフが言いました。アリアは「もしルーカスが騎士なら、ジョセフはならず者だ」と言っているのが聞かれました。ジェームズは「ジョセフはエイデンが騎士である場合に限りならず者だ」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンは騎士です  \n(2) ベンジャミンはならず者です  \n(3) ルーカスは騎士です  \n(4) ジョセフはならず者です  \n(5) アリアは騎士です  \n(6) ジェームズは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エイヴァ、エミリー、ルーク、ルーカス、ハーパー、そしてエラ。エイヴァの言葉では、「ルークはエラがならず者である場合に限り騎士です」。エミリーは、「もしエミリーが騎士なら、ルークはならず者です」と述べました。ルークは、「エラは騎士であり、エラはならず者です」と主張しました。「ハーパーはならず者であり、ルークはならず者です」とルーカスは主張しました。ハーパーは、「ルーカスはエイヴァが騎士である場合に限りならず者です」と言いました。エラは、「もしエミリーが騎士なら、ハーパーは騎士です」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァは騎士です  \n(2) エミリーは騎士です  \n(3) ルークはならず者です  \n(4) ルーカスはならず者です  \n(5) ハーパーは騎士です  \n(6) エラは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：アビゲイル、リリー、エラ、エミリー、ソフィア、そしてローガン。アビゲイルは「ソフィアはならず者ではない」と言いました。リリーは「エラは騎士か、ローガンは騎士だ」と表現しました。「ソフィアはならず者であり、ソフィアは騎士だ」とエラは主張しました。エミリーの言葉では「アビゲイルは騎士だ」と言いました。ソフィアは「もしソフィアが騎士なら、リリーは騎士だ」と言いました。ローガンは「ソフィアはならず者ではない」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アビゲイルは騎士です  \n(2) リリーは騎士です  \n(3) エラはならず者です  \n(4) エミリーは騎士です  \n(5) ソフィアは騎士です  \n(6) ローガンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エマ、エイブリー、ウィリアム、マシュー、スカーレット、そしてイーサン。エマは「エマは騎士か、ウィリアムは騎士です」とコメントしました。エイブリーは「エマはならず者で、ウィリアムはならず者です」と言いました。ウィリアムは「イーサンはならず者です」と言いました。「エイブリーはならず者か、ウィリアムはならず者です」とマシューは主張しました。スカーレットの言葉では「マシューはならず者で、イーサンは騎士です」と言いました。イーサンは「エマは騎士です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エマは騎士です  \n(2) エイブリーはならず者です  \n(3) ウィリアムはならず者です  \n(4) マシューは騎士です  \n(5) スカーレットはならず者です  \n(6) イーサンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジャクソン、アビゲイル、エラ、ノア、エイブリー、そしてマシュー。ジャクソンは「アビゲイルはならず者で、アビゲイルは騎士だ」と言いました。アビゲイルは「エイブリーはならず者で、エイブリーは騎士だ」と述べました。「マシューはならず者か、マシューは騎士だ」とエラが宣言しました。「もしエイブリーが騎士なら、エラは騎士だ」とノアが言いました。エイブリーは「マシューは騎士だ」と言いました。「もしジャクソンが騎士なら、エラは騎士だ」とマシューが主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンはならず者です  \n(2) アビゲイルはならず者です  \n(3) エラは騎士です  \n(4) ノアは騎士です  \n(5) エイブリーは騎士です  \n(6) マシューは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：スカーレット、ルーク、ペネロペ、ミア、ライリー、そしてノア。スカーレットの言葉では、「ルークは騎士である場合に限り、スカーレットは騎士です」。ルークは「スカーレットは騎士です」と言いました。ペネロペの言葉では、「ライリーはならず者であるか、ルークはならず者です」。ミアは「ノアは騎士であるか、ルークはならず者です」と述べました。ライリーは「ミアは騎士である場合に限り、ルークはならず者です」と指摘しました。ノアは「ミアは騎士である場合に限り、ライリーは騎士です」と表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) スカーレットは騎士です  \n(2) ルークは騎士です  \n(3) ペネロペはならず者です  \n(4) ミアはならず者です  \n(5) ライリーは騎士です  \n(6) ノアはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ハーパー、メイソン、デイビッド、オーウェン、クロエ、そしてゾーイ。ハーパーは「ゾーイはならず者ではない」と言いました。メイソンは「オーウェンはならず者か、ゾーイは騎士だ」と言いました。デイビッドは「もしクロエが騎士なら、ハーパーは騎士だ」と述べました。オーウェンは「ハーパーは騎士で、クロエは騎士だ」と言いました。クロエは「メイソンは騎士で、ハーパーはならず者だ」と言いました。ゾーイは「ゾーイは騎士で、クロエは騎士だ」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーはならず者です  \n(2) メイソンは騎士です  \n(3) デイビッドはならず者です  \n(4) オーウェンはならず者です  \n(5) クロエは騎士です  \n(6) ゾーイはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：イヴリン、アレクサンダー、オーロラ、オーウェン、メイソン、そしてローガン。イヴリンは「メイソンは騎士で、ローガンはならず者です」と主張しました。アレクサンダーは「ローガンはならず者で、イヴリンは騎士です」と主張しました。オーロラは「アレクサンダーが騎士なら、ローガンも騎士です」と言いました。「ローガンはならず者で、オーロラはならず者です」とオーウェンは主張しました。「アレクサンダーはならず者であるのは、オーウェンが騎士である場合に限ります」とメイソンは言いました。ローガンは「オーロラは騎士ではありません」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンはならず者です  \n(2) アレクサンダーはならず者です  \n(3) オーロラは騎士です  \n(4) オーウェンはならず者です  \n(5) メイソンはならず者です  \n(6) ローガンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：マイケル、アリア、イヴリン、イーサン、ソフィア、そしてオーロラ。マイケルは「オーロラは騎士か、イヴリンはならず者だ」と言いました。アリアの発言では「ソフィアは騎士で、イーサンは騎士だ」と言っています。イヴリンは「マイケルは騎士だ」と言っているのが聞かれました。「ソフィアは騎士で、アリアは騎士だ」とイーサンが言いました。ソフィアは、もしマイケルが騎士ならオーロラはならず者だと言いました。オーロラは「ソフィアはならず者か、マイケルは騎士だ」と主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルは騎士です  \n(2) アリアはならず者です  \n(3) イヴリンは騎士です  \n(4) イーサンはならず者です  \n(5) ソフィアはならず者です  \n(6) オーロラは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ペネロペ、ジェームズ、ノア、サミュエル、クロエ、そしてアビゲイル。ペネロペは「ノアは騎士ではない」と言いました。ジェームズは「サミュエルはならず者であるか、サミュエルは騎士である」と宣言しました。ノアは「クロエは騎士ではない」と言いました。サミュエルは「ノアはならず者であるのは、ペネロペが騎士である場合に限る」と言いました。クロエは「ペネロペは騎士であるか、ペネロペはならず者である」と言いました。「ノアは騎士であるのは、ジェームズがならず者である場合に限る」とアビゲイルは宣言しました。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペは騎士です  \n(2) ジェームズは騎士です  \n(3) ノアはならず者です  \n(4) サミュエルは騎士です  \n(5) クロエは騎士です  \n(6) アビゲイルは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：サミュエル、オリバー、ソフィア、ジョセフ、オリビア、そしてミア。サミュエルは「ジョセフは騎士で、オリバーはならず者だ」とコメントしました。オリバーによれば、「もしジョセフがならず者なら、オリバーは騎士だ」とのことです。ソフィアは、オリビアはジョセフがならず者である場合に限り騎士であると表現しました。「ミアは騎士だ」とジョセフは主張しました。オリビアは、ジョセフは騎士で、サミュエルも騎士だと言いました。ミアの言葉では、「オリビアはならず者だ」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルはならず者です  \n(2) オリバーは騎士です  \n(3) ソフィアは騎士です  \n(4) ジョセフは騎士です  \n(5) オリビアはならず者です  \n(6) ミアは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エイヴァ、デイビッド、ソフィア、オーロラ、アメリア、そしてスカーレット。エイヴァは「デイビッドはならず者か、スカーレットは騎士です」と言いました。デイビッドは「もしデイビッドが騎士なら、アメリアは騎士です」と表現しました。ソフィアは「スカーレットはならず者ではありません」と言っているのが聞こえました。オーロラは「エイヴァはならず者で、スカーレットはならず者です」と述べました。「ソフィアは騎士です」とアメリアは主張しました。スカーレットは「もしソフィアがならず者なら、エイヴァは騎士です」と指摘しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァは騎士です  \n(2) デイビッドは騎士です  \n(3) ソフィアは騎士です  \n(4) オーロラはならず者です  \n(5) アメリアは騎士です  \n(6) スカーレットは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ルーク、エマ、エミリー、イヴリン、エイデン、そしてリリー。ルークは「エイデンはならず者か、エミリーは騎士だ」と述べました。エマは「エミリーは騎士である場合、エイデンはならず者である」と言いました。エミリーは「ルークはならず者か、イヴリンはならず者だ」と表現しました。「もしイヴリンが騎士なら、ルークは騎士だ」とイヴリンが言いました。「リリーはならず者か、エイデンは騎士だ」とエイデンが言いました。「エミリーはならず者で、イヴリンは騎士だ」とリリーが主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) エマはならず者です  \n(3) エミリーはならず者です  \n(4) イヴリンは騎士です  \n(5) エイデンはならず者です  \n(6) リリーは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エイブリー、ローガン、ペネロペ、エリザベス、ゾーイ、そしてライリー。エイブリーは「もしペネロペが騎士なら、ゾーイも騎士だ」と言いました。ローガンは「ライリーはゾーイが騎士である場合に限りならず者だ」と言っているのが聞かれました。ペネロペは「ゾーイはローガンが騎士である場合に限り騎士だ」と言いました。エリザベスは「ゾーイはならず者ではない」と言いました。「ペネロペは騎士ではない」とゾーイは宣言しました。ライリーの発言は「ローガンは騎士であり、ゾーイは騎士だ」となります。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーはならず者です  \n(2) ローガンはならず者です  \n(3) ペネロペは騎士です  \n(4) エリザベスはならず者です  \n(5) ゾーイはならず者です  \n(6) ライリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ハーパー、ノア、ジェームズ、メイソン、エイヴァ、そしてエミリー。ハーパーは「エミリーはならず者で、ノアは騎士だ」と主張しました。ノアの言葉では、「ジェームズはならず者であるのはハーパーがならず者である場合に限る」と言いました。ジェームズによれば、「ノアはならず者であるのはハーパーがならず者である場合に限る」とのことです。メイソンによれば、「ジェームズはならず者ではない」と言っています。エイヴァの言葉では、「エミリーは騎士であるか、ハーパーは騎士である」と言っています。「ジェームズはならず者ではない」とエミリーが言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーはならず者です  \n(2) ノアはならず者です  \n(3) ジェームズは騎士です  \n(4) メイソンは騎士です  \n(5) エイヴァは騎士です  \n(6) エミリーは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジェームズ、ジャック、ビクトリア、オリビア、エマ、そしてソフィア。ジェームズは「ソフィアはならず者か、ビクトリアはならず者だ」と述べました。ジャックは「エマは騎士である場合に限り、ソフィアは騎士である」と言いました。ビクトリアの発言では「ジェームズは騎士である場合に限り、エマはならず者だ」と言いました。「ジャックは騎士だ」とオリビアが言いました。エマは「ビクトリアは騎士であり、ソフィアは騎士だ」と述べました。ソフィアはオリビアが騎士であり、ビクトリアがならず者だと表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズは騎士です  \n(2) ジャックは騎士です  \n(3) ビクトリアは騎士です  \n(4) オリビアは騎士です  \n(5) エマはならず者です  \n(6) ソフィアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ハーパー、ゾーイ、エイヴァ、ウィリアム、エマ、そしてイーサン。ハーパーは「ウィリアムはならず者か、イーサンはならず者だ」と主張しました。ゾーイは「エイヴァは騎士で、ハーパーは騎士だ」と言いました。エイヴァによれば、「イーサンはならず者で、ウィリアムは騎士だ」とのことです。「イーサンはならず者で、ゾーイはならず者だ」とウィリアムは宣言しました。エマは「イーサンはゾーイがならず者である場合に限り、ならず者だ」と述べました。イーサンは「イーサンは騎士だ」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーは騎士です  \n(2) ゾーイはならず者です  \n(3) エイヴァはならず者です  \n(4) ウィリアムはならず者です  \n(5) エマはならず者です  \n(6) イーサンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ビクトリア、ルーカス、エイデン、クロエ、ジェームズ、そしてハーパーです。「クロエはならず者だ」とビクトリアが宣言しました。「もしハーパーが騎士なら、ルーカスは騎士だ」とルーカスが宣言しました。エイデンは「クロエはならず者であるのは、ジェームズが騎士である場合に限る」と言いました。クロエは「ビクトリアはならず者であるか、ジェームズは騎士である」と言いました。ジェームズの発言では、「もしビクトリアが騎士なら、クロエはならず者だ」と言いました。ハーパーは「ジェームズはならず者であるのは、クロエが騎士である場合に限る」と指摘しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ビクトリアはならず者です  \n(2) ルーカスは騎士です  \n(3) エイデンはならず者です  \n(4) クロエは騎士です  \n(5) ジェームズは騎士です  \n(6) ハーパーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：サミュエル、ゾーイ、イザベラ、ローガン、マイケル、そしてウィリアム。サミュエルは「イザベラはならず者であるのは、マイケルが騎士である場合に限る」と述べました。ゾーイは「イザベラはならず者であるのは、ウィリアムがならず者である場合に限る」と言いました。イザベラの発言は「ゾーイは騎士であるか、サミュエルは騎士である」となっています。ローガンは「ゾーイがならず者であれば、ローガンは騎士である」と言いました。マイケルによれば「イザベラは騎士であり、マイケルは騎士である」とのことです。ウィリアムは「マイケルが騎士であるのは、ウィリアムが騎士である場合に限る」とコメントしました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルはならず者です  \n(2) ゾーイは騎士です  \n(3) イザベラは騎士です  \n(4) ローガンは騎士です  \n(5) マイケルは騎士です  \n(6) ウィリアムは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：マシュー、ソフィア、ジェームズ、イザベラ、ジェイコブ、そしてイヴリン。マシューは「イヴリンは騎士で、イザベラはならず者だ」と主張しました。ソフィアは「ジェームズは騎士か、ジェームズはならず者だ」と言いました。ジェームズは「マシューは騎士で、ジェイコブは騎士だ」と述べました。「もしジェイコブがならず者なら、ソフィアはならず者だ」とイザベラが宣言しました。ジェイコブは自分が騎士だと言いました。イヴリンは「マシューは騎士ではない」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マシューはならず者です  \n(2) ソフィアは騎士です  \n(3) ジェームズはならず者です  \n(4) イザベラは騎士です  \n(5) ジェイコブは騎士です  \n(6) イヴリンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジェイコブ、エイヴァ、オリバー、ウィリアム、クロエ、そしてデイビッドです。ジェイコブは「もしデイビッドがならず者なら、エイヴァはならず者だ」と表現しました。エイヴァは「デイビッドは騎士で、デイビッドはならず者だ」と主張しました。オリバーは「もしウィリアムがならず者なら、デイビッドはならず者だ」と述べました。ウィリアムは「ジェイコブはならず者で、オリバーは騎士だ」と主張しました。クロエによれば「オリバーは騎士だ」とのことです。デイビッドはあなたにエイヴァがならず者だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブは騎士です  \n(2) エイヴァはならず者です  \n(3) オリバーはならず者です  \n(4) ウィリアムはならず者です  \n(5) クロエはならず者です  \n(6) デイビッドは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジェームズ、メイソン、ジェイコブ、ペネロペ、ハーパー、そしてエマ。ジェームズは「ペネロペはならず者か、ジェイコブは騎士だ」とコメントしました。メイソンの言葉では「ハーパーは騎士だ」と言っています。ジェイコブは「もしメイソンがならず者なら、メイソンは騎士だ」とあなたに言いました。ペネロペは「ハーパーはならず者で、エマはならず者だ」と言っているのが聞かれました。ハーパーによれば「エマは騎士か、ジェームズは騎士だ」とのことです。エマは「もしハーパーが騎士なら、ジェームズは騎士だ」と表現しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズは騎士です  \n(2) メイソンは騎士です  \n(3) ジェイコブは騎士です  \n(4) ペネロペはならず者です  \n(5) ハーパーは騎士です  \n(6) エマは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：オリビア、ミア、エイヴァ、オリバー、ライリー、そしてジャクソン。オリビアの言葉によれば、「ミアはならず者である場合に限り、オリバーはならず者です」。ミアによると、「エイヴァは騎士であるか、ミアは騎士です」。エイヴァによれば、「ライリーはならず者であるか、オリバーは騎士です」。オリバーは、ミアは騎士であるか、エイヴァは騎士であると言いました。ライリーの発言では、「もしジャクソンがならず者なら、ジャクソンは騎士です」。ジャクソンは、「オリビアは騎士である場合に限り、オリビアはならず者です」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアは騎士です  \n(2) ミアは騎士です  \n(3) エイヴァは騎士です  \n(4) オリバーは騎士です  \n(5) ライリーはならず者です  \n(6) ジャクソンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：デイビッド、エイヴァ、オーロラ、エラ、ローガン、そしてルーク。デイビッドは「ルークは騎士であるのはエイヴァがならず者である場合に限る」と言いました。「ルークがならず者であれば、ローガンは騎士です」とエイヴァが言いました。オーロラは「デイビッドが騎士であれば、エイヴァは騎士です」と表現しました。エラは「ローガンはならず者であるか、ルークは騎士です」と述べました。「エイヴァは騎士であるか、デイビッドは騎士です」とローガンが主張しました。ルークは「オーロラはならず者であるか、ローガンはならず者です」と断言しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドは騎士です  \n(2) エイヴァは騎士です  \n(3) オーロラは騎士です  \n(4) エラはならず者です  \n(5) ローガンは騎士です  \n(6) ルークはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：アビゲイル、アリア、セバスチャン、ヘンリー、エイヴァ、そしてベンジャミン。アビゲイルはこう言いました。「アリアはベンジャミンがならず者である場合に限り、騎士です。」アリアは「アリアは騎士であるか、ベンジャミンがならず者である」と言いました。「エイヴァはならず者であるか、ヘンリーは騎士である」とセバスチャンが宣言しました。ヘンリーは「エイヴァは騎士であり、ベンジャミンは騎士である」と言っているのが聞かれました。エイヴァは「ベンジャミンはならず者であり、アビゲイルは騎士である」と言いました。ベンジャミンは「もしアビゲイルが騎士であれば、エイヴァは騎士である」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アビゲイルはならず者です  \n(2) アリアは騎士です  \n(3) セバスチャンは騎士です  \n(4) ヘンリーはならず者です  \n(5) エイヴァはならず者です  \n(6) ベンジャミンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：サミュエル、メイソン、ベンジャミン、ソフィア、ハーパー、そしてアリア。サミュエルは「アリアは騎士だ」と言いました。メイソンは「アリアが騎士であるならば、ベンジャミンはならず者だ」と言いました。ベンジャミンによれば「サミュエルは騎士であるか、ソフィアは騎士である」とのことです。ソフィアは「アリアは騎士であるか、ハーパーはならず者だ」とコメントしました。ハーパーは「ハーパーは騎士だ」と言っているのが聞かれました。アリアは「もしベンジャミンが騎士であれば、ベンジャミンはならず者だ」と言っているのが聞かれました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルはならず者です  \n(2) メイソンは騎士です  \n(3) ベンジャミンは騎士です  \n(4) ソフィアは騎士です  \n(5) ハーパーはならず者です  \n(6) アリアはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ハーパー、ウィリアム、アリア、サミュエル、ルーカス、そしてメイソン。ハーパーは「ルーカスはならず者で、サミュエルは騎士だ」と言いました。ウィリアムはメイソンがならず者で、サミュエルが騎士だと言いました。アリアはハーパーが騎士で、メイソンが騎士だと表現しました。サミュエルは「アリアはならず者ではない」と述べました。ルーカスはメイソンがならず者であるか、ウィリアムがならず者であると言いました。メイソンはあなたにハーパーがならず者ではないと言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーはならず者です  \n(2) ウィリアムはならず者です  \n(3) アリアはならず者です  \n(4) サミュエルはならず者です  \n(5) ルーカスは騎士です  \n(6) メイソンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：マイケル、エマ、クロエ、ゾーイ、アレクサンダー、そしてエラ。マイケルの発言はこうです：「もしゾーイが騎士なら、クロエはならず者です」。エマは「クロエはならず者か、ゾーイはならず者です」と述べました。クロエはあなたに、マイケルはならず者か、エマはならず者だと言いました。ゾーイは「マイケルはならず者ではありません」と言いました。アレクサンダーは「クロエはならず者です」と述べました。エラによれば「クロエは騎士か、アレクサンダーは騎士です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルは騎士です  \n(2) エマは騎士です  \n(3) クロエはならず者です  \n(4) ゾーイは騎士です  \n(5) アレクサンダーは騎士です  \n(6) エラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ミア、クロエ、デイビッド、シャーロット、エリザベス、そしてオリビア。ミアは「ミアは騎士か、オリビアはならず者です」と述べました。クロエはシャーロットが騎士であると言いました。デイビッドは「エリザベスはならず者です」と述べました。シャーロットは「クロエはミアがならず者である場合に限り騎士です」と言いました。「ミアは騎士か、オリビアは騎士です」とエリザベスは宣言しました。オリビアは「シャーロットは騎士です」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアはならず者です  \n(2) クロエは騎士です  \n(3) デイビッドはならず者です  \n(4) シャーロットは騎士です  \n(5) エリザベスは騎士です  \n(6) オリビアは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ルーク、ルーカス、ダニエル、スカーレット、グレース、そしてサミュエル。ルークによると、「もしスカーレットがならず者なら、ルークは騎士だ」。ルーカスは「もしグレースが騎士なら、スカーレットはならず者だ」と主張しました。ダニエルは「ルーカスはならず者か、ルークは騎士だと言っているのが聞かれました。スカーレットは「ダニエルはならず者だ」と言いました。グレースの発言では「スカーレットは騎士だ」と言っています。「もしルークが騎士なら、ダニエルはならず者だ」とサミュエルが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) ルーカスは騎士です  \n(3) ダニエルは騎士です  \n(4) スカーレットはならず者です  \n(5) グレースはならず者です  \n(6) サミュエルはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エミリー、オーウェン、ミア、ベンジャミン、マシュー、そしてイザベラ。エミリーは「もしミアがならず者なら、イザベラはならず者です」と言いました。オーウェンは「ベンジャミンはならず者です」とコメントしました。「オーウェンは騎士ではありません」とミアは主張しました。ベンジャミンによれば、「マシューはならず者か、ベンジャミンは騎士です」。マシューは「もしベンジャミンがならず者なら、イザベラは騎士です」と言いました。イザベラは「もしオーウェンが騎士なら、オーウェンはならず者です」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーは騎士です  \n(2) オーウェンはならず者です  \n(3) ミアは騎士です  \n(4) ベンジャミンは騎士です  \n(5) マシューは騎士です  \n(6) イザベラは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エミリー、シャーロット、ジェームズ、ルーカス、イヴリン、そしてアメリア。エミリーによれば、「もしアメリアが騎士なら、ルーカスはならず者です」。シャーロットは「アメリアはならず者です」と主張しました。ジェームズの言葉では、「シャーロットは騎士ではありません」。ルーカスは「アメリアは騎士で、シャーロットも騎士です」と述べました。イヴリンの言葉では、「シャーロットは騎士です」。アメリアの言葉では、「エミリーはならず者です」。さて、誰が騎士で、誰がならず者でしょうか？",
        "solution_text_format": "(1) エミリーは騎士です  \n(2) シャーロットは騎士です  \n(3) ジェームズはならず者です  \n(4) ルーカスはならず者です  \n(5) イヴリンは騎士です  \n(6) アメリアはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジョセフ、ソフィア、エイヴァ、アメリア、アビゲイル、そしてリアム。ジョセフの言葉によれば、「エイヴァが騎士ならば、ジョセフは騎士です」。ソフィアはアビゲイルが騎士であるか、アメリアがならず者であると表現しました。エイヴァはアビゲイルがならず者であり、アメリアが騎士であると述べました。アメリアは「ジョセフはならず者であり、リアムはならず者です」と言いました。アビゲイルによれば、「エイヴァはソフィアがならず者である場合に限り、ならず者です」。リアムは「アメリアはならず者ではありません」と主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフは騎士です  \n(2) ソフィアは騎士です  \n(3) エイヴァはならず者です  \n(4) アメリアはならず者です  \n(5) アビゲイルはならず者です  \n(6) リアムはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：オリバー、ペネロペ、ミア、ルーカス、ソフィア、そしてマイケル。オリバーによれば、「ルーカスはならず者で、ペネロペは騎士です」。ペネロペはこう言いました、「もしペネロペが騎士なら、オリバーは騎士です」。ミアは主張しました：「ルーカスは騎士ではありません」。ルーカスはソフィアが騎士で、オリバーも騎士だと言いました。「マイケルは騎士か、ソフィアは騎士です」 - ソフィア。マイケルはあなたにオリバーが騎士で、ペネロペがならず者だと言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリバーは騎士です  \n(2) ペネロペは騎士です  \n(3) ミアは騎士です  \n(4) ルーカスはならず者です  \n(5) ソフィアはならず者です  \n(6) マイケルはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：アビゲイル、エミリー、ローガン、ダニエル、エイデン、そしてエマ。「ダニエルはならず者であるのはローガンが騎士である場合に限る」とアビゲイルは主張しました。エミリーは「ローガンは騎士です」と言いました。「もしエイデンが騎士なら、ダニエルはならず者です」とローガンが言いました。ダニエルは「ローガンは騎士ではありません」と言いました。エイデンは「アビゲイルはならず者です」と言っているのが聞かれました。エマの言葉では、「エイデンはならず者で、ローガンは騎士です」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アビゲイルは騎士です  \n(2) エミリーは騎士です  \n(3) ローガンは騎士です  \n(4) ダニエルはならず者です  \n(5) エイデンはならず者です  \n(6) エマは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エラ、アレクサンダー、サミュエル、ノア、ルーク、そしてデイビッド。エラは「アレクサンダーは騎士ではない」と述べました。アレクサンダーは「エラは騎士であるか、ルークはならず者である」とコメントしました。サミュエルは「ルークはならず者である」と言いました。「もしエラがならず者なら、ルークはならず者である」とノアが言いました。「ノアは騎士であり、サミュエルはならず者である」とルークが言いました。「エラはならず者であり、エラは騎士である」とデイビッドが主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラはならず者です  \n(2) アレクサンダーは騎士です  \n(3) サミュエルは騎士です  \n(4) ノアは騎士です  \n(5) ルークはならず者です  \n(6) デイビッドはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ゾーイ、ダニエル、ルーカス、エイヴァ、オーウェン、そしてアメリア。ゾーイは「アメリアが騎士なら、エイヴァも騎士だ」と言いました。ダニエルは「オーウェンはならず者か、ダニエルは騎士だ」と言いました。ルーカスの言葉では「ダニエルは騎士ではない」と言っています。エイヴァは「ゾーイはならず者だ」と述べました。オーウェンによれば「オーウェンは騎士か、ゾーイは騎士だ」と言っています。アメリアは「ダニエルは騎士で、ゾーイは騎士だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ゾーイは騎士です  \n(2) ダニエルはならず者です  \n(3) ルーカスは騎士です  \n(4) エイヴァはならず者です  \n(5) オーウェンは騎士です  \n(6) アメリアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジェームズ、ルーク、アビゲイル、メイソン、ビクトリア、そしてゾーイ。ジェームズの発言：「ルークは騎士で、メイソンはならず者です」。ルークは「ビクトリアはならず者か、アビゲイルはならず者です」と述べました。アビゲイルは「ビクトリアが騎士なら、アビゲイルも騎士です」と表現しました。「ビクトリアはならず者か、ジェームズは騎士です」とメイソンが主張しました。「もしジェームズがならず者なら、アビゲイルは騎士です」とビクトリアが言及しました。「ルークはならず者で、ビクトリアはならず者です」とゾーイが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズはならず者です  \n(2) ルークはならず者です  \n(3) アビゲイルは騎士です  \n(4) メイソンはならず者です  \n(5) ビクトリアは騎士です  \n(6) ゾーイはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ソフィア、アリア、オーウェン、イヴリン、ベンジャミン、そしてエラ。ソフィアは「ソフィアは騎士であるのは、イヴリンがならず者である場合に限る」と言いました。アリアの言葉では、「エラはならず者で、アリアは騎士です」とのことです。オーウェンは「ソフィアは騎士です」と指摘しました。イヴリンの発言では、「エラは騎士です」と言いました。ベンジャミンは「ソフィアはならず者ではありません」と主張しました。エラは「もしベンジャミンが騎士なら、アリアはならず者です」と表現しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) アリアは騎士です  \n(3) オーウェンは騎士です  \n(4) イヴリンはならず者です  \n(5) ベンジャミンは騎士です  \n(6) エラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：アレクサンダー、ダニエル、マイケル、ジェイコブ、アリア、そしてベンジャミン。アレクサンダーは「ベンジャミンは騎士で、ジェイコブも騎士だ」と言いました。「もしダニエルが騎士なら、ジェイコブはならず者だ」とダニエルが宣言しました。マイケルは「もしジェイコブが騎士なら、アレクサンダーはならず者だ」と言いました。「もしアレクサンダーがならず者なら、ダニエルはならず者だ」とジェイコブが言いました。アリアは「ジェイコブはならず者ではない」とコメントしました。ベンジャミンは「アリアはならず者だ」と指摘しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アレクサンダーはならず者です  \n(2) ダニエルは騎士です  \n(3) マイケルは騎士です  \n(4) ジェイコブはならず者です  \n(5) アリアはならず者です  \n(6) ベンジャミンは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ベンジャミン、クロエ、ビクトリア、イザベラ、エラ、そしてエミリー。ベンジャミンは「クロエは騎士ではない」と言いました。クロエは「クロエは騎士だ」と言っているのが聞かれました。「クロエはならず者で、エミリーはならず者だ」とビクトリアが宣言しました。イザベラはあなたにベンジャミンが騎士だと言いました。エラは「ベンジャミンはならず者ではない」とコメントしました。エミリーは「クロエはビクトリアが騎士である場合に限りならず者だ」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンはならず者です  \n(2) クロエは騎士です  \n(3) ビクトリアはならず者です  \n(4) イザベラはならず者です  \n(5) エラはならず者です  \n(6) エミリーは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ソフィア、ウィリアム、アリア、エリザベス、オーウェン、そしてルーカス。ソフィアは「エリザベスがならず者なら、アリアはならず者です」と主張しました。ウィリアムは「オーウェンは騎士か、ルーカスはならず者です」と宣言しました。アリアは「ルーカスは騎士ではありません」とコメントしました。エリザベスはアリアがならず者ではないと言いました。オーウェンの言葉では「ソフィアは騎士である場合に限り、ソフィアはならず者です」。ルーカスは「オーウェンは騎士で、ルーカスは騎士です」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) ウィリアムは騎士です  \n(3) アリアは騎士です  \n(4) エリザベスは騎士です  \n(5) オーウェンはならず者です  \n(6) ルーカスはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：マイケル、ベンジャミン、セバスチャン、グレース、イーサン、そしてアリア。マイケルは「イーサンはならず者か、マイケルは騎士だ」と主張しました。ベンジャミンは「もしマイケルがならず者なら、アリアはならず者だ」と述べました。「ベンジャミンは騎士だ」とセバスチャンが言いました。グレースによれば、「セバスチャンはならず者で、アリアは騎士だ」とのことです。イーサンは「マイケルは騎士だ」と言っているのが聞かれました。アリアは「イーサンは騎士か、ベンジャミンは騎士だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルは騎士です  \n(2) ベンジャミンは騎士です  \n(3) セバスチャンは騎士です  \n(4) グレースはならず者です  \n(5) イーサンは騎士です  \n(6) アリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ルーカス、エイデン、ソフィア、アレクサンダー、ミア、そしてゾーイ。ルーカスは「エイデンが騎士なら、ミアは騎士だ」と宣言しました。エイデンは「ソフィアはルーカスが騎士である場合に限りならず者だ」と述べました。ソフィアはアレクサンダーが騎士であるか、アレクサンダーがならず者であると言いました。アレクサンダーは「ミアはソフィアがならず者である場合に限りならず者だ」と言いました。ミアは「ゾーイは騎士ではない」と言いました。ゾーイはソフィアがならず者だと言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスは騎士です  \n(2) エイデンはならず者です  \n(3) ソフィアは騎士です  \n(4) アレクサンダーは騎士です  \n(5) ミアは騎士です  \n(6) ゾーイはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：アビゲイル、エイヴァ、ソフィア、ソフィア、ライリー、そしてデイビッドです。「ソフィアは騎士ではない」とアビゲイルが主張しました。「ソフィアはならず者で、エイヴァは騎士です」とエイヴァが言いました。ソフィアはライリーが騎士ではないと言いました。ソフィアは「ソフィアはならず者か、デイビッドはならず者です」と述べました。ライリーは「ソフィアは騎士か、アビゲイルは騎士です」と主張しました。デイビッドはエイヴァがならず者だと表現しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アビゲイルは騎士です  \n(2) エイヴァはならず者です  \n(3) ソフィアはならず者です  \n(4) ソフィアは騎士です  \n(5) ライリーは騎士です  \n(6) デイビッドは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エラ、ペネロペ、リアム、ジェイコブ、グレース、そしてジェームズ。エラは「ペネロペはならず者か、リアムはならず者だ」と宣言しました。ペネロペは「リアムはならず者で、ジェームズはならず者だ」と言いました。リアムは「ペネロペはならず者だ」とコメントしました。ジェイコブは「グレースは騎士か、ジェームズは騎士だ」と言及しました。グレースの発言では「エラは騎士か、グレースは騎士だ」と述べました。ジェームズの発言では「ジェイコブはならず者か、ジェイコブは騎士だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラは騎士です  \n(2) ペネロペはならず者です  \n(3) リアムは騎士です  \n(4) ジェイコブは騎士です  \n(5) グレースは騎士です  \n(6) ジェームズは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ミア、ジェームズ、エマ、メイソン、エラ、そしてハーパーです。「ハーパーは騎士ではない」とミアが言いました。「ハーパーは騎士だ」とジェームズが主張しました。エマは「エマは騎士で、メイソンも騎士だ」と断言しました。メイソンは「エマがならず者であるのはエラがならず者である場合に限る」と述べました。エラは「ハーパーは騎士ではない」とコメントしました。ハーパーによれば「メイソンは騎士か、ジェームズはならず者だ」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアはならず者です  \n(2) ジェームズは騎士です  \n(3) エマはならず者です  \n(4) メイソンは騎士です  \n(5) エラはならず者です  \n(6) ハーパーは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：オーウェン、サミュエル、ジョセフ、ソフィア、オリビア、そしてゾーイ。オーウェンによれば、「オリビアはゾーイが騎士である場合に限り騎士です」。サミュエルはオリビアがならず者ではないと言いました。ジョセフは「ゾーイが騎士ならソフィアはならず者です」と言いました。ソフィアは「オリビアがならず者である場合に限りジョセフはならず者です」と主張しました。オリビアは「ゾーイはならず者です」と言いました。ゾーイは「ジョセフがならず者である場合に限りオーウェンは騎士です」と主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンはならず者です  \n(2) サミュエルはならず者です  \n(3) ジョセフは騎士です  \n(4) ソフィアはならず者です  \n(5) オリビアはならず者です  \n(6) ゾーイは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エラ、クロエ、リアム、ジョセフ、デイビッド、そしてエマ。エラは「エマは騎士ではない」とコメントしました。クロエによれば、「ジョセフはならず者であるか、クロエは騎士である」とのことです。「ジョセフは騎士で、エラも騎士だ」とリアムは主張しました。ジョセフは「クロエはならず者ではない」とコメントしました。デイビッドは「エマは騎士で、エラも騎士だ」と言いました。エマは「クロエはならず者だ」と述べました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラは騎士です  \n(2) クロエは騎士です  \n(3) リアムは騎士です  \n(4) ジョセフは騎士です  \n(5) デイビッドはならず者です  \n(6) エマはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ノア、エミリー、クロエ、デイビッド、ルーク、そしてオリビア。ノアの発言では、「デイビッドはエミリーがならず者である場合に限り騎士である」。エミリーは「ノアはならず者ではない」と言いました。クロエは「デイビッドはならず者で、エミリーは騎士だ」と述べました。デイビッドは「ノアはならず者ではない」と指摘しました。ルークは「オリビアはならず者だ」と述べました。オリビアは「クロエは騎士ではない」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアはならず者です  \n(2) エミリーはならず者です  \n(3) クロエはならず者です  \n(4) デイビッドはならず者です  \n(5) ルークはならず者です  \n(6) オリビアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：イザベラ、エラ、ゾーイ、エミリー、メイソン、そしてオリビア。イザベラは、エラがならず者でエミリーが騎士であると表現しました。エラは「エラは騎士かエミリーはならず者だ」と述べました。「もしエラがならず者なら、ゾーイは騎士だ」とゾーイが言いました。エミリーの発言によれば、「メイソンはならず者である場合に限り、オリビアはならず者である」。メイソンは「エラは騎士でゾーイはならず者だ」と言いました。オリビアの発言は「もしイザベラがならず者なら、エラはならず者だ」となっています。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イザベラはならず者です  \n(2) エラは騎士です  \n(3) ゾーイは騎士です  \n(4) エミリーは騎士です  \n(5) メイソンはならず者です  \n(6) オリビアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：セバスチャン、エミリー、エイブリー、オーロラ、エイヴァ、そしてソフィア。セバスチャンによると、「もしエミリーがならず者なら、エイヴァは騎士です」。エミリーは、ソフィアが騎士であるか、エイブリーがならず者であると表現しました。エイブリーは、「エイヴァはならず者か、オーロラはならず者です」と言っているのが聞かれました。オーロラの発言では、「ソフィアはならず者で、オーロラは騎士です」。エイヴァは、「エミリーは騎士ではありません」と言っているのが聞かれました。ソフィアは、「エイブリーはならず者か、エイブリーは騎士です」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) セバスチャンは騎士です  \n(2) エミリーは騎士です  \n(3) エイブリーは騎士です  \n(4) オーロラはならず者です  \n(5) エイヴァはならず者です  \n(6) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ウィリアム、リアム、オリビア、アビゲイル、ヘンリー、そしてローガン。ウィリアムは、「ヘンリーは騎士であるのは、ウィリアムが騎士である場合に限る」と表現しました。リアムの言葉では、「ローガンはオリビアが騎士である場合に限り騎士です」。オリビアは、「ローガンは騎士であるか、ウィリアムはならず者です」と言いました。アビゲイルは、「ウィリアムはオリビアがならず者である場合に限り騎士です」と述べました。ヘンリーは、リアムが騎士であり、ウィリアムが騎士であると言いました。「ヘンリーは騎士であるか、オリビアは騎士です」とローガンは宣言しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムは騎士です  \n(2) リアムは騎士です  \n(3) オリビアは騎士です  \n(4) アビゲイルはならず者です  \n(5) ヘンリーは騎士です  \n(6) ローガンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エマ、ベンジャミン、ジョセフ、メイソン、エイヴァ、そしてデイビッド。エマは、ベンジャミンが騎士だと言いました。ベンジャミンは「デイビッドは騎士だ」と言っているのが聞かれました。「ジョセフは騎士か、デイビッドは騎士だ」とジョセフが言いました。メイソンによれば、「ベンジャミンは騎士で、エマはならず者だ」とのことです。「もしエイヴァが騎士なら、ジョセフはならず者だ」とエイヴァは主張しました。デイビッドは「ベンジャミンは騎士で、ジョセフは騎士だ」と述べました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エマはならず者です  \n(2) ベンジャミンはならず者です  \n(3) ジョセフはならず者です  \n(4) メイソンはならず者です  \n(5) エイヴァは騎士です  \n(6) デイビッドはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：アレクサンダー、ミア、リリー、エイヴァ、イザベラ、そしてエイデン。アレクサンダーは「イザベラはならず者ではない」とコメントしました。ミアは「アレクサンダーはイザベラが騎士である場合に限り騎士である」と言いました。「アレクサンダーはならず者だ」とリリーが言いました。エイヴァは「もしエイデンが騎士なら、ミアはならず者だ」と言いました。「エイデンは騎士か、エイデンはならず者だ」とイザベラが宣言しました。エイデンは「ミアは騎士だ」と主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アレクサンダーは騎士です  \n(2) ミアは騎士です  \n(3) リリーはならず者です  \n(4) エイヴァはならず者です  \n(5) イザベラは騎士です  \n(6) エイデンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：リリー、ジェイコブ、ルーク、マイケル、オーウェン、そしてエイブリー。リリーの発言：「もしジェイコブがならず者なら、エイブリーはならず者です」。ジェイコブは「リリーは騎士ではない」と述べました。ルークは「マイケルは騎士です」と言いました。マイケルの言葉：「リリーはならず者ではありません」。オーウェンは「エイブリーは騎士で、リリーも騎士です」と言いました。エイブリーは「リリーが騎士である場合、ルークはならず者です」と指摘しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーは騎士です  \n(2) ジェイコブはならず者です  \n(3) ルークは騎士です  \n(4) マイケルは騎士です  \n(5) オーウェンはならず者です  \n(6) エイブリーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：オリバー、ノア、ビクトリア、エラ、アメリア、そしてイーサン。オリバーは「エラはならず者か、アメリアは騎士だ」と述べました。ノアの言葉では「オリバーはならず者ではない」と言いました。「ノアはアメリアがならず者である場合に限り、ならず者だ」とビクトリアが言いました。エラは「ビクトリアは騎士か、エラは騎士だ」と述べました。アメリアの発言では「オリバーは騎士で、ビクトリアはならず者だ」と言いました。イーサンは「ビクトリアはならず者で、ビクトリアは騎士だ」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリバーはならず者です  \n(2) ノアはならず者です  \n(3) ビクトリアは騎士です  \n(4) エラは騎士です  \n(5) アメリアはならず者です  \n(6) イーサンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エイヴァ、シャーロット、エラ、ジャクソン、オーウェン、そしてアメリア。エイヴァは「シャーロットはならず者で、オーウェンはならず者です」と述べました。「エイヴァはならず者ではありません」とシャーロットは主張しました。エラは「アメリアはジャクソンがならず者である場合に限り、ならず者です」と言いました。ジャクソンによれば、「シャーロットが騎士であれば、オーウェンはならず者です」。オーウェンは「シャーロットはエイヴァがならず者である場合に限り、ならず者です」と表現しました。アメリアは「シャーロットは騎士ではありません」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァはならず者です  \n(2) シャーロットはならず者です  \n(3) エラは騎士です  \n(4) ジャクソンは騎士です  \n(5) オーウェンは騎士です  \n(6) アメリアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ウィリアム、エリザベス、ジャクソン、エマ、アメリア、そしてセバスチャン。ウィリアムはジャクソンが騎士であると述べました。エリザベスの言葉では、「アメリアは騎士か、エマはならず者です」。ジャクソンの言葉では、「セバスチャンは騎士か、ウィリアムはならず者です」。エマによれば、「エリザベスは騎士か、セバスチャンはならず者です」。アメリアは「ジャクソンが騎士であるのは、エマが騎士である場合に限る」と述べました。セバスチャンは「エリザベスは騎士か、エリザベスはならず者です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムは騎士です  \n(2) エリザベスは騎士です  \n(3) ジャクソンは騎士です  \n(4) エマは騎士です  \n(5) アメリアは騎士です  \n(6) セバスチャンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エミリー、ベンジャミン、ビクトリア、ソフィア、ライリー、そしてイザベラ。エミリーは、「ビクトリアはならず者であるのは、ベンジャミンが騎士である場合に限る」と言いました。ベンジャミンの発言は、「ソフィアが騎士であれば、ソフィアはならず者である」とのことです。ビクトリアによれば、「ベンジャミンはならず者です」。ソフィアは、「エミリーが騎士であれば、イザベラはならず者です」と主張しました。ライリーは、「エミリーが騎士であれば、ビクトリアは騎士です」と述べました。イザベラは、「エミリーはならず者ではありません」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーは騎士です  \n(2) ベンジャミンは騎士です  \n(3) ビクトリアはならず者です  \n(4) ソフィアはならず者です  \n(5) ライリーはならず者です  \n(6) イザベラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エイデン、イザベラ、エイブリー、オリビア、ウィリアム、そしてノアです。エイデンは「ノアはならず者で、エイブリーもならず者だ」と言いました。イザベラは「エイデンはノアがならず者である場合に限りならず者だ」と述べました。エイブリーの言葉では「ノアは騎士だ」と言っています。オリビアは「エイブリーはノアがならず者である場合に限り騎士だ」とあなたに伝えました。ウィリアムは「エイブリーがならず者なら、ノアもならず者だ」と主張しました。ノアの言葉では「ウィリアムは騎士で、イザベラはならず者だ」と言っています。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンはならず者です  \n(2) イザベラはならず者です  \n(3) エイブリーは騎士です  \n(4) オリビアはならず者です  \n(5) ウィリアムは騎士です  \n(6) ノアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：マイケル、イザベラ、ゾーイ、ソフィア、イヴリン、そしてサミュエル。マイケルは「ゾーイはならず者か、ゾーイは騎士だ」と主張しました。イザベラは「もしソフィアが騎士なら、イヴリンはならず者だ」と断言しました。ゾーイの発言では「イザベラは騎士か、イヴリンはならず者だ」と言いました。ソフィアはあなたに、イヴリンはならず者か、サミュエルはならず者だと言いました。「ゾーイは騎士ではない」とイヴリンは宣言しました。サミュエルは「ゾーイはならず者だ」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルは騎士です  \n(2) イザベラは騎士です  \n(3) ゾーイは騎士です  \n(4) ソフィアは騎士です  \n(5) イヴリンはならず者です  \n(6) サミュエルはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：グレース、セバスチャン、リアム、エイデン、リリー、そしてスカーレット。グレースは「スカーレットはならず者で、スカーレットは騎士です」と言いました。セバスチャンの発言では「エイデンは騎士で、スカーレットは騎士です」と言っています。リアムは「リアムは騎士か、リリーはならず者です」と述べました。エイデンは「スカーレットは騎士か、スカーレットはならず者です」とあなたに言いました。「リアムは騎士で、セバスチャンは騎士です」とリリーは主張しました。スカーレットは「もしグレースがならず者なら、エイデンは騎士です」と断言しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) グレースはならず者です  \n(2) セバスチャンは騎士です  \n(3) リアムは騎士です  \n(4) エイデンは騎士です  \n(5) リリーは騎士です  \n(6) スカーレットは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：メイソン、ペネロペ、ベンジャミン、セバスチャン、ライリー、そしてオリビア。メイソンの発言では、「ライリーは騎士です」。ペネロペは、「ライリーが騎士なら、メイソンはならず者です」とコメントしました。「メイソンはならず者です」とベンジャミンが言いました。セバスチャンによれば、「オリビアは騎士ではありません」。ライリーは、「ベンジャミンが騎士なら、セバスチャンは騎士です」と主張しました。オリビアは、「ペネロペはセバスチャンが騎士である場合に限りならず者です」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) メイソンはならず者です  \n(2) ペネロペは騎士です  \n(3) ベンジャミンは騎士です  \n(4) セバスチャンはならず者です  \n(5) ライリーはならず者です  \n(6) オリビアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：リリー、ハーパー、エイブリー、オリビア、マシュー、そしてアメリア。リリーの言葉では、「もしエイブリーが騎士なら、アメリアは騎士です」。ハーパーは、リリーが騎士ではないと言いました。エイブリーは、「ハーパーはならず者か、オリビアはならず者です」と述べました。オリビアは、リリーがならず者ならアメリアは騎士だと言いました。マシューは、オリビアが騎士であるのはアメリアが騎士である場合に限ると言いました。アメリアは、「エイブリーはならず者ではありません」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーは騎士です  \n(2) ハーパーはならず者です  \n(3) エイブリーは騎士です  \n(4) オリビアは騎士です  \n(5) マシューは騎士です  \n(6) アメリアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：アリア、イザベラ、イーサン、アメリア、メイソン、そしてウィリアム。「ウィリアムはならず者か、メイソンはならず者です」とアリアが宣言しました。「ウィリアムは騎士です」とイザベラが言いました。イーサンの言葉では、「メイソンは騎士です」。アメリアは「イーサンはならず者です」と言いました。「アリアはならず者で、ウィリアムはならず者です」とメイソンが言いました。ウィリアムはイザベラがならず者か、イザベラが騎士だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アリアは騎士です  \n(2) イザベラは騎士です  \n(3) イーサンはならず者です  \n(4) アメリアは騎士です  \n(5) メイソンはならず者です  \n(6) ウィリアムは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジョセフ、リアム、ゾーイ、イザベラ、メイソン、そしてヘンリー。ジョセフは「イザベラは騎士で、ヘンリーはならず者だ」と主張しました。リアムの発言では「ゾーイは騎士だ」と言いました。ゾーイは「イザベラはならず者ではない」と述べました。「もしヘンリーが騎士なら、メイソンは騎士だ」とイザベラが言いました。メイソンは「ジョセフは騎士だ」とコメントしました。ヘンリーは「もしメイソンがならず者なら、リアムはならず者だ」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフはならず者です  \n(2) リアムはならず者です  \n(3) ゾーイはならず者です  \n(4) イザベラはならず者です  \n(5) メイソンはならず者です  \n(6) ヘンリーは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エイデン、グレース、ペネロペ、マイケル、ノア、そしてイヴリン。エイデンは「ノアは騎士だ」と言いました。グレースの発言では「ノアは騎士ではない」と言っています。ペネロペによれば「ノアはならず者ではない」とのことです。「ペネロペは騎士ではない」とマイケルが言いました。ノアは「もしエイデンが騎士なら、ペネロペは騎士だ」と表現しました。イヴリンは「イヴリンは騎士で、ペネロペはならず者だ」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンは騎士です  \n(2) グレースはならず者です  \n(3) ペネロペは騎士です  \n(4) マイケルはならず者です  \n(5) ノアは騎士です  \n(6) イヴリンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：イザベラ、アメリア、ジョセフ、ライリー、ビクトリア、そしてジェームズ。イザベラは「アメリアがならず者なら、ジョセフはならず者です」と言いました。アメリアは「ビクトリアはならず者です」と言っているのが聞かれました。ジョセフは「イザベラは騎士か、ジェームズは騎士です」と言いました。ライリーは「イザベラは騎士で、ジョセフは騎士です」と言いました。ビクトリアは「ライリーは騎士ではありません」とコメントしました。ジェームズは「アメリアはならず者で、イザベラは騎士です」と表現しました。さて、誰が騎士で、誰がならず者でしょうか？",
        "solution_text_format": "(1) イザベラは騎士です  \n(2) アメリアは騎士です  \n(3) ジョセフは騎士です  \n(4) ライリーは騎士です  \n(5) ビクトリアはならず者です  \n(6) ジェームズはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ローガン、エミリー、オーウェン、エラ、アリア、そしてライリー。ローガンはこう言いました。「オーウェンは騎士です」。エミリーは「ローガンはならず者で、ローガンは騎士です」と主張しました。オーウェンの発言によれば、「ローガンはならず者で、ライリーは騎士です」。エラによると、「ライリーはエミリーがならず者である場合に限り騎士です」。アリアはローガンがならず者ではないと表現しました。ライリーは「エミリーは騎士であるか、ライリーが騎士です」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンはならず者です  \n(2) エミリーはならず者です  \n(3) オーウェンはならず者です  \n(4) エラはならず者です  \n(5) アリアはならず者です  \n(6) ライリーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：イーサン、ヘンリー、ジャック、ジェイコブ、イヴリン、そしてベンジャミン。イーサンは「ベンジャミンは騎士で、イヴリンはならず者だ」と主張しました。ヘンリーは「もしジェイコブが騎士なら、ジャックは騎士だ」と述べました。「もしベンジャミンがならず者なら、ヘンリーは騎士だ」とジャックは宣言しました。ジェイコブは「ジャックが騎士である場合、ジャックはならず者だ」と言っているのが聞かれました。「もしジェイコブが騎士なら、ジャックは騎士だ」とイヴリンが言いました。ベンジャミンは「もしジャックが騎士なら、ジャックはならず者だ」と表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンはならず者です  \n(2) ヘンリーは騎士です  \n(3) ジャックは騎士です  \n(4) ジェイコブはならず者です  \n(5) イヴリンは騎士です  \n(6) ベンジャミンはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ダニエル、ミア、オリバー、エイブリー、マイケル、そしてオリビア。ダニエルは「オリビアは騎士である場合に限り、ならず者です」と述べました。「マイケルはオリビアがならず者である場合に限り、ならず者です」とミアが言いました。「オリバーはオリビアがならず者です」とオリバーが主張しました。「ミアはならず者です」とエイブリー。マイケルは「オリバーは騎士です」と言いました。オリビアは「エイブリーはならず者です」と主張しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルはならず者です  \n(2) ミアはならず者です  \n(3) オリバーは騎士です  \n(4) エイブリーは騎士です  \n(5) マイケルは騎士です  \n(6) オリビアはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：グレース、ノア、シャーロット、オーロラ、イザベラ、そしてルーク。グレースは、シャーロットがならず者でオーロラが騎士であると述べました。「グレースは騎士であり、グレースはならず者だ」とノアは宣言しました。「オーロラはならず者か、ルークは騎士だ」とシャーロットは主張しました。オーロラは、シャーロットがならず者かイザベラが騎士であると述べました。「ノアはならず者だ」とイザベラは宣言しました。「イザベラは騎士だ」とルークが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) グレースはならず者です  \n(2) ノアはならず者です  \n(3) シャーロットは騎士です  \n(4) オーロラは騎士です  \n(5) イザベラは騎士です  \n(6) ルークは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：シャーロット、ジェイコブ、ウィリアム、ハーパー、アメリア、そしてリアム。シャーロットの発言：「もしリアムがならず者なら、ウィリアムはならず者です」。ジェイコブはこう言いました：「シャーロットはならず者で、リアムはならず者です」。ウィリアムは、アメリアがならず者であるか、シャーロットが騎士であると表現しました。「ウィリアムは騎士ではありません」 - ハーパー。アメリアの発言：「ウィリアムはならず者ではありません」。リアムは、もしジェイコブがならず者なら、リアムは騎士であると表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットは騎士です  \n(2) ジェイコブはならず者です  \n(3) ウィリアムは騎士です  \n(4) ハーパーはならず者です  \n(5) アメリアは騎士です  \n(6) リアムは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジョセフ、ゾーイ、セバスチャン、ルーク、ソフィア、そしてノア。ジョセフが言ったように、「セバスチャンはならず者か、ルークは騎士です」。ゾーイによれば、「もしノアが騎士なら、ソフィアはならず者です」。セバスチャンは、もしジョセフが騎士なら、ルークはならず者だと言いました。ルークは、ジョセフが騎士かゾーイが騎士だと言いました。ソフィアは、ゾーイが騎士であり、ゾーイがならず者だと言いました。ノアの言葉では、「ソフィアは騎士であり、セバスチャンはならず者です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフは騎士です  \n(2) ゾーイは騎士です  \n(3) セバスチャンはならず者です  \n(4) ルークは騎士です  \n(5) ソフィアはならず者です  \n(6) ノアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エイデン、エマ、リリー、ジャック、ダニエル、そしてシャーロット。エイデンは「エマはならず者ではない」とコメントしました。エマは「エイデンはならず者であるか、ジャックは騎士である」と主張しました。「ダニエルはならず者ではない」とリリーが言いました。「ジャックは騎士であるか、シャーロットは騎士である」とジャックが宣言しました。ダニエルは「シャーロットは騎士であるのは、リリーがならず者である場合に限る」と言いました。シャーロットは「ダニエルはならず者である」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンは騎士です  \n(2) エマは騎士です  \n(3) リリーは騎士です  \n(4) ジャックは騎士です  \n(5) ダニエルは騎士です  \n(6) シャーロットはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エイデン、クロエ、エイブリー、シャーロット、エミリー、そしてオーロラ。エイデンは「エミリーは騎士ではない」と言いました。クロエは「オーロラは騎士か、エイデンは騎士だ」と言っているのが聞かれました。「もしエミリーがならず者なら、エミリーは騎士だ」とエイブリーは主張しました。「オーロラは騎士か、エイデンはならず者だ」とシャーロットは言いました。エミリーは「クロエはならず者ではない」と述べました。オーロラは「もしエイブリーが騎士なら、シャーロットは騎士だ」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンはならず者です  \n(2) クロエは騎士です  \n(3) エイブリーは騎士です  \n(4) シャーロットは騎士です  \n(5) エミリーは騎士です  \n(6) オーロラは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジェームズ、リリー、イーサン、ソフィア、ソフィア、そしてイザベラ。ジェームズが言ったように、「リリーはならず者です」。リリーは「イーサンは騎士です」と主張しました。イーサンは「イーサンは騎士で、イザベラは騎士です」と述べました。「リリーはならず者で、イーサンはならず者です」とソフィアが宣言しました。ソフィアによれば、「イーサンはならず者です」。イザベラは「もしソフィアがならず者なら、リリーはならず者です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズは騎士です  \n(2) リリーはならず者です  \n(3) イーサンはならず者です  \n(4) ソフィアは騎士です  \n(5) ソフィアは騎士です  \n(6) イザベラは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジェームズ、ソフィア、ジョセフ、イーサン、イヴリン、そしてリリーです。「もしイーサンがならず者なら、ジョセフは騎士だ」とジェームズが宣言しました。ソフィアは「もしイヴリンが騎士なら、リリーは騎士だ」と主張しました。ジョセフは「ジョセフは騎士で、ソフィアはならず者だ」と言っているのが聞かれました。イーサンは「もしソフィアが騎士なら、ソフィアはならず者だ」と言いました。イヴリンは「イーサンはならず者か、リリーは騎士だ」と述べました。リリーは「ジョセフは騎士ではない」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズはならず者です  \n(2) ソフィアは騎士です  \n(3) ジョセフはならず者です  \n(4) イーサンはならず者です  \n(5) イヴリンは騎士です  \n(6) リリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：イザベラ、マシュー、サミュエル、ジョセフ、ウィリアム、そしてシャーロット。イザベラは「マシューはならず者か、シャーロットは騎士です」と言っているのが聞かれました。マシューの言葉では、「サミュエルはならず者で、ジョセフはならず者です」。サミュエルは「イザベラは騎士か、イザベラはならず者です」と言いました。ジョセフの発言では、「ウィリアムはならず者ではありません」。ウィリアムは「サミュエルはならず者です」と宣言しました。「マシューはサミュエルが騎士である場合に限り騎士です」とシャーロットは宣言しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イザベラは騎士です  \n(2) マシューはならず者です  \n(3) サミュエルは騎士です  \n(4) ジョセフはならず者です  \n(5) ウィリアムはならず者です  \n(6) シャーロットはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エラ、メイソン、ベンジャミン、オーロラ、ルーカス、そしてジェイコブです。エラによれば、「オーロラは騎士か、ベンジャミンは騎士です」。メイソンは「ベンジャミンは騎士か、ルーカスは騎士です」とコメントしました。ベンジャミンはメイソンが騎士かオーロラが騎士だと言いました。オーロラは「エラは騎士か、ルーカスは騎士です」と言いました。ルーカスは「もしエラがならず者なら、メイソンはならず者です」と主張しました。「オーロラはならず者であるのは、ベンジャミンが騎士である場合に限る」とジェイコブが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラは騎士です  \n(2) メイソンは騎士です  \n(3) ベンジャミンは騎士です  \n(4) オーロラは騎士です  \n(5) ルーカスは騎士です  \n(6) ジェイコブはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ミア、ペネロペ、ビクトリア、アメリア、ヘンリー、そしてジェイコブ。ミアの発言：「ペネロペは騎士です」。ペネロペは、「もしアメリアが騎士なら、ビクトリアはならず者です」と述べました。ビクトリアは、「ミアはならず者である場合、ヘンリーもならず者です」と述べました。「ジェイコブはならず者ではありません」とアメリアが言いました。「ジェイコブはならず者ではありません」とヘンリーが言いました。「ビクトリアはならず者ではありません」とジェイコブが主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアは騎士です  \n(2) ペネロペは騎士です  \n(3) ビクトリアはならず者です  \n(4) アメリアはならず者です  \n(5) ヘンリーはならず者です  \n(6) ジェイコブはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エイデン、オーロラ、ルーク、ベンジャミン、エミリー、そしてメイソン。エイデンによれば、「もしメイソンがならず者なら、メイソンは騎士です」。オーロラはベンジャミンが騎士であると述べました。ルークは「メイソンは騎士であり、メイソンはならず者です」と指摘しました。「メイソンはならず者であり、ベンジャミンは騎士です」とベンジャミンは主張しました。エミリーは「もしメイソンがならず者なら、ルークはならず者です」と言いました。メイソンの言葉では、「オーロラは騎士であり、ルークはならず者です」となります。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンはならず者です  \n(2) オーロラはならず者です  \n(3) ルークはならず者です  \n(4) ベンジャミンはならず者です  \n(5) エミリーは騎士です  \n(6) メイソンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ローガン、ジェームズ、スカーレット、ルーカス、エマ、そしてリリー。「ジェームズはならず者であるのは、ローガンが騎士である場合に限る」 - ローガン。ジェームズは「ルーカスがならず者なら、ローガンは騎士だ」と言っているのが聞かれました。スカーレットは「エマはならず者で、リリーは騎士だ」と言いました。「スカーレットは騎士であるのは、ジェームズがならず者である場合に限る」 - ルーカス。エマは「リリーがならず者なら、ルーカスは騎士だ」と言いました。リリーは「ローガンは騎士で、リリーは騎士だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンはならず者です  \n(2) ジェームズはならず者です  \n(3) スカーレットはならず者です  \n(4) ルーカスはならず者です  \n(5) エマはならず者です  \n(6) リリーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ハーパー、ジャクソン、スカーレット、アビゲイル、オリバー、そしてダニエル。ハーパーは「スカーレットは騎士で、ダニエルも騎士です」と述べました。ジャクソンは「アビゲイルは騎士で、アビゲイルはならず者です」と指摘しました。スカーレットの言葉では「ジャクソンは騎士ではありません」。アビゲイルによれば「もしオリバーが騎士なら、ハーパーは騎士です」。オリバーの発言では「ジャクソンはならず者で、ダニエルは騎士です」。ダニエルはスカーレットが騎士であると表現しました。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーは騎士です  \n(2) ジャクソンはならず者です  \n(3) スカーレットは騎士です  \n(4) アビゲイルは騎士です  \n(5) オリバーは騎士です  \n(6) ダニエルは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ソフィア、オーロラ、エイヴァ、デイビッド、ペネロペ、そしてウィリアム。ソフィアは「ウィリアムはならず者だ」と言いました。オーロラは「エイヴァは騎士で、ペネロペも騎士だ」と言いました。エイヴァは「デイビッドは騎士である場合に限り、デイビッドはならず者だ」と言っているのが聞かれました。デイビッドは「ウィリアムがならず者なら、オーロラは騎士だ」と主張しました。「ソフィアは騎士で、オーロラも騎士だ」とペネロペは宣言しました。ウィリアムは「デイビッドは騎士で、ペネロペも騎士だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) オーロラはならず者です  \n(3) エイヴァはならず者です  \n(4) デイビッドはならず者です  \n(5) ペネロペはならず者です  \n(6) ウィリアムはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：セバスチャン、アリア、エイヴァ、オリビア、ベンジャミン、そしてシャーロット。セバスチャンは「ベンジャミンはならず者か、アリアはならず者だ」と言いました。アリアは「エイヴァはならず者だ」と表現しました。エイヴァは「シャーロットはベンジャミンが騎士である場合に限り騎士だ」と言っているのが聞かれました。オリビアは「アリアは騎士である場合に限りアリアはならず者だ」とあなたに言いました。「シャーロットは騎士ではない」とベンジャミンは主張しました。シャーロットは「オリビアは騎士だ」と表現しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) セバスチャンはならず者です  \n(2) アリアは騎士です  \n(3) エイヴァはならず者です  \n(4) オリビアはならず者です  \n(5) ベンジャミンは騎士です  \n(6) シャーロットはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：グレース、オリバー、オーロラ、ソフィア、セバスチャン、そしてオリビア。グレースによれば、「もしグレースが騎士なら、オーロラはならず者です」。オリバーによれば、「オーロラはならず者です」。オーロラは、「オーロラが騎士であるのは、セバスチャンが騎士である場合に限ります」と述べました。「オリバーはならず者です」とソフィアが言いました。「オーロラはならず者であるか、オーロラは騎士である」とセバスチャンが言及しました。オリビアは、「セバスチャンはならず者ではありません」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) グレースは騎士です  \n(2) オリバーは騎士です  \n(3) オーロラはならず者です  \n(4) ソフィアはならず者です  \n(5) セバスチャンは騎士です  \n(6) オリビアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エマ、イヴリン、アリア、エイデン、ソフィア、そしてエイブリー。エマは「イヴリンはならず者であるのは、エイブリーが騎士である場合に限る」と言っているのが聞かれました。「エイブリーは騎士か、エイブリーはならず者だ」とイヴリンは主張しました。アリアは、エマはならず者であり、イヴリンは騎士であると言いました。エイデンは「ソフィアは騎士であり、エイブリーはならず者だ」とコメントしました。ソフィアの発言は「アリアはならず者ではない」です。エイブリーは、ソフィアはならず者であり、エイブリーは騎士であると表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エマは騎士です  \n(2) イヴリンは騎士です  \n(3) アリアはならず者です  \n(4) エイデンはならず者です  \n(5) ソフィアはならず者です  \n(6) エイブリーはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ダニエル、アリア、オーウェン、イーサン、アレクサンダー、そしてベンジャミン。ダニエルは「オーウェンは騎士ではない」と言いました。アリアは「もしオーウェンがならず者なら、ベンジャミンもならず者だ」と述べました。オーウェンの言葉では「ベンジャミンはならず者だ」と言っています。イーサンは「オーウェンは騎士だ」と言いました。「アリアは騎士である場合、アリアはならず者である」とアレクサンダーは言いました。ベンジャミンの言葉では「イーサンは騎士か、オーウェンはならず者だ」と言っています。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルは騎士です  \n(2) アリアはならず者です  \n(3) オーウェンはならず者です  \n(4) イーサンはならず者です  \n(5) アレクサンダーはならず者です  \n(6) ベンジャミンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ベンジャミン、エイヴァ、ウィリアム、ルーカス、ライリー、そしてリリー。ベンジャミンは「エイヴァが騎士であるならば、リリーも騎士である」と言っているのが聞かれました。エイヴァの言葉では、「ルーカスは騎士であるか、リリーはならず者である」とのことです。ウィリアムは「ルーカスが騎士であるならば、ライリーはならず者である」と主張しました。ルーカスは「ライリーはならず者であり、ライリーは騎士である」と述べました。ライリーは「リリーはならず者ではない」と言いました。リリーはウィリアムがならず者であり、ウィリアムが騎士であると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンはならず者です  \n(2) エイヴァは騎士です  \n(3) ウィリアムはならず者です  \n(4) ルーカスはならず者です  \n(5) ライリーはならず者です  \n(6) リリーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ウィリアム、リリー、ハーパー、ダニエル、シャーロット、そしてエリザベス。ウィリアムは「シャーロットは騎士だ」と言いました。リリーは「ウィリアムは騎士だ」と言っているのが聞かれました。ハーパーは「エリザベスはならず者で、シャーロットは騎士だ」と言いました。ダニエルは「もしダニエルが騎士なら、ウィリアムはならず者だ」と言いました。シャーロットは「シャーロットは騎士で、エリザベスは騎士だ」と宣言しました。エリザベスは「ハーパーはならず者か、ハーパーは騎士だ」と宣言しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムはならず者です  \n(2) リリーはならず者です  \n(3) ハーパーはならず者です  \n(4) ダニエルは騎士です  \n(5) シャーロットはならず者です  \n(6) エリザベスは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ソフィア、ペネロペ、エミリー、エイデン、デイビッド、そしてアリア。ソフィアの発言では、「ペネロペはならず者です」と言っています。ペネロペは「ペネロペは騎士で、デイビッドは騎士です」と述べました。エミリーはデイビッドが騎士であると言いました。エイデンは「ペネロペは騎士か、アリアはならず者です」と指摘しました。デイビッドは「エイデンはならず者で、エイデンは騎士です」と言いました。アリアによれば、「ソフィアは騎士で、デイビッドはならず者です」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) ペネロペはならず者です  \n(3) エミリーはならず者です  \n(4) エイデンはならず者です  \n(5) デイビッドはならず者です  \n(6) アリアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：イヴリン、ダニエル、メイソン、ソフィア、ゾーイ、そしてエイブリー。「ゾーイはならず者で、イヴリンは騎士です」とイヴリンが言いました。ダニエルの言葉では、「もしゾーイがならず者なら、ソフィアもならず者です」。メイソンによれば、「イヴリンは騎士です」。ソフィアによると、「エイブリーはならず者か、ゾーイは騎士です」。ゾーイは「メイソンはならず者ではありません」と宣言しました。「ゾーイはならず者か、ダニエルはならず者です」とエイブリーが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンはならず者です  \n(2) ダニエルは騎士です  \n(3) メイソンはならず者です  \n(4) ソフィアはならず者です  \n(5) ゾーイはならず者です  \n(6) エイブリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ソフィア、アレクサンダー、ジェイコブ、ハーパー、スカーレット、そしてヘンリー。ソフィアによれば、「ジェイコブは騎士で、スカーレットは騎士です」。アレクサンダーによれば、「ハーパーはならず者で、ジェイコブはならず者です」。ジェイコブはあなたにヘンリーが騎士だと言いました。「ソフィアは騎士である場合に限り、アレクサンダーは騎士です」とハーパーが言いました。「ヘンリーは騎士であるか、ジェイコブは騎士です」とスカーレットが宣言しました。ヘンリーによれば、「ソフィアはならず者であるか、アレクサンダーはならず者です」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) アレクサンダーはならず者です  \n(3) ジェイコブは騎士です  \n(4) ハーパーはならず者です  \n(5) スカーレットは騎士です  \n(6) ヘンリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ローガン、ベンジャミン、マシュー、ウィリアム、ミア、そしてグレース。ローガンは「もしベンジャミンがならず者なら、マシューは騎士だ」とコメントしました。ベンジャミンは「グレースはならず者か、ローガンは騎士だ」と宣言しました。マシューは「ミアはグレースがならず者である場合に限り、ならず者だ」と言いました。ウィリアムは「もしベンジャミンがならず者なら、グレースはならず者だ」と述べました。ミアは「ウィリアムはならず者だ」と主張しました。グレースは「ベンジャミンは騎士ではない」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンは騎士です  \n(2) ベンジャミンは騎士です  \n(3) マシューは騎士です  \n(4) ウィリアムは騎士です  \n(5) ミアはならず者です  \n(6) グレースはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：アメリア、アリア、ヘンリー、オリバー、ソフィア、そしてジョセフ。アメリアは言いました。「もしオリバーが騎士なら、アリアは騎士です」。アリアは言いました。「ヘンリーはならず者で、オリバーは騎士です」。ヘンリーはこう言いました。「もしソフィアがならず者なら、ジョセフは騎士です」。オリバーは、ヘンリーが騎士であるのはソフィアがならず者である場合に限ると表現しました。ソフィアはあなたに言いました。「もしオリバーが騎士なら、ヘンリーは騎士です」。ジョセフは主張しました。「オリバーはならず者です」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアは騎士です  \n(2) アリアはならず者です  \n(3) ヘンリーは騎士です  \n(4) オリバーはならず者です  \n(5) ソフィアは騎士です  \n(6) ジョセフは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ビクトリア、エイブリー、ジャクソン、ソフィア、グレース、そしてサミュエル。ビクトリアはソフィアが騎士ではないと言いました。エイブリーはビクトリアが騎士ではないと表現しました。ジャクソンはエイブリーがならず者であり、ソフィアもならず者であるとあなたに伝えました。ソフィアは「エイブリーはならず者であり、グレースは騎士です」と述べました。グレースは「エイブリーは騎士です」と言いました。サミュエルは、ジャクソンが騎士である場合に限り、グレースがならず者であると表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ビクトリアは騎士です  \n(2) エイブリーはならず者です  \n(3) ジャクソンは騎士です  \n(4) ソフィアはならず者です  \n(5) グレースはならず者です  \n(6) サミュエルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：デイビッド、ゾーイ、イーサン、リリー、ハーパー、そしてエマ。デイビッドは、「リリーはならず者であるのは、デイビッドが騎士である場合に限る」と言いました。ゾーイは、「エマは騎士であるか、デイビッドはならず者である」と言いました。イーサンは、ハーパーは騎士ではないと言いました。リリーの言葉では、「デイビッドが騎士であれば、リリーも騎士である」と言いました。ハーパーは、「リリーはならず者ではない」と述べました。エマは、「リリーはデイビッドが騎士である場合に限り騎士である」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドは騎士です  \n(2) ゾーイはならず者です  \n(3) イーサンは騎士です  \n(4) リリーはならず者です  \n(5) ハーパーはならず者です  \n(6) エマはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：イヴリン、オーロラ、エラ、シャーロット、アビゲイル、そしてイザベラ。イヴリンによれば、「アビゲイルは騎士で、シャーロットも騎士です」。オーロラは「イザベラは騎士ではありません」と指摘しました。エラは「イヴリンはならず者で、アビゲイルは騎士です」と述べました。シャーロットの言葉では、「エラはならず者ではありません」。アビゲイルの発言では、「エラは騎士であるか、オーロラは騎士である」。イザベラはあなたにイヴリンがならず者であると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンはならず者です  \n(2) オーロラはならず者です  \n(3) エラはならず者です  \n(4) シャーロットはならず者です  \n(5) アビゲイルはならず者です  \n(6) イザベラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エリザベス、マシュー、オリバー、エイヴァ、ローガン、そしてノア。エリザベスは「オリバーが騎士なら、エイヴァも騎士です」と言っているのが聞かれました。マシューは「エイヴァがならず者であるのは、エリザベスがならず者である場合に限ります」と言っているのが聞かれました。オリバーの言葉では「エリザベスは騎士です」。エイヴァの発言では「ローガンは騎士で、エイヴァは騎士です」と言っています。ローガンは「エイヴァがならず者であるのは、オリバーがならず者である場合に限ります」と述べました。「マシューはならず者ではありません」とノアが言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスは騎士です  \n(2) マシューは騎士です  \n(3) オリバーは騎士です  \n(4) エイヴァは騎士です  \n(5) ローガンは騎士です  \n(6) ノアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：セバスチャン、ジャック、イーサン、ペネロペ、ソフィア、そしてルーク。セバスチャンの発言では、「ジャックはイーサンがならず者である場合に限り騎士です」。ジャックは「ペネロペはならず者である場合に限り騎士です」と宣言しました。イーサンは「ペネロペはならず者です」と述べました。ペネロペは「ジャックはならず者で、ソフィアはならず者です」と指摘しました。ソフィアは「セバスチャンはならず者であるか、ルークは騎士です」と言いました。「ペネロペはならず者であるか、ジャックはならず者です」とルークは主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) セバスチャンは騎士です  \n(2) ジャックはならず者です  \n(3) イーサンは騎士です  \n(4) ペネロペはならず者です  \n(5) ソフィアは騎士です  \n(6) ルークは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：イーサン、ウィリアム、エマ、ベンジャミン、イザベラ、そしてミア。イーサンは「ベンジャミンはならず者か、ウィリアムはならず者だ」と述べました。ウィリアムは「ミアはイザベラが騎士である場合に限り騎士だ」と主張しました。「ミアはならず者で、イザベラは騎士だ」とエマは主張しました。ベンジャミンは「ウィリアムは騎士で、ミアは騎士だ」とコメントしました。イザベラは「もしベンジャミンが騎士なら、エマはならず者だ」とコメントしました。ミアはあなたにイザベラが騎士だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンはならず者です  \n(2) ウィリアムは騎士です  \n(3) エマはならず者です  \n(4) ベンジャミンは騎士です  \n(5) イザベラは騎士です  \n(6) ミアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ローガン、オリビア、エイデン、シャーロット、ジェイコブ、そしてゾーイ。ローガンは「ジェイコブは騎士だ」と述べました。オリビアは「エイデンは騎士か、ゾーイはならず者だ」と指摘しました。「もしローガンが騎士なら、オリビアは騎士だ」とエイデンが言いました。シャーロットは「ゾーイは騎士か、オリビアは騎士だ」と言いました。ジェイコブは「エイデンはならず者か、シャーロットはならず者だ」と述べました。ゾーイによれば「ジェイコブはならず者であるのは、ローガンが騎士である場合に限る」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンはならず者です  \n(2) オリビアは騎士です  \n(3) エイデンは騎士です  \n(4) シャーロットは騎士です  \n(5) ジェイコブはならず者です  \n(6) ゾーイはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：シャーロット、ベンジャミン、セバスチャン、ダニエル、ジェームズ、そしてミア。シャーロットは「もしジェームズが騎士なら、セバスチャンはならず者だ」と宣言しました。ベンジャミンは「セバスチャンはならず者だ」と主張しました。セバスチャンは「ジェームズは騎士だ」と述べました。ダニエルは「セバスチャンが騎士であるとき、ミアはならず者だ」と言いました。ジェームズは「ミアは騎士だ」と述べました。ミアは「ダニエルはならず者か、ジェームズは騎士だ」と言っているのが聞かれました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットはならず者です  \n(2) ベンジャミンはならず者です  \n(3) セバスチャンは騎士です  \n(4) ダニエルはならず者です  \n(5) ジェームズは騎士です  \n(6) ミアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジェームズ、ソフィア、ライリー、ジャクソン、ジャック、そしてベンジャミン。ジェームズは「ジャクソンがならず者なら、ライリーもならず者だ」と言いました。ソフィアは「ライリーはジェームズがならず者である場合に限り、ならず者である」と述べました。ライリーの発言は「ベンジャミンはならず者か、ベンジャミンは騎士だ」というものでした。ジャクソンは「ベンジャミンはならず者か、ベンジャミンは騎士だ」と表現しました。ジャックは「ジェームズは騎士ではない」と言いました。ベンジャミンは「ソフィアが騎士なら、ジャックは騎士だ」と指摘しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズは騎士です  \n(2) ソフィアは騎士です  \n(3) ライリーは騎士です  \n(4) ジャクソンは騎士です  \n(5) ジャックはならず者です  \n(6) ベンジャミンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：グレース、ミア、アメリア、アビゲイル、スカーレット、そしてオーロラ。グレースの言葉では、「スカーレットはならず者か、オーロラは騎士です」。ミアの発言では、「スカーレットは騎士である場合、アビゲイルも騎士です」。アメリアは、「アビゲイルはならず者か、グレースはならず者です」と述べました。「グレースはならず者で、オーロラは騎士です」とアビゲイルが主張しました。スカーレットは、「オーロラはならず者で、グレースは騎士です」と指摘しました。「アビゲイルはならず者です」とオーロラが言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) グレースは騎士です  \n(2) ミアは騎士です  \n(3) アメリアは騎士です  \n(4) アビゲイルはならず者です  \n(5) スカーレットはならず者です  \n(6) オーロラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ソフィア、ライリー、ルーカス、リアム、ジャクソン、そしてスカーレット。「リアムは騎士ではない」 - ソフィア。「ソフィアはならず者であるか、ルーカスはならず者である」とライリーが宣言しました。ルーカスは、ジャクソンが騎士であればスカーレットも騎士であると言いました。リアムは「スカーレットはならず者だ」と言っているのが聞かれました。ジャクソンは「リアムがならず者であればライリーは騎士だ」と述べました。スカーレットによれば、「ルーカスはソフィアが騎士である場合に限りならず者である」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアはならず者です  \n(2) ライリーは騎士です  \n(3) ルーカスはならず者です  \n(4) リアムは騎士です  \n(5) ジャクソンは騎士です  \n(6) スカーレットはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジェイコブ、クロエ、ダニエル、エイヴァ、アリア、そしてペネロペ。ジェイコブは「ダニエルは騎士である場合に限り、ジェイコブは騎士である」とコメントしました。クロエは「もしペネロペが騎士なら、ジェイコブはならず者だ」と言っているのが聞かれました。ダニエルは「もしジェイコブがならず者なら、クロエはならず者だ」と言っているのが聞かれました。エイヴァは「ダニエルは騎士で、クロエはならず者だ」と述べました。アリアは「ペネロペはならず者で、ペネロペは騎士だ」と言いました。ペネロペは「ペネロペは騎士である場合に限り、エイヴァは騎士だ」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブは騎士です  \n(2) クロエはならず者です  \n(3) ダニエルは騎士です  \n(4) エイヴァは騎士です  \n(5) アリアはならず者です  \n(6) ペネロペは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジェイコブ、ジャック、エリザベス、ミア、ゾーイ、そしてメイソン。ジェイコブは「ジャックはならず者ではない」と言いました。ジャックは「ゾーイはならず者で、ジェイコブはならず者だ」と言っているのが聞かれました。「ミアはならず者だ」とエリザベスが主張しました。ミアの発言では「ゾーイは騎士ではない」と言いました。ゾーイは「エリザベスは騎士だ」と言っているのが聞かれました。メイソンは「ゾーイは騎士ではない」と主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブはならず者です  \n(2) ジャックはならず者です  \n(3) エリザベスは騎士です  \n(4) ミアはならず者です  \n(5) ゾーイは騎士です  \n(6) メイソンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エミリー、オリバー、スカーレット、エラ、イザベラ、そしてエイヴァ。「スカーレットは騎士であるのはオリバーが騎士である場合に限る」とエミリーは主張しました。オリバーは「イザベラは騎士であるのはエイヴァが騎士である場合に限る」と言いました。スカーレットは「オリバーは騎士であるのはイザベラが騎士である場合に限る」と指摘しました。エラは「エミリーは騎士であり、エラは騎士である」と述べました。イザベラは「オリバーはならず者であるか、エラは騎士である」と言いました。「スカーレットはならず者であるのはイザベラが騎士である場合に限る」とエイヴァが言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーはならず者です  \n(2) オリバーは騎士です  \n(3) スカーレットはならず者です  \n(4) エラはならず者です  \n(5) イザベラはならず者です  \n(6) エイヴァはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：シャーロット、エラ、アレクサンダー、エイデン、ジャクソン、そしてジョセフ。シャーロットは「ジャクソンは騎士か、エラは騎士です」と主張しました。エラは「シャーロットは騎士ではありません」と言いました。アレクサンダーは「ジャクソンはならず者である場合に限り、エイデンはならず者です」とコメントしました。エイデンは「アレクサンダーはならず者ではありません」と述べました。ジャクソンは「アレクサンダーは騎士です」と言いました。ジョセフは「エラはならず者ではありません」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットは騎士です  \n(2) エラはならず者です  \n(3) アレクサンダーは騎士です  \n(4) エイデンは騎士です  \n(5) ジャクソンは騎士です  \n(6) ジョセフはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：イヴリン、ヘンリー、ローガン、エイブリー、ダニエル、そしてエイデン。イヴリンはダニエルがならず者でローガンが騎士だと言いました。ヘンリーは、ローガンが騎士であるのはエイデンがならず者である場合に限るとあなたに伝えました。「ダニエルは騎士だ」とローガンは主張しました。エイブリーは「ヘンリーはならず者ではない」と言っているのが聞かれました。「ヘンリーはならず者ではない」とダニエルも言いました。エイデンの言葉では、「ヘンリーはならず者ではない」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンはならず者です  \n(2) ヘンリーはならず者です  \n(3) ローガンはならず者です  \n(4) エイブリーはならず者です  \n(5) ダニエルはならず者です  \n(6) エイデンはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジェイコブ、ウィリアム、ビクトリア、メイソン、グレース、そしてアメリア。ジェイコブは「メイソンは騎士だ」と主張しました。ウィリアムの言葉では「ウィリアムは騎士で、ジェイコブも騎士だ」と言っています。「ジェイコブは騎士である場合に限り、ジェイコブはならず者だ」とビクトリアが言いました。メイソンは「ウィリアムはならず者だ」と述べました。グレースは「グレースは騎士で、ウィリアムは騎士だ」と表現しました。「メイソンはならず者で、アメリアは騎士だ」とアメリアが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブは騎士です  \n(2) ウィリアムはならず者です  \n(3) ビクトリアはならず者です  \n(4) メイソンは騎士です  \n(5) グレースはならず者です  \n(6) アメリアはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エミリー、オリビア、サミュエル、リアム、イヴリン、そしてメイソン。エミリーは「イヴリンはならず者ではない」と言いました。オリビアは「メイソンは騎士で、リアムも騎士だ」と言いました。「リアムはならず者だ」とサミュエルは主張しました。リアムは「オリビアはならず者ではない」と言いました。イヴリンの言葉では「メイソンはならず者か、リアムはならず者だ」とのことです。「リアムはならず者で、リアムは騎士だ」とメイソンが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーは騎士です  \n(2) オリビアはならず者です  \n(3) サミュエルは騎士です  \n(4) リアムはならず者です  \n(5) イヴリンは騎士です  \n(6) メイソンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：メイソン、サミュエル、エミリー、シャーロット、ビクトリア、そしてハーパー。メイソンは「もしサミュエルが騎士なら、エミリーはならず者だ」と主張しました。サミュエルは「ハーパーは騎士ではない」と言いました。「サミュエルはならず者であるのは、メイソンがならず者である場合に限る」とエミリーが言いました。シャーロットはエミリーが騎士ではないと言いました。ビクトリアは「シャーロットは騎士であるか、サミュエルは騎士である」とコメントしました。「ビクトリアが騎士であるのは、ハーパーが騎士である場合に限る」とハーパーが宣言しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) メイソンは騎士です  \n(2) サミュエルはならず者です  \n(3) エミリーはならず者です  \n(4) シャーロットは騎士です  \n(5) ビクトリアは騎士です  \n(6) ハーパーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ダニエル、オリバー、エイヴァ、ビクトリア、ゾーイ、そしてオリビア。ダニエルは「オリビアはならず者か、オリバーは騎士だ」と主張しました。オリバーは「ゾーイはならず者で、エイヴァはならず者だ」とコメントしました。エイヴァは「オリビアはならず者だ」と主張しました。ビクトリアは、オリビアが騎士であるのはダニエルが騎士である場合に限るとあなたに言いました。ゾーイによれば、「オリビアは騎士ではない」とのことです。オリビアは「ダニエルは騎士か、オリビアは騎士だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルは騎士です  \n(2) オリバーは騎士です  \n(3) エイヴァはならず者です  \n(4) ビクトリアは騎士です  \n(5) ゾーイはならず者です  \n(6) オリビアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：アビゲイル、メイソン、ゾーイ、アレクサンダー、ルーク、そしてリリー。アビゲイルによれば、「メイソンはルークがならず者である場合に限り騎士です」。メイソンは「リリーは騎士であり、ゾーイはならず者です」と言いました。「ゾーイが騎士であれば、ルークも騎士です」とゾーイは主張しました。「メイソンが騎士であれば、ルークも騎士です」とアレクサンダーは宣言しました。ルークは「ゾーイはアレクサンダーがならず者である場合に限りならず者です」とコメントしました。「アビゲイルはならず者であるか、メイソンは騎士です」とリリーは言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アビゲイルは騎士です  \n(2) メイソンはならず者です  \n(3) ゾーイは騎士です  \n(4) アレクサンダーは騎士です  \n(5) ルークは騎士です  \n(6) リリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エイブリー、ローガン、リリー、ソフィア、イーサン、そしてエラ。「ソフィアはならず者か、リリーは騎士だ」とエイブリーは主張しました。ローガンは、ソフィアがならず者であるのはイーサンがならず者である場合に限ると言いました。リリーは、「エラは騎士で、イーサンは騎士だ」と述べました。ソフィアは、「イーサンがならず者なら、イーサンは騎士だ」と言いました。イーサンは、「エイブリーは騎士か、リリーはならず者だ」とコメントしました。「ローガンはならず者で、ソフィアはならず者だ」とエラが言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーはならず者です  \n(2) ローガンは騎士です  \n(3) リリーはならず者です  \n(4) ソフィアは騎士です  \n(5) イーサンは騎士です  \n(6) エラはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ウィリアム、ジョセフ、エミリー、ジェームズ、セバスチャン、そしてエイヴァ。ウィリアムは「セバスチャンはならず者か、エイヴァは騎士だ」と言っているのが聞かれました。ジョセフは「ウィリアムはならず者であるのは、エイヴァがならず者である場合に限る」と述べました。エミリーの発言では「エイヴァは騎士であるのは、ジョセフが騎士である場合に限る」と言っています。ジェームズは「セバスチャンは騎士ではない」と述べました。「もしジョセフが騎士なら、エイヴァはならず者だ」とセバスチャンが宣言しました。エイヴァは「ウィリアムは騎士で、ジョセフはならず者だ」と言いました。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムはならず者です  \n(2) ジョセフは騎士です  \n(3) エミリーはならず者です  \n(4) ジェームズはならず者です  \n(5) セバスチャンは騎士です  \n(6) エイヴァはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エリザベス、エイデン、ダニエル、ローガン、オリバー、そしてセバスチャン。エリザベスは「エイデンは騎士ではない」と主張しました。エイデンは「セバスチャンは騎士である場合に限り、セバスチャンはならず者である」と言っているのが聞かれました。ダニエルは「ローガンは騎士ではない」と言いました。ローガンは「エイデンは騎士ではない」と述べました。オリバーはセバスチャンはならず者ではないと言いました。セバスチャンは「エイデンは騎士ではない」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスは騎士です  \n(2) エイデンはならず者です  \n(3) ダニエルはならず者です  \n(4) ローガンは騎士です  \n(5) オリバーは騎士です  \n(6) セバスチャンは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エイブリー、シャーロット、ルーカス、リリー、ソフィア、そしてビクトリア。エイブリーは「シャーロットは騎士ではない」と言いました。シャーロットは「ビクトリアはならず者だ」と言っているのが聞かれました。「もしリリーが騎士なら、ソフィアはならず者だ」とルーカスは言いました。リリーは「ルーカスは騎士ではない」とコメントしました。ソフィアは「ビクトリアが騎士であるならば、ビクトリアはならず者だ」と主張しました。ビクトリアは「もしルーカスがならず者なら、ソフィアはならず者だ」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーは騎士です  \n(2) シャーロットはならず者です  \n(3) ルーカスは騎士です  \n(4) リリーはならず者です  \n(5) ソフィアはならず者です  \n(6) ビクトリアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ルーカス、オリバー、ジャクソン、ベンジャミン、ノア、そしてルーク。ルーカスはルークが騎士だと言いました。オリバーの発言では、「ノアはならず者だ」と言っています。ジャクソンは「もしルークがならず者なら、ベンジャミンもならず者だ」と言っているのが聞かれました。ベンジャミンによれば、「ルークはならず者で、ルーカスはならず者だ」とのことです。ノアはオリバーがならず者で、ノアが騎士だと言いました。ルークの発言では、「ルーカスはならず者で、ノアは騎士だ」と言っています。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスはならず者です  \n(2) オリバーは騎士です  \n(3) ジャクソンはならず者です  \n(4) ベンジャミンは騎士です  \n(5) ノアはならず者です  \n(6) ルークはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジャック、エイデン、サミュエル、ソフィア、イヴリン、そしてエイブリー。ジャックの言葉では、「もしジャックが騎士なら、エイブリーはならず者だ」と言っています。エイデンは「ジャックは騎士だ」とコメントしました。サミュエルは「イヴリンは騎士で、エイデンはならず者だ」と言いました。ソフィアは「ジャックはならず者ではない」と言いました。イヴリンの発言では「サミュエルはならず者で、ソフィアはならず者だ」と言っています。エイブリーはサミュエルが騎士だと表現しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャックは騎士です  \n(2) エイデンは騎士です  \n(3) サミュエルはならず者です  \n(4) ソフィアは騎士です  \n(5) イヴリンはならず者です  \n(6) エイブリーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ルーカス、ウィリアム、セバスチャン、ダニエル、エマ、そしてオリビア。ルーカスはセバスチャンが騎士であると表現しました。ウィリアムは「ルーカスは騎士ではない」と言いました。セバスチャンは「オリビアはならず者だ」と言いました。ダニエルは「エマは騎士で、セバスチャンはならず者だ」と述べました。エマは「ルーカスは騎士だ」と言いました。オリビアは「セバスチャンは騎士か、ルーカスはならず者だ」とコメントしました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスはならず者です  \n(2) ウィリアムは騎士です  \n(3) セバスチャンはならず者です  \n(4) ダニエルはならず者です  \n(5) エマはならず者です  \n(6) オリビアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ウィリアム、エイデン、スカーレット、エイブリー、エイヴァ、そしてベンジャミン。ウィリアムは「もしスカーレットが騎士なら、エイヴァはならず者だ」と述べました。エイデンは「もしベンジャミンがならず者なら、ベンジャミンは騎士だ」と表現しました。スカーレットの発言では「ウィリアムは騎士ではない」と言いました。エイブリーは「エイデンはならず者だ」と述べました。エイヴァは「スカーレットは騎士だ」と言いました。ベンジャミンは「エイヴァは騎士で、エイブリーも騎士だ」と表現しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムは騎士です  \n(2) エイデンはならず者です  \n(3) スカーレットはならず者です  \n(4) エイブリーは騎士です  \n(5) エイヴァはならず者です  \n(6) ベンジャミンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジャクソン、ヘンリー、ダニエル、ルーク、サミュエル、そしてクロエ。「ダニエルはならず者だ」とジャクソンが言いました。ヘンリーは、「もしサミュエルが騎士なら、クロエも騎士だ」と指摘しました。ダニエルはルークが騎士だと言いました。「クロエは騎士ではない」とルークが宣言しました。「ヘンリーはならず者ではない」とサミュエルが言及しました。クロエは「ルークはならず者だ」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンは騎士です  \n(2) ヘンリーは騎士です  \n(3) ダニエルはならず者です  \n(4) ルークはならず者です  \n(5) サミュエルは騎士です  \n(6) クロエは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジャクソン、ソフィア、イザベラ、エリザベス、エイヴァ、そしてリリー。ジャクソンの発言によれば、「エイヴァは騎士である場合に限り、エイヴァはならず者である」。ソフィアによると、「エイヴァはならず者であり、イザベラはならず者である」。イザベラは「エイヴァが騎士であれば、エイヴァはならず者である」と主張しました。エリザベスは「エイヴァはならず者である場合に限り、ソフィアはならず者である」と述べました。エイヴァによれば、「イザベラは騎士であるか、ソフィアはならず者である」。リリーの言葉では、「エリザベスは騎士であり、エイヴァは騎士である」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンはならず者です  \n(2) ソフィアはならず者です  \n(3) イザベラはならず者です  \n(4) エリザベスはならず者です  \n(5) エイヴァは騎士です  \n(6) リリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：サミュエル、リリー、アリア、エイブリー、アビゲイル、そしてベンジャミン。サミュエルは「リリーは騎士で、アリアも騎士だ」と言いました。リリーは「サミュエルは騎士だ」と言いました。アリアはあなたにアビゲイルが騎士だと言いました。エイブリーの言葉では「もしベンジャミンが騎士なら、ベンジャミンはならず者だ」と述べました。アビゲイルの言葉では「エイブリーはならず者で、リリーはならず者だ」と言いました。ベンジャミンは「アビゲイルは騎士か、リリーはならず者だ」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルはならず者です  \n(2) リリーはならず者です  \n(3) アリアは騎士です  \n(4) エイブリーはならず者です  \n(5) アビゲイルは騎士です  \n(6) ベンジャミンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：イザベラ、ソフィア、エラ、ジャクソン、ルーク、そしてヘンリー。イザベラは「ジャクソンが騎士なら、エラは騎士です」と言いました。ソフィアは「イザベラはならず者ではありません」と指摘しました。エラは「ヘンリーは騎士で、イザベラはならず者です」とコメントしました。ジャクソンは「ルークは騎士ではありません」と主張しました。ルークは「イザベラがならず者なら、ソフィアは騎士です」と主張しました。ヘンリーは「ルークは騎士か、ルークはならず者です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イザベラは騎士です  \n(2) ソフィアは騎士です  \n(3) エラはならず者です  \n(4) ジャクソンはならず者です  \n(5) ルークは騎士です  \n(6) ヘンリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：シャーロット、ヘンリー、エリザベス、オーロラ、ジョセフ、そしてジャクソン。シャーロットの言葉によれば、「ジョセフは騎士で、オーロラはならず者です」。ヘンリーによると、「ジョセフはならず者であるのは、ジャクソンが騎士である場合に限ります」。エリザベスは、オーロラはならず者ではないと言いました。「エリザベスはならず者であるか、エリザベスは騎士である」とオーロラは主張しました。「オーロラはならず者であるのは、シャーロットがならず者である場合に限る」とジョセフは宣言しました。ジャクソンは、シャーロットは騎士であると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットはならず者です  \n(2) ヘンリーはならず者です  \n(3) エリザベスは騎士です  \n(4) オーロラは騎士です  \n(5) ジョセフはならず者です  \n(6) ジャクソンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エマ、ローガン、ジャクソン、ダニエル、アリア、そしてヘンリー。「アリアがならず者であるとき、エマは騎士である」とエマは宣言しました。ローガンは、「エマが騎士であるとき、ダニエルも騎士である」と言いました。ジャクソンによれば、「アリアがならず者であるとき、ヘンリーもならず者である」とのことです。ダニエルの発言では、「アリアは騎士ではない」と言っています。アリアは、「ダニエルが騎士であるとき、ヘンリーはならず者である」と指摘しました。ヘンリーは、「エマは騎士であるか、ジャクソンは騎士である」とコメントしました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エマは騎士です  \n(2) ローガンは騎士です  \n(3) ジャクソンはならず者です  \n(4) ダニエルは騎士です  \n(5) アリアはならず者です  \n(6) ヘンリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エリザベス、ソフィア、ビクトリア、アビゲイル、グレース、そしてルーク。「ソフィアは騎士であるのは、ルークがならず者である場合に限る」とエリザベスが言いました。ソフィアは、「エリザベスは騎士であるか、グレースは騎士である」と述べました。ビクトリアは、「グレースはならず者であり、アビゲイルは騎士である」と言いました。アビゲイルは、「ビクトリアはならず者であるか、ソフィアは騎士である」と言いました。グレースは、「ルークはならず者であり、エリザベスは騎士である」と言いました。ルークは、ソフィアは騎士であり、アビゲイルはならず者であるとあなたに言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスは騎士です  \n(2) ソフィアは騎士です  \n(3) ビクトリアはならず者です  \n(4) アビゲイルは騎士です  \n(5) グレースは騎士です  \n(6) ルークはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：リリー、イザベラ、エラ、ジェームズ、エリザベス、そしてセバスチャン。リリーは「ジェームズは騎士ではない」と言いました。イザベラは「エラは騎士か、エラはならず者です」と指摘しました。エラは「リリーはならず者で、リリーは騎士です」と述べました。ジェームズは「エリザベスはならず者か、エラは騎士です」と主張しました。エリザベスによれば「もしエラがならず者なら、イザベラはならず者です」とのことです。セバスチャンの言葉では「リリーは騎士で、エリザベスは騎士です」と言っています。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーはならず者です  \n(2) イザベラは騎士です  \n(3) エラはならず者です  \n(4) ジェームズは騎士です  \n(5) エリザベスはならず者です  \n(6) セバスチャンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ウィリアム、イーサン、オーロラ、エイブリー、アビゲイル、そしてルーカス。ウィリアムは「アビゲイルがならず者なら、ルーカスはならず者だ」と主張しました。イーサンは「エイブリーはならず者か、ルーカスはならず者だ」と述べました。オーロラの発言では「アビゲイルは騎士である場合に限り、ルーカスは騎士です」と言いました。エイブリーの言葉では「ルーカスが騎士なら、イーサンはならず者です」と言いました。アビゲイルは「ルーカスが騎士なら、イーサンはならず者です」と言いました。ルーカスはあなたに「アビゲイルは騎士です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムは騎士です  \n(2) イーサンはならず者です  \n(3) オーロラは騎士です  \n(4) エイブリーは騎士です  \n(5) アビゲイルは騎士です  \n(6) ルーカスは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ライリー、イーサン、ヘンリー、アレクサンダー、エマ、そしてイザベラ。ライリーは「エマはならず者ではない」と言いました。イーサンは「ライリーはならず者か、イザベラは騎士だ」と主張しました。ヘンリーによれば、「ライリーはならず者で、エマはならず者だ」とのことです。アレクサンダーは「イーサンはならず者で、ヘンリーは騎士だ」とコメントしました。エマの言葉では「イーサンはならず者ではない」と言っています。イザベラは「もしエマがならず者なら、ライリーは騎士だ」とコメントしました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ライリーは騎士です  \n(2) イーサンは騎士です  \n(3) ヘンリーはならず者です  \n(4) アレクサンダーはならず者です  \n(5) エマは騎士です  \n(6) イザベラは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：アメリア、エイヴァ、オリビア、オリバー、ジャック、そしてエイブリー。「エイブリーはならず者で、オリバーは騎士です」とアメリアが言いました。エイヴァの言葉では、「ジャックは騎士です」。オリビアは「オリバーは騎士か、アメリアは騎士です」と言いました。オリバーは「エイヴァはならず者か、オリビアはならず者です」と述べました。ジャックはあなたにオリバーは騎士ではないと言いました。エイブリーはあなたにエイヴァは騎士か、オリビアはならず者だと言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアは騎士です  \n(2) エイヴァはならず者です  \n(3) オリビアは騎士です  \n(4) オリバーは騎士です  \n(5) ジャックはならず者です  \n(6) エイブリーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：アレクサンダー、エラ、オーロラ、ハーパー、エイヴァ、そしてエミリー。アレクサンダーは「エラは騎士か、エミリーはならず者だ」と主張しました。「ハーパーは騎士で、オーロラはならず者だ」とエラが宣言しました。オーロラはエミリーが騎士だと言いました。「エイヴァは騎士ではない」とハーパーが言いました。「エミリーはならず者で、オーロラはならず者だ」とエイヴァが主張しました。「エミリーは騎士か、オーロラはならず者だ」とエミリーが言及しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アレクサンダーはならず者です  \n(2) エラはならず者です  \n(3) オーロラは騎士です  \n(4) ハーパーは騎士です  \n(5) エイブリーはならず者です  \n(6) エミリーは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：クロエ、ジャック、エイブリー、マイケル、セバスチャン、そしてエリザベス。「エリザベスは騎士ではない」とクロエが言いました。ジャックは「セバスチャンはエリザベスが騎士である場合に限り騎士である」と述べました。エイブリーは「エイブリーは騎士であり、セバスチャンはならず者である」と言っているのが聞かれました。マイケルの言葉では、「ジャックはならず者ではない」と言いました。セバスチャンは「ジャックはならず者である」と言っているのが聞かれました。エリザベスは「セバスチャンは騎士ではない」と指摘しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) クロエは騎士です  \n(2) ジャックはならず者です  \n(3) エイブリーはならず者です  \n(4) マイケルはならず者です  \n(5) セバスチャンは騎士です  \n(6) エリザベスはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：イーサン、アビゲイル、ソフィア、ジェイコブ、イヴリン、そしてペネロペです。「ソフィアはならず者ではない」とイーサンが宣言しました。アビゲイルは「ペネロペはならず者ではない」と言いました。ソフィアは、ペネロペは騎士であるか、イーサンはならず者であると言いました。ジェイコブは「イーサンはならず者であるか、イーサンは騎士である」と述べました。イヴリンは、イーサンはならず者であるか、ペネロペはならず者であると表現しました。ペネロペの発言は「イーサンは騎士であるか、イヴリンは騎士である」となります。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンは騎士です  \n(2) アビゲイルは騎士です  \n(3) ソフィアは騎士です  \n(4) ジェイコブは騎士です  \n(5) イヴリンはならず者です  \n(6) ペネロペは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ジョセフ、ジェイコブ、スカーレット、ペネロペ、ルーカス、そしてローガン。ジョセフによると、「スカーレットはならず者で、ペネロペは騎士です」。ジェイコブは「ルーカスは騎士です」と言っているのが聞かれました。スカーレットは、ジョセフは騎士で、ペネロペはならず者だと言いました。「ルーカスは騎士か、ジョセフは騎士です」 - ペネロペ。ルーカスは、ジョセフは騎士ではないと言いました。ローガンは「スカーレットはならず者ではありません」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフは騎士です  \n(2) ジェイコブはならず者です  \n(3) スカーレットはならず者です  \n(4) ペネロペは騎士です  \n(5) ルーカスはならず者です  \n(6) ローガンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ローガン、ゾーイ、ノア、ルーク、ソフィア、そしてアメリア。ローガンは「ノアがならず者であるならば、ソフィアもならず者である」と言っているのが聞かれました。ゾーイによれば、「ローガンはならず者で、ルークは騎士です」。ノアの発言では、「ローガンはならず者です」。ルークは「もしソフィアが騎士ならば、ソフィアはならず者です」とコメントしました。ソフィアの言葉では、「ゾーイはならず者か、アメリアはならず者です」。アメリアは「アメリアは騎士か、ソフィアは騎士です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンはならず者です  \n(2) ゾーイは騎士です  \n(3) ノアは騎士です  \n(4) ルークは騎士です  \n(5) ソフィアはならず者です  \n(6) アメリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ハーパー、ノア、イザベラ、エイヴァ、サミュエル、そしてジャクソン。「もしイザベラが騎士なら、イザベラはならず者だ」とハーパーが言いました。ノアはこう言いました。「もしハーパーが騎士なら、イザベラは騎士だ」。イザベラは主張しました。「ジャクソンはハーパーが騎士である限りならず者だ」。エイヴァの言葉では、「ジャクソンは騎士だ」。サミュエルはこう言いました。「もしイザベラが騎士なら、ノアは騎士だ」。ジャクソンは「ノアは騎士か、サミュエルはならず者だ」と主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーはならず者です  \n(2) ノアは騎士です  \n(3) イザベラは騎士です  \n(4) エイヴァは騎士です  \n(5) サミュエルは騎士です  \n(6) ジャクソンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ソフィア、イザベラ、リリー、エマ、サミュエル、そしてエリザベス。ソフィアは「イザベラは騎士で、サミュエルは騎士です」と述べました。「エリザベスは騎士です」とイザベラが宣言しました。リリーは「エマは騎士で、サミュエルは騎士です」とコメントしました。エマは「ソフィアはならず者か、エリザベスは騎士です」と言いました。サミュエルは「もしソフィアが騎士なら、エリザベスは騎士です」とコメントしました。エリザベスはリリーがならず者で、イザベラが騎士だと言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアはならず者です  \n(2) イザベラはならず者です  \n(3) リリーは騎士です  \n(4) エマは騎士です  \n(5) サミュエルは騎士です  \n(6) エリザベスはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：イーサン、ルーク、オーウェン、オリバー、エラ、そしてソフィア。イーサンの発言では、「オリバーはならず者ではない」と言いました。ルークは「もしソフィアがならず者なら、ルークは騎士だ」と言いました。「ルークはならず者だ」とオーウェンが主張しました。オリバーは「もしエラが騎士なら、オーウェンはならず者だ」と述べました。エラはオーウェンが騎士であり、エラも騎士だと言いました。「オーウェンは騎士か、エラはならず者だ」とソフィアが主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンは騎士です  \n(2) ルークは騎士です  \n(3) オーウェンはならず者です  \n(4) オリバーは騎士です  \n(5) エラはならず者です  \n(6) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エラ、ベンジャミン、ペネロペ、ハーパー、ミア、そしてエミリー。「ベンジャミンはならず者ではない」とエラが言いました。「ハーパーが騎士なら、ベンジャミンは騎士だ」とベンジャミンが主張しました。ペネロペは「エラはならず者ではない」と言いました。ハーパーによれば、「ペネロペは騎士か、エラは騎士です」。 「エミリーは騎士か、エラは騎士だ」とミアが主張しました。エミリーはハーパーがならず者か、エラがならず者だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラは騎士です  \n(2) ベンジャミンは騎士です  \n(3) ペネロペは騎士です  \n(4) ハーパーは騎士です  \n(5) ミアは騎士です  \n(6) エミリーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ルーク、アメリア、エミリー、エマ、ハーパー、そしてスカーレット。ルークは「エミリーはならず者であるのは、ルークが騎士である場合に限る」とコメントしました。アメリアの言葉では「ルークは騎士ではない」と言っています。エミリーの発言では「スカーレットがならず者であれば、アメリアは騎士である」と述べています。エマは「ルークは騎士ではない」と言っているのが聞かれました。ハーパーは、ルークが騎士であるか、スカーレットが騎士であると言いました。スカーレットは「ハーパーはならず者であるか、エミリーは騎士である」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) アメリアはならず者です  \n(3) エミリーはならず者です  \n(4) エマはならず者です  \n(5) ハーパーは騎士です  \n(6) スカーレットはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：ハーパー、イーサン、エマ、ローガン、オーウェン、そしてルーク。ハーパーによれば、「エマはならず者である場合に限り、ローガンは騎士である」。イーサンの発言では、「ローガンがならず者であれば、オーウェンもならず者である」。エマは「ルークが騎士であれば、オーウェンはならず者である」と主張しました。ローガンの発言では、「ハーパーはならず者である場合に限り、ローガンは騎士である」。オーウェンは「ルークはならず者であり、ハーパーは騎士である」と宣言しました。ルークの言葉では、「エマは騎士であるか、ルークは騎士である」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーはならず者です  \n(2) イーサンは騎士です  \n(3) エマは騎士です  \n(4) ローガンは騎士です  \n(5) オーウェンはならず者です  \n(6) ルークは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：エイデン、オリバー、クロエ、メイソン、リアム、そしてリリー。エイデンは「リアムは騎士ではない」と主張しました。オリバーは「エイデンはならず者ではない」と述べました。クロエはメイソンが騎士ではないと言いました。「エイデンは騎士で、クロエは騎士だ」とメイソンは言及しました。リアムによれば、「エイデンはならず者で、リリーはならず者だ」とのことです。リリーはメイソンがならず者で、メイソンが騎士だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンはならず者です  \n(2) オリバーはならず者です  \n(3) クロエは騎士です  \n(4) メイソンはならず者です  \n(5) リアムは騎士です  \n(6) リリーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは6人の住人に出会います：セバスチャン、ジェームズ、ダニエル、オリビア、メイソン、そしてソフィア。「もしジェームズが騎士なら、メイソンはならず者だ」とセバスチャンが言いました。ジェームズは、「オリビアが騎士である限り、セバスチャンはならず者だ」と表現しました。ダニエルは、「メイソンはならず者で、ソフィアは騎士だ」と言いました。オリビアは、セバスチャンがならず者であるか、メイソンがならず者であると言いました。メイソンの発言は、「メイソンは騎士であるか、ソフィアは騎士である」です。ソフィアは、「ダニエルは騎士ではない」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) セバスチャンはならず者です  \n(2) ジェームズは騎士です  \n(3) ダニエルはならず者です  \n(4) オリビアは騎士です  \n(5) メイソンは騎士です  \n(6) ソフィアは騎士です"
    }
]