[
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：诺亚、维多利亚、艾娃、莉莉、丹尼尔、亚历山大和马修。诺亚说马修是骑士，维多利亚是骑士。维多利亚提到：“莉莉是无赖当且仅当马修是骑士。”艾娃的陈述是：“马修是骑士或者维多利亚是骑士。”莉莉被听到说：“如果维多利亚是无赖，那么马修就是无赖。”丹尼尔评论道：“亚历山大不是骑士。”亚历山大声明：“诺亚是骑士或者艾娃是无赖。”马修说：“艾娃是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是无赖  \n(2) 维多利亚是骑士  \n(3) 艾娃是骑士  \n(4) 莉莉是骑士  \n(5) 丹尼尔是骑士  \n(6) 亚历山大是无赖  \n(7) 马修是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：丹尼尔、塞缪尔、迈克尔、索菲娅、梅森、阿丽亚和亚历山大。丹尼尔说：“迈克尔是无赖当且仅当亚历山大是骑士。”塞缪尔说迈克尔是骑士，亚历山大是无赖。迈克尔声称：“阿丽亚不是无赖。”索菲娅表示亚历山大是骑士，梅森是无赖。梅森指出：“亚历山大不是骑士。”根据阿丽亚的说法：“如果迈克尔是骑士，那么亚历山大是无赖。”亚历山大告诉你阿丽亚是无赖，丹尼尔是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是一名骑士  \n(2) 塞缪尔是一名骑士  \n(3) 迈克尔是一名骑士  \n(4) 索菲娅是一名无赖  \n(5) 梅森是一名骑士  \n(6) 阿丽亚是一名骑士  \n(7) 亚历山大是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：阿梅莉亚、洛根、本杰明、约瑟夫、迈克尔、卢卡斯和佐伊。阿梅莉亚告诉你，佐伊是无赖当且仅当迈克尔是无赖。“洛根是骑士当且仅当阿梅莉亚是无赖”——洛根说。“如果洛根是无赖，那么本杰明就是骑士，”本杰明声称。约瑟夫被听到说，“如果本杰明是无赖，那么卢卡斯就是骑士”。迈克尔评论道，“阿梅莉亚是骑士”。“约瑟夫是无赖当且仅当迈克尔是骑士，”卢卡斯声称。佐伊评论道，“卢卡斯不是骑士”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是无赖  \n(2) 洛根是无赖  \n(3) 本杰明是无赖  \n(4) 约瑟夫是无赖  \n(5) 迈克尔是无赖  \n(6) 卢卡斯是无赖  \n(7) 佐伊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：伊莎贝拉、格蕾丝、伊丽莎白、奥萝拉、索菲娅、赖利和亚历山大。伊莎贝拉说：“亚历山大是骑士或者格蕾丝是骑士。”格蕾丝说：“伊丽莎白不是无赖。”伊丽莎白评论道：“伊丽莎白是骑士，赖利是骑士。”根据奥萝拉的说法，“索菲娅不是骑士。”索菲娅被听到说：“奥萝拉是骑士，亚历山大是无赖。”赖利说：“亚历山大是无赖。”亚历山大指出：“如果格蕾丝是骑士，那么伊莎贝拉就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是骑士  \n(2) 格蕾丝是无赖  \n(3) 伊丽莎白是无赖  \n(4) 奥萝拉是骑士  \n(5) 索菲娅是无赖  \n(6) 赖利是无赖  \n(7) 亚历山大是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：奥利弗、哈珀、亚历山大、格蕾丝、卢卡斯、伊芙琳和艾拉。奥利弗声称：“哈珀是无赖当且仅当艾拉是无赖。”在哈珀的话中：“艾拉是骑士，卢卡斯是无赖。”亚历山大说：“奥利弗是骑士，卢卡斯是无赖。”格蕾丝被听到说：“卢卡斯是无赖当且仅当卢卡斯是骑士。”卢卡斯说：“奥利弗是无赖或者格蕾丝是无赖。”伊芙琳评论道：“卢卡斯不是骑士。”艾拉声称：“格蕾丝是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利弗是一名骑士  \n(2) 哈珀是一个无赖  \n(3) 亚历山大是一个无赖  \n(4) 格蕾丝是一个无赖  \n(5) 卢卡斯是一名骑士  \n(6) 伊芙琳是一个无赖  \n(7) 艾拉是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：赖利、大卫、维多利亚、奥萝拉、本杰明、伊丽莎白和艾登。赖利说道：“如果伊丽莎白是骑士，那么维多利亚就是无赖。”大卫表示，如果且仅如果本杰明是无赖，那么艾登就是无赖。维多利亚说：“赖利不是骑士。”奥萝拉评论道：“维多利亚是无赖或者伊丽莎白是无赖。”本杰明宣称：“赖利是骑士当且仅当赖利是无赖。”伊丽莎白表示艾登不是无赖。艾登说：“奥萝拉不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是一名骑士  \n(2) 大卫是一个无赖  \n(3) 维多利亚是一个无赖  \n(4) 奥萝拉是一名骑士  \n(5) 本杰明是一个无赖  \n(6) 伊丽莎白是一名骑士  \n(7) 艾登是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：赖利、本杰明、迈克尔、艾米莉、诺亚、梅森和利亚姆。“艾米莉是骑士当且仅当梅森是骑士”——赖利说。“如果诺亚是无赖，那么赖利就是无赖，”本杰明宣称。“艾米莉是骑士或者梅森是骑士，”迈克尔提到。艾米莉说诺亚是无赖或者艾米莉是骑士。正如诺亚所说，“赖利是无赖当且仅当本杰明是骑士”。“本杰明是无赖而梅森是骑士，”梅森声称。利亚姆说，迈克尔是骑士当且仅当迈克尔是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是一个无赖  \n(2) 本杰明是一个骑士  \n(3) 迈克尔是一个骑士  \n(4) 艾米莉是一个骑士  \n(5) 诺亚是一个骑士  \n(6) 梅森是一个无赖  \n(7) 利亚姆是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：斯嘉丽、伊森、佐伊、艾娃、卢卡斯、维多利亚和亚历山大。斯嘉丽告诉你，艾娃是骑士或者伊森是骑士。伊森提到：“如果伊森是骑士，那么亚历山大就是无赖。”佐伊说：“如果斯嘉丽是无赖，那么艾娃就是骑士。”在艾娃的话中：“佐伊不是无赖。”卢卡斯被听到说：“亚历山大是骑士，斯嘉丽是无赖。”维多利亚声称：“如果卢卡斯是无赖，那么佐伊就是无赖。”亚历山大提到：“伊森是骑士，斯嘉丽是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 斯嘉丽是一名骑士  \n(2) 伊森是一名骑士  \n(3) 佐伊是一名骑士  \n(4) 艾娃是一名骑士  \n(5) 卢卡斯是一名无赖  \n(6) 维多利亚是一名无赖  \n(7) 亚历山大是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：杰克、亨利、卢克、艾弗里、詹姆斯、梅森和塞缪尔。杰克评论道：“杰克是骑士当且仅当塞缪尔是无赖。”亨利的陈述是：“艾弗里是无赖并且艾弗里是骑士。”卢克评论道：“詹姆斯是无赖并且艾弗里是无赖。”正如艾弗里所说：“塞缪尔是骑士或者杰克是无赖。”詹姆斯告诉你，梅森是无赖当且仅当艾弗里是骑士。梅森告诉你，亨利是骑士并且梅森是骑士。“卢克是骑士并且梅森是无赖”——塞缪尔。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）杰克是无赖  \n（2）亨利是无赖  \n（3）卢克是无赖  \n（4）艾弗里是骑士  \n（5）詹姆斯是骑士  \n（6）梅森是无赖  \n（7）塞缪尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：马修、阿丽亚、伊森、米娅、艾弗里、克洛伊和哈珀。马修提到：“艾弗里是无赖，而哈珀是骑士。”阿丽亚评论道：“米娅是无赖当且仅当马修是骑士。”伊森的陈述是：“阿丽亚是无赖或者米娅是无赖。”米娅被听到说：“如果艾弗里是骑士，那么艾弗里就是无赖。”艾弗里被听到说：“米娅是骑士或者米娅是无赖。”克洛伊评论道：“米娅是无赖当且仅当阿丽亚是无赖。”哈珀则说道：“伊森不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是无赖  \n(2) 阿丽亚是无赖  \n(3) 伊森是骑士  \n(4) 米娅是无赖  \n(5) 艾弗里是骑士  \n(6) 克洛伊是骑士  \n(7) 哈珀是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：阿比盖尔、阿丽亚、雅各布、利亚姆、詹姆斯、阿梅莉亚和大卫。在阿比盖尔的话中：“大卫是骑士当且仅当利亚姆是骑士。”阿丽亚指出：“如果阿比盖尔是骑士，那么利亚姆是骑士。”雅各布说：“阿比盖尔是无赖。”利亚姆说：“如果阿梅莉亚是骑士，那么阿比盖尔是骑士。”詹姆斯声称：“雅各布是骑士或者阿梅莉亚是无赖。”阿梅莉亚说：“大卫不是骑士。”大卫说雅各布是无赖，而大卫是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是一名骑士  \n(2) 阿丽亚是一名骑士  \n(3) 雅各布是一个无赖  \n(4) 利亚姆是一名骑士  \n(5) 詹姆斯是一名骑士  \n(6) 阿梅莉亚是一个无赖  \n(7) 大卫是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：维多利亚、杰克逊、杰克、雅各布、克洛伊、丹尼尔和洛根。维多利亚表示，如果洛根是骑士，那么丹尼尔就是骑士。杰克逊表示，洛根是无赖或者杰克是无赖。杰克说：“如果杰克逊是骑士，那么维多利亚就是骑士。”雅各布告诉你，如果丹尼尔是骑士，那么维多利亚就是骑士。“维多利亚不是无赖，”克洛伊宣称。丹尼尔被听到说：“雅各布是骑士或者杰克逊是无赖。”在洛根的声明中：“丹尼尔不是骑士。”那么，谁是骑士，谁是无赖？",
        "solution_text_format": "(1) 维多利亚是一名骑士  \n(2) 杰克逊是一名骑士  \n(3) 杰克是一名骑士  \n(4) 雅各布是一名骑士  \n(5) 克洛伊是一名骑士  \n(6) 丹尼尔是一名骑士  \n(7) 洛根是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：詹姆斯、阿比盖尔、丹尼尔、卢卡斯、奥利弗、赖利和马修。詹姆斯声称：“丹尼尔是个无赖。”阿比盖尔告诉你，如果赖利是骑士，那么卢卡斯就是骑士。丹尼尔说：“如果赖利是骑士，那么卢卡斯就是骑士。”根据卢卡斯的说法：“如果丹尼尔是无赖，那么奥利弗就是无赖。”奥利弗声称：“丹尼尔是骑士，阿比盖尔是无赖。”赖利表示阿比盖尔不是骑士。马修声明：“奥利弗是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是无赖  \n(2) 阿比盖尔是骑士  \n(3) 丹尼尔是骑士  \n(4) 卢卡斯是骑士  \n(5) 奥利弗是无赖  \n(6) 赖利是无赖  \n(7) 马修是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：诺亚、奥萝拉、杰克、奥利弗、米娅、伊芙琳和索菲娅。诺亚宣称：“米娅是骑士当且仅当索菲娅是骑士。”奥萝拉说：“索菲娅是骑士，米娅是骑士。”杰克说：“伊芙琳不是无赖。”奥利弗提到：“伊芙琳不是无赖。”米娅宣称：“如果伊芙琳是骑士，那么索菲娅就是无赖。”伊芙琳评论道：“杰克是骑士或者米娅是骑士。”索菲娅被听到说：“诺亚是骑士，奥萝拉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是无赖  \n(2) 奥萝拉是无赖  \n(3) 杰克是骑士  \n(4) 奥利弗是骑士  \n(5) 米娅是骑士  \n(6) 伊芙琳是骑士  \n(7) 索菲娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：塞缪尔、莉莉、洛根、雅各布、威廉、艾登和亨利。在塞缪尔的话中：“洛根是无赖，艾登是骑士。”在莉莉的话中：“雅各布是骑士当且仅当威廉是骑士。”洛根提到：“如果莉莉是无赖，那么塞缪尔就是骑士。”雅各布提到：“如果亨利是无赖，那么塞缪尔就是无赖。”威廉说：“艾登是骑士，亨利是无赖。”艾登被听到说：“如果莉莉是骑士，那么亨利是无赖。”亨利声明：“威廉是无赖或者艾登是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是无赖  \n(2) 莉莉是骑士  \n(3) 洛根是骑士  \n(4) 雅各布是骑士  \n(5) 威廉是骑士  \n(6) 艾登是骑士  \n(7) 亨利是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：卢克、奥利弗、詹姆斯、艾弗里、杰克逊、洛根和欧文。卢克说：“艾弗里是无赖。”奥利弗指出：“洛根是无赖当且仅当洛根是骑士。”詹姆斯提到：“艾弗里是无赖，卢克是骑士。”艾弗里说：“詹姆斯是骑士或者洛根是无赖。”杰克逊说：“如果詹姆斯是无赖，那么洛根是无赖。”洛根声明：“艾弗里是无赖。”欧文评论道：“如果奥利弗是骑士，那么杰克逊是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是无赖  \n(2) 奥利弗是无赖  \n(3) 詹姆斯是无赖  \n(4) 艾弗里是骑士  \n(5) 杰克逊是骑士  \n(6) 洛根是无赖  \n(7) 欧文是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：利亚姆、夏洛特、格蕾丝、塞缪尔、丹尼尔、索菲娅和奥利弗。利亚姆说：“利亚姆是骑士。”夏洛特指出：“利亚姆是骑士。”格蕾丝说，如果且仅如果丹尼尔是骑士，那么利亚姆就是无赖。塞缪尔声明：“索菲娅是无赖当且仅当丹尼尔是无赖。”丹尼尔告诉你，塞缪尔不是骑士。“奥利弗是骑士或者利亚姆是骑士”——索菲娅。奥利弗说：“丹尼尔是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是无赖  \n(2) 夏洛特是无赖  \n(3) 格蕾丝是无赖  \n(4) 塞缪尔是骑士  \n(5) 丹尼尔是无赖  \n(6) 索菲娅是无赖  \n(7) 奥利弗是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：夏洛特、伊芙琳、诺亚、阿梅莉亚、迈克尔、杰克逊和格蕾丝。夏洛特表示，如果伊芙琳是无赖，那么阿梅莉亚就是无赖。伊芙琳说格蕾丝是无赖或者夏洛特是无赖。“夏洛特是骑士当且仅当迈克尔是无赖”——诺亚。阿梅莉亚告诉你格蕾丝是无赖。迈克尔表示杰克逊是无赖而诺亚是骑士。“阿梅莉亚是骑士当且仅当夏洛特是骑士，”杰克逊提到。“夏洛特是无赖或者伊芙琳是无赖”——格蕾丝。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是一名骑士  \n(2) 伊芙琳是一名骑士  \n(3) 诺亚是一名骑士  \n(4) 阿梅莉亚是一名骑士  \n(5) 迈克尔是一名无赖  \n(6) 杰克逊是一名骑士  \n(7) 格蕾丝是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：艾米莉、夏洛特、杰克逊、奥利弗、索菲娅、塞缪尔和大卫。根据艾米莉的说法，“杰克逊是无赖当且仅当塞缪尔是无赖。”夏洛特告诉你塞缪尔不是无赖。杰克逊声称，“大卫是无赖，索菲娅是骑士。”奥利弗说，“艾米莉不是骑士。”索菲娅表示艾米莉是无赖或者大卫是无赖。“夏洛特是无赖，塞缪尔是骑士，”塞缪尔宣称。大卫说，“大卫是骑士，奥利弗是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是无赖  \n(2) 夏洛特是无赖  \n(3) 杰克逊是骑士  \n(4) 奥利弗是骑士  \n(5) 索菲娅是骑士  \n(6) 塞缪尔是无赖  \n(7) 大卫是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：艾娃、米娅、诺亚、伊森、迈克尔、克洛伊和阿比盖尔。根据艾娃的说法，“伊森是无赖当且仅当迈克尔是骑士”。米娅说：“艾娃是骑士或者迈克尔是无赖”。诺亚表示伊森是骑士，迈克尔是骑士。伊森评论道：“米娅是骑士”。迈克尔说伊森是无赖或者阿比盖尔是骑士。克洛伊表示米娅是骑士，伊森是无赖。阿比盖尔声明：“迈克尔是骑士或者伊森是无赖”。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是一名骑士  \n(2) 米娅是一名骑士  \n(3) 诺亚是一个无赖  \n(4) 伊森是一名骑士  \n(5) 迈克尔是一个无赖  \n(6) 克洛伊是一个无赖  \n(7) 阿比盖尔是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：欧文、艾米莉、莉莉、亨利、哈珀、奥萝拉和索菲娅。正如欧文所说：“欧文是骑士。”艾米莉说：“莉莉不是无赖。”莉莉提到：“如果索菲娅是骑士，那么欧文就是骑士。”亨利声明：“艾米莉是骑士或者艾米莉是无赖。”哈珀指出：“哈珀是骑士而奥萝拉是无赖。”奥萝拉被听到说：“亨利是骑士或者莉莉是骑士。”索菲娅表示莉莉是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是骑士  \n(2) 艾米莉是骑士  \n(3) 莉莉是骑士  \n(4) 亨利是骑士  \n(5) 哈珀是无赖  \n(6) 奥萝拉是骑士  \n(7) 索菲娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：阿比盖尔、赖利、佩内洛普、卢卡斯、伊芙琳、莉莉和米娅。阿比盖尔说：“伊芙琳是无赖，莉莉是骑士。”赖利说，如果米娅是骑士，那么阿比盖尔就是无赖。佩内洛普断言：“伊芙琳是骑士，卢卡斯是无赖。”卢卡斯说：“米娅是骑士，伊芙琳是骑士。”伊芙琳评论道：“莉莉是骑士或者赖利是骑士。”莉莉提到：“米娅是无赖或者伊芙琳是无赖。”米娅评论道：“佩内洛普是骑士，卢卡斯是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是无赖  \n(2) 赖利是骑士  \n(3) 佩内洛普是骑士  \n(4) 卢卡斯是无赖  \n(5) 伊芙琳是骑士  \n(6) 莉莉是骑士  \n(7) 米娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：奥利维亚、阿比盖尔、阿梅莉亚、伊丽莎白、哈珀、奥萝拉和索菲娅。根据奥利维亚的说法，“阿梅莉亚不是无赖。”阿比盖尔声称：“索菲娅不是骑士。”阿梅莉亚提到：“如果索菲娅是骑士，那么哈珀就是骑士。”伊丽莎白宣称：“哈珀不是无赖。”哈珀提到：“阿比盖尔是无赖。”奥萝拉说：“伊丽莎白是骑士或者阿梅莉亚是无赖。”索菲娅声称：“如果伊丽莎白是无赖，那么奥利维亚就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是骑士  \n(2) 阿比盖尔是无赖  \n(3) 阿梅莉亚是骑士  \n(4) 伊丽莎白是骑士  \n(5) 哈珀是骑士  \n(6) 奥萝拉是骑士  \n(7) 索菲娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：詹姆斯、伊森、佩内洛普、亨利、奥利弗、迈克尔和威廉。詹姆斯表示威廉是骑士或者佩内洛普是骑士。伊森说：“佩内洛普是无赖，迈克尔是骑士。”佩内洛普宣称：“迈克尔是骑士当且仅当伊森是无赖。”亨利评论道：“詹姆斯是无赖。”根据奥利弗的说法：“威廉是无赖。”在迈克尔的话中：“如果詹姆斯是骑士，那么威廉就是无赖。”威廉说：“佩内洛普是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）詹姆斯是无赖  \n（2）伊森是骑士  \n（3）佩内洛普是无赖  \n（4）亨利是骑士  \n（5）奥利弗是骑士  \n（6）迈克尔是骑士  \n（7）威廉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：诺亚、斯嘉丽、奥萝拉、奥利弗、詹姆斯、哈珀和米娅。“米娅是骑士或者米娅是无赖，”诺亚说。斯嘉丽评论道：“米娅是骑士。” “奥利弗不是骑士，”奥萝拉宣称。在奥利弗的陈述中：“奥萝拉是无赖或者奥萝拉是骑士。”詹姆斯表示：“斯嘉丽是骑士并且奥萝拉是骑士。”根据哈珀的说法，“如果诺亚是无赖，那么斯嘉丽就是无赖。”米娅说斯嘉丽是无赖，而米娅是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是骑士  \n(2) 斯嘉丽是无赖  \n(3) 奥萝拉是无赖  \n(4) 奥利弗是骑士  \n(5) 詹姆斯是无赖  \n(6) 哈珀是骑士  \n(7) 米娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：伊莎贝拉、威廉、艾米莉、詹姆斯、杰克逊、洛根和阿丽亚。根据伊莎贝拉的说法：“如果洛根是骑士，那么艾米莉就是骑士。”威廉的陈述是：“伊莎贝拉不是骑士。”在艾米莉的话中：“威廉是骑士当且仅当詹姆斯是骑士。”詹姆斯说：“杰克逊不是骑士。”杰克逊提到：“如果洛根是无赖，那么詹姆斯就是骑士。”洛根被听到说：“艾米莉是骑士，伊莎贝拉是骑士。”阿丽亚评论道：“如果伊莎贝拉是骑士，那么威廉就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是一名骑士  \n(2) 威廉是一个无赖  \n(3) 艾米莉是一名骑士  \n(4) 詹姆斯是一个无赖  \n(5) 杰克逊是一名骑士  \n(6) 洛根是一名骑士  \n(7) 阿丽亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：卢卡斯、阿梅莉亚、伊森、利亚姆、詹姆斯、斯嘉丽和梅森。卢卡斯说：“梅森不是骑士。”阿梅莉亚宣称：“利亚姆是骑士当且仅当利亚姆是无赖。”有人听到伊森说：“詹姆斯是骑士，利亚姆是骑士。”利亚姆说：“斯嘉丽是骑士，詹姆斯是无赖。”詹姆斯说：“斯嘉丽不是骑士。”斯嘉丽说：“如果阿梅莉亚是骑士，那么利亚姆是骑士。”根据梅森的说法：“伊森不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是一名骑士  \n(2) 阿梅莉亚是一个无赖  \n(3) 伊森是一个无赖  \n(4) 利亚姆是一名骑士  \n(5) 詹姆斯是一个无赖  \n(6) 斯嘉丽是一名骑士  \n(7) 梅森是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：艾米莉、赖利、亨利、佐伊、诺亚、杰克逊和阿比盖尔。艾米莉说：“如果阿比盖尔是无赖，那么亨利就是无赖。”赖利表示杰克逊是骑士，诺亚是骑士。亨利声称：“阿比盖尔是骑士，艾米莉是无赖。”佐伊说：“杰克逊不是无赖。”诺亚评论道：“亨利是骑士。”杰克逊表示赖利不是骑士。阿比盖尔说：“如果诺亚是骑士，那么艾米莉就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是骑士  \n(2) 赖利是无赖  \n(3) 亨利是无赖  \n(4) 佐伊是骑士  \n(5) 诺亚是无赖  \n(6) 杰克逊是骑士  \n(7) 阿比盖尔是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：哈珀、艾弗里、伊丽莎白、诺亚、夏洛特、艾拉和艾娃。“夏洛特是骑士，”哈珀声称。艾弗里的陈述是：“如果艾娃是骑士，那么哈珀就是无赖。”伊丽莎白指出：“哈珀是无赖。”诺亚断言：“伊丽莎白是骑士或者哈珀是无赖。”夏洛特的陈述是：“艾弗里是骑士，艾娃是骑士。”艾拉说：“夏洛特是无赖。”艾娃说：“哈珀是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是无赖  \n(2) 艾弗里是骑士  \n(3) 伊丽莎白是骑士  \n(4) 诺亚是骑士  \n(5) 夏洛特是无赖  \n(6) 艾拉是骑士  \n(7) 艾娃是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：伊莎贝拉、索菲娅、利亚姆、塞巴斯蒂安、迈克尔、亚历山大和艾登。伊莎贝拉声称：“利亚姆是骑士。”索菲娅说：“塞巴斯蒂安是骑士。”利亚姆在一份声明中说：“如果亚历山大是骑士，那么伊莎贝拉就是骑士。”塞巴斯蒂安评论道：“亚历山大是无赖。”迈克尔表示：“塞巴斯蒂安是骑士当且仅当索菲娅是无赖。”亚历山大声明：“利亚姆不是无赖。”艾登声称：“如果伊莎贝拉是无赖，那么塞巴斯蒂安就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是一名骑士  \n(2) 索菲娅是一个无赖  \n(3) 利亚姆是一名骑士  \n(4) 塞巴斯蒂安是一个无赖  \n(5) 迈克尔是一个无赖  \n(6) 亚历山大是一名骑士  \n(7) 艾登是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：哈珀、杰克逊、亨利、格蕾丝、欧文、利亚姆和阿丽亚。哈珀声称：“格蕾丝是个无赖。”杰克逊说：“亨利是个无赖或者阿丽亚是个无赖。”亨利声称：“利亚姆是个无赖当且仅当欧文是个无赖。”格蕾丝说杰克逊是个无赖，哈珀是个骑士。欧文指出：“如果亨利是个无赖，那么杰克逊就是个骑士。”利亚姆声称：“阿丽亚是个骑士，亨利是个骑士。”阿丽亚说：“亨利是个骑士，格蕾丝是个无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是一名骑士  \n(2) 杰克逊是一名骑士  \n(3) 亨利是一个无赖  \n(4) 格蕾丝是一个无赖  \n(5) 欧文是一名骑士  \n(6) 利亚姆是一个无赖  \n(7) 阿丽亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：亚历山大、马修、奥利维亚、伊芙琳、雅各布、夏洛特和伊莎贝拉。亚历山大提到：“伊芙琳是骑士当且仅当伊芙琳是无赖。”马修声称：“伊莎贝拉是骑士。”奥利维亚说奥利维亚是骑士或者雅各布是骑士。伊芙琳声称：“亚历山大是骑士。”雅各布评论道：“夏洛特是骑士而亚历山大是无赖。”夏洛特说：“亚历山大不是骑士。”伊莎贝拉说：“伊芙琳不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亚历山大是无赖  \n(2) 马修是无赖  \n(3) 奥利维亚是骑士  \n(4) 伊芙琳是无赖  \n(5) 雅各布是骑士  \n(6) 夏洛特是骑士  \n(7) 伊莎贝拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：威廉、阿比盖尔、艾登、伊芙琳、索菲娅、维多利亚和欧文。威廉表示索菲娅是骑士。阿比盖尔说：“威廉不是骑士。”艾登声明：“伊芙琳是骑士或者艾登是骑士。”伊芙琳提到：“阿比盖尔是骑士或者阿比盖尔是无赖。”索菲娅被听到说：“伊芙琳不是无赖。”维多利亚说：“威廉是骑士或者阿比盖尔是骑士。”根据欧文的说法：“维多利亚是骑士并且阿比盖尔是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 阿比盖尔是一个无赖  \n(3) 艾登是一名骑士  \n(4) 伊芙琳是一名骑士  \n(5) 索菲娅是一名骑士  \n(6) 维多利亚是一名骑士  \n(7) 欧文是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：约瑟夫、詹姆斯、艾拉、塞巴斯蒂安、阿丽亚、本杰明和莉莉。约瑟夫评论道：“塞巴斯蒂安是骑士或者詹姆斯是骑士。”詹姆斯说道：“艾拉是骑士并且约瑟夫是骑士。”艾拉声明：“本杰明不是骑士。”塞巴斯蒂安宣称：“本杰明不是骑士。”阿丽亚告诉你，约瑟夫是骑士当且仅当本杰明是骑士。本杰明说莉莉是无赖当且仅当阿丽亚是骑士。“莉莉声称：“本杰明是骑士或者阿丽亚是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是无赖  \n(2) 詹姆斯是无赖  \n(3) 艾拉是无赖  \n(4) 塞巴斯蒂安是无赖  \n(5) 阿丽亚是无赖  \n(6) 本杰明是骑士  \n(7) 莉莉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：佐伊、艾拉、杰克、丹尼尔、杰克逊、伊芙琳和威廉。佐伊说：“佐伊是骑士或者威廉是骑士。”艾拉声称：“如果伊芙琳是无赖，那么伊芙琳就是骑士。”杰克提到：“佐伊是骑士。”丹尼尔表示：“杰克逊是无赖或者杰克是骑士。”杰克逊说：“如果伊芙琳是骑士，那么威廉就是无赖。”根据伊芙琳的说法：“佐伊是无赖，杰克逊是骑士。”威廉的声明是：“佐伊是无赖，伊芙琳是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佐伊是一名骑士  \n(2) 艾拉是一个无赖  \n(3) 杰克是一名骑士  \n(4) 丹尼尔是一名骑士  \n(5) 杰克逊是一名骑士  \n(6) 伊芙琳是一个无赖  \n(7) 威廉是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：塞缪尔、迈克尔、丹尼尔、利亚姆、梅森、伊丽莎白和阿丽亚。塞缪尔说：“迈克尔不是骑士。”在迈克尔的话中：“梅森是无赖。”丹尼尔表示阿丽亚是无赖。“利亚姆是骑士或者塞缪尔是骑士，”利亚姆声称。“丹尼尔是骑士当且仅当利亚姆是无赖，”梅森提到。“阿丽亚是骑士或者阿丽亚是无赖，”伊丽莎白提到。阿丽亚表示利亚姆是无赖当且仅当阿丽亚是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是无赖  \n(2) 迈克尔是骑士  \n(3) 丹尼尔是无赖  \n(4) 利亚姆是无赖  \n(5) 梅森是无赖  \n(6) 伊丽莎白是骑士  \n(7) 阿丽亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：利亚姆、艾登、阿比盖尔、艾弗里、索菲娅、亨利和伊莎贝拉。利亚姆说：“索菲娅是骑士当且仅当阿比盖尔是无赖。”艾登说：“艾登是骑士，伊莎贝拉是骑士。”阿比盖尔说：“艾弗里是无赖，利亚姆是骑士。”艾弗里说：“如果阿比盖尔是无赖，那么艾登是骑士。”索菲娅表示：“艾弗里是骑士或者索菲娅是骑士。”亨利表示阿比盖尔是骑士。伊莎贝拉说：“艾弗里是无赖，索菲娅是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是无赖  \n(2) 艾登是无赖  \n(3) 阿比盖尔是无赖  \n(4) 艾弗里是无赖  \n(5) 索菲娅是无赖  \n(6) 亨利是无赖  \n(7) 伊莎贝拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：奥利维亚、阿梅莉亚、塞缪尔、艾娃、迈克尔、夏洛特和亚历山大。正如奥利维亚所说：“亚历山大是骑士或者亚历山大是无赖。”阿梅莉亚的陈述是：“奥利维亚不是无赖。”塞缪尔提到：“迈克尔是无赖，艾娃是无赖。”艾娃声称：“奥利维亚是骑士或者阿梅莉亚是无赖。”迈克尔的话是：“亚历山大是无赖，奥利维亚是无赖。”夏洛特告诉你，塞缪尔不是无赖。“塞缪尔是无赖，奥利维亚是无赖”——亚历山大。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是骑士  \n(2) 阿梅莉亚是骑士  \n(3) 塞缪尔是无赖  \n(4) 艾娃是骑士  \n(5) 迈克尔是无赖  \n(6) 夏洛特是无赖  \n(7) 亚历山大是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：威廉、阿梅莉亚、索菲娅、欧文、杰克、约瑟夫和大卫。威廉说：“如果威廉是骑士，那么大卫就是无赖。”阿梅莉亚提到：“约瑟夫是无赖或者威廉是无赖。”索菲娅评论道：“威廉不是无赖。”欧文断言：“阿梅莉亚是骑士当且仅当约瑟夫是骑士。”杰克被听到说：“如果威廉是无赖，那么阿梅莉亚就是骑士。”约瑟夫指出：“阿梅莉亚是无赖，欧文是骑士。”大卫声称：“威廉是骑士，约瑟夫是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 阿梅莉亚是一名骑士  \n(3) 索菲娅是一名骑士  \n(4) 欧文是一名无赖  \n(5) 杰克是一名骑士  \n(6) 约瑟夫是一名无赖  \n(7) 大卫是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：亨利、索菲娅、米娅、杰克逊、奥利弗、塞缪尔和奥萝拉。亨利声称：“奥利弗是骑士，索菲娅是无赖。”索菲娅说：“索菲娅是骑士。”米娅说：“杰克逊是骑士当且仅当亨利是骑士。”杰克逊声明：“索菲娅是骑士。”奥利弗评论道：“杰克逊是骑士或者米娅是骑士。”塞缪尔告诉你：“米娅是骑士当且仅当杰克逊是无赖。”奥萝拉说塞缪尔是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是无赖  \n(2) 索菲娅是骑士  \n(3) 米娅是无赖  \n(4) 杰克逊是骑士  \n(5) 奥利弗是骑士  \n(6) 塞缪尔是骑士  \n(7) 奥萝拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：威廉、阿丽亚、塞巴斯蒂安、伊莎贝拉、伊芙琳、佩内洛普和格蕾丝。威廉声称：“伊莎贝拉是无赖当且仅当格蕾丝是无赖。”阿丽亚的陈述是：“格蕾丝是无赖或者格蕾丝是骑士。”塞巴斯蒂安指出：“伊芙琳是无赖。”伊莎贝拉说：“伊莎贝拉是骑士或者格蕾丝是骑士。”伊芙琳提到：“佩内洛普是无赖并且佩内洛普是骑士。”佩内洛普评论道：“阿丽亚是骑士。”格蕾丝指出：“如果佩内洛普是骑士，那么阿丽亚是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 阿丽亚是一名骑士  \n(3) 塞巴斯蒂安是一名骑士  \n(4) 伊莎贝拉是一名骑士  \n(5) 伊芙琳是一名无赖  \n(6) 佩内洛普是一名骑士  \n(7) 格蕾丝是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：莉莉、约瑟夫、丹尼尔、索菲娅、艾弗里、索菲娅和诺亚。莉莉说：“如果索菲娅是无赖，那么艾弗里就是无赖。”约瑟夫指出：“艾弗里不是骑士。”丹尼尔说：“诺亚是无赖。”索菲娅说：“如果艾弗里是骑士，那么莉莉就是骑士。”艾弗里说：“索菲娅是骑士。”索菲娅告诉你，艾弗里不是无赖。“约瑟夫是无赖或者艾弗里是无赖，”诺亚提到。那谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是骑士  \n(2) 约瑟夫是无赖  \n(3) 丹尼尔是无赖  \n(4) 索菲娅是骑士  \n(5) 艾弗里是骑士  \n(6) 索菲娅是骑士  \n(7) 诺亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：哈珀、约瑟夫、莉莉、欧文、克洛伊、詹姆斯和伊芙琳。哈珀说：“伊芙琳是无赖或者约瑟夫是无赖。”约瑟夫声明：“詹姆斯是无赖或者伊芙琳是骑士。”莉莉说：“哈珀是无赖或者约瑟夫是骑士。”欧文表示，如果詹姆斯是骑士，那么詹姆斯就是无赖。克洛伊声称：“詹姆斯是骑士或者约瑟夫是无赖。”詹姆斯评论道：“哈珀是无赖当且仅当约瑟夫是骑士。”伊芙琳的声明是：“欧文是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是一名骑士  \n(2) 约瑟夫是一个无赖  \n(3) 莉莉是一个无赖  \n(4) 欧文是一个无赖  \n(5) 克洛伊是一名骑士  \n(6) 詹姆斯是一名骑士  \n(7) 伊芙琳是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：亨利、克洛伊、雅各布、艾拉、利亚姆、梅森和迈克尔。亨利说：“如果梅森是无赖，那么雅各布就是无赖。”克洛伊断言：“如果迈克尔是无赖，那么雅各布就是无赖。”雅各布说：“利亚姆是无赖，而亨利是骑士。”艾拉说，如果且仅如果梅森是无赖，克洛伊就是无赖。利亚姆声明：“迈克尔是无赖。”梅森断言：“迈克尔是骑士。”迈克尔告诉你亨利是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）亨利是一名骑士  \n（2）克洛伊是一名骑士  \n（3）雅各布是一名骑士  \n（4）艾拉是一名骑士  \n（5）利亚姆是一名无赖  \n（6）梅森是一名骑士  \n（7）迈克尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：哈珀、奥利维亚、佩内洛普、阿梅莉亚、克洛伊、本杰明和艾拉。“如果本杰明是无赖，那么本杰明就是骑士，”哈珀提到。奥利维亚告诉你，哈珀是无赖或者佩内洛普是骑士。佩内洛普声明：“哈珀是骑士或者本杰明是骑士”。阿梅莉亚断言：“哈珀是无赖当且仅当奥利维亚是无赖”。在克洛伊的话中：“艾拉是无赖当且仅当佩内洛普是无赖”。在本杰明的话中：“艾拉不是骑士”。在艾拉的陈述中：“克洛伊是骑士”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是一名骑士  \n(2) 奥利维亚是一名骑士  \n(3) 佩内洛普是一名骑士  \n(4) 阿梅莉亚是一名骑士  \n(5) 克洛伊是一名无赖  \n(6) 本杰明是一名骑士  \n(7) 艾拉是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：艾登、亚历山大、雅各布、奥萝拉、迈克尔、伊莎贝拉和亨利。艾登评论道：“艾登是骑士，奥萝拉是骑士。”亚历山大声称：“当且仅当奥萝拉是无赖时，艾登才是骑士。”雅各布说：“艾登是骑士。”奥萝拉在一份声明中说：“迈克尔是骑士当且仅当雅各布是无赖。”迈克尔断言：“伊莎贝拉不是骑士。”伊莎贝拉评论道：“奥萝拉是骑士或者亚历山大是骑士。”亨利告诉你：“如果奥萝拉是无赖，那么艾登就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是一名骑士  \n(2) 亚历山大是一个无赖  \n(3) 雅各布是一名骑士  \n(4) 奥萝拉是一名骑士  \n(5) 迈克尔是一个无赖  \n(6) 伊莎贝拉是一名骑士  \n(7) 亨利是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：伊芙琳、本杰明、莉莉、艾米莉、艾登、亚历山大和马修。“艾登不是无赖”——伊芙琳说。根据本杰明的说法，“亚历山大是无赖”。莉莉说马修是骑士，伊芙琳也是骑士。正如艾米莉所说，“莉莉是无赖，伊芙琳是无赖”。有人听到艾登说，“马修是无赖或者亚历山大是无赖”。亚历山大说，“艾登不是无赖”。马修表示本杰明是骑士或者马修是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是一名骑士  \n(2) 本杰明是一个无赖  \n(3) 莉莉是一个无赖  \n(4) 艾米莉是一个无赖  \n(5) 艾登是一名骑士  \n(6) 亚历山大是一名骑士  \n(7) 马修是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：伊莎贝拉、马修、艾登、克洛伊、杰克逊、夏洛特和伊森。伊莎贝拉说：“夏洛特不是骑士。”马修的话是：“艾登是无赖，克洛伊是骑士。”艾登的陈述是：“如果伊莎贝拉是无赖，那么夏洛特就是骑士。”克洛伊说：“马修是无赖，伊森是骑士。”杰克逊告诉你，马修是骑士，夏洛特是骑士。“杰克逊不是骑士，”夏洛特宣称。伊森断言：“伊莎贝拉是无赖当且仅当马修是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是无赖  \n(2) 马修是无赖  \n(3) 艾登是骑士  \n(4) 克洛伊是骑士  \n(5) 杰克逊是无赖  \n(6) 夏洛特是骑士  \n(7) 伊森是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：奥利弗、利亚姆、威廉、索菲娅、佐伊、卢克和莉莉。奥利弗说道：“如果卢克是骑士，那么莉莉就是骑士。”利亚姆声称：“威廉是骑士，而莉莉是无赖。”威廉评论道：“莉莉是无赖，而索菲娅是无赖。”索菲娅在声明中说：“如果且仅如果佐伊是无赖，那么佐伊就是骑士。”佐伊说莉莉是无赖或者索菲娅是骑士。“威廉不是无赖，”卢克声称。莉莉被听到说：“索菲娅不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利弗是无赖  \n(2) 利亚姆是骑士  \n(3) 威廉是骑士  \n(4) 索菲娅是无赖  \n(5) 佐伊是骑士  \n(6) 卢克是骑士  \n(7) 莉莉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：米娅、斯嘉丽、艾拉、格蕾丝、阿比盖尔、诺亚和詹姆斯。米娅说：“阿比盖尔是无赖，诺亚是无赖。”斯嘉丽说阿比盖尔是骑士或者米娅是无赖。艾拉评论道：“米娅是骑士或者詹姆斯是骑士。”根据格蕾丝的说法，“米娅是无赖。”阿比盖尔被听到说：“格蕾丝是骑士或者阿比盖尔是骑士。”诺亚说：“艾拉不是无赖。”詹姆斯评论道：“如果斯嘉丽是无赖，那么格蕾丝就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是无赖  \n(2) 斯嘉丽是骑士  \n(3) 艾拉是骑士  \n(4) 格蕾丝是骑士  \n(5) 阿比盖尔是骑士  \n(6) 诺亚是骑士  \n(7) 詹姆斯是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：马修、奥萝拉、卢卡斯、格蕾丝、夏洛特、阿丽亚和米娅。马修说：“格蕾丝不是无赖。”奥萝拉说：“米娅是无赖当且仅当夏洛特是无赖。”卢卡斯被听到说：“米娅是无赖或者阿丽亚是骑士。”格蕾丝声明：“卢卡斯是无赖。”夏洛特被听到说：“阿丽亚是无赖而马修是骑士。”阿丽亚宣称：“米娅是无赖或者格蕾丝是无赖。”米娅声称：“马修是骑士而奥萝拉是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是无赖  \n(2) 奥萝拉是骑士  \n(3) 卢卡斯是骑士  \n(4) 格蕾丝是无赖  \n(5) 夏洛特是无赖  \n(6) 阿丽亚是骑士  \n(7) 米娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：迈克尔、莉莉、卢卡斯、杰克逊、艾娃、马修和哈珀。迈克尔声称：“马修是无赖或者艾娃是骑士。”莉莉则声称：“莉莉是骑士或者卢卡斯是骑士。”卢卡斯说：“如果哈珀是无赖，那么哈珀就是骑士。”杰克逊被听到说：“迈克尔是骑士当且仅当迈克尔是无赖。”在艾娃看来：“马修是骑士当且仅当哈珀是骑士。”马修评论道：“杰克逊是骑士。”哈珀说：“如果莉莉是无赖，那么马修就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是一名骑士  \n(2) 莉莉是一名骑士  \n(3) 卢卡斯是一名骑士  \n(4) 杰克逊是一名无赖  \n(5) 艾娃是一名无赖  \n(6) 马修是一名无赖  \n(7) 哈珀是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：佩内洛普、阿比盖尔、杰克逊、莉莉、迈克尔、奥萝拉和索菲娅。佩内洛普声称：“杰克逊是骑士或者索菲娅是无赖。”阿比盖尔说：“杰克逊是骑士。”杰克逊说：“莉莉是骑士或者佩内洛普是无赖。”莉莉说：“佩内洛普是无赖而迈克尔是骑士。”迈克尔宣称：“如果阿比盖尔是骑士，那么奥萝拉就是无赖。”奥萝拉评论道：“莉莉是无赖或者索菲娅是无赖。”索菲娅指出：“杰克逊是无赖当且仅当迈克尔是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是一名骑士  \n(2) 阿比盖尔是一个无赖  \n(3) 杰克逊是一个无赖  \n(4) 莉莉是一个无赖  \n(5) 迈克尔是一名骑士  \n(6) 奥萝拉是一名骑士  \n(7) 索菲娅是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：斯嘉丽、艾弗里、赖利、奥利弗、伊森、威廉和艾玛。斯嘉丽说：“艾弗里是骑士，威廉是骑士。”艾弗里声称：“伊森是无赖当且仅当斯嘉丽是骑士。”赖利的话是：“如果艾玛是无赖，那么艾弗里就是无赖。”奥利弗说：“赖利不是骑士。”伊森宣称：“奥利弗是骑士。”威廉宣称：“赖利不是骑士。”艾玛被听到说：“威廉不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 斯嘉丽是无赖  \n(2) 艾弗里是无赖  \n(3) 赖利是骑士  \n(4) 奥利弗是无赖  \n(5) 伊森是无赖  \n(6) 威廉是无赖  \n(7) 艾玛是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：赖利、亚历山大、诺亚、斯嘉丽、杰克逊、奥萝拉和艾弗里。“艾弗里不是骑士，”赖利宣称。“亚历山大是骑士当且仅当艾弗里是骑士，”亚历山大说。诺亚评论道：“赖利是无赖，亚历山大是无赖。” “艾弗里是骑士，”斯嘉丽声称。“赖利是无赖或者诺亚是无赖，”杰克逊提到。奥萝拉说赖利是骑士，奥萝拉是骑士。艾弗里评论道：“亚历山大是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是无赖  \n(2) 亚历山大是骑士  \n(3) 诺亚是无赖  \n(4) 斯嘉丽是骑士  \n(5) 杰克逊是骑士  \n(6) 奥萝拉是无赖  \n(7) 艾弗里是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：诺亚、莉莉、奥利弗、塞缪尔、格蕾丝、米娅和斯嘉丽。诺亚说：“斯嘉丽不是骑士。”莉莉说：“诺亚是骑士或者奥利弗是骑士。”奥利弗提到：“米娅是无赖或者米娅是骑士。”塞缪尔表示莉莉不是无赖。格蕾丝被听到说：“莉莉是骑士或者塞缪尔是骑士。”米娅被听到说：“斯嘉丽不是无赖。”斯嘉丽断言：“如果莉莉是无赖，那么格蕾丝就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是无赖  \n(2) 莉莉是骑士  \n(3) 奥利弗是骑士  \n(4) 塞缪尔是骑士  \n(5) 格蕾丝是骑士  \n(6) 米娅是骑士  \n(7) 斯嘉丽是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：欧文、艾拉、大卫、梅森、哈珀、奥萝拉和克洛伊。欧文说道：“大卫是无赖或者欧文是骑士。”艾拉提到：“欧文是无赖而且克洛伊是无赖。”大卫说：“克洛伊不是骑士。”梅森被听到说：“奥萝拉是骑士当且仅当艾拉是无赖。”哈珀声明：“艾拉不是骑士。”奥萝拉宣称：“克洛伊是骑士。”克洛伊的陈述是：“大卫是无赖当且仅当克洛伊是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是一名骑士  \n(2) 艾拉是一个无赖  \n(3) 大卫是一个无赖  \n(4) 梅森是一名骑士  \n(5) 哈珀是一名骑士  \n(6) 奥萝拉是一名骑士  \n(7) 克洛伊是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：索菲娅、亚历山大、梅森、克洛伊、伊芙琳、佩内洛普和卢克。索菲娅告诉你，亚历山大是骑士当且仅当索菲娅是骑士。亚历山大声称：“索菲娅是骑士或者克洛伊是无赖。”梅森提到：“克洛伊是无赖当且仅当克洛伊是骑士。”克洛伊断言：“如果克洛伊是骑士，那么梅森就是无赖。”伊芙琳表示梅森是无赖或者克洛伊是无赖。佩内洛普断言：“索菲娅是无赖或者亚历山大是无赖。”卢克评论道：“伊芙琳不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是骑士  \n(2) 亚历山大是骑士  \n(3) 梅森是无赖  \n(4) 克洛伊是骑士  \n(5) 伊芙琳是骑士  \n(6) 佩内洛普是无赖  \n(7) 卢克是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：马修、索菲娅、伊芙琳、伊森、亨利、詹姆斯和阿比盖尔。马修被听到说：“詹姆斯不是无赖。”索菲娅说：“如果阿比盖尔是无赖，那么詹姆斯就是骑士。”伊芙琳告诉你，詹姆斯是无赖当且仅当马修是无赖。伊森断言：“伊芙琳不是无赖。”亨利声称：“马修是骑士当且仅当索菲娅是无赖。”詹姆斯被听到说：“伊芙琳不是无赖。”在阿比盖尔的陈述中：“詹姆斯不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是一名骑士  \n(2) 索菲娅是一名骑士  \n(3) 伊芙琳是一名骑士  \n(4) 伊森是一名骑士  \n(5) 亨利是一名无赖  \n(6) 詹姆斯是一名骑士  \n(7) 阿比盖尔是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：塞缪尔、艾登、维多利亚、亚历山大、奥利维亚、詹姆斯和诺亚。塞缪尔说：“亚历山大是无赖当且仅当亚历山大是骑士。”艾登评论道：“诺亚是骑士，奥利维亚是无赖。”维多利亚说：“诺亚是骑士，詹姆斯是骑士。”亚历山大宣称：“维多利亚不是骑士。”奥利维亚被听到说：“詹姆斯是无赖，艾登是无赖。”詹姆斯说：“维多利亚是无赖。”诺亚指出：“维多利亚是骑士当且仅当塞缪尔是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是无赖  \n(2) 艾登是无赖  \n(3) 维多利亚是无赖  \n(4) 亚历山大是骑士  \n(5) 奥利维亚是无赖  \n(6) 詹姆斯是骑士  \n(7) 诺亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：索菲娅、维多利亚、佐伊、艾拉、阿丽亚、米娅和奥利维亚。索菲娅表示艾拉是骑士或者维多利亚是无赖。“阿丽亚是无赖，”维多利亚声称。佐伊告诉你，索菲娅是骑士当且仅当维多利亚是无赖。在艾拉的话中：“奥利维亚是骑士并且奥利维亚是无赖。” “艾拉是无赖，”阿丽亚宣称。“维多利亚是骑士而奥利维亚是无赖” - 米娅。“如果索菲娅是骑士，那么阿丽亚是骑士，”奥利维亚提到。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 维多利亚是一个无赖  \n(3) 佐伊是一名骑士  \n(4) 艾拉是一个无赖  \n(5) 阿丽亚是一名骑士  \n(6) 米娅是一个无赖  \n(7) 奥利维亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：艾娃、卢克、斯嘉丽、洛根、阿梅莉亚、奥萝拉和伊森。艾娃被听到说：“洛根是无赖，阿梅莉亚是无赖。”卢克声明：“奥萝拉不是骑士。”斯嘉丽声称：“卢克是骑士。”洛根指出：“卢克是骑士。”阿梅莉亚告诉你，如果卢克是骑士，那么洛根就是骑士。“洛根是无赖，阿梅莉亚是无赖，”奥萝拉提到。“阿梅莉亚是骑士，”伊森宣称。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是无赖  \n(2) 卢克是骑士  \n(3) 斯嘉丽是骑士  \n(4) 洛根是骑士  \n(5) 阿梅莉亚是骑士  \n(6) 奥萝拉是无赖  \n(7) 伊森是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：伊芙琳、艾米莉、莉莉、约瑟夫、欧文、艾玛和格蕾丝。伊芙琳表示约瑟夫是无赖或者莉莉是骑士。“约瑟夫是骑士”——艾米莉。“如果欧文是骑士，那么约瑟夫就是无赖”——莉莉。“莉莉不是骑士，”约瑟夫声称。欧文表示艾米莉是无赖。艾玛说莉莉是骑士而格蕾丝是无赖。在格蕾丝的陈述中：“约瑟夫是骑士而欧文是骑士”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是一名骑士  \n(2) 艾米莉是一个无赖  \n(3) 莉莉是一名骑士  \n(4) 约瑟夫是一个无赖  \n(5) 欧文是一名骑士  \n(6) 艾玛是一名骑士  \n(7) 格蕾丝是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：艾弗里、塞缪尔、艾玛、丹尼尔、洛根、大卫和奥利弗。艾弗里说：“塞缪尔是骑士，艾弗里是骑士。”塞缪尔说：“艾玛是无赖，艾弗里是骑士。”艾玛宣称：“大卫是无赖，奥利弗是无赖。”在丹尼尔的陈述中：“丹尼尔是骑士，艾弗里是骑士。”洛根告诉你，艾弗里不是无赖。“如果奥利弗是无赖，那么艾玛就是骑士。”——大卫。在奥利弗的陈述中：“洛根是无赖当且仅当艾玛是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是无赖  \n(2) 塞缪尔是无赖  \n(3) 艾玛是无赖  \n(4) 丹尼尔是无赖  \n(5) 洛根是无赖  \n(6) 大卫是骑士  \n(7) 奥利弗是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：诺亚、迈克尔、艾娃、哈珀、詹姆斯、欧文和索菲娅。诺亚说：“索菲娅是骑士。”迈克尔说：“哈珀是无赖当且仅当诺亚是无赖。”艾娃说：“艾娃是骑士，詹姆斯是骑士。”哈珀提到：“迈克尔是骑士或者詹姆斯是骑士。”詹姆斯说：“欧文是骑士或者索菲娅是无赖。”欧文说：“迈克尔是无赖，索菲娅是骑士。”索菲娅被听到说：“哈珀不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是骑士  \n(2) 迈克尔是骑士  \n(3) 艾娃是无赖  \n(4) 哈珀是骑士  \n(5) 詹姆斯是无赖  \n(6) 欧文是无赖  \n(7) 索菲娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：雅各布、詹姆斯、奥利维亚、斯嘉丽、艾玛、夏洛特和维多利亚。雅各布的陈述是：“斯嘉丽是无赖或者维多利亚是无赖。”詹姆斯说：“维多利亚是无赖或者奥利维亚是骑士。”奥利维亚提到：“雅各布不是骑士。”斯嘉丽表示夏洛特不是无赖。艾玛评论道：“如果维多利亚是骑士，那么奥利维亚就是无赖。”夏洛特评论：“艾玛是无赖。”维多利亚说：“詹姆斯是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 雅各布是无赖  \n(2) 詹姆斯是骑士  \n(3) 奥利维亚是骑士  \n(4) 斯嘉丽是骑士  \n(5) 艾玛是无赖  \n(6) 夏洛特是骑士  \n(7) 维多利亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：艾玛、哈珀、伊莎贝拉、伊森、艾娃、大卫和塞缪尔。根据艾玛的说法，“塞缪尔不是无赖”。“大卫是骑士，”哈珀宣称。伊莎贝拉表示，“伊莎贝拉是骑士，艾娃是骑士”。伊森说，“塞缪尔是骑士，大卫是无赖。” “哈珀不是无赖” - 艾娃。大卫指出，“艾玛不是无赖”。塞缪尔评论道，“伊森是骑士，艾玛是骑士”。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是无赖  \n(2) 哈珀是无赖  \n(3) 伊莎贝拉是无赖  \n(4) 伊森是无赖  \n(5) 艾娃是无赖  \n(6) 大卫是无赖  \n(7) 塞缪尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：佩内洛普、欧文、格蕾丝、阿梅莉亚、艾登、卢卡斯和米娅。佩内洛普说：“如果米娅是骑士，那么艾登就是无赖。”欧文说格蕾丝是骑士或者佩内洛普是骑士。格蕾丝的陈述是：“佩内洛普是骑士或者阿梅莉亚是无赖。”阿梅莉亚指出：“欧文不是无赖。”艾登的陈述是：“佩内洛普是骑士当且仅当欧文是无赖。”根据卢卡斯的说法：“艾登是骑士当且仅当欧文是无赖。”米娅评论道：“欧文不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是一名骑士  \n(2) 欧文是一名骑士  \n(3) 格蕾丝是一名骑士  \n(4) 阿梅莉亚是一名骑士  \n(5) 艾登是一名无赖  \n(6) 卢卡斯是一名骑士  \n(7) 米娅是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：亚历山大、索菲娅、塞缪尔、大卫、伊莎贝拉、威廉和阿比盖尔。亚历山大说：“阿比盖尔是无赖。”索菲娅说伊莎贝拉不是无赖。根据塞缪尔的说法，“威廉不是无赖。”大卫评论道：“伊莎贝拉不是骑士。”伊莎贝拉说索菲娅是骑士或者威廉是骑士。威廉提到：“亚历山大是骑士或者阿比盖尔是无赖。”阿比盖尔说如果且仅如果伊莎贝拉是无赖，威廉就是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）亚历山大是无赖  \n（2）索菲娅是无赖  \n（3）塞缪尔是无赖  \n（4）大卫是骑士  \n（5）伊莎贝拉是无赖  \n（6）威廉是无赖  \n（7）阿比盖尔是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：赖利、亨利、伊丽莎白、伊莎贝拉、詹姆斯、本杰明和索菲娅。赖利说：“赖利是骑士当且仅当詹姆斯是无赖。”亨利宣称：“亨利是骑士当且仅当本杰明是无赖。”伊丽莎白告诉你，如果本杰明是无赖，那么赖利就是无赖。伊莎贝拉说：“本杰明是无赖。”詹姆斯指出：“赖利是骑士，索菲娅是骑士。”在本杰明的话中：“伊丽莎白是骑士。”在索菲娅的陈述中：“亨利是无赖当且仅当伊丽莎白是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是一名骑士  \n(2) 亨利是一个无赖  \n(3) 伊丽莎白是一个无赖  \n(4) 伊莎贝拉是一名骑士  \n(5) 詹姆斯是一个无赖  \n(6) 本杰明是一个无赖  \n(7) 索菲娅是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：佐伊、艾娃、雅各布、威廉、亨利、伊莎贝拉和艾登。佐伊说道：“艾登是骑士当且仅当雅各布是骑士。”艾娃声称：“艾登是骑士或者佐伊是无赖。”根据雅各布的说法，“艾娃是骑士当且仅当艾登是骑士。”威廉告诉你，威廉是骑士，亨利也是骑士。“雅各布是无赖或者伊莎贝拉是骑士，”亨利声称。伊莎贝拉断言：“艾娃是骑士当且仅当艾登是无赖。” “伊莎贝拉是无赖或者雅各布是无赖，”艾登宣称。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佐伊是一名骑士  \n(2) 艾娃是一名骑士  \n(3) 雅各布是一名骑士  \n(4) 威廉是一个无赖  \n(5) 亨利是一个无赖  \n(6) 伊莎贝拉是一个无赖  \n(7) 艾登是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：佩内洛普、奥利弗、雅各布、梅森、詹姆斯、艾玛和卢卡斯。佩内洛普告诉你梅森是个无赖。奥利弗被听到说：“卢卡斯是个无赖或者奥利弗是个骑士。”根据雅各布的说法：“如果佩内洛普是个骑士，那么艾玛就是个无赖。”梅森表示奥利弗不是无赖。“梅森是个无赖当且仅当奥利弗是个骑士，”詹姆斯提到。在艾玛的陈述中：“詹姆斯是个骑士当且仅当梅森是个无赖。”卢卡斯断言：“艾玛是个骑士或者詹姆斯是个骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是无赖  \n(2) 奥利弗是骑士  \n(3) 雅各布是骑士  \n(4) 梅森是骑士  \n(5) 詹姆斯是无赖  \n(6) 艾玛是骑士  \n(7) 卢卡斯是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：艾弗里、艾娃、米娅、佩内洛普、赖利、塞缪尔和奥利维亚。根据艾弗里的说法：“艾娃是骑士，佩内洛普是骑士。”艾娃说米娅是骑士，佩内洛普是骑士。在米娅的陈述中：“佩内洛普是无赖，艾弗里是骑士。”佩内洛普指出：“赖利是骑士。”赖利提到：“如果米娅是无赖，那么艾弗里就是骑士。”塞缪尔声称：“佩内洛普是无赖或者艾娃是无赖。”奥利维亚声称：“当且仅当艾弗里是骑士时，塞缪尔才是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是无赖  \n(2) 艾娃是无赖  \n(3) 米娅是无赖  \n(4) 佩内洛普是无赖  \n(5) 赖利是无赖  \n(6) 塞缪尔是骑士  \n(7) 奥利维亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：佩内洛普、索菲娅、莉莉、奥萝拉、诺亚、杰克逊和卢克。佩内洛普表示索菲娅是一个无赖。索菲娅表示卢克是一个无赖。“杰克逊是一个无赖，而奥萝拉是一个骑士，”莉莉声称。奥萝拉断言：“莉莉不是一个无赖。”诺亚被听到说：“杰克逊不是一个无赖。”在杰克逊的话中：“卢克不是一个无赖。”卢克评论道：“奥萝拉是一个无赖当且仅当诺亚是一个无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是无赖  \n(2) 索菲娅是骑士  \n(3) 莉莉是骑士  \n(4) 奥萝拉是骑士  \n(5) 诺亚是无赖  \n(6) 杰克逊是无赖  \n(7) 卢克是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：马修、艾拉、哈珀、亚历山大、佩内洛普、本杰明和艾娃。“哈珀是骑士，”马修宣称。有人听到艾拉说：“艾娃是无赖或者马修是无赖。”哈珀说：“艾娃不是骑士。”亚历山大说：“艾拉是骑士当且仅当艾娃是无赖。”根据佩内洛普的说法，“如果艾娃是骑士，那么亚历山大就是无赖。”本杰明宣称：“艾娃是骑士当且仅当哈珀是骑士。”艾娃表示：“如果马修是无赖，那么哈珀就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是无赖  \n(2) 艾拉是骑士  \n(3) 哈珀是无赖  \n(4) 亚历山大是无赖  \n(5) 佩内洛普是骑士  \n(6) 本杰明是无赖  \n(7) 艾娃是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：马修、本杰明、伊森、梅森、维多利亚、雅各布和卢卡斯。根据马修的说法，“维多利亚不是无赖”。本杰明评论道，“如果梅森是骑士，那么马修就是无赖”。伊森被听到说，“马修是骑士当且仅当卢卡斯是骑士”。梅森被听到说，“梅森是骑士当且仅当维多利亚是骑士”。维多利亚被听到说，“如果雅各布是无赖，那么本杰明就是无赖”。“马修是无赖”——雅各布。卢卡斯指出，“本杰明是无赖当且仅当雅各布是无赖”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是一名骑士  \n(2) 本杰明是一个无赖  \n(3) 伊森是一名骑士  \n(4) 梅森是一名骑士  \n(5) 维多利亚是一名骑士  \n(6) 雅各布是一个无赖  \n(7) 卢卡斯是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：威廉、哈珀、梅森、詹姆斯、塞缪尔、阿梅莉亚和马修。威廉表示，如果梅森是骑士，那么塞缪尔就是无赖。哈珀说：“梅森是骑士或者詹姆斯是骑士。”梅森表示塞缪尔是无赖，而塞缪尔是骑士。詹姆斯告诉你阿梅莉亚不是无赖。塞缪尔被听到说：“威廉不是无赖。”在阿梅莉亚的陈述中：“马修是无赖当且仅当詹姆斯是无赖。”根据马修的说法：“如果哈珀是骑士，那么阿梅莉亚就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 哈珀是一个无赖  \n(3) 梅森是一个无赖  \n(4) 詹姆斯是一个无赖  \n(5) 塞缪尔是一名骑士  \n(6) 阿梅莉亚是一个无赖  \n(7) 马修是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：大卫、艾登、阿比盖尔、亚历山大、艾玛、杰克逊和艾娃。大卫告诉你，艾登是骑士当且仅当杰克逊是无赖。艾登说：“艾娃是无赖或者亚历山大是骑士。”阿比盖尔声明：“亚历山大是无赖或者艾娃是骑士。”根据亚历山大的说法，“杰克逊不是骑士。”艾玛告诉你，如果大卫是骑士，那么阿比盖尔就是骑士。杰克逊说大卫是骑士而艾玛是无赖。艾娃说：“如果艾玛是骑士，那么亚历山大就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）大卫是骑士  \n（2）艾登是骑士  \n（3）阿比盖尔是骑士  \n（4）亚历山大是骑士  \n（5）艾玛是骑士  \n（6）杰克逊是无赖  \n（7）艾娃是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：伊丽莎白、詹姆斯、艾登、米娅、奥利维亚、佐伊和奥萝拉。伊丽莎白说：“如果米娅是无赖，那么佐伊就是无赖。”詹姆斯说：“艾登是骑士。”艾登宣称：“佐伊是无赖或者伊丽莎白是无赖。”米娅被听到说：“如果詹姆斯是无赖，那么米娅就是骑士。”奥利维亚评论道：“如果詹姆斯是无赖，那么奥萝拉就是无赖。”佐伊宣称：“米娅是骑士或者奥萝拉是骑士。”奥萝拉说：“米娅不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是一名骑士  \n(2) 詹姆斯是一个无赖  \n(3) 艾登是一个无赖  \n(4) 米娅是一名骑士  \n(5) 奥利维亚是一名骑士  \n(6) 佐伊是一名骑士  \n(7) 奥萝拉是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：格蕾丝、斯嘉丽、阿梅莉亚、莉莉、塞巴斯蒂安、丹尼尔和维多利亚。格蕾丝被听到说：“丹尼尔是骑士当且仅当丹尼尔是无赖。”斯嘉丽评论道：“塞巴斯蒂安是无赖，维多利亚是无赖。”阿梅莉亚的陈述是：“斯嘉丽是无赖当且仅当维多利亚是骑士。”莉莉提到：“丹尼尔不是骑士。”塞巴斯蒂安提到：“如果阿梅莉亚是无赖，那么阿梅莉亚就是骑士。”根据丹尼尔的说法：“如果塞巴斯蒂安是骑士，那么莉莉就是无赖。”维多利亚表示：“丹尼尔是无赖当且仅当格蕾丝是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是无赖  \n(2) 斯嘉丽是无赖  \n(3) 阿梅莉亚是骑士  \n(4) 莉莉是骑士  \n(5) 塞巴斯蒂安是骑士  \n(6) 丹尼尔是无赖  \n(7) 维多利亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：本杰明、克洛伊、艾米莉、赖利、米娅、伊莎贝拉和佩内洛普。本杰明声称：“艾米莉是骑士，伊莎贝拉是无赖。”根据克洛伊的说法，“佩内洛普是骑士”。艾米莉说：“艾米莉是骑士或者本杰明是无赖。”赖利被听到说：“米娅是无赖，艾米莉是无赖。”根据米娅的说法，“伊莎贝拉是骑士当且仅当艾米莉是无赖。”伊莎贝拉评论道：“赖利不是骑士。”佩内洛普提到：“艾米莉是骑士，伊莎贝拉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是无赖  \n(2) 克洛伊是骑士  \n(3) 艾米莉是骑士  \n(4) 赖利是无赖  \n(5) 米娅是无赖  \n(6) 伊莎贝拉是骑士  \n(7) 佩内洛普是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：大卫、本杰明、迈克尔、伊芙琳、夏洛特、阿梅莉亚和詹姆斯。在大卫的话中：“迈克尔是个无赖。”本杰明说：“夏洛特不是无赖。”在迈克尔的话中：“夏洛特是骑士当且仅当大卫是骑士。”在伊芙琳的话中：“詹姆斯是骑士或者本杰明是无赖。”夏洛特宣称：“如果伊芙琳是骑士，那么迈克尔就是无赖。”阿梅莉亚告诉你詹姆斯不是无赖。在詹姆斯的话中：“大卫是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 大卫是无赖  \n(2) 本杰明是无赖  \n(3) 迈克尔是骑士  \n(4) 伊芙琳是骑士  \n(5) 夏洛特是无赖  \n(6) 阿梅莉亚是无赖  \n(7) 詹姆斯是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：本杰明、索菲娅、梅森、艾娃、阿丽亚、阿比盖尔和利亚姆。本杰明表示利亚姆是无赖，而利亚姆是骑士。索菲娅说：“艾娃是骑士，利亚姆是骑士。”梅森说：“艾娃是骑士或者阿比盖尔是无赖。”艾娃声称：“利亚姆是骑士或者阿比盖尔是无赖。”阿丽亚声称：“梅森是骑士，阿比盖尔是无赖。”阿比盖尔说：“艾娃是无赖，本杰明是骑士。”利亚姆说：“艾娃是无赖，索菲娅是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是无赖  \n(2) 索菲娅是无赖  \n(3) 梅森是骑士  \n(4) 艾娃是骑士  \n(5) 阿丽亚是骑士  \n(6) 阿比盖尔是无赖  \n(7) 利亚姆是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：伊莎贝拉、卢卡斯、阿比盖尔、伊森、奥利弗、佐伊和威廉。伊莎贝拉声称：“如果奥利弗是骑士，那么威廉就是骑士。”卢卡斯说伊莎贝拉是骑士。“奥利弗是无赖，阿比盖尔是骑士，”阿比盖尔说。伊森告诉你，佐伊是无赖。奥利弗指出：“伊森是骑士当且仅当阿比盖尔是无赖。”根据佐伊的说法，“如果卢卡斯是骑士，那么伊莎贝拉就是骑士。”威廉声称：“佐伊是无赖，伊森是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是一名骑士  \n(2) 卢卡斯是一名骑士  \n(3) 阿比盖尔是一个无赖  \n(4) 伊森是一个无赖  \n(5) 奥利弗是一个无赖  \n(6) 佐伊是一名骑士  \n(7) 威廉是一个无赖"
    },
    {
        "quiz": "一个非常特别的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：洛根、艾玛、格蕾丝、亚历山大、艾米莉、丹尼尔和奥利弗。“丹尼尔是骑士”——洛根说。艾玛评论道：“洛根不是骑士”。格蕾丝被听到说：“丹尼尔是骑士或者丹尼尔是无赖”。在亚历山大的话中：“如果丹尼尔是无赖，那么艾米莉就是骑士”。艾米莉评论道：“奥利弗是骑士”。丹尼尔说：“格蕾丝不是无赖”。奥利弗说洛根是无赖或者格蕾丝是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是一名骑士  \n(2) 艾玛是一名无赖  \n(3) 格蕾丝是一名骑士  \n(4) 亚历山大是一名骑士  \n(5) 艾米莉是一名骑士  \n(6) 丹尼尔是一名骑士  \n(7) 奥利弗是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：艾拉、维多利亚、奥萝拉、诺亚、莉莉、亨利和亚历山大。艾拉说：“亚历山大是骑士或者奥萝拉是骑士。”维多利亚提到：“莉莉是骑士并且莉莉是无赖。”奥萝拉说：“如果诺亚是骑士，那么维多利亚就是无赖。”诺亚声称：“亚历山大是无赖或者亨利是无赖。”莉莉表示维多利亚是无赖。亨利说：“奥萝拉不是骑士。”亚历山大则说：“如果奥萝拉是无赖，那么亚历山大就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是一名骑士  \n(2) 维多利亚是一名无赖  \n(3) 奥萝拉是一名骑士  \n(4) 诺亚是一名骑士  \n(5) 莉莉是一名骑士  \n(6) 亨利是一名无赖  \n(7) 亚历山大是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：奥利维亚、大卫、艾娃、本杰明、克洛伊、阿梅莉亚和丹尼尔。奥利维亚说：“本杰明是骑士当且仅当大卫是无赖。”大卫声明：“阿梅莉亚是无赖或者本杰明是骑士。”根据艾娃的说法，“克洛伊是骑士或者丹尼尔是骑士。”本杰明说：“大卫是无赖当且仅当本杰明是骑士。”克洛伊告诉你，如果大卫是骑士，那么丹尼尔是骑士。阿梅莉亚评论道：“阿梅莉亚是骑士。”丹尼尔宣称：“艾娃是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是无赖  \n(2) 大卫是无赖  \n(3) 艾娃是骑士  \n(4) 本杰明是无赖  \n(5) 克洛伊是骑士  \n(6) 阿梅莉亚是骑士  \n(7) 丹尼尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：莉莉、詹姆斯、亚历山大、欧文、斯嘉丽、索菲娅和大卫。莉莉表示索菲娅是骑士。“斯嘉丽是无赖，”詹姆斯声称。“当且仅当莉莉是骑士时，詹姆斯才是骑士，”亚历山大提到。“欧文是骑士或者斯嘉丽是骑士，”欧文说。斯嘉丽的陈述是：“如果詹姆斯是无赖，那么大卫就是骑士。”在索菲娅的话中：“大卫是骑士或者斯嘉丽是骑士。”大卫的陈述是：“索菲娅是无赖或者大卫是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是骑士  \n(2) 詹姆斯是无赖  \n(3) 亚历山大是无赖  \n(4) 欧文是骑士  \n(5) 斯嘉丽是骑士  \n(6) 索菲娅是骑士  \n(7) 大卫是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：佐伊、伊芙琳、索菲娅、马修、杰克逊、欧文和本杰明。佐伊指出：“佐伊是骑士或者索菲娅是无赖。”伊芙琳的陈述是：“佐伊是骑士。”索菲娅声称：“杰克逊是无赖或者佐伊是骑士。”马修表示，如果本杰明是无赖，那么佐伊就是无赖。杰克逊的陈述是：“索菲娅是骑士。”欧文指出：“马修不是骑士。”本杰明声称：“佐伊是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佐伊是一名骑士  \n(2) 伊芙琳是一名骑士  \n(3) 索菲娅是一名骑士  \n(4) 马修是一名骑士  \n(5) 杰克逊是一名骑士  \n(6) 欧文是一名无赖  \n(7) 本杰明是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：丹尼尔、亚历山大、艾娃、雅各布、本杰明、马修和阿比盖尔。正如丹尼尔所说：“如果马修是无赖，那么阿比盖尔就是骑士。”亚历山大说：“马修是无赖，丹尼尔是骑士。”艾娃评论道：“雅各布是无赖。”雅各布指出：“丹尼尔是骑士或者亚历山大是骑士。”本杰明表示亚历山大是骑士，而亚历山大是无赖。在马修的话中：“本杰明是骑士，艾娃是无赖。”阿比盖尔告诉你本杰明不是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）丹尼尔是一名骑士  \n（2）亚历山大是一名骑士  \n（3）艾娃是一名无赖  \n（4）雅各布是一名骑士  \n（5）本杰明是一名无赖  \n（6）马修是一名无赖  \n（7）阿比盖尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：本杰明、佩内洛普、维多利亚、艾登、迈克尔、伊莎贝拉和杰克逊。本杰明宣称：“如果维多利亚是骑士，那么迈克尔就是骑士。”佩内洛普告诉你，维多利亚是骑士或者艾登是无赖。维多利亚评论道：“艾登是骑士。”艾登断言：“佩内洛普是骑士或者维多利亚是无赖。”迈克尔表示：“本杰明是无赖或者迈克尔是骑士。”伊莎贝拉说：“艾登不是无赖。”杰克逊断言：“本杰明是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是一名骑士  \n(2) 佩内洛普是一名骑士  \n(3) 维多利亚是一名骑士  \n(4) 艾登是一名骑士  \n(5) 迈克尔是一名骑士  \n(6) 伊莎贝拉是一名骑士  \n(7) 杰克逊是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：伊莎贝拉、索菲娅、马修、伊丽莎白、卢卡斯、本杰明和欧文。伊莎贝拉评论道：“欧文是一个无赖，索菲娅也是一个无赖。”索菲娅说，只有卢卡斯是骑士时，伊莎贝拉才是骑士。马修的话是：“马修是骑士当且仅当卢卡斯是无赖。”伊丽莎白说：“马修是无赖，索菲娅是无赖。”根据卢卡斯的说法：“马修是骑士当且仅当伊莎贝拉是骑士。”本杰明指出：“索菲娅不是无赖。”根据欧文的说法：“如果伊莎贝拉是骑士，那么索菲娅就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是无赖  \n(2) 索菲娅是骑士  \n(3) 马修是骑士  \n(4) 伊丽莎白是无赖  \n(5) 卢卡斯是无赖  \n(6) 本杰明是骑士  \n(7) 欧文是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：本杰明、艾拉、艾娃、阿比盖尔、马修、夏洛特和杰克。“杰克是无赖当且仅当马修是骑士”——本杰明说。根据艾拉的说法，“杰克是无赖或者艾娃是无赖”。有人听到艾娃说：“马修不是骑士”。正如阿比盖尔所说，“马修是无赖当且仅当艾娃是骑士”。“杰克是骑士而本杰明是无赖”——马修说。“艾拉是骑士或者马修是骑士”——夏洛特说。“艾拉不是无赖，”杰克声称。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是无赖  \n(2) 艾拉是骑士  \n(3) 艾娃是无赖  \n(4) 阿比盖尔是骑士  \n(5) 马修是骑士  \n(6) 夏洛特是骑士  \n(7) 杰克是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：雅各布、阿梅莉亚、大卫、伊芙琳、米娅、塞巴斯蒂安和格蕾丝。雅各布说伊芙琳不是骑士。阿梅莉亚说：“如果格蕾丝是无赖，那么伊芙琳就是骑士。”大卫评论道：“雅各布是骑士当且仅当大卫是骑士。”伊芙琳说雅各布是无赖或者大卫是无赖。米娅指出：“伊芙琳是无赖当且仅当格蕾丝是骑士。”塞巴斯蒂安指出：“米娅是骑士。”格蕾丝评论道：“雅各布是无赖而格蕾丝是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）雅各布是一名骑士  \n（2）阿梅莉亚是一个无赖  \n（3）大卫是一名骑士  \n（4）伊芙琳是一个无赖  \n（5）米娅是一个无赖  \n（6）塞巴斯蒂安是一个无赖  \n（7）格蕾丝是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：索菲娅、阿比盖尔、艾娃、伊森、塞缪尔、迈克尔和赖利。索菲娅说，如果且仅如果艾娃是骑士，那么艾娃就是无赖。阿比盖尔指出：“如果索菲娅是骑士，那么赖利就是无赖。”艾娃声称：“阿比盖尔不是无赖。”伊森表示，如果塞缪尔是骑士，那么迈克尔就是无赖。“赖利是骑士，艾娃是无赖，”塞缪尔声称。“赖利是骑士，艾娃是骑士，”迈克尔说。赖利告诉你，伊森是无赖或者索菲娅是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 阿比盖尔是骑士  \n(3) 艾娃是骑士  \n(4) 伊森是骑士  \n(5) 塞缪尔是无赖  \n(6) 迈克尔是无赖  \n(7) 赖利是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：詹姆斯、杰克逊、艾米莉、利亚姆、雅各布、奥利弗和杰克。詹姆斯评论道：“杰克是无赖当且仅当詹姆斯是骑士。”杰克逊提到：“雅各布不是骑士。”艾米莉的陈述是：“利亚姆是无赖。”利亚姆的陈述是：“詹姆斯是骑士或者杰克逊是骑士。”雅各布声明：“詹姆斯不是无赖。”根据奥利弗的说法，“利亚姆不是无赖。”杰克评论道：“雅各布不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是一名骑士  \n(2) 杰克逊是一个无赖  \n(3) 艾米莉是一个无赖  \n(4) 利亚姆是一名骑士  \n(5) 雅各布是一名骑士  \n(6) 奥利弗是一名骑士  \n(7) 杰克是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：威廉、艾拉、亨利、梅森、詹姆斯、艾玛和哈珀。威廉声称：“如果威廉是骑士，那么梅森就是无赖。”艾拉表示：“梅森是无赖。”亨利评论道：“亨利是骑士当且仅当詹姆斯是骑士。”根据梅森的说法，“亨利是无赖。”詹姆斯声称：“亨利是无赖或者亨利是骑士。”艾玛说：“亨利不是无赖。”哈珀表示威廉是骑士或者艾拉是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 艾拉是一名骑士  \n(3) 亨利是一名骑士  \n(4) 梅森是一名无赖  \n(5) 詹姆斯是一名骑士  \n(6) 艾玛是一名骑士  \n(7) 哈珀是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：欧文、阿丽亚、维多利亚、佩内洛普、克洛伊、雅各布和奥利维亚。欧文说：“奥利维亚是骑士当且仅当阿丽亚是骑士。”阿丽亚声称：“佩内洛普是骑士或者奥利维亚是无赖。”维多利亚说：“佩内洛普是骑士当且仅当雅各布是无赖。”佩内洛普声称：“雅各布是无赖并且雅各布是骑士。”克洛伊表示：“奥利维亚不是无赖。”雅各布说：“维多利亚是无赖并且佩内洛普是骑士。”奥利维亚提到：“如果维多利亚是骑士，那么维多利亚就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是无赖  \n(2) 阿丽亚是无赖  \n(3) 维多利亚是无赖  \n(4) 佩内洛普是无赖  \n(5) 克洛伊是骑士  \n(6) 雅各布是无赖  \n(7) 奥利维亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：洛根、艾玛、奥萝拉、利亚姆、杰克逊、阿丽亚和艾登。洛根声称：“如果艾玛是骑士，那么奥萝拉就是无赖。”艾玛评论道：“利亚姆不是无赖。”奥萝拉说：“杰克逊不是骑士。”利亚姆表示：“阿丽亚是骑士。”杰克逊提到：“洛根是骑士。”根据阿丽亚的话：“艾登是无赖，杰克逊是骑士。”在艾登看来：“如果杰克逊是骑士，那么洛根就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是一名骑士  \n(2) 艾玛是一名骑士  \n(3) 奥萝拉是一个无赖  \n(4) 利亚姆是一名骑士  \n(5) 杰克逊是一名骑士  \n(6) 阿丽亚是一名骑士  \n(7) 艾登是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：奥利维亚、艾登、奥萝拉、迈克尔、莉莉、阿梅莉亚和诺亚。奥利维亚说：“阿梅莉亚是骑士，莉莉是无赖。”艾登指出：“莉莉是无赖。”奥萝拉说：“阿梅莉亚不是骑士。”迈克尔评论道：“诺亚是骑士，奥萝拉是骑士。”莉莉表示：“艾登是骑士当且仅当阿梅莉亚是无赖。”阿梅莉亚表示，如果迈克尔是无赖，那么莉莉就是无赖。诺亚说：“莉莉是骑士，阿梅莉亚是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是骑士  \n(2) 艾登是骑士  \n(3) 奥萝拉是无赖  \n(4) 迈克尔是无赖  \n(5) 莉莉是无赖  \n(6) 阿梅莉亚是骑士  \n(7) 诺亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：梅森、迈克尔、本杰明、杰克逊、伊莎贝拉、大卫和奥利维亚。梅森提到：“本杰明不是无赖。”在迈克尔的陈述中：“迈克尔是骑士，大卫是骑士。”根据本杰明的说法：“伊莎贝拉是骑士。”在杰克逊的陈述中：“迈克尔是骑士或者奥利维亚是无赖。”在伊莎贝拉的话中：“梅森是无赖，大卫是骑士。”大卫说道：“梅森是骑士当且仅当伊莎贝拉是无赖。”奥利维亚说道：“本杰明是无赖，迈克尔是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是无赖  \n(2) 迈克尔是无赖  \n(3) 本杰明是无赖  \n(4) 杰克逊是无赖  \n(5) 伊莎贝拉是无赖  \n(6) 大卫是无赖  \n(7) 奥利维亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：卢克、迈克尔、格蕾丝、艾拉、艾弗里、索菲娅和艾娃。卢克被听到说：“如果索菲娅是无赖，那么艾拉就是骑士。”迈克尔的陈述是：“卢克是骑士或者索菲娅是骑士。”格蕾丝被听到说：“迈克尔是骑士，艾拉是骑士。”艾拉被听到说：“艾弗里不是骑士。”艾弗里的陈述是：“艾娃是骑士。”索菲娅说艾弗里是无赖。在艾娃的话中：“艾弗里是骑士当且仅当索菲娅是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 迈克尔是一名骑士  \n(3) 格蕾丝是一名骑士  \n(4) 艾拉是一名骑士  \n(5) 艾弗里是一名无赖  \n(6) 索菲娅是一名骑士  \n(7) 艾娃是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：亚历山大、威廉、利亚姆、亨利、奥利维亚、赖利和索菲娅。“亨利是无赖或者利亚姆是骑士，”亚历山大说。威廉声明：“赖利是骑士。”利亚姆说奥利维亚是无赖，索菲娅是骑士。“如果奥利维亚是无赖，那么奥利维亚就是骑士，”亨利宣称。“索菲娅是骑士，”奥利维亚宣称。“如果威廉是骑士，那么奥利维亚就是骑士，”赖利声称。在索菲娅的话中：“如果亚历山大是骑士，那么奥利维亚就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）亚历山大是无赖  \n（2）威廉是骑士  \n（3）利亚姆是无赖  \n（4）亨利是骑士  \n（5）奥利维亚是骑士  \n（6）赖利是骑士  \n（7）索菲娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：艾娃、阿丽亚、索菲娅、艾玛、奥萝拉、梅森和本杰明。“艾玛不是无赖，”艾娃提到。根据阿丽亚的说法，“奥萝拉是骑士当且仅当本杰明是无赖。” “阿丽亚是骑士，”索菲娅声称。艾玛表示，“梅森不是骑士。”正如奥萝拉所说，“本杰明是骑士并且本杰明是无赖。”梅森被听到说，“本杰明是骑士或者艾玛是无赖。”正如本杰明所说，“艾娃不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是无赖  \n(2) 阿丽亚是无赖  \n(3) 索菲娅是无赖  \n(4) 艾玛是无赖  \n(5) 奥萝拉是无赖  \n(6) 梅森是骑士  \n(7) 本杰明是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：米娅、约瑟夫、塞缪尔、格蕾丝、伊莎贝拉、诺亚和伊芙琳。米娅提到：“塞缪尔是骑士或者伊莎贝拉是无赖。”约瑟夫说：“伊莎贝拉是无赖或者塞缪尔是骑士。”塞缪尔宣称：“约瑟夫是骑士或者塞缪尔是骑士。”格蕾丝断言：“伊芙琳是骑士。”伊莎贝拉声称：“格蕾丝是无赖并且格蕾丝是骑士。”诺亚声称：“如果米娅是无赖，那么格蕾丝是骑士。”在伊芙琳的话中：“诺亚不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是一名骑士  \n(2) 约瑟夫是一名骑士  \n(3) 塞缪尔是一名骑士  \n(4) 格蕾丝是一名骑士  \n(5) 伊莎贝拉是一名无赖  \n(6) 诺亚是一名骑士  \n(7) 伊芙琳是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：莉莉、伊丽莎白、克洛伊、迈克尔、洛根、威廉和约瑟夫。莉莉说：“克洛伊是无赖或者洛根是无赖。”伊丽莎白说：“约瑟夫不是骑士。”克洛伊评论道：“伊丽莎白是骑士。”迈克尔指出：“莉莉是无赖当且仅当伊丽莎白是无赖。”洛根宣称：“威廉是无赖。”威廉宣称：“如果伊丽莎白是无赖，那么迈克尔就是无赖。”约瑟夫被听到说：“如果莉莉是无赖，那么迈克尔就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是骑士  \n(2) 伊丽莎白是无赖  \n(3) 克洛伊是无赖  \n(4) 迈克尔是无赖  \n(5) 洛根是无赖  \n(6) 威廉是骑士  \n(7) 约瑟夫是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：维多利亚、伊莎贝拉、诺亚、伊森、杰克逊、阿梅莉亚和佐伊。维多利亚提到：“伊森是无赖或者佐伊是骑士。”伊莎贝拉说：“诺亚是骑士，维多利亚是骑士。”诺亚的陈述是：“如果佐伊是骑士，那么伊森就是无赖。”伊森说：“阿梅莉亚是无赖或者佐伊是骑士。”杰克逊指出：“伊森是骑士。”阿梅莉亚说：“诺亚是骑士。”佐伊告诉你，阿梅莉亚是骑士或者阿梅莉亚是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 维多利亚是一名骑士  \n(2) 伊莎贝拉是一个无赖  \n(3) 诺亚是一个无赖  \n(4) 伊森是一名骑士  \n(5) 杰克逊是一名骑士  \n(6) 阿梅莉亚是一个无赖  \n(7) 佐伊是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：詹姆斯、艾弗里、诺亚、雅各布、克洛伊、阿梅莉亚和杰克逊。詹姆斯说：“杰克逊是个无赖，克洛伊也是个无赖。”根据艾弗里的说法，“詹姆斯是个无赖或者阿梅莉亚是个无赖。”诺亚表示杰克逊是个骑士或者詹姆斯是个骑士。雅各布表示阿梅莉亚是个无赖当且仅当艾弗里是个骑士。克洛伊评论道：“克洛伊是个骑士当且仅当雅各布是个骑士。”阿梅莉亚表示如果克洛伊是个无赖，那么雅各布就是个无赖。杰克逊指出：“雅各布是个无赖当且仅当诺亚是个无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是无赖  \n(2) 艾弗里是骑士  \n(3) 诺亚是骑士  \n(4) 雅各布是骑士  \n(5) 克洛伊是无赖  \n(6) 阿梅莉亚是无赖  \n(7) 杰克逊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：艾拉、艾玛、塞缪尔、伊莎贝拉、丹尼尔、阿梅莉亚和艾弗里。艾拉说：“丹尼尔是骑士或者艾弗里是无赖。”根据艾玛的说法，“如果丹尼尔是无赖，那么艾弗里就是无赖。”塞缪尔声明：“如果阿梅莉亚是骑士，那么塞缪尔就是骑士。”伊莎贝拉说：“丹尼尔是无赖或者阿梅莉亚是无赖。”丹尼尔表示艾弗里是无赖，而丹尼尔是骑士。阿梅莉亚说丹尼尔是骑士。艾弗里被听到说：“丹尼尔是无赖或者伊莎贝拉是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是无赖  \n(2) 艾玛是无赖  \n(3) 塞缪尔是骑士  \n(4) 伊莎贝拉是骑士  \n(5) 丹尼尔是无赖  \n(6) 阿梅莉亚是无赖  \n(7) 艾弗里是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：伊莎贝拉、欧文、迈克尔、索菲娅、塞缪尔、阿比盖尔和本杰明。根据伊莎贝拉的说法，“索菲娅是无赖当且仅当本杰明是无赖”。欧文声称：“阿比盖尔不是骑士”。迈克尔表示：“本杰明是无赖，阿比盖尔是骑士”。索菲娅说：“本杰明是骑士”。塞缪尔说，伊莎贝拉是骑士当且仅当本杰明是无赖。阿比盖尔说：“欧文是骑士或者迈克尔是无赖。” “阿比盖尔是骑士或者伊莎贝拉是骑士” - 本杰明。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是一名骑士  \n(2) 欧文是一个无赖  \n(3) 迈克尔是一个无赖  \n(4) 索菲娅是一名骑士  \n(5) 塞缪尔是一个无赖  \n(6) 阿比盖尔是一名骑士  \n(7) 本杰明是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：艾登、伊莎贝拉、塞巴斯蒂安、奥利维亚、洛根、威廉和佐伊。艾登说：“塞巴斯蒂安是骑士，伊莎贝拉是无赖。”伊莎贝拉告诉你威廉不是无赖。塞巴斯蒂安断言：“奥利维亚不是无赖。”奥利维亚说：“艾登是无赖或者塞巴斯蒂安是骑士。”根据洛根的说法，“艾登是无赖或者威廉是无赖。”威廉说：“如果艾登是无赖，那么伊莎贝拉是骑士。”佐伊的陈述是：“如果艾登是骑士，那么洛根是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是无赖  \n(2) 伊莎贝拉是骑士  \n(3) 塞巴斯蒂安是骑士  \n(4) 奥利维亚是骑士  \n(5) 洛根是骑士  \n(6) 威廉是骑士  \n(7) 佐伊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：索菲娅、伊莎贝拉、维多利亚、大卫、阿比盖尔、佩内洛普和伊芙琳。索菲娅的陈述是：“佩内洛普是无赖，伊莎贝拉是无赖。”伊莎贝拉告诉你阿比盖尔是无赖。“佩内洛普不是骑士，”维多利亚宣称。大卫断言：“维多利亚是骑士。”阿比盖尔的陈述是：“佩内洛普不是骑士。”佩内洛普的陈述是：“大卫是无赖或者大卫是骑士。”伊芙琳声称：“大卫不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 伊莎贝拉是骑士  \n(3) 维多利亚是无赖  \n(4) 大卫是无赖  \n(5) 阿比盖尔是无赖  \n(6) 佩内洛普是骑士  \n(7) 伊芙琳是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：约瑟夫、利亚姆、格蕾丝、索菲娅、塞巴斯蒂安、奥萝拉和杰克。正如约瑟夫所说：“格蕾丝是骑士，杰克是骑士。”利亚姆告诉你杰克不是骑士。“如果杰克是骑士，那么奥萝拉就是无赖，”格蕾丝声称。索菲娅断言：“如果格蕾丝是无赖，那么利亚姆就是无赖。”塞巴斯蒂安说格蕾丝是骑士。奥萝拉表示：“如果索菲娅是无赖，那么杰克就是无赖。”杰克声称：“索菲娅是骑士，奥萝拉是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是无赖  \n(2) 利亚姆是骑士  \n(3) 格蕾丝是骑士  \n(4) 索菲娅是骑士  \n(5) 塞巴斯蒂安是骑士  \n(6) 奥萝拉是骑士  \n(7) 杰克是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：奥利弗、奥利维亚、赖利、詹姆斯、夏洛特、梅森和艾拉。奥利弗提到：“奥利维亚是无赖，赖利是无赖。”根据奥利维亚的话，“如果奥利维亚是骑士，那么夏洛特就是骑士。”赖利声称：“梅森不是无赖。”詹姆斯评论道：“如果梅森是骑士，那么奥利维亚就是无赖。”夏洛特声称：“奥利维亚是骑士。”根据梅森的说法，“夏洛特是无赖，奥利维亚是无赖。”艾拉说：“如果梅森是无赖，那么赖利就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利弗是无赖  \n(2) 奥利维亚是骑士  \n(3) 赖利是无赖  \n(4) 詹姆斯是骑士  \n(5) 夏洛特是骑士  \n(6) 梅森是无赖  \n(7) 艾拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：哈珀、约瑟夫、伊芙琳、本杰明、马修、奥利维亚和艾弗里。哈珀说：“如果本杰明是无赖，那么本杰明就是骑士。” 约瑟夫告诉你，伊芙琳是无赖当且仅当哈珀是骑士。伊芙琳告诉你，伊芙琳是骑士当且仅当马修是无赖。本杰明声明：“伊芙琳是骑士或者约瑟夫是无赖。” “艾弗里不是无赖” - 马修。奥利维亚告诉你，哈珀是骑士。艾弗里评论道：“奥利维亚是无赖而艾弗里是骑士。” 那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是一名骑士  \n(2) 约瑟夫是一个无赖  \n(3) 伊芙琳是一名骑士  \n(4) 本杰明是一名骑士  \n(5) 马修是一个无赖  \n(6) 奥利维亚是一名骑士  \n(7) 艾弗里是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：阿梅莉亚、伊莎贝拉、威廉、梅森、马修、伊森和卢克。在阿梅莉亚的话中：“梅森是骑士，伊森是无赖。” “梅森是无赖”——伊莎贝拉。“伊莎贝拉是无赖”——威廉。梅森说，如果卢克是骑士，那么威廉就是骑士。马修表示梅森是无赖。伊森评论道：“梅森是骑士当且仅当卢克是骑士。”卢克评论道：“如果梅森是骑士，那么阿梅莉亚就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是无赖  \n(2) 伊莎贝拉是骑士  \n(3) 威廉是无赖  \n(4) 梅森是无赖  \n(5) 马修是骑士  \n(6) 伊森是无赖  \n(7) 卢克是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：利亚姆、阿丽亚、梅森、伊莎贝拉、夏洛特、亨利和大卫。利亚姆说：“大卫不是无赖。”阿丽亚提到：“亨利是无赖，而大卫是骑士。”梅森评论道：“阿丽亚是骑士或者大卫是骑士。”伊莎贝拉说：“亨利是无赖当且仅当利亚姆是骑士。”夏洛特告诉你阿丽亚是无赖。亨利说：“如果利亚姆是无赖，那么亨利就是骑士。”大卫表示：“夏洛特是骑士或者利亚姆是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）利亚姆是一名骑士  \n（2）阿丽亚是一个无赖  \n（3）梅森是一名骑士  \n（4）伊莎贝拉是一个无赖  \n（5）夏洛特是一名骑士  \n（6）亨利是一名骑士  \n（7）大卫是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：诺亚、奥利弗、伊芙琳、阿比盖尔、格蕾丝、艾玛和大卫。诺亚说：“奥利弗不是骑士。”奥利弗提到：“艾玛是无赖或者奥利弗是骑士。”伊芙琳表示阿比盖尔不是无赖。阿比盖尔被听到说：“如果格蕾丝是骑士，那么伊芙琳就是骑士。”格蕾丝声明：“大卫是骑士，而大卫是无赖。”艾玛断言：“如果奥利弗是无赖，那么格蕾丝就是骑士。”大卫说：“阿比盖尔不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是无赖  \n(2) 奥利弗是骑士  \n(3) 伊芙琳是骑士  \n(4) 阿比盖尔是骑士  \n(5) 格蕾丝是无赖  \n(6) 艾玛是骑士  \n(7) 大卫是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：詹姆斯、赖利、伊莎贝拉、约瑟夫、佩内洛普、维多利亚和阿梅莉亚。詹姆斯说赖利是无赖或者伊莎贝拉是骑士。赖利告诉你约瑟夫是无赖。伊莎贝拉评论道：“佩内洛普是无赖而佩内洛普是骑士”。约瑟夫表示阿梅莉亚是骑士。佩内洛普告诉你维多利亚是无赖。维多利亚说佩内洛普是骑士或者詹姆斯是骑士。在阿梅莉亚的话中：“如果维多利亚是无赖，那么伊莎贝拉就是骑士”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是一名骑士  \n(2) 赖利是一个无赖  \n(3) 伊莎贝拉是一个无赖  \n(4) 约瑟夫是一名骑士  \n(5) 佩内洛普是一个无赖  \n(6) 维多利亚是一名骑士  \n(7) 阿梅莉亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：洛根、克洛伊、杰克逊、塞缪尔、佩内洛普、马修和艾米莉。洛根的陈述是：“塞缪尔不是骑士”。根据克洛伊的说法，“洛根是个无赖”。杰克逊表示，佩内洛普是个无赖或者克洛伊是个无赖。塞缪尔说佩内洛普是个骑士。佩内洛普的陈述是：“克洛伊是无赖当且仅当马修是无赖”。马修指出，“克洛伊不是无赖”。艾米莉声明，“克洛伊不是骑士”。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是无赖  \n(2) 克洛伊是骑士  \n(3) 杰克逊是无赖  \n(4) 塞缪尔是骑士  \n(5) 佩内洛普是骑士  \n(6) 马修是骑士  \n(7) 艾米莉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：卢克、大卫、亨利、伊森、杰克、本杰明和雅各布。“亨利是骑士，雅各布是骑士，”卢克宣称。有人听到大卫说：“本杰明是骑士当且仅当雅各布是无赖。” “大卫是无赖或者杰克是无赖” - 亨利。伊森表示，雅各布是骑士当且仅当杰克是骑士。“如果卢克是骑士，那么大卫是骑士，”杰克提到。本杰明断言：“卢克不是无赖。” “本杰明不是骑士” - 雅各布。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是无赖  \n(2) 大卫是骑士  \n(3) 亨利是无赖  \n(4) 伊森是骑士  \n(5) 杰克是骑士  \n(6) 本杰明是无赖  \n(7) 雅各布是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：米娅、利亚姆、奥利维亚、阿比盖尔、阿梅莉亚、洛根和丹尼尔。“利亚姆是无赖，丹尼尔是骑士，”米娅声称。“洛根是无赖，米娅是无赖，”利亚姆说。奥利维亚说：“利亚姆不是无赖。”阿比盖尔断言：“如果奥利维亚是骑士，那么阿比盖尔就是骑士。”阿梅莉亚提到：“利亚姆不是无赖。”根据洛根的说法，“如果利亚姆是无赖，那么阿比盖尔就是无赖。”丹尼尔评论道：“阿比盖尔是无赖当且仅当洛根是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是骑士  \n(2) 利亚姆是无赖  \n(3) 奥利维亚是无赖  \n(4) 阿比盖尔是骑士  \n(5) 阿梅莉亚是无赖  \n(6) 洛根是无赖  \n(7) 丹尼尔是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：莉莉、詹姆斯、艾拉、伊莎贝拉、夏洛特、格蕾丝和诺亚。“如果伊莎贝拉是无赖，那么夏洛特就是无赖，”莉莉声称。詹姆斯表示诺亚是骑士。“詹姆斯不是骑士，”艾拉宣称。“如果伊莎贝拉是骑士，那么夏洛特就是骑士，”伊莎贝拉说。夏洛特告诉你她是骑士。正如格蕾丝所说，“如果诺亚是骑士，那么夏洛特就是骑士。” “詹姆斯是无赖，伊莎贝拉是无赖，”诺亚说。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是骑士  \n(2) 詹姆斯是无赖  \n(3) 艾拉是骑士  \n(4) 伊莎贝拉是骑士  \n(5) 夏洛特是骑士  \n(6) 格蕾丝是骑士  \n(7) 诺亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：詹姆斯、威廉、雅各布、利亚姆、阿梅莉亚、卢卡斯和丹尼尔。詹姆斯表示阿梅莉亚是一个无赖。“阿梅莉亚是骑士”——威廉。雅各布的陈述是：“如果丹尼尔是无赖，那么阿梅莉亚就是无赖。”利亚姆表示阿梅莉亚是骑士。阿梅莉亚说：“詹姆斯是骑士，丹尼尔是无赖。”卢卡斯断言：“詹姆斯是骑士当且仅当威廉是骑士。”丹尼尔说：“阿梅莉亚是骑士当且仅当雅各布是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）詹姆斯是一名骑士  \n（2）威廉是一个无赖  \n（3）雅各布是一名骑士  \n（4）利亚姆是一个无赖  \n（5）阿梅莉亚是一个无赖  \n（6）卢卡斯是一个无赖  \n（7）丹尼尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：莉莉、阿丽亚、诺亚、索菲娅、艾拉、大卫和夏洛特。莉莉说，如果大卫是无赖，那么大卫就是骑士。阿丽亚告诉你，大卫是骑士当且仅当莉莉是骑士。诺亚说，莉莉是骑士当且仅当夏洛特是骑士。索菲娅的话是：“大卫是无赖当且仅当大卫是骑士”。艾拉的话是：“阿丽亚是无赖并且阿丽亚是骑士”。大卫声明：“诺亚不是无赖”。夏洛特说，如果大卫是骑士，那么阿丽亚就是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是无赖  \n(2) 阿丽亚是骑士  \n(3) 诺亚是无赖  \n(4) 索菲娅是无赖  \n(5) 艾拉是无赖  \n(6) 大卫是无赖  \n(7) 夏洛特是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：夏洛特、约瑟夫、诺亚、格蕾丝、丹尼尔、艾玛和杰克。夏洛特提到：“艾玛不是骑士。” 约瑟夫宣称：“约瑟夫是骑士。” 诺亚说杰克不是骑士。格蕾丝说：“约瑟夫是骑士或者夏洛特是无赖。” 丹尼尔说：“如果艾玛是无赖，那么夏洛特就是无赖。” 艾玛宣称：“如果诺亚是骑士，那么丹尼尔就是无赖。” 杰克说：“诺亚是骑士当且仅当约瑟夫是骑士。” 那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是无赖  \n(2) 约瑟夫是无赖  \n(3) 诺亚是无赖  \n(4) 格蕾丝是骑士  \n(5) 丹尼尔是骑士  \n(6) 艾玛是骑士  \n(7) 杰克是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：艾登、格蕾丝、奥萝拉、夏洛特、迈克尔、洛根和克洛伊。艾登声称：“如果艾登是骑士，那么格蕾丝就是无赖。”格蕾丝提到：“夏洛特是骑士。”奥萝拉说：“迈克尔是骑士，格蕾丝是骑士。”夏洛特声明：“艾登是骑士当且仅当迈克尔是骑士。”迈克尔指出：“迈克尔是骑士当且仅当格蕾丝是无赖。”在洛根看来：“奥萝拉是无赖当且仅当格蕾丝是无赖。”克洛伊评论道：“如果艾登是无赖，那么艾登就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是一名骑士  \n(2) 格蕾丝是一个无赖  \n(3) 奥萝拉是一个无赖  \n(4) 夏洛特是一个无赖  \n(5) 迈克尔是一个无赖  \n(6) 洛根是一名骑士  \n(7) 克洛伊是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：约瑟夫、詹姆斯、伊莎贝拉、伊森、索菲娅、杰克和奥萝拉。约瑟夫说：“伊莎贝拉是个无赖。”詹姆斯宣称：“伊森是无赖当且仅当伊莎贝拉是无赖。”根据伊莎贝拉的话，“索菲娅是骑士，詹姆斯是无赖。”伊森说：“詹姆斯是骑士。”索菲娅表示杰克是骑士或者杰克是无赖。杰克说：“伊森是骑士，詹姆斯是无赖。”奥萝拉说：“伊莎贝拉是骑士或者索菲娅是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是无赖  \n(2) 詹姆斯是无赖  \n(3) 伊莎贝拉是骑士  \n(4) 伊森是无赖  \n(5) 索菲娅是骑士  \n(6) 杰克是无赖  \n(7) 奥萝拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：詹姆斯、伊森、夏洛特、亨利、约瑟夫、雅各布和阿丽亚。詹姆斯被听到说：“雅各布是无赖，夏洛特是无赖。”伊森说：“如果雅各布是骑士，那么亨利就是无赖。”夏洛特声明：“雅各布是无赖当且仅当阿丽亚是无赖。”亨利声明：“詹姆斯是无赖当且仅当亨利是骑士。”约瑟夫说：“如果阿丽亚是骑士，那么伊森就是无赖。”雅各布评论道：“雅各布是骑士，伊森是骑士。”阿丽亚说伊森是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是无赖  \n(2) 伊森是骑士  \n(3) 夏洛特是骑士  \n(4) 亨利是无赖  \n(5) 约瑟夫是无赖  \n(6) 雅各布是骑士  \n(7) 阿丽亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：维多利亚、詹姆斯、阿丽亚、卢克、赖利、约瑟夫和伊莎贝拉。维多利亚说阿丽亚不是骑士。詹姆斯的声明是：“卢克不是无赖。”阿丽亚宣称：“约瑟夫是骑士当且仅当约瑟夫是无赖。”卢克宣称：“如果阿丽亚是骑士，那么赖利就是骑士。”赖利宣称：“如果维多利亚是无赖，那么卢克就是无赖。”约瑟夫表示阿丽亚不是无赖。根据伊莎贝拉的说法：“卢克是无赖当且仅当维多利亚是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 维多利亚是一名骑士  \n(2) 詹姆斯是一名骑士  \n(3) 阿丽亚是一名无赖  \n(4) 卢克是一名骑士  \n(5) 赖利是一名骑士  \n(6) 约瑟夫是一名无赖  \n(7) 伊莎贝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：卢克、本杰明、亨利、杰克逊、伊丽莎白、梅森和阿梅莉亚。卢克说本杰明是骑士。本杰明说：“阿梅莉亚是无赖，梅森是无赖。”亨利断言：“本杰明不是无赖。”杰克逊提到：“梅森是无赖，卢克是无赖。”伊丽莎白断言：“本杰明是骑士。”梅森指出：“杰克逊是无赖当且仅当杰克逊是骑士。”阿梅莉亚告诉你梅森是无赖，而梅森是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 本杰明是一名骑士  \n(3) 亨利是一名骑士  \n(4) 杰克逊是一个无赖  \n(5) 伊丽莎白是一名骑士  \n(6) 梅森是一个无赖  \n(7) 阿梅莉亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：米娅、雅各布、奥利弗、阿梅莉亚、亨利、欧文和卢卡斯。米娅说：“米娅是骑士，卢卡斯是无赖。”雅各布说：“奥利弗不是无赖。”奥利弗说：“如果卢卡斯是无赖，那么阿梅莉亚就是骑士。”阿梅莉亚声称：“卢卡斯是无赖或者亨利是无赖。”亨利的声明是：“欧文是无赖。”欧文的声明是：“如果奥利弗是无赖，那么欧文就是骑士。”卢卡斯说：“如果奥利弗是无赖，那么亨利就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是无赖  \n(2) 雅各布是骑士  \n(3) 奥利弗是骑士  \n(4) 阿梅莉亚是骑士  \n(5) 亨利是无赖  \n(6) 欧文是骑士  \n(7) 卢卡斯是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：卢克、艾米莉、梅森、本杰明、诺亚、莉莉和格蕾丝。卢克说：“莉莉不是骑士。”艾米莉声称：“诺亚是骑士。”梅森说：“本杰明是无赖当且仅当卢克是无赖。”本杰明说：“诺亚是无赖。”诺亚说：“艾米莉是骑士，莉莉是无赖。”莉莉表示：“如果本杰明是骑士，那么艾米莉是骑士。”格蕾丝评论道：“如果本杰明是无赖，那么本杰明是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 艾米莉是一名无赖  \n(3) 梅森是一名骑士  \n(4) 本杰明是一名骑士  \n(5) 诺亚是一名无赖  \n(6) 莉莉是一名无赖  \n(7) 格蕾丝是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：约瑟夫、索菲娅、詹姆斯、塞巴斯蒂安、艾玛、阿梅莉亚和杰克。正如约瑟夫所说：“杰克是骑士，同时杰克也是无赖。”索菲娅说：“艾玛是骑士。”詹姆斯说：“如果约瑟夫是骑士，那么阿梅莉亚就是骑士。”塞巴斯蒂安说：“约瑟夫是骑士。”艾玛断言：“詹姆斯不是无赖。”阿梅莉亚说：“杰克是骑士当且仅当索菲娅是无赖。”杰克告诉你，艾玛不是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是无赖  \n(2) 索菲娅是骑士  \n(3) 詹姆斯是骑士  \n(4) 塞巴斯蒂安是无赖  \n(5) 艾玛是骑士  \n(6) 阿梅莉亚是无赖  \n(7) 杰克是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：塞巴斯蒂安、丹尼尔、杰克逊、卢卡斯、阿比盖尔、亚历山大和斯嘉丽。在塞巴斯蒂安的话中：“杰克逊是骑士或者亚历山大是骑士”。根据丹尼尔的说法，“斯嘉丽是无赖当且仅当杰克逊是骑士”。在杰克逊的陈述中：“丹尼尔是骑士当且仅当丹尼尔是无赖”。卢卡斯表示，如果亚历山大是无赖，那么塞巴斯蒂安就是骑士。“斯嘉丽是骑士”——阿比盖尔说。在亚历山大的陈述中：“阿比盖尔是无赖”。斯嘉丽说：“杰克逊是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞巴斯蒂安是无赖  \n(2) 丹尼尔是骑士  \n(3) 杰克逊是无赖  \n(4) 卢卡斯是无赖  \n(5) 阿比盖尔是骑士  \n(6) 亚历山大是无赖  \n(7) 斯嘉丽是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：伊森、奥萝拉、索菲娅、诺亚、艾娃、威廉和艾登。伊森被听到说：“诺亚是骑士。”奥萝拉声称：“索菲娅是无赖。”索菲娅宣称：“伊森是骑士。”诺亚说：“艾登是无赖，而诺亚是骑士。”艾娃的陈述是：“威廉是骑士。”威廉告诉你，诺亚是骑士或者伊森是骑士。“奥萝拉是无赖或者索菲娅是无赖，”艾登声称。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是无赖  \n(2) 奥萝拉是骑士  \n(3) 索菲娅是无赖  \n(4) 诺亚是无赖  \n(5) 艾娃是无赖  \n(6) 威廉是无赖  \n(7) 艾登是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：奥利维亚、马修、奥利弗、塞巴斯蒂安、佩内洛普、艾娃和夏洛特。奥利维亚被听到说：“佩内洛普不是骑士。”马修告诉你，马修是骑士或者奥利弗是无赖。“马修是骑士或者夏洛特是无赖，”奥利弗声称。塞巴斯蒂安表示佩内洛普是骑士而奥利弗是无赖。佩内洛普说奥利弗是无赖。艾娃在一份声明中说：“如果夏洛特是骑士，那么奥利弗是无赖。”夏洛特声明：“如果佩内洛普是骑士，那么夏洛特是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是骑士  \n(2) 马修是骑士  \n(3) 奥利弗是骑士  \n(4) 塞巴斯蒂安是无赖  \n(5) 佩内洛普是无赖  \n(6) 艾娃是无赖  \n(7) 夏洛特是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：卢克、佐伊、索菲娅、约瑟夫、格蕾丝、奥利维亚和塞巴斯蒂安。卢克说：“格蕾丝是无赖。” 佐伊说：“塞巴斯蒂安是骑士当且仅当索菲娅是骑士。” 索菲娅提到：“奥利维亚不是无赖。” 约瑟夫说：“奥利维亚是无赖。” 格蕾丝声称：“格蕾丝是骑士当且仅当约瑟夫是骑士。” 根据奥利维亚的说法：“佐伊不是骑士。” 塞巴斯蒂安声明：“格蕾丝是无赖或者塞巴斯蒂安是骑士。” 那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是无赖  \n(2) 佐伊是骑士  \n(3) 索菲娅是无赖  \n(4) 约瑟夫是骑士  \n(5) 格蕾丝是骑士  \n(6) 奥利维亚是无赖  \n(7) 塞巴斯蒂安是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：马修、伊芙琳、索菲娅、本杰明、艾弗里、艾玛和格蕾丝。马修说：“马修是骑士当且仅当本杰明是骑士。”伊芙琳评论道：“如果艾玛是骑士，那么马修就是无赖。”索菲娅的陈述是：“马修是无赖，格蕾丝是无赖。”本杰明表示马修是无赖。“本杰明是骑士或者马修是无赖”——艾弗里。艾玛告诉你：“艾弗里是无赖当且仅当马修是骑士。”格蕾丝指出：“马修是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是无赖  \n(2) 伊芙琳是骑士  \n(3) 索菲娅是骑士  \n(4) 本杰明是骑士  \n(5) 艾弗里是骑士  \n(6) 艾玛是骑士  \n(7) 格蕾丝是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：佩内洛普、艾米莉、马修、亚历山大、本杰明、克洛伊和伊森。佩内洛普说：“克洛伊是无赖当且仅当亚历山大是无赖。”艾米莉声称：“佩内洛普是无赖，亚历山大是骑士。”马修提到：“艾米莉是无赖。”亚历山大说：“如果克洛伊是骑士，那么本杰明是无赖。”本杰明断言：“马修是无赖或者伊森是无赖。”克洛伊表示伊森是骑士或者本杰明是骑士。伊森说：“克洛伊是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是一名骑士  \n(2) 艾米莉是一名无赖  \n(3) 马修是一名骑士  \n(4) 亚历山大是一名骑士  \n(5) 本杰明是一名无赖  \n(6) 克洛伊是一名骑士  \n(7) 伊森是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：塞缪尔、约瑟夫、阿梅莉亚、本杰明、艾娃、奥利维亚和威廉。塞缪尔声称：“威廉是无赖或者阿梅莉亚是无赖。”约瑟夫评论道：“如果奥利维亚是骑士，那么本杰明就是无赖。”阿梅莉亚表示：“奥利维亚是无赖。”本杰明说约瑟夫是无赖，而艾娃是骑士。“阿梅莉亚是骑士，而本杰明是无赖。”——艾娃。奥利维亚说：“本杰明不是无赖。”威廉说：“如果且仅如果阿梅莉亚是骑士，奥利维亚就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是无赖  \n(2) 约瑟夫是骑士  \n(3) 阿梅莉亚是骑士  \n(4) 本杰明是无赖  \n(5) 艾娃是骑士  \n(6) 奥利维亚是无赖  \n(7) 威廉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：约瑟夫、卢卡斯、佐伊、艾登、丹尼尔、夏洛特和威廉。约瑟夫说：“夏洛特不是无赖。”卢卡斯说：“夏洛特是无赖。”佐伊宣称：“威廉是无赖或者艾登是无赖。”艾登宣称：“卢卡斯不是骑士。”丹尼尔说：“如果约瑟夫是无赖，那么夏洛特就是无赖。”夏洛特提到：“佐伊是骑士，丹尼尔是骑士。”威廉说：“威廉是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是一名骑士  \n(2) 卢卡斯是一个无赖  \n(3) 佐伊是一名骑士  \n(4) 艾登是一名骑士  \n(5) 丹尼尔是一名骑士  \n(6) 夏洛特是一名骑士  \n(7) 威廉是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：利亚姆、马修、奥萝拉、雅各布、迈克尔、奥利弗和格蕾丝。利亚姆告诉你，如果雅各布是骑士，那么马修就是骑士。马修指出：“奥萝拉不是骑士。”奥萝拉说：“雅各布是骑士，奥利弗是骑士。”根据雅各布的说法，“迈克尔是骑士当且仅当奥利弗是无赖。”迈克尔告诉你，奥利弗是骑士。奥利弗表示格蕾丝是骑士，利亚姆是骑士。格蕾丝声明：“马修不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是一名骑士  \n(2) 马修是一名骑士  \n(3) 奥萝拉是一个无赖  \n(4) 雅各布是一个无赖  \n(5) 迈克尔是一名骑士  \n(6) 奥利弗是一名骑士  \n(7) 格蕾丝是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：梅森、雅各布、大卫、丹尼尔、亨利、米娅和洛根。梅森说：“亨利不是骑士。”雅各布说：“米娅是无赖，亨利也是无赖。”大卫宣称：“如果洛根是无赖，那么米娅就是无赖。”丹尼尔提到：“丹尼尔是骑士，或者米娅是无赖。”亨利评论道：“大卫是无赖当且仅当米娅是无赖。”米娅在一份声明中说：“梅森是无赖。”洛根指出：“大卫是无赖，而洛根是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是一名骑士  \n(2) 雅各布是一名骑士  \n(3) 大卫是一名骑士  \n(4) 丹尼尔是一名骑士  \n(5) 亨利是一个无赖  \n(6) 米娅是一个无赖  \n(7) 洛根是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：斯嘉丽、莉莉、亚历山大、大卫、奥利弗、哈珀和雅各布。斯嘉丽告诉你雅各布是骑士。“大卫是无赖，哈珀是骑士。”——莉莉。“如果莉莉是骑士，那么大卫就是骑士，”亚历山大宣称。根据大卫的说法，“如果亚历山大是骑士，那么大卫就是骑士。”奥利弗说大卫是无赖，雅各布也是无赖。“亚历山大不是无赖，”哈珀声称。根据雅各布的说法，“哈珀是无赖，亚历山大是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）斯嘉丽是无赖  \n（2）莉莉是无赖  \n（3）亚历山大是骑士  \n（4）大卫是骑士  \n（5）奥利弗是无赖  \n（6）哈珀是骑士  \n（7）雅各布是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：杰克、伊莎贝拉、米娅、夏洛特、赖利、本杰明和洛根。杰克说：“夏洛特是骑士。”伊莎贝拉声明：“洛根是骑士，洛根是无赖。”米娅断言：“伊莎贝拉是骑士。”夏洛特评论道：“伊莎贝拉不是骑士。”赖利提到：“米娅是骑士，洛根是骑士。”本杰明的话是：“如果夏洛特是骑士，那么杰克就是无赖。”洛根说：“米娅是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克是骑士  \n(2) 伊莎贝拉是无赖  \n(3) 米娅是无赖  \n(4) 夏洛特是骑士  \n(5) 赖利是无赖  \n(6) 本杰明是无赖  \n(7) 洛根是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：雅各布、本杰明、阿丽亚、哈珀、佐伊、马修和威廉。雅各布说：“哈珀是无赖当且仅当佐伊是骑士。”本杰明表示，如果佐伊是无赖，那么威廉就是无赖。阿丽亚告诉你，哈珀是无赖或者佐伊是无赖。哈珀断言：“本杰明是无赖，佐伊是骑士。”佐伊被听到说：“马修是骑士。”在马修的话中：“如果威廉是骑士，那么哈珀就是骑士。”威廉说：“阿丽亚是无赖，佐伊是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）雅各布是一名骑士  \n（2）本杰明是一名骑士  \n（3）阿丽亚是一名骑士  \n（4）哈珀是一名无赖  \n（5）佐伊是一名骑士  \n（6）马修是一名骑士  \n（7）威廉是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：雅各布、艾弗里、大卫、洛根、维多利亚、佩内洛普和杰克。雅各布告诉你佩内洛普是骑士，维多利亚是无赖。艾弗里说：“雅各布不是骑士。”大卫说：“维多利亚是骑士当且仅当雅各布是无赖。”洛根表示杰克不是骑士。维多利亚表示洛根是无赖，而维多利亚是骑士。“如果艾弗里是无赖，那么杰克就是无赖，”佩内洛普声称。杰克表示雅各布是骑士，而大卫是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）雅各布是一名骑士  \n（2）艾弗里是一个无赖  \n（3）大卫是一名骑士  \n（4）洛根是一名骑士  \n（5）维多利亚是一个无赖  \n（6）佩内洛普是一名骑士  \n（7）杰克是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：艾玛、卢卡斯、大卫、伊森、欧文、约瑟夫和奥萝拉。艾玛说欧文是骑士或者卢卡斯是无赖。卢卡斯说：“约瑟夫不是无赖。”大卫声明：“艾玛是无赖。”伊森被听到说：“艾玛是无赖当且仅当大卫是骑士。”根据欧文的说法：“如果卢卡斯是无赖，那么伊森就是无赖。”约瑟夫提到：“大卫不是骑士。”在奥萝拉的话中：“卢卡斯是无赖或者伊森是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是骑士  \n(2) 卢卡斯是骑士  \n(3) 大卫是无赖  \n(4) 伊森是骑士  \n(5) 欧文是骑士  \n(6) 约瑟夫是骑士  \n(7) 奥萝拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：亨利、艾拉、卢克、阿比盖尔、伊莎贝拉、杰克逊和夏洛特。亨利说：“卢克不是无赖。”艾拉说：“卢克不是骑士。”卢克的陈述是：“亨利是无赖当且仅当阿比盖尔是骑士。”阿比盖尔告诉你，亨利是骑士或者伊莎贝拉是无赖。伊莎贝拉说：“如果阿比盖尔是骑士，那么卢克就是骑士。”根据杰克逊的说法：“如果阿比盖尔是无赖，那么亨利就是骑士。”夏洛特说：“如果艾拉是无赖，那么卢克就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是无赖  \n(2) 艾拉是骑士  \n(3) 卢克是无赖  \n(4) 阿比盖尔是无赖  \n(5) 伊莎贝拉是骑士  \n(6) 杰克逊是无赖  \n(7) 夏洛特是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：诺亚、伊丽莎白、赖利、佩内洛普、索菲娅、佐伊和艾娃。在诺亚的话中：“艾娃是骑士，伊丽莎白是骑士”。在伊丽莎白的陈述中：“诺亚是骑士或者艾娃是无赖”。赖利评论道：“伊丽莎白不是骑士”。“艾娃是骑士当且仅当艾娃是无赖，”佩内洛普提到。索菲娅说，艾娃是骑士当且仅当赖利是无赖。佐伊指出：“诺亚是无赖当且仅当赖利是骑士”。艾娃告诉你，赖利是无赖或者佐伊是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是骑士  \n(2) 伊丽莎白是骑士  \n(3) 赖利是无赖  \n(4) 佩内洛普是无赖  \n(5) 索菲娅是骑士  \n(6) 佐伊是骑士  \n(7) 艾娃是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：莉莉、斯嘉丽、艾拉、奥利弗、艾娃、格蕾丝和雅各布。莉莉说：“艾娃是个无赖。”斯嘉丽指出：“奥利弗不是骑士。”艾拉说：“雅各布不是骑士。”奥利弗声称：“艾拉是骑士。”有人听到艾娃说：“格蕾丝是个无赖，奥利弗是骑士。”格蕾丝声称：“艾娃是个无赖，斯嘉丽是个无赖。”雅各布告诉你，格蕾丝不是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是无赖  \n(2) 斯嘉丽是无赖  \n(3) 艾拉是骑士  \n(4) 奥利弗是骑士  \n(5) 艾娃是骑士  \n(6) 格蕾丝是无赖  \n(7) 雅各布是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：米娅、伊森、伊莎贝拉、佩内洛普、威廉、艾玛和本杰明。“本杰明是无赖或者伊森是无赖，”米娅声称。伊森评论道：“艾玛是骑士或者本杰明是无赖。”伊莎贝拉评论道：“如果米娅是骑士，那么伊森就是无赖。”佩内洛普告诉你艾玛是无赖并且本杰明是无赖。威廉告诉你本杰明是无赖或者伊莎贝拉是无赖。艾玛表示伊莎贝拉是骑士或者佩内洛普是骑士。本杰明说如果伊莎贝拉是无赖，那么威廉就是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是无赖  \n(2) 伊森是骑士  \n(3) 伊莎贝拉是骑士  \n(4) 佩内洛普是无赖  \n(5) 威廉是无赖  \n(6) 艾玛是骑士  \n(7) 本杰明是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：雅各布、索菲娅、大卫、夏洛特、洛根、格蕾丝和奥利维亚。“夏洛特是骑士或者大卫是骑士”——雅各布说。索菲娅评论道：“雅各布不是无赖。”大卫说：“如果雅各布是骑士，那么奥利维亚就是无赖。”根据夏洛特的说法，“格蕾丝不是无赖。”洛根宣称：“大卫是无赖当且仅当格蕾丝是无赖。”格蕾丝说：“索菲娅是骑士，夏洛特是骑士。”奥利维亚断言：“雅各布是无赖或者夏洛特是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 雅各布是一名骑士  \n(2) 索菲娅是一名骑士  \n(3) 大卫是一名骑士  \n(4) 夏洛特是一名骑士  \n(5) 洛根是一名骑士  \n(6) 格蕾丝是一名骑士  \n(7) 奥利维亚是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：詹姆斯、丹尼尔、卢克、夏洛特、米娅、艾拉和赖利。詹姆斯说：“卢克是无赖当且仅当卢克是骑士。”丹尼尔评论道：“夏洛特是无赖当且仅当丹尼尔是骑士。”卢克说：“米娅是无赖并且米娅是骑士。”夏洛特被听到说：“丹尼尔是无赖当且仅当米娅是无赖。”米娅说：“如果米娅是骑士，那么丹尼尔就是无赖。”艾拉声称：“卢克不是骑士。”赖利宣称：“詹姆斯是骑士或者詹姆斯是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是无赖  \n(2) 丹尼尔是无赖  \n(3) 卢克是无赖  \n(4) 夏洛特是无赖  \n(5) 米娅是骑士  \n(6) 艾拉是骑士  \n(7) 赖利是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：佩内洛普、索菲娅、詹姆斯、斯嘉丽、艾弗里、本杰明和塞缪尔。佩内洛普的陈述是：“詹姆斯是无赖，而佩内洛普是骑士。”索菲娅表示，如果塞缪尔是无赖，那么詹姆斯就是无赖。詹姆斯表示，如果斯嘉丽是无赖，那么索菲娅就是无赖。斯嘉丽指出：“本杰明是骑士或者艾弗里是骑士。”艾弗里表示本杰明不是无赖。“佩内洛普是骑士，”本杰明宣称。“佩内洛普是骑士或者詹姆斯是骑士，”塞缪尔提到。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是无赖  \n(2) 索菲娅是骑士  \n(3) 詹姆斯是无赖  \n(4) 斯嘉丽是无赖  \n(5) 艾弗里是无赖  \n(6) 本杰明是无赖  \n(7) 塞缪尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：卢克、米娅、阿比盖尔、塞巴斯蒂安、本杰明、佐伊和杰克。卢克说：“本杰明是个无赖。”米娅声称：“如果佐伊是骑士，那么阿比盖尔就是骑士。”阿比盖尔指出：“佐伊是骑士当且仅当塞巴斯蒂安是骑士。”塞巴斯蒂安说：“卢克是骑士。”本杰明评论道：“阿比盖尔是骑士，塞巴斯蒂安是骑士。”佐伊宣称：“佐伊是骑士。”杰克的声明是：“卢克不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 米娅是一名骑士  \n(3) 阿比盖尔是一个无赖  \n(4) 塞巴斯蒂安是一名骑士  \n(5) 本杰明是一个无赖  \n(6) 佐伊是一个无赖  \n(7) 杰克是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：卢卡斯、雅各布、利亚姆、斯嘉丽、塞缪尔、维多利亚和艾弗里。卢卡斯说，如果塞缪尔是骑士，那么利亚姆就是无赖。雅各布被听到说：“塞缪尔不是无赖。”利亚姆声明：“雅各布是骑士当且仅当斯嘉丽是骑士。”根据斯嘉丽的话，“塞缪尔不是无赖。”塞缪尔声明：“斯嘉丽是骑士，斯嘉丽是无赖。”根据维多利亚的说法，“利亚姆是无赖或者雅各布是骑士。”正如艾弗里所说，“卢卡斯是无赖，塞缪尔是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是一名骑士  \n(2) 雅各布是一个无赖  \n(3) 利亚姆是一名骑士  \n(4) 斯嘉丽是一个无赖  \n(5) 塞缪尔是一个无赖  \n(6) 维多利亚是一个无赖  \n(7) 艾弗里是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：大卫、伊丽莎白、奥利弗、艾登、艾娃、艾米莉和马修。大卫被听到说：“马修是骑士或者艾登是无赖。”伊丽莎白声明：“奥利弗是骑士。”正如奥利弗所说：“大卫不是无赖。”艾登评论道：“大卫是骑士或者艾登是骑士。”艾娃宣称：“如果且仅如果奥利弗是骑士，艾米莉就是无赖。”艾米莉告诉你：“如果且仅如果大卫是骑士，艾登就是骑士。”马修评论道：“大卫是无赖或者艾登是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）大卫是骑士  \n（2）伊丽莎白是骑士  \n（3）奥利弗是骑士  \n（4）艾登是骑士  \n（5）艾娃是无赖  \n（6）艾米莉是骑士  \n（7）马修是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：阿丽亚、丹尼尔、梅森、大卫、米娅、伊丽莎白和斯嘉丽。阿丽亚声称：“伊丽莎白是骑士，丹尼尔是骑士。”丹尼尔则说：“如果伊丽莎白是骑士，那么米娅就是骑士。”梅森被听到说：“大卫是骑士或者大卫是无赖。”大卫断言：“丹尼尔是无赖，斯嘉丽是无赖。”米娅告诉你，伊丽莎白是无赖，丹尼尔是骑士。伊丽莎白说，如果梅森是无赖，那么大卫就是骑士。“米娅是无赖当且仅当阿丽亚是骑士，”斯嘉丽提到。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿丽亚是无赖  \n(2) 丹尼尔是无赖  \n(3) 梅森是骑士  \n(4) 大卫是骑士  \n(5) 米娅是无赖  \n(6) 伊丽莎白是骑士  \n(7) 斯嘉丽是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：迈克尔、塞巴斯蒂安、杰克逊、佩内洛普、诺亚、伊莎贝拉和佐伊。迈克尔说：“伊莎贝拉不是无赖。”塞巴斯蒂安说：“诺亚是无赖或者伊莎贝拉是无赖。”杰克逊说：“诺亚是无赖而塞巴斯蒂安是骑士。”佩内洛普说：“佐伊是无赖。”诺亚说：“如果塞巴斯蒂安是无赖，那么诺亚就是骑士。”伊莎贝拉说：“如果且仅如果塞巴斯蒂安是骑士，迈克尔就是无赖。”佐伊说：“塞巴斯蒂安是无赖或者迈克尔是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是一名骑士  \n(2) 塞巴斯蒂安是一个无赖  \n(3) 杰克逊是一个无赖  \n(4) 佩内洛普是一个无赖  \n(5) 诺亚是一名骑士  \n(6) 伊莎贝拉是一名骑士  \n(7) 佐伊是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：佩内洛普、伊芙琳、夏洛特、艾拉、艾登、阿丽亚和杰克逊。佩内洛普评论道：“佩内洛普是骑士。”伊芙琳指出：“佩内洛普不是无赖。”夏洛特说：“佩内洛普是骑士或者艾登是骑士。”艾拉则说：“夏洛特是骑士或者夏洛特是无赖。”艾登声称：“杰克逊是无赖。”阿丽亚声称：“艾登是无赖并且杰克逊是无赖。”杰克逊说夏洛特是骑士，艾拉是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是一名骑士  \n(2) 伊芙琳是一名骑士  \n(3) 夏洛特是一名骑士  \n(4) 艾拉是一名骑士  \n(5) 艾登是一名无赖  \n(6) 阿丽亚是一名无赖  \n(7) 杰克逊是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：洛根、艾登、大卫、哈珀、伊芙琳、丹尼尔和维多利亚。“艾登是骑士，丹尼尔是无赖，”洛根声称。有人听到艾登说：“丹尼尔是骑士当且仅当大卫是骑士。”大卫说：“维多利亚是骑士或者艾登是无赖。”在哈珀的话中：“伊芙琳是无赖。”根据伊芙琳的说法：“如果洛根是骑士，那么艾登是骑士。”丹尼尔宣称：“大卫不是骑士。”维多利亚说伊芙琳不是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是无赖  \n(2) 艾登是无赖  \n(3) 大卫是骑士  \n(4) 哈珀是无赖  \n(5) 伊芙琳是骑士  \n(6) 丹尼尔是无赖  \n(7) 维多利亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：杰克、威廉、亨利、梅森、欧文、伊丽莎白和本杰明。杰克说：“伊丽莎白不是无赖。”威廉评论道：“如果威廉是骑士，那么伊丽莎白就是骑士。”亨利表示亨利是骑士，而杰克是无赖。“杰克是骑士，”梅森提到。欧文的声明是：“欧文是骑士，而威廉是无赖。”伊丽莎白断言：“如果杰克是无赖，那么梅森就是无赖。”本杰明指出：“威廉是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）杰克是骑士  \n（2）威廉是骑士  \n（3）亨利是无赖  \n（4）梅森是骑士  \n（5）欧文是无赖  \n（6）伊丽莎白是骑士  \n（7）本杰明是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：伊莎贝拉、亨利、梅森、迈克尔、奥利维亚、维多利亚和利亚姆。伊莎贝拉声称：“梅森是骑士，利亚姆是无赖。”亨利说：“如果迈克尔是骑士，那么维多利亚就是骑士。”梅森的话是：“迈克尔是骑士当且仅当维多利亚是无赖。”迈克尔说：“维多利亚是骑士。”奥利维亚声称：“亨利不是无赖。”维多利亚告诉你亨利是无赖，奥利维亚是骑士。利亚姆指出：“迈克尔是骑士或者奥利维亚是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是无赖  \n(2) 亨利是骑士  \n(3) 梅森是无赖  \n(4) 迈克尔是无赖  \n(5) 奥利维亚是骑士  \n(6) 维多利亚是无赖  \n(7) 利亚姆是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：欧文、夏洛特、塞巴斯蒂安、哈珀、迈克尔、维多利亚和梅森。“夏洛特不是骑士，”欧文说。夏洛特说，如果且仅如果维多利亚是骑士，那么梅森就是骑士。塞巴斯蒂安评论道：“维多利亚是无赖。” “欧文是无赖，夏洛特是骑士，”哈珀宣称。根据迈克尔的说法，“维多利亚是骑士。”正如维多利亚所说，“迈克尔是无赖，夏洛特是骑士。”梅森评论道，“迈克尔是无赖或者夏洛特是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是一名骑士  \n(2) 夏洛特是一个无赖  \n(3) 塞巴斯蒂安是一名骑士  \n(4) 哈珀是一个无赖  \n(5) 迈克尔是一个无赖  \n(6) 维多利亚是一个无赖  \n(7) 梅森是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：艾米莉、米娅、欧文、艾娃、奥利维亚、大卫和佐伊。艾米莉声称：“艾米莉是骑士，艾娃是无赖。”米娅告诉你：“如果且仅如果艾娃是无赖，欧文就是骑士。”根据欧文的说法：“米娅是无赖，大卫是骑士。”艾娃说：“如果且仅如果米娅是骑士，艾娃就是骑士。”奥利维亚声称：“欧文是骑士。”大卫评论道：“大卫是骑士或者欧文是无赖。”佐伊评论道：“艾米莉是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是无赖  \n(2) 米娅是骑士  \n(3) 欧文是无赖  \n(4) 艾娃是骑士  \n(5) 奥利维亚是无赖  \n(6) 大卫是骑士  \n(7) 佐伊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：梅森、亚历山大、莉莉、大卫、伊芙琳、约瑟夫和佩内洛普。梅森声称：“约瑟夫是骑士或者伊芙琳是无赖。”亚历山大宣称：“当且仅当约瑟夫是无赖时，亚历山大是骑士。”莉莉评论道：“佩内洛普是无赖，亚历山大是无赖。”大卫提到：“如果佩内洛普是无赖，那么亚历山大是骑士。”伊芙琳表示：“如果莉莉是骑士，那么大卫是无赖。”约瑟夫指出：“当且仅当佩内洛普是无赖时，大卫是骑士。”佩内洛普则说：“伊芙琳是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是无赖  \n(2) 亚历山大是无赖  \n(3) 莉莉是骑士  \n(4) 大卫是无赖  \n(5) 伊芙琳是骑士  \n(6) 约瑟夫是无赖  \n(7) 佩内洛普是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：杰克逊、詹姆斯、洛根、索菲娅、大卫、约瑟夫和伊森。杰克逊说：“大卫是无赖或者大卫是骑士。”詹姆斯说：“詹姆斯是骑士或者索菲娅是无赖。”洛根评论道：“大卫是无赖而索菲娅是骑士。”索菲娅说：“洛根是无赖而伊森是无赖。”大卫说约瑟夫是无赖。约瑟夫告诉你詹姆斯是无赖或者索菲娅是无赖。伊森说：“洛根不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）杰克逊是骑士  \n（2）詹姆斯是骑士  \n（3）洛根是无赖  \n（4）索菲娅是骑士  \n（5）大卫是骑士  \n（6）约瑟夫是无赖  \n（7）伊森是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：威廉、艾拉、阿丽亚、迈克尔、格蕾丝、艾娃和詹姆斯。威廉说：“艾娃是骑士。”艾拉说：“詹姆斯不是无赖。”阿丽亚宣称：“詹姆斯是无赖当且仅当格蕾丝是无赖。”迈克尔说：“如果威廉是骑士，那么艾娃就是无赖。”格蕾丝评论道：“迈克尔是无赖或者艾娃是无赖。”艾娃说：“阿丽亚是骑士，迈克尔是骑士。”詹姆斯被听到说：“威廉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是无赖  \n(2) 艾拉是无赖  \n(3) 阿丽亚是无赖  \n(4) 迈克尔是骑士  \n(5) 格蕾丝是骑士  \n(6) 艾娃是无赖  \n(7) 詹姆斯是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：伊丽莎白、格蕾丝、丹尼尔、索菲娅、洛根、艾拉和亚历山大。正如伊丽莎白所说：“丹尼尔是骑士，丹尼尔是无赖。”格蕾丝的陈述是：“索菲娅是无赖。”丹尼尔告诉你，亚历山大是骑士。索菲娅说：“伊丽莎白不是骑士。”洛根评论道：“索菲娅是骑士。”艾拉说，格蕾丝是无赖当且仅当伊丽莎白是骑士。亚历山大说：“艾拉是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是无赖  \n(2) 格蕾丝是无赖  \n(3) 丹尼尔是无赖  \n(4) 索菲娅是骑士  \n(5) 洛根是骑士  \n(6) 艾拉是无赖  \n(7) 亚历山大是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：约瑟夫、洛根、莉莉、索菲娅、詹姆斯、卢卡斯和欧文。“索菲娅是个无赖，”约瑟夫提到。洛根评论道：“洛根是骑士或者索菲娅是骑士。”莉莉断言：“约瑟夫是骑士当且仅当詹姆斯是骑士。”索菲娅说道：“如果欧文是无赖，那么约瑟夫就是骑士。”詹姆斯提到：“卢卡斯是骑士当且仅当洛根是无赖。”在卢卡斯的一句话中：“索菲娅是无赖并且约瑟夫是无赖。”欧文说卢卡斯是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是无赖  \n(2) 洛根是骑士  \n(3) 莉莉是无赖  \n(4) 索菲娅是骑士  \n(5) 詹姆斯是骑士  \n(6) 卢卡斯是无赖  \n(7) 欧文是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：佩内洛普、诺亚、卢卡斯、本杰明、杰克逊、莉莉和夏洛特。佩内洛普被听到说：“莉莉是骑士或者佩内洛普是骑士”。根据诺亚的说法：“夏洛特是无赖，杰克逊是无赖”。卢卡斯说佩内洛普是骑士。在本杰明的陈述中：“如果夏洛特是无赖，那么佩内洛普是骑士”。在杰克逊的陈述中：“佩内洛普是骑士或者卢卡斯是无赖”。正如莉莉所说：“杰克逊是无赖当且仅当本杰明是无赖”。夏洛特说杰克逊是骑士或者卢卡斯是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是一名骑士  \n(2) 诺亚是一个无赖  \n(3) 卢卡斯是一名骑士  \n(4) 本杰明是一名骑士  \n(5) 杰克逊是一名骑士  \n(6) 莉莉是一名骑士  \n(7) 夏洛特是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：诺亚、维多利亚、洛根、索菲娅、杰克、伊芙琳和格蕾丝。诺亚说：“洛根是骑士。”维多利亚说：“诺亚是无赖，格蕾丝是骑士。”洛根的陈述是：“维多利亚是骑士或者维多利亚是无赖。”索菲娅表示，诺亚是无赖当且仅当格蕾丝是无赖。“维多利亚是骑士，诺亚是无赖，”杰克宣称。伊芙琳说：“杰克是无赖或者洛根是骑士。” “诺亚是骑士或者洛根是骑士”——格蕾丝。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是骑士  \n(2) 维多利亚是无赖  \n(3) 洛根是骑士  \n(4) 索菲娅是骑士  \n(5) 杰克是无赖  \n(6) 伊芙琳是骑士  \n(7) 格蕾丝是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：奥利维亚、卢卡斯、伊莎贝拉、艾玛、丹尼尔、奥萝拉和艾拉。奥利维亚说：“丹尼尔是骑士。”卢卡斯说：“伊莎贝拉不是无赖。”伊莎贝拉声明：“艾拉是无赖。”艾玛评论道：“奥利维亚是骑士或者卢卡斯是无赖。”丹尼尔说：“奥萝拉是骑士而丹尼尔是骑士。”奥萝拉指出：“奥萝拉是骑士而卢卡斯是骑士。”根据艾拉的说法：“奥萝拉是骑士或者奥利维亚是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是无赖  \n(2) 卢卡斯是骑士  \n(3) 伊莎贝拉是骑士  \n(4) 艾玛是无赖  \n(5) 丹尼尔是无赖  \n(6) 奥萝拉是无赖  \n(7) 艾拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：洛根、塞巴斯蒂安、本杰明、格蕾丝、艾娃、迈克尔和伊莎贝拉。洛根说：“艾娃不是无赖。”塞巴斯蒂安声明：“格蕾丝是骑士或者本杰明是骑士。”本杰明说：“洛根是无赖或者迈克尔是骑士。”格蕾丝表示伊莎贝拉是无赖。艾娃说：“如果艾娃是骑士，那么迈克尔是骑士。”迈克尔说本杰明不是无赖。伊莎贝拉说：“如果伊莎贝拉是骑士，那么格蕾丝是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是一名骑士  \n(2) 塞巴斯蒂安是一名骑士  \n(3) 本杰明是一名骑士  \n(4) 格蕾丝是一名无赖  \n(5) 艾娃是一名骑士  \n(6) 迈克尔是一名骑士  \n(7) 伊莎贝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：莉莉、杰克逊、维多利亚、佐伊、艾登、丹尼尔和亨利。莉莉说艾登是无赖或者丹尼尔是骑士。杰克逊宣称：“维多利亚是骑士当且仅当丹尼尔是骑士。”维多利亚提到：“佐伊是骑士或者亨利是骑士。”佐伊被听到说：“佐伊是骑士并且亨利是骑士。”艾登被听到说：“莉莉不是无赖。”丹尼尔的话是：“莉莉是骑士当且仅当丹尼尔是骑士。”亨利评论道：“莉莉不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是骑士  \n(2) 杰克逊是无赖  \n(3) 维多利亚是无赖  \n(4) 佐伊是无赖  \n(5) 艾登是骑士  \n(6) 丹尼尔是骑士  \n(7) 亨利是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：艾娃、索菲娅、伊丽莎白、艾弗里、伊莎贝拉、克洛伊和约瑟夫。艾娃声称：“艾弗里是骑士当且仅当约瑟夫是无赖。”索菲娅说：“伊丽莎白不是无赖。”根据伊丽莎白的说法：“艾弗里不是无赖。”在艾弗里的话中：“如果约瑟夫是骑士，那么索菲娅就是骑士。”伊莎贝拉宣称：“克洛伊是无赖或者艾娃是骑士。”克洛伊被听到说：“如果索菲娅是骑士，那么艾弗里就是无赖。”约瑟夫指出：“克洛伊是无赖当且仅当伊丽莎白是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是一名骑士  \n(2) 索菲娅是一名骑士  \n(3) 伊丽莎白是一名骑士  \n(4) 艾弗里是一名骑士  \n(5) 伊莎贝拉是一名骑士  \n(6) 克洛伊是一名无赖  \n(7) 约瑟夫是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：艾弗里、阿丽亚、本杰明、约瑟夫、维多利亚、亚历山大和艾米莉。艾弗里告诉你，约瑟夫是个无赖。阿丽亚的陈述是：“如果艾米莉是个无赖，那么维多利亚就是骑士。”本杰明说：“阿丽亚不是骑士。”约瑟夫评论道：“艾米莉是个无赖或者艾弗里是骑士。”维多利亚宣称：“如果亚历山大是骑士，那么艾弗里就是骑士。”亚历山大说：“维多利亚是骑士当且仅当艾弗里是骑士。”艾米莉说：“本杰明是个无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是无赖  \n(2) 阿丽亚是无赖  \n(3) 本杰明是骑士  \n(4) 约瑟夫是骑士  \n(5) 维多利亚是无赖  \n(6) 亚历山大是骑士  \n(7) 艾米莉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：索菲娅、杰克逊、佩内洛普、伊莎贝拉、艾弗里、莉莉和哈珀。索菲娅评论道：“伊莎贝拉是骑士当且仅当莉莉是骑士。”杰克逊声称：“索菲娅是无赖或者哈珀是无赖。”佩内洛普声称：“杰克逊是无赖并且哈珀是无赖。”伊莎贝拉说：“索菲娅是无赖当且仅当杰克逊是无赖。”艾弗里表示索菲娅是骑士。莉莉声称：“如果伊莎贝拉是无赖，那么伊莎贝拉就是骑士。”哈珀说：“如果杰克逊是骑士，那么莉莉就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 杰克逊是一个无赖  \n(3) 佩内洛普是一个无赖  \n(4) 伊莎贝拉是一个无赖  \n(5) 艾弗里是一名骑士  \n(6) 莉莉是一个无赖  \n(7) 哈珀是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：艾弗里、卢克、哈珀、伊丽莎白、夏洛特、阿丽亚和洛根。艾弗里告诉你，如果阿丽亚是无赖，那么伊丽莎白就是无赖。卢克声称：“哈珀是无赖，阿丽亚是无赖。”哈珀宣称：“如果卢克是骑士，那么伊丽莎白就是无赖。”伊丽莎白告诉你，洛根不是无赖。夏洛特评论道：“如果卢克是无赖，那么艾弗里就是骑士。”阿丽亚告诉你，伊丽莎白是骑士。洛根声称：“夏洛特不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是一名骑士  \n(2) 卢克是一个无赖  \n(3) 哈珀是一名骑士  \n(4) 伊丽莎白是一名骑士  \n(5) 夏洛特是一名骑士  \n(6) 阿丽亚是一名骑士  \n(7) 洛根是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：艾米莉、艾玛、索菲娅、哈珀、莉莉、阿丽亚和杰克逊。根据艾米莉的说法：“莉莉是无赖或者艾米莉是骑士。”在艾玛的陈述中：“艾米莉不是骑士。”索菲娅指出：“艾米莉是无赖而艾玛是骑士。”哈珀评论道：“杰克逊是骑士或者阿丽亚是骑士。”莉莉断言：“艾玛不是无赖。”正如阿丽亚所说：“哈珀是无赖当且仅当哈珀是骑士。”在杰克逊的话中：“如果艾米莉是无赖，那么哈珀就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是骑士  \n(2) 艾玛是无赖  \n(3) 索菲娅是无赖  \n(4) 哈珀是骑士  \n(5) 莉莉是无赖  \n(6) 阿丽亚是无赖  \n(7) 杰克逊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：伊丽莎白、莉莉、索菲娅、欧文、杰克、亚历山大和奥萝拉。正如伊丽莎白所说：“莉莉不是无赖。”莉莉说：“奥萝拉是骑士。”索菲娅说：“杰克是骑士，奥萝拉是骑士。”欧文告诉你，奥萝拉是骑士当且仅当亚历山大是骑士。杰克说：“索菲娅是骑士，亚历山大是骑士。”亚历山大告诉你，如果欧文是骑士，那么伊丽莎白就是无赖。正如奥萝拉所说：“如果杰克是无赖，那么欧文就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是无赖  \n(2) 莉莉是无赖  \n(3) 索菲娅是无赖  \n(4) 欧文是无赖  \n(5) 杰克是无赖  \n(6) 亚历山大是骑士  \n(7) 奥萝拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：莉莉、詹姆斯、佩内洛普、伊莎贝拉、塞巴斯蒂安、杰克逊和伊丽莎白。莉莉说道：“如果詹姆斯是无赖，那么伊莎贝拉就是骑士。”詹姆斯声称：“伊莎贝拉是无赖当且仅当杰克逊是骑士。”根据佩内洛普的说法：“伊莎贝拉是骑士当且仅当詹姆斯是无赖。”伊莎贝拉说：“杰克逊不是骑士。”塞巴斯蒂安说：“伊丽莎白不是无赖。”杰克逊说：“如果佩内洛普是骑士，那么塞巴斯蒂安就是无赖。”伊丽莎白表示：“伊莎贝拉是无赖当且仅当伊丽莎白是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是骑士  \n(2) 詹姆斯是骑士  \n(3) 佩内洛普是骑士  \n(4) 伊莎贝拉是无赖  \n(5) 塞巴斯蒂安是无赖  \n(6) 杰克逊是骑士  \n(7) 伊丽莎白是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：洛根、卢卡斯、威廉、阿比盖尔、利亚姆、伊森和阿梅莉亚。洛根的陈述是：“利亚姆不是无赖”。卢卡斯说：“利亚姆是骑士当且仅当洛根是骑士”。威廉说威廉是骑士或者卢卡斯是骑士。阿比盖尔告诉你阿梅莉亚是骑士，伊森是骑士。利亚姆指出：“伊森不是骑士”。伊森指出：“洛根是骑士当且仅当伊森是骑士”。阿梅莉亚宣称：“利亚姆是无赖或者洛根是骑士”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是一名骑士  \n(2) 卢卡斯是一名骑士  \n(3) 威廉是一名骑士  \n(4) 阿比盖尔是一名无赖  \n(5) 利亚姆是一名骑士  \n(6) 伊森是一名无赖  \n(7) 阿梅莉亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：艾弗里、艾玛、伊森、塞缪尔、哈珀、伊莎贝拉和亚历山大。根据艾弗里的说法：“如果且仅如果伊莎贝拉是无赖，亚历山大就是无赖。”艾玛评论道：“艾弗里不是骑士。”在伊森的话中：“哈珀是无赖或者艾玛是骑士。”塞缪尔评论道：“亚历山大是无赖或者艾弗里是骑士。”哈珀断言：“亚历山大是骑士或者艾玛是无赖。”伊莎贝拉被听到说：“伊森不是无赖。”亚历山大指出：“伊莎贝拉是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是一名骑士  \n(2) 艾玛是一个无赖  \n(3) 伊森是一个无赖  \n(4) 塞缪尔是一名骑士  \n(5) 哈珀是一名骑士  \n(6) 伊莎贝拉是一个无赖  \n(7) 亚历山大是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：艾弗里、奥利维亚、阿梅莉亚、艾娃、阿丽亚、斯嘉丽和本杰明。艾弗里说：“如果艾娃是无赖，那么艾弗里就是骑士。”奥利维亚评论道：“阿梅莉亚不是骑士。”阿梅莉亚告诉你，如果阿丽亚是骑士，那么本杰明就是无赖。艾娃告诉你，阿丽亚不是骑士。根据阿丽亚的说法，“奥利维亚是骑士或者阿梅莉亚是无赖。”斯嘉丽说，如果且仅如果阿丽亚是骑士，那么本杰明就是无赖。本杰明被听到说：“奥利维亚是无赖，艾弗里是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是一名骑士  \n(2) 奥利维亚是一个无赖  \n(3) 阿梅莉亚是一名骑士  \n(4) 艾娃是一名骑士  \n(5) 阿丽亚是一个无赖  \n(6) 斯嘉丽是一名骑士  \n(7) 本杰明是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：迈克尔、亚历山大、艾娃、卢克、卢卡斯、詹姆斯和艾拉。迈克尔说卢卡斯是无赖，而卢卡斯是骑士。“艾娃是骑士，詹姆斯是无赖。”——亚历山大。“卢克是骑士当且仅当艾拉是无赖，”艾娃声称。“卢卡斯是无赖，迈克尔是骑士，”卢克提到。“迈克尔是骑士，”卢卡斯提到。詹姆斯指出，“如果艾拉是骑士，那么詹姆斯就是骑士。”根据艾拉的说法，“詹姆斯是骑士或者艾娃是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是无赖  \n(2) 亚历山大是无赖  \n(3) 艾娃是骑士  \n(4) 卢克是无赖  \n(5) 卢卡斯是无赖  \n(6) 詹姆斯是骑士  \n(7) 艾拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：丹尼尔、杰克逊、艾登、阿比盖尔、斯嘉丽、洛根和艾拉。丹尼尔被听到说：“艾拉是无赖，洛根是无赖。”杰克逊说：“如果艾登是无赖，那么艾拉就是无赖。”艾登被听到说：“当且仅当洛根是无赖时，艾登就是骑士。”阿比盖尔指出：“洛根不是无赖。”斯嘉丽说艾拉是无赖。“杰克逊是骑士或者丹尼尔是骑士，”洛根声称。“如果丹尼尔是骑士，那么杰克逊就是骑士，”艾拉宣称。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）丹尼尔是无赖  \n（2）杰克逊是无赖  \n（3）艾登是无赖  \n（4）阿比盖尔是无赖  \n（5）斯嘉丽是无赖  \n（6）洛根是无赖  \n（7）艾拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：伊芙琳、亚历山大、索菲娅、亨利、雅各布、伊森和阿丽亚。伊芙琳告诉你，阿丽亚是无赖当且仅当亚历山大是无赖。亚历山大说：“伊森不是无赖。”索菲娅表示阿丽亚是无赖或者亨利是骑士。在亨利的陈述中：“索菲娅不是骑士。”在雅各布的陈述中：“阿丽亚是骑士，索菲娅是骑士。”伊森表示亨利是骑士，雅各布是骑士。在阿丽亚的话中：“雅各布不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是一名骑士  \n(2) 亚历山大是一个无赖  \n(3) 索菲娅是一名骑士  \n(4) 亨利是一个无赖  \n(5) 雅各布是一个无赖  \n(6) 伊森是一个无赖  \n(7) 阿丽亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：伊丽莎白、斯嘉丽、阿梅莉亚、阿丽亚、雅各布、洛根和诺亚。伊丽莎白说斯嘉丽是个无赖。“如果诺亚是无赖，那么阿梅莉亚就是骑士。”——斯嘉丽。阿梅莉亚说阿丽亚不是无赖。阿丽亚说：“伊丽莎白是骑士，阿丽亚是骑士。”雅各布说：“伊丽莎白是无赖当且仅当伊丽莎白是骑士。”在洛根的陈述中：“雅各布不是骑士。”诺亚说：“洛根是无赖。”那么谁是骑士，谁是无赖？",
        "solution_text_format": "(1) 伊丽莎白是一名骑士  \n(2) 斯嘉丽是一个无赖  \n(3) 阿梅莉亚是一个无赖  \n(4) 阿丽亚是一个无赖  \n(5) 雅各布是一个无赖  \n(6) 洛根是一名骑士  \n(7) 诺亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：莉莉、大卫、洛根、诺亚、佩内洛普、本杰明和索菲娅。莉莉的陈述是：“大卫是骑士。”大卫评论道：“洛根是骑士或者索菲娅是无赖。”洛根说：“索菲娅是骑士而莉莉是无赖。”诺亚说：“莉莉是骑士而本杰明是骑士。”根据佩内洛普的说法：“如果诺亚是骑士，那么索菲娅就是无赖。”本杰明说：“诺亚不是无赖。”索菲娅评论道：“如果佩内洛普是骑士，那么本杰明就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是骑士  \n(2) 大卫是骑士  \n(3) 洛根是无赖  \n(4) 诺亚是无赖  \n(5) 佩内洛普是骑士  \n(6) 本杰明是无赖  \n(7) 索菲娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：诺亚、塞缪尔、伊芙琳、卢克、卢卡斯、杰克逊和梅森。诺亚声称：“伊芙琳是骑士。”塞缪尔说：“卢卡斯不是骑士。”伊芙琳说：“杰克逊是骑士或者梅森是骑士。”卢克声称：“如果杰克逊是无赖，那么塞缪尔就是骑士。”卢卡斯提到：“诺亚不是无赖。”杰克逊被听到说：“伊芙琳是骑士或者伊芙琳是无赖。”梅森宣称：“塞缪尔是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是骑士  \n(2) 塞缪尔是无赖  \n(3) 伊芙琳是骑士  \n(4) 卢克是骑士  \n(5) 卢卡斯是骑士  \n(6) 杰克逊是骑士  \n(7) 梅森是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：伊莎贝拉、丹尼尔、索菲娅、斯嘉丽、约瑟夫、艾玛和维多利亚。伊莎贝拉评论道：“丹尼尔不是骑士。”丹尼尔则说：“伊莎贝拉是无赖，维多利亚是骑士。”索菲娅评论道：“伊莎贝拉是无赖或者艾玛是骑士。”斯嘉丽说艾玛是骑士或者索菲娅是骑士。约瑟夫说：“如果维多利亚是无赖，那么索菲娅就是骑士。”艾玛断言：“维多利亚是无赖或者斯嘉丽是无赖。”维多利亚评论道：“约瑟夫是无赖当且仅当索菲娅是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是一名骑士  \n(2) 丹尼尔是一个无赖  \n(3) 索菲娅是一名骑士  \n(4) 斯嘉丽是一名骑士  \n(5) 约瑟夫是一名骑士  \n(6) 艾玛是一名骑士  \n(7) 维多利亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：佐伊、雅各布、艾拉、克洛伊、伊森、卢克和莉莉。佐伊声称：“克洛伊是骑士或者克洛伊是无赖。”雅各布说道：“伊森是无赖。”艾拉说雅各布是骑士，莉莉是骑士。“莉莉不是骑士，”克洛伊声称。伊森评论道：“克洛伊不是骑士。”卢克声称：“艾拉不是骑士。”莉莉指出：“卢克是骑士，佐伊是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佐伊是一名骑士  \n(2) 雅各布是一名骑士  \n(3) 艾拉是一个无赖  \n(4) 克洛伊是一名骑士  \n(5) 伊森是一个无赖  \n(6) 卢克是一名骑士  \n(7) 莉莉是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了7位居民：杰克逊、米娅、阿比盖尔、本杰明、哈珀、奥利弗和艾米莉。杰克逊说：“哈珀是骑士当且仅当杰克逊是骑士。”根据米娅的说法，“哈珀是无赖或者艾米莉是骑士。”阿比盖尔声称：“杰克逊是无赖。”本杰明说杰克逊是骑士，而杰克逊是无赖。哈珀说：“杰克逊不是无赖。”奥利弗提到：“如果阿比盖尔是无赖，那么米娅就是无赖。”艾米莉表示本杰明是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）杰克逊是一名骑士  \n（2）米娅是一个无赖  \n（3）阿比盖尔是一个无赖  \n（4）本杰明是一个无赖  \n（5）哈珀是一名骑士  \n（6）奥利弗是一名骑士  \n（7）艾米莉是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：卢卡斯、塞巴斯蒂安、本杰明、雅各布、艾玛、莉莉和迈克尔。卢卡斯的陈述是：“莉莉是无赖或者迈克尔是无赖”。塞巴斯蒂安被听到说：“如果卢卡斯是骑士，那么莉莉就是无赖”。本杰明告诉你，卢卡斯是骑士或者本杰明是骑士。雅各布声明：“迈克尔不是无赖”。艾玛被听到说：“雅各布是骑士当且仅当莉莉是骑士”。“艾玛不是骑士，”莉莉宣称。迈克尔表示艾玛不是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是骑士  \n(2) 塞巴斯蒂安是无赖  \n(3) 本杰明是骑士  \n(4) 雅各布是无赖  \n(5) 艾玛是无赖  \n(6) 莉莉是骑士  \n(7) 迈克尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：约瑟夫、莉莉、艾玛、哈珀、克洛伊、伊森和洛根。约瑟夫声称：“哈珀是骑士，哈珀是无赖。”莉莉说：“哈珀是骑士。”艾玛宣称：“约瑟夫不是无赖。”哈珀说：“克洛伊是骑士。”克洛伊指出：“如果莉莉是无赖，那么艾玛就是无赖。”伊森的陈述是：“约瑟夫是骑士，洛根是无赖。”洛根说伊森是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是无赖  \n(2) 莉莉是骑士  \n(3) 艾玛是无赖  \n(4) 哈珀是骑士  \n(5) 克洛伊是骑士  \n(6) 伊森是无赖  \n(7) 洛根是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：艾登、约瑟夫、格蕾丝、奥萝拉、索菲娅、克洛伊和利亚姆。艾登说，如果且仅如果约瑟夫是无赖，那么利亚姆就是无赖。约瑟夫提到：“如果格蕾丝是无赖，那么利亚姆就是无赖。”根据格蕾丝的说法，“索菲娅是无赖。”奥萝拉说，如果艾登是无赖，那么格蕾丝就是骑士。索菲娅断言：“如果且仅如果艾登是骑士，那么克洛伊就是无赖。”克洛伊提到：“格蕾丝不是骑士。”根据利亚姆的说法，“奥萝拉不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是无赖  \n(2) 约瑟夫是骑士  \n(3) 格蕾丝是无赖  \n(4) 奥萝拉是无赖  \n(5) 索菲娅是骑士  \n(6) 克洛伊是骑士  \n(7) 利亚姆是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了7位居民：詹姆斯、约瑟夫、艾拉、梅森、丹尼尔、奥利维亚和索菲娅。詹姆斯说：“索菲娅不是骑士。” 约瑟夫说梅森不是无赖。艾拉的陈述是：“索菲娅是无赖当且仅当詹姆斯是骑士。” 梅森断言：“奥利维亚是骑士。” 丹尼尔表示梅森是无赖当且仅当艾拉是无赖。奥利维亚被听到说：“约瑟夫是骑士或者艾拉是骑士。” 索菲娅被听到说：“梅森是骑士当且仅当梅森是无赖。” 那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是一名骑士  \n(2) 约瑟夫是一名骑士  \n(3) 艾拉是一名骑士  \n(4) 梅森是一名骑士  \n(5) 丹尼尔是一名骑士  \n(6) 奥利维亚是一名骑士  \n(7) 索菲娅是一名无赖"
    }
]