[
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：亚历山大、伊森、伊丽莎白、卢克、诺亚和马修。亚历山大说：“诺亚是一个无赖。”伊森告诉你，如果卢克是一个无赖，那么马修就是一个无赖。伊丽莎白说，诺亚是骑士当且仅当马修是无赖。“诺亚不是骑士，”卢克提到。诺亚在一份声明中说：“马修不是无赖。”马修被听到说：“亚历山大是骑士或者卢克是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亚历山大是无赖  \n(2) 伊森是无赖  \n(3) 伊丽莎白是无赖  \n(4) 卢克是无赖  \n(5) 诺亚是骑士  \n(6) 马修是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：赖利、梅森、索菲娅、阿比盖尔、丹尼尔和迈克尔。赖利声称：“索菲娅是骑士。”梅森则说：“丹尼尔是无赖或者迈克尔是骑士。”索菲娅说：“梅森是骑士当且仅当梅森是无赖。”阿比盖尔说丹尼尔是骑士或者赖利是无赖。丹尼尔断言：“赖利是骑士。”迈克尔表示：“赖利是无赖当且仅当阿比盖尔是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是一个无赖  \n(2) 梅森是一个骑士  \n(3) 索菲娅是一个无赖  \n(4) 阿比盖尔是一个骑士  \n(5) 丹尼尔是一个无赖  \n(6) 迈克尔是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：阿梅莉亚、奥利弗、卢卡斯、本杰明、迈克尔和洛根。阿梅莉亚说：“迈克尔是骑士当且仅当洛根是骑士。”奥利弗指出：“阿梅莉亚是无赖或者迈克尔是无赖。”卢卡斯告诉你迈克尔不是无赖。“卢卡斯是无赖而阿梅莉亚是无赖”——本杰明说。“本杰明是无赖或者本杰明是骑士，”迈克尔声称。洛根被听到说：“阿梅莉亚是骑士而本杰明是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是无赖  \n(2) 奥利弗是骑士  \n(3) 卢卡斯是骑士  \n(4) 本杰明是无赖  \n(5) 迈克尔是骑士  \n(6) 洛根是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：威廉、雅各布、奥萝拉、马修、洛根和格蕾丝。威廉说：“雅各布是骑士或者洛根是骑士。”雅各布告诉你，威廉是骑士当且仅当马修是骑士。奥萝拉声明：“如果雅各布是骑士，那么格蕾丝是骑士。”马修说：“雅各布是无赖或者格蕾丝是无赖。”洛根评论道：“如果威廉是无赖，那么雅各布是骑士。”根据格蕾丝的说法，“洛根是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是无赖  \n(2) 雅各布是无赖  \n(3) 奥萝拉是骑士  \n(4) 马修是骑士  \n(5) 洛根是无赖  \n(6) 格蕾丝是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：亨利、卢卡斯、佩内洛普、格蕾丝、艾拉和亚历山大。亨利说：“佩内洛普是骑士或者艾拉是无赖。”卢卡斯宣称：“亨利不是无赖。”佩内洛普断言：“如果亚历山大是骑士，那么艾拉就是骑士。”格蕾丝的话是：“卢卡斯是骑士。”艾拉说：“卢卡斯是骑士当且仅当格蕾丝是无赖。”亚历山大被听到说：“亨利是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是一名骑士  \n(2) 卢卡斯是一名骑士  \n(3) 佩内洛普是一名骑士  \n(4) 格蕾丝是一名骑士  \n(5) 艾拉是一名无赖  \n(6) 亚历山大是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：本杰明、佐伊、塞缪尔、马修、克洛伊和大卫。本杰明被听到说：“佐伊是骑士当且仅当克洛伊是无赖。”佐伊宣称：“塞缪尔不是骑士。”塞缪尔则说道：“塞缪尔是骑士当且仅当克洛伊是无赖。”马修表示，如果塞缪尔是无赖，那么克洛伊就是无赖。克洛伊说：“马修是骑士当且仅当本杰明是骑士。”大卫评论道：“本杰明是骑士，克洛伊是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是无赖  \n(2) 佐伊是无赖  \n(3) 塞缪尔是骑士  \n(4) 马修是骑士  \n(5) 克洛伊是无赖  \n(6) 大卫是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：丹尼尔、迈克尔、梅森、马修、本杰明和利亚姆。“本杰明不是无赖”——丹尼尔说。迈克尔说：“如果马修是无赖，那么梅森就是无赖。” “迈克尔是骑士”——梅森说。“丹尼尔不是骑士，”马修宣称。“梅森是无赖，梅森是骑士，”本杰明提到。利亚姆说梅森是无赖，丹尼尔是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是无赖  \n(2) 迈克尔是骑士  \n(3) 梅森是骑士  \n(4) 马修是骑士  \n(5) 本杰明是无赖  \n(6) 利亚姆是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：伊森、阿比盖尔、哈珀、斯嘉丽、艾娃和奥利弗。伊森说：“如果奥利弗是无赖，那么哈珀就是骑士。”阿比盖尔声称：“斯嘉丽是无赖当且仅当伊森是无赖。”哈珀告诉你阿比盖尔是无赖。斯嘉丽指出：“伊森不是骑士。”艾娃提到：“伊森是无赖或者哈珀是无赖。”在奥利弗的话中：“阿比盖尔是骑士当且仅当艾娃是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是一名骑士  \n(2) 阿比盖尔是一个无赖  \n(3) 哈珀是一名骑士  \n(4) 斯嘉丽是一个无赖  \n(5) 艾娃是一个无赖  \n(6) 奥利弗是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：伊芙琳、杰克、梅森、奥萝拉、杰克逊和詹姆斯。伊芙琳表示梅森不是骑士。杰克说：“奥萝拉是骑士或者詹姆斯是骑士。”梅森评论道：“詹姆斯是骑士而奥萝拉是无赖。”奥萝拉的陈述是：“伊芙琳是无赖当且仅当杰克逊是无赖。”杰克逊评论道：“奥萝拉是无赖。”詹姆斯说：“梅森是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是无赖  \n(2) 杰克是骑士  \n(3) 梅森是骑士  \n(4) 奥萝拉是无赖  \n(5) 杰克逊是骑士  \n(6) 詹姆斯是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：哈珀、约瑟夫、马修、克洛伊、艾弗里和伊森。“如果艾弗里是骑士，那么约瑟夫就是骑士，”哈珀宣称。有人听到约瑟夫说：“伊森是骑士。” “如果哈珀是无赖，那么马修就是骑士，”马修提到。克洛伊评论道：“马修是骑士，伊森是骑士。”在艾弗里的陈述中：“克洛伊不是骑士。”有人听到伊森说：“克洛伊是无赖或者哈珀是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是一名骑士  \n(2) 约瑟夫是一名骑士  \n(3) 马修是一名骑士  \n(4) 克洛伊是一名骑士  \n(5) 艾弗里是一名无赖  \n(6) 伊森是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：索菲娅、佐伊、利亚姆、阿比盖尔、阿丽亚和夏洛特。根据索菲娅的说法：“利亚姆是无赖或者佐伊是无赖。”佐伊告诉你阿比盖尔不是骑士。利亚姆说：“索菲娅不是无赖。”阿比盖尔指出：“利亚姆是骑士。”阿丽亚说：“利亚姆是无赖当且仅当利亚姆是骑士。”夏洛特则表示：“阿比盖尔是骑士当且仅当索菲娅是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 佐伊是一个无赖  \n(3) 利亚姆是一名骑士  \n(4) 阿比盖尔是一名骑士  \n(5) 阿丽亚是一个无赖  \n(6) 夏洛特是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：杰克逊、塞缪尔、索菲娅、艾弗里、丹尼尔和欧文。杰克逊声称：“艾弗里是无赖当且仅当塞缪尔是骑士。”塞缪尔宣称：“如果索菲娅是无赖，那么丹尼尔就是骑士。”索菲娅表示塞缪尔不是骑士。艾弗里表示：“丹尼尔是无赖当且仅当索菲娅是无赖。”在丹尼尔的话中：“艾弗里是无赖或者杰克逊是无赖。”欧文告诉你杰克逊不是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是一名骑士  \n(2) 塞缪尔是一名骑士  \n(3) 索菲娅是一名无赖  \n(4) 艾弗里是一名无赖  \n(5) 丹尼尔是一名骑士  \n(6) 欧文是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：马修、阿比盖尔、伊丽莎白、丹尼尔、卢卡斯和阿丽亚。马修说：“如果阿丽亚是骑士，那么卢卡斯就是无赖。”阿比盖尔提到：“伊丽莎白是无赖当且仅当马修是骑士。”伊丽莎白断言：“马修不是骑士。”丹尼尔告诉你，卢卡斯是无赖或者阿比盖尔是骑士。卢卡斯说：“马修是骑士，卢卡斯是骑士。”根据阿丽亚的说法：“丹尼尔是骑士当且仅当伊丽莎白是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是一名骑士  \n(2) 阿比盖尔是一名骑士  \n(3) 伊丽莎白是一个无赖  \n(4) 丹尼尔是一名骑士  \n(5) 卢卡斯是一个无赖  \n(6) 阿丽亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：格蕾丝、索菲娅、詹姆斯、诺亚、亚历山大和大卫。格蕾丝说：“詹姆斯是骑士或者大卫是无赖。”索菲娅宣称：“亚历山大不是骑士。”詹姆斯宣称：“格蕾丝是无赖而大卫是骑士。”诺亚说：“格蕾丝不是无赖。”亚历山大说：“诺亚是骑士而格蕾丝是无赖。”大卫提到：“索菲娅是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是一名骑士  \n(2) 索菲娅是一名骑士  \n(3) 詹姆斯是一个无赖  \n(4) 诺亚是一名骑士  \n(5) 亚历山大是一个无赖  \n(6) 大卫是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：卢克、索菲娅、赖利、克洛伊、威廉和伊芙琳。“赖利是骑士当且仅当威廉是无赖，”卢克声称。根据索菲娅的说法，“克洛伊不是无赖”。在赖利的话中：“赖利是骑士当且仅当克洛伊是无赖”。在克洛伊的话中：“伊芙琳不是骑士”。威廉指出，“伊芙琳是无赖”。伊芙琳指出，“伊芙琳是骑士当且仅当卢克是无赖”。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是无赖  \n(2) 索菲娅是无赖  \n(3) 赖利是无赖  \n(4) 克洛伊是无赖  \n(5) 威廉是无赖  \n(6) 伊芙琳是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：佩内洛普、杰克逊、艾弗里、维多利亚、夏洛特和奥萝拉。佩内洛普说：“维多利亚是骑士或者杰克逊是无赖。”杰克逊说：“如果艾弗里是骑士，那么奥萝拉就是无赖。”根据艾弗里的说法，“佩内洛普是骑士当且仅当奥萝拉是无赖。”维多利亚指出：“维多利亚是骑士。”夏洛特指出：“艾弗里是无赖当且仅当佩内洛普是无赖。”正如奥萝拉所说：“艾弗里是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是无赖  \n(2) 杰克逊是骑士  \n(3) 艾弗里是无赖  \n(4) 维多利亚是无赖  \n(5) 夏洛特是骑士  \n(6) 奥萝拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：丹尼尔、格蕾丝、佩内洛普、赖利、利亚姆和本杰明。丹尼尔说：“赖利是无赖或者赖利是骑士。”格蕾丝宣称：“佩内洛普不是无赖。”根据佩内洛普的说法：“赖利是无赖并且赖利是骑士。”赖利指出：“佩内洛普是骑士并且本杰明是无赖。”利亚姆说，如果格蕾丝是无赖，那么丹尼尔就是骑士。本杰明声明：“利亚姆是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是一名骑士  \n(2) 格蕾丝是一个无赖  \n(3) 佩内洛普是一个无赖  \n(4) 赖利是一个无赖  \n(5) 利亚姆是一名骑士  \n(6) 本杰明是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：夏洛特、杰克逊、伊芙琳、艾登、艾米莉和阿梅莉亚。夏洛特说：“伊芙琳不是骑士。”杰克逊声称：“夏洛特是无赖或者伊芙琳是骑士。”伊芙琳表示，如果杰克逊是无赖，那么夏洛特就是骑士。艾登说艾登是骑士，杰克逊是无赖。“夏洛特不是无赖。”——艾米莉。阿梅莉亚告诉你，艾米莉是骑士，阿梅莉亚是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是无赖  \n(2) 杰克逊是骑士  \n(3) 伊芙琳是骑士  \n(4) 艾登是无赖  \n(5) 艾米莉是无赖  \n(6) 阿梅莉亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：杰克逊、佐伊、艾米莉、佩内洛普、夏洛特和塞缪尔。“佩内洛普不是骑士”——杰克逊说。佐伊声称：“艾米莉是无赖”。根据艾米莉的说法，“佩内洛普是骑士”。佩内洛普告诉你，杰克逊是无赖或者夏洛特是无赖。夏洛特声明：“杰克逊是骑士当且仅当艾米莉是骑士”。塞缪尔说：“杰克逊是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是一个无赖  \n(2) 佐伊是一个无赖  \n(3) 艾米莉是一个骑士  \n(4) 佩内洛普是一个骑士  \n(5) 夏洛特是一个无赖  \n(6) 塞缪尔是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：迈克尔、阿比盖尔、詹姆斯、诺亚、艾娃和欧文。迈克尔说：“如果艾娃是骑士，那么詹姆斯就是无赖。”阿比盖尔断言：“欧文是无赖当且仅当艾娃是无赖。”根据詹姆斯的说法，“迈克尔不是骑士。”诺亚说：“詹姆斯是无赖或者艾娃是无赖。”艾娃表示，迈克尔是骑士当且仅当迈克尔是无赖。欧文评论道：“迈克尔不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是一名骑士  \n(2) 阿比盖尔是一名骑士  \n(3) 詹姆斯是一个无赖  \n(4) 诺亚是一名骑士  \n(5) 艾娃是一个无赖  \n(6) 欧文是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：卢克、欧文、亨利、艾米莉、梅森和佩内洛普。卢克说：“艾米莉是无赖或者欧文是无赖。”欧文说：“梅森是骑士当且仅当卢克是骑士。”亨利说：“梅森是无赖。”艾米莉说：“梅森是骑士当且仅当梅森是无赖。”梅森说：“卢克是骑士，艾米莉是骑士。”佩内洛普说：“卢克是骑士或者佩内洛普是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 欧文是一个无赖  \n(3) 亨利是一名骑士  \n(4) 艾米莉是一个无赖  \n(5) 梅森是一个无赖  \n(6) 佩内洛普是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了六位居民：卢克、赖利、亚历山大、詹姆斯、卢卡斯和迈克尔。卢克声称：“亚历山大是个无赖。”赖利说：“詹姆斯是个骑士。”亚历山大说：“赖利是骑士当且仅当赖利是无赖。”詹姆斯说迈克尔是个骑士。卢卡斯断言：“赖利是个无赖，迈克尔是个骑士。”迈克尔的陈述是：“詹姆斯是无赖当且仅当赖利是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 赖利是一名骑士  \n(3) 亚历山大是一个无赖  \n(4) 詹姆斯是一名骑士  \n(5) 卢卡斯是一个无赖  \n(6) 迈克尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：大卫、亨利、阿比盖尔、阿梅莉亚、索菲娅和雅各布。大卫说：“亨利是骑士，阿梅莉亚是无赖。”亨利声明：“索菲娅是骑士，阿比盖尔是无赖。”阿比盖尔说：“亨利是骑士，索菲娅是骑士。”阿梅莉亚声称：“亨利不是骑士。”索菲娅提到：“如果亨利是无赖，那么大卫就是骑士。”雅各布宣称：“如果雅各布是骑士，那么索菲娅就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）大卫是无赖  \n（2）亨利是无赖  \n（3）阿比盖尔是无赖  \n（4）阿梅莉亚是骑士  \n（5）索菲娅是无赖  \n（6）雅各布是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：迈克尔、亨利、威廉、索菲娅、伊芙琳和詹姆斯。迈克尔说：“如果索菲娅是骑士，那么伊芙琳就是无赖。”亨利说：“迈克尔不是骑士。”威廉表示伊芙琳是骑士或者威廉是骑士。索菲娅说：“迈克尔是无赖，亨利是无赖。”伊芙琳宣称：“迈克尔是骑士。”詹姆斯评论道：“索菲娅不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是一名骑士  \n(2) 亨利是一个无赖  \n(3) 威廉是一名骑士  \n(4) 索菲娅是一个无赖  \n(5) 伊芙琳是一名骑士  \n(6) 詹姆斯是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：佩内洛普、大卫、詹姆斯、米娅、诺亚和斯嘉丽。佩内洛普说：“詹姆斯是骑士或者斯嘉丽是无赖。”大卫提到：“如果诺亚是骑士，那么佩内洛普就是骑士。”詹姆斯说：“如果米娅是骑士，那么佩内洛普就是无赖。”米娅评论道：“诺亚不是无赖。”诺亚宣称：“斯嘉丽是无赖，米娅也是无赖。”斯嘉丽在声明中说：“米娅不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是一名骑士  \n(2) 大卫是一名骑士  \n(3) 詹姆斯是一名骑士  \n(4) 米娅是一名无赖  \n(5) 诺亚是一名无赖  \n(6) 斯嘉丽是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：约瑟夫、伊莎贝拉、艾拉、丹尼尔、洛根和詹姆斯。约瑟夫评论道：“丹尼尔是无赖或者洛根是无赖。”伊莎贝拉说：“丹尼尔是无赖。”根据艾拉的说法：“洛根是无赖当且仅当洛根是骑士。”丹尼尔的陈述是：“洛根是无赖而艾拉是骑士。”洛根说：“丹尼尔是骑士。”詹姆斯则表示：“如果约瑟夫是骑士，那么洛根就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是骑士  \n(2) 伊莎贝拉是骑士  \n(3) 艾拉是无赖  \n(4) 丹尼尔是无赖  \n(5) 洛根是无赖  \n(6) 詹姆斯是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：杰克、卢卡斯、梅森、伊森、阿梅莉亚和利亚姆。杰克说：“梅森不是骑士。”卢卡斯说：“利亚姆是骑士或者杰克是骑士。”梅森说：“阿梅莉亚是骑士。”伊森宣称：“如果利亚姆是骑士，那么阿梅莉亚就是骑士。”阿梅莉亚被听到说：“梅森是骑士当且仅当杰克是无赖。”利亚姆说：“梅森是骑士当且仅当杰克是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克是一个无赖  \n(2) 卢卡斯是一个无赖  \n(3) 梅森是一个骑士  \n(4) 伊森是一个骑士  \n(5) 阿梅莉亚是一个骑士  \n(6) 利亚姆是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：亨利、杰克逊、艾米莉、丹尼尔、迈克尔和马修。亨利评论道：“杰克逊是骑士。”杰克逊被听到说：“艾米莉不是骑士。”艾米莉声明：“如果马修是无赖，那么马修就是骑士。”丹尼尔表示亨利是骑士，迈克尔是骑士。迈克尔断言：“迈克尔是骑士，丹尼尔是骑士。”马修的声明是：“丹尼尔是骑士，艾米莉是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是一名骑士  \n(2) 杰克逊是一名骑士  \n(3) 艾米莉是一个无赖  \n(4) 丹尼尔是一个无赖  \n(5) 迈克尔是一个无赖  \n(6) 马修是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：艾娃、哈珀、雅各布、夏洛特、艾拉和诺亚。艾娃被听到说：“夏洛特是无赖或者雅各布是无赖。”哈珀提到：“雅各布是骑士或者夏洛特是无赖。”雅各布声称：“艾拉是骑士并且夏洛特是骑士。”夏洛特在一份声明中说：“艾娃不是骑士。”艾拉指出：“艾娃是骑士并且哈珀是骑士。”诺亚断言：“如果艾娃是无赖，那么雅各布就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是一名骑士  \n(2) 哈珀是一名骑士  \n(3) 雅各布是一个无赖  \n(4) 夏洛特是一个无赖  \n(5) 艾拉是一名骑士  \n(6) 诺亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：伊莎贝拉、利亚姆、艾米莉、阿比盖尔、克洛伊和索菲娅。伊莎贝拉说：“阿比盖尔不是无赖。”利亚姆说：“阿比盖尔是骑士或者阿比盖尔是无赖。”艾米莉断言：“阿比盖尔是骑士或者阿比盖尔是无赖。”阿比盖尔说：“如果艾米莉是无赖，那么克洛伊就是无赖。”克洛伊的陈述是：“利亚姆不是无赖。”索菲娅说：“伊莎贝拉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是一名骑士  \n(2) 利亚姆是一名骑士  \n(3) 艾米莉是一名骑士  \n(4) 阿比盖尔是一名骑士  \n(5) 克洛伊是一名骑士  \n(6) 索菲娅是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：维多利亚、格蕾丝、杰克逊、利亚姆、亨利和约瑟夫。维多利亚声称：“利亚姆不是无赖。”格蕾丝指出：“如果亨利是骑士，那么维多利亚就是骑士。”杰克逊断言：“如果维多利亚是无赖，那么亨利就是无赖。”利亚姆说：“约瑟夫是骑士。”亨利声称：“杰克逊不是骑士。”约瑟夫说利亚姆是无赖或者格蕾丝是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 维多利亚是一名骑士  \n(2) 格蕾丝是一名骑士  \n(3) 杰克逊是一名骑士  \n(4) 利亚姆是一名骑士  \n(5) 亨利是一名无赖  \n(6) 约瑟夫是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：雅各布、阿丽亚、亚历山大、伊莎贝拉、奥利维亚和本杰明。雅各布说：“奥利维亚是骑士，奥利维亚是无赖。”阿丽亚提到：“如果本杰明是无赖，那么奥利维亚就是骑士。”亚历山大提到：“本杰明是无赖当且仅当亚历山大是骑士。”伊莎贝拉断言：“亚历山大是无赖。”奥利维亚说，如果亚历山大是无赖，那么雅各布就是无赖。本杰明断言：“如果伊莎贝拉是无赖，那么伊莎贝拉就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）雅各布是无赖  \n（2）阿丽亚是骑士  \n（3）亚历山大是骑士  \n（4）伊莎贝拉是无赖  \n（5）奥利维亚是骑士  \n（6）本杰明是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：阿比盖尔、威廉、伊芙琳、塞缪尔、维多利亚和索菲娅。阿比盖尔评论道：“维多利亚是无赖当且仅当维多利亚是骑士。”威廉断言：“索菲娅是无赖。”伊芙琳表示，维多利亚是无赖当且仅当塞缪尔是无赖。塞缪尔说：“伊芙琳是无赖，威廉是骑士。”维多利亚声明：“塞缪尔是无赖，维多利亚是骑士。”索菲娅评论道：“伊芙琳是无赖或者威廉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是无赖  \n(2) 威廉是无赖  \n(3) 伊芙琳是无赖  \n(4) 塞缪尔是无赖  \n(5) 维多利亚是骑士  \n(6) 索菲娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：卢克、塞巴斯蒂安、约瑟夫、莉莉、斯嘉丽和詹姆斯。卢克提到：“如果詹姆斯是无赖，那么约瑟夫就是骑士。”塞巴斯蒂安表示莉莉不是骑士。约瑟夫评论道：“如果斯嘉丽是无赖，那么莉莉就是无赖。”莉莉说道：“约瑟夫是无赖，卢克是骑士。”斯嘉丽声明：“詹姆斯是无赖，约瑟夫是无赖。”詹姆斯宣称：“斯嘉丽是骑士，塞巴斯蒂安是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 塞巴斯蒂安是一名骑士  \n(3) 约瑟夫是一名骑士  \n(4) 莉莉是一个无赖  \n(5) 斯嘉丽是一个无赖  \n(6) 詹姆斯是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：格蕾丝、杰克、丹尼尔、伊芙琳、艾拉和米娅。格蕾丝告诉你，如果伊芙琳是骑士，那么艾拉就是无赖。杰克声称：“艾拉不是骑士。”丹尼尔指出：“丹尼尔是骑士当且仅当杰克是无赖。”伊芙琳声称：“米娅是无赖当且仅当米娅是骑士。”艾拉提到：“丹尼尔不是骑士。”米娅表示：“杰克是无赖或者丹尼尔是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是一名骑士  \n(2) 杰克是一个无赖  \n(3) 丹尼尔是一个无赖  \n(4) 伊芙琳是一个无赖  \n(5) 艾拉是一名骑士  \n(6) 米娅是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：利亚姆、约瑟夫、迈克尔、雅各布、伊丽莎白和梅森。利亚姆说道：“约瑟夫是骑士，迈克尔是骑士。”约瑟夫声称：“如果利亚姆是无赖，那么利亚姆就是骑士。”迈克尔表示：“约瑟夫是骑士当且仅当雅各布是无赖。”雅各布说：“雅各布是骑士当且仅当迈克尔是无赖。”伊丽莎白表示利亚姆不是骑士。梅森声称：“约瑟夫是骑士当且仅当雅各布是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是无赖  \n(2) 约瑟夫是无赖  \n(3) 迈克尔是无赖  \n(4) 雅各布是无赖  \n(5) 伊丽莎白是骑士  \n(6) 梅森是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：利亚姆、伊芙琳、伊莎贝拉、杰克逊、艾登和索菲娅。利亚姆表示伊芙琳是骑士。伊芙琳说：“伊芙琳是骑士，伊莎贝拉是无赖。”伊莎贝拉说：“如果索菲娅是无赖，那么利亚姆就是骑士。”杰克逊说：“伊芙琳是无赖，索菲娅是骑士。”艾登说：“杰克逊是无赖，伊芙琳是骑士。”索菲娅说：“如果利亚姆是骑士，那么杰克逊就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是无赖  \n(2) 伊芙琳是无赖  \n(3) 伊莎贝拉是骑士  \n(4) 杰克逊是骑士  \n(5) 艾登是无赖  \n(6) 索菲娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：亚历山大、赖利、艾娃、夏洛特、阿梅莉亚和奥利维亚。亚历山大说：“如果赖利是无赖，那么阿梅莉亚就是无赖。”赖利声称：“艾娃是骑士当且仅当夏洛特是骑士。”艾娃说：“夏洛特不是无赖。”夏洛特的陈述是：“阿梅莉亚不是骑士。”阿梅莉亚提到：“奥利维亚是骑士或者艾娃是无赖。”奥利维亚声称：“赖利是无赖或者亚历山大是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亚历山大是一名骑士  \n(2) 赖利是一名骑士  \n(3) 艾娃是一名无赖  \n(4) 夏洛特是一名无赖  \n(5) 阿梅莉亚是一名骑士  \n(6) 奥利维亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：欧文、佐伊、格蕾丝、莉莉、卢卡斯和索菲娅。欧文宣称：“如果莉莉是无赖，那么莉莉就是骑士。”佐伊评论道：“莉莉是无赖。”格蕾丝说：“卢卡斯是无赖或者佐伊是无赖。”莉莉提到：“卢卡斯是无赖当且仅当莉莉是骑士。”卢卡斯评论道：“如果欧文是无赖，那么欧文就是骑士。”索菲娅断言：“莉莉不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是无赖  \n(2) 佐伊是骑士  \n(3) 格蕾丝是骑士  \n(4) 莉莉是无赖  \n(5) 卢卡斯是无赖  \n(6) 索菲娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：詹姆斯、索菲娅、赖利、亨利、杰克逊和佩内洛普。詹姆斯说：“如果索菲娅是骑士，那么赖利就是无赖。”索菲娅说：“佩内洛普不是骑士。”赖利声称：“詹姆斯不是无赖。”亨利说：“赖利是骑士。”杰克逊说：“亨利是无赖，索菲娅是骑士。”佩内洛普声明：“索菲娅是骑士当且仅当赖利是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是一名骑士  \n(2) 索菲娅是一名无赖  \n(3) 赖利是一名骑士  \n(4) 亨利是一名骑士  \n(5) 杰克逊是一名无赖  \n(6) 佩内洛普是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：斯嘉丽、伊莎贝拉、艾登、亚历山大、威廉和约瑟夫。在斯嘉丽的话中：“亚历山大是骑士当且仅当威廉是无赖。” “威廉是无赖当且仅当威廉是骑士” - 伊莎贝拉。“伊莎贝拉是骑士，”艾登声称。亚历山大的声明中：“斯嘉丽是无赖或者威廉是无赖。” 威廉指出：“艾登不是无赖。” “艾登不是骑士” - 约瑟夫。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 斯嘉丽是一名骑士  \n(2) 伊莎贝拉是一个无赖  \n(3) 艾登是一个无赖  \n(4) 亚历山大是一名骑士  \n(5) 威廉是一个无赖  \n(6) 约瑟夫是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：丹尼尔、莉莉、索菲娅、卢克、诺亚和艾弗里。丹尼尔说：“卢克是骑士或者诺亚是无赖。”莉莉宣称：“丹尼尔是无赖或者索菲娅是无赖。”索菲娅说诺亚是骑士或者卢克是骑士。卢克指出：“艾弗里是骑士而诺亚是无赖。”诺亚说：“卢克是骑士。”艾弗里说：“丹尼尔是无赖或者索菲娅是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是一名骑士  \n(2) 莉莉是一名骑士  \n(3) 索菲娅是一名无赖  \n(4) 卢克是一名无赖  \n(5) 诺亚是一名无赖  \n(6) 艾弗里是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：维多利亚、哈珀、亚历山大、詹姆斯、莉莉和奥利弗。维多利亚说：“亚历山大是无赖或者詹姆斯是骑士。”根据哈珀的说法，“莉莉是无赖。”亚历山大说：“奥利弗是无赖。”詹姆斯说：“詹姆斯是骑士，奥利弗是骑士。”莉莉说：“奥利弗是骑士，维多利亚是无赖。”奥利弗表示亚历山大是骑士或者詹姆斯是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 维多利亚是一名骑士  \n(2) 哈珀是一名骑士  \n(3) 亚历山大是一个无赖  \n(4) 詹姆斯是一名骑士  \n(5) 莉莉是一个无赖  \n(6) 奥利弗是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：利亚姆、艾拉、索菲娅、欧文、迈克尔和梅森。在利亚姆的话中：“索菲娅是无赖或者利亚姆是骑士。”在艾拉的话中：“索菲娅是骑士。”根据索菲娅的说法，“利亚姆不是无赖。”欧文声称：“迈克尔不是骑士。”迈克尔说：“利亚姆不是无赖。”梅森说迈克尔是无赖或者迈克尔是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是一名骑士  \n(2) 艾拉是一名骑士  \n(3) 索菲娅是一名骑士  \n(4) 欧文是一个无赖  \n(5) 迈克尔是一名骑士  \n(6) 梅森是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：奥利弗、亨利、奥利维亚、欧文、塞巴斯蒂安和阿梅莉亚。奥利弗的陈述是：“奥利维亚不是无赖。”亨利表示奥利维亚是无赖。“阿梅莉亚是无赖，奥利弗是无赖，”奥利维亚提到。欧文告诉你阿梅莉亚不是骑士。塞巴斯蒂安声明：“欧文是骑士当且仅当奥利维亚是骑士。”阿梅莉亚断言：“阿梅莉亚是骑士当且仅当塞巴斯蒂安是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利弗是无赖  \n(2) 亨利是骑士  \n(3) 奥利维亚是无赖  \n(4) 欧文是无赖  \n(5) 塞巴斯蒂安是骑士  \n(6) 阿梅莉亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：阿比盖尔、克洛伊、迈克尔、大卫、伊芙琳和索菲娅。阿比盖尔说：“大卫不是无赖。”克洛伊的话是：“阿比盖尔是骑士当且仅当索菲娅是骑士。”迈克尔评论道：“索菲娅是骑士或者克洛伊是无赖。”大卫声称：“克洛伊不是无赖。”伊芙琳说：“大卫是无赖当且仅当索菲娅是无赖。”索菲娅的声明是：“大卫是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是无赖  \n(2) 克洛伊是无赖  \n(3) 迈克尔是骑士  \n(4) 大卫是无赖  \n(5) 伊芙琳是无赖  \n(6) 索菲娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：卢克、艾米莉、亚历山大、本杰明、阿丽亚和伊芙琳。卢克说：“本杰明是骑士”。艾米莉被听到说：“伊芙琳是骑士或者亚历山大是无赖”。亚历山大说：“如果卢克是骑士，那么卢克就是无赖”。根据本杰明的说法：“如果卢克是骑士，那么艾米莉是骑士”。阿丽亚说卢克不是无赖。伊芙琳则表示：“艾米莉不是骑士”。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 艾米莉是一名骑士  \n(3) 亚历山大是一个无赖  \n(4) 本杰明是一名骑士  \n(5) 阿丽亚是一名骑士  \n(6) 伊芙琳是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：伊森、艾拉、克洛伊、阿丽亚、欧文和夏洛特。伊森说：“阿丽亚是骑士或者伊森是骑士。”艾拉被听到说：“夏洛特不是无赖。”克洛伊说：“伊森是骑士或者阿丽亚是骑士。”阿丽亚说：“克洛伊是无赖，艾拉是无赖。”欧文说：“克洛伊不是骑士。”夏洛特说：“克洛伊不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是一名骑士  \n(2) 艾拉是一名骑士  \n(3) 克洛伊是一名骑士  \n(4) 阿丽亚是一个无赖  \n(5) 欧文是一个无赖  \n(6) 夏洛特是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：奥萝拉、威廉、利亚姆、洛根、卢克和佩内洛普。奥萝拉声称：“利亚姆不是无赖。”威廉告诉你，洛根是无赖或者卢克是骑士。利亚姆说道：“卢克是无赖或者奥萝拉是无赖。”洛根断言：“奥萝拉是骑士或者利亚姆是骑士。”卢克评论道：“当且仅当利亚姆是骑士时，卢克才是骑士。”佩内洛普的陈述是：“利亚姆不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥萝拉是一名骑士  \n(2) 威廉是一个无赖  \n(3) 利亚姆是一名骑士  \n(4) 洛根是一名骑士  \n(5) 卢克是一个无赖  \n(6) 佩内洛普是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：格蕾丝、夏洛特、杰克、塞巴斯蒂安、阿比盖尔和米娅。格蕾丝的陈述是：“如果杰克是无赖，那么阿比盖尔就是无赖。”夏洛特提到：“塞巴斯蒂安不是无赖。”杰克指出：“米娅是骑士。”塞巴斯蒂安说，如果且仅如果格蕾丝是骑士，那么阿比盖尔就是骑士。阿比盖尔评论道：“夏洛特是无赖或者夏洛特是骑士。”根据米娅的说法：“阿比盖尔是骑士或者格蕾丝是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是一名骑士  \n(2) 夏洛特是一名骑士  \n(3) 杰克是一名骑士  \n(4) 塞巴斯蒂安是一名骑士  \n(5) 阿比盖尔是一名骑士  \n(6) 米娅是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：艾登、本杰明、卢卡斯、约瑟夫、阿丽亚和詹姆斯。艾登说：“詹姆斯是骑士或者本杰明是骑士。”本杰明声明：“艾登是无赖。”卢卡斯提到：“詹姆斯是骑士或者詹姆斯是无赖。”约瑟夫说：“本杰明不是无赖。”阿丽亚被听到说：“如果卢卡斯是骑士，那么约瑟夫是无赖。”詹姆斯声明：“约瑟夫是无赖当且仅当艾登是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是一名骑士  \n(2) 本杰明是一个无赖  \n(3) 卢卡斯是一名骑士  \n(4) 约瑟夫是一个无赖  \n(5) 阿丽亚是一名骑士  \n(6) 詹姆斯是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：艾娃、艾米莉、卢克、卢卡斯、哈珀和艾拉。艾娃说：“卢克是骑士当且仅当艾拉是无赖。”艾米莉声明：“如果艾米莉是骑士，那么卢克就是无赖。”卢克断言：“艾拉是骑士，艾拉是无赖。”卢卡斯声称：“哈珀是无赖，卢克是无赖。”哈珀说：“卢卡斯是无赖当且仅当艾娃是骑士。”艾拉被听到说：“如果艾米莉是骑士，那么哈珀就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是一名骑士  \n(2) 艾米莉是一名骑士  \n(3) 卢克是一个无赖  \n(4) 卢卡斯是一个无赖  \n(5) 哈珀是一名骑士  \n(6) 艾拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：阿比盖尔、莉莉、艾拉、艾米莉、索菲娅和洛根。阿比盖尔说：“索菲娅不是无赖。”莉莉表示艾拉是骑士或者洛根是骑士。“索菲娅是无赖，索菲娅是骑士，”艾拉声称。艾米莉说：“阿比盖尔是骑士。”索菲娅说：“如果索菲娅是骑士，那么莉莉是骑士。”洛根说：“索菲娅不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是一名骑士  \n(2) 莉莉是一名骑士  \n(3) 艾拉是一名无赖  \n(4) 艾米莉是一名骑士  \n(5) 索菲娅是一名骑士  \n(6) 洛根是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：艾玛、艾弗里、威廉、马修、斯嘉丽和伊森。艾玛评论道：“艾玛是骑士或者威廉是骑士。”正如艾弗里所说：“艾玛是无赖而威廉是无赖。”威廉说：“伊森是无赖。”马修声称：“艾弗里是无赖或者威廉是无赖。”在斯嘉丽的话中：“马修是无赖而伊森是骑士。”伊森说：“艾玛是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是骑士  \n(2) 艾弗里是无赖  \n(3) 威廉是无赖  \n(4) 马修是骑士  \n(5) 斯嘉丽是无赖  \n(6) 伊森是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：杰克逊、阿比盖尔、艾拉、诺亚、艾弗里和马修。杰克逊说：“阿比盖尔是无赖，阿比盖尔是骑士。”阿比盖尔指出：“艾弗里是无赖，艾弗里是骑士。”艾拉宣称：“马修是无赖或者马修是骑士。”诺亚说：“如果艾弗里是骑士，那么艾拉就是骑士。”艾弗里说：“马修是骑士。”马修声称：“如果杰克逊是骑士，那么艾拉就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是无赖  \n(2) 阿比盖尔是无赖  \n(3) 艾拉是骑士  \n(4) 诺亚是骑士  \n(5) 艾弗里是骑士  \n(6) 马修是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：斯嘉丽、卢克、佩内洛普、米娅、赖利和诺亚。在斯嘉丽的话中：“卢克是骑士当且仅当斯嘉丽是骑士。”卢克说：“斯嘉丽是骑士。”在佩内洛普的话中：“赖利是无赖或者卢克是无赖。”米娅声明：“诺亚是骑士或者卢克是无赖。”赖利指出：“米娅是骑士当且仅当卢克是无赖。”诺亚表示米娅是骑士当且仅当赖利是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 斯嘉丽是一名骑士  \n(2) 卢克是一名骑士  \n(3) 佩内洛普是一个无赖  \n(4) 米娅是一个无赖  \n(5) 赖利是一名骑士  \n(6) 诺亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：哈珀、梅森、大卫、欧文、克洛伊和佐伊。哈珀说：“佐伊不是无赖。”梅森说欧文是无赖或者佐伊是骑士。大卫评论道：“如果克洛伊是骑士，那么哈珀就是骑士。”欧文说：“哈珀是骑士，克洛伊是骑士。”正如克洛伊所说：“梅森是骑士，哈珀是无赖。”佐伊被听到说：“佐伊是骑士，克洛伊是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是无赖  \n(2) 梅森是骑士  \n(3) 大卫是无赖  \n(4) 欧文是无赖  \n(5) 克洛伊是骑士  \n(6) 佐伊是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：伊芙琳、亚历山大、奥萝拉、欧文、梅森和洛根。伊芙琳声称：“梅森是骑士，洛根是无赖。”亚历山大声称：“洛根是无赖，伊芙琳是骑士。”奥萝拉告诉你，如果亚历山大是骑士，那么洛根就是骑士。“洛根是无赖，奥萝拉是无赖，”欧文声称。“亚历山大是无赖当且仅当欧文是骑士，”梅森提到。洛根声称：“奥萝拉不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是无赖  \n(2) 亚历山大是无赖  \n(3) 奥萝拉是骑士  \n(4) 欧文是无赖  \n(5) 梅森是无赖  \n(6) 洛根是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：迈克尔、阿丽亚、伊芙琳、伊森、索菲娅和奥萝拉。“奥萝拉是骑士或者伊芙琳是无赖”——迈克尔说。阿丽亚的陈述是：“索菲娅是骑士，伊森是骑士”。有人听到伊芙琳说：“迈克尔是骑士”。“索菲娅是骑士，阿丽亚是骑士”——伊森说。索菲娅告诉你，如果迈克尔是骑士，那么奥萝拉就是无赖。奥萝拉声称：“索菲娅是无赖或者迈克尔是骑士”。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是一名骑士  \n(2) 阿丽亚是一个无赖  \n(3) 伊芙琳是一名骑士  \n(4) 伊森是一个无赖  \n(5) 索菲娅是一个无赖  \n(6) 奥萝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：佩内洛普、詹姆斯、诺亚、塞缪尔、克洛伊和阿比盖尔。佩内洛普说道：“诺亚不是骑士。”詹姆斯宣称：“塞缪尔是无赖或者塞缪尔是骑士。”诺亚说：“克洛伊不是骑士。”塞缪尔说道：“诺亚是无赖当且仅当佩内洛普是骑士。”克洛伊说：“佩内洛普是骑士或者佩内洛普是无赖。”阿比盖尔宣称：“诺亚是骑士当且仅当詹姆斯是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是一名骑士  \n(2) 詹姆斯是一名骑士  \n(3) 诺亚是一名无赖  \n(4) 塞缪尔是一名骑士  \n(5) 克洛伊是一名骑士  \n(6) 阿比盖尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：塞缪尔、奥利弗、索菲娅、约瑟夫、奥利维亚和米娅。塞缪尔评论道：“约瑟夫是骑士，奥利弗是无赖。”根据奥利弗的说法：“如果约瑟夫是无赖，那么奥利弗就是骑士。”索菲娅表示，只有当约瑟夫是无赖时，奥利维亚才是骑士。“米娅是骑士，”约瑟夫声称。奥利维亚告诉你，约瑟夫是骑士，塞缪尔是骑士。在米娅的话中：“奥利维亚是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是无赖  \n(2) 奥利弗是骑士  \n(3) 索菲娅是骑士  \n(4) 约瑟夫是骑士  \n(5) 奥利维亚是无赖  \n(6) 米娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：艾娃、大卫、索菲娅、奥萝拉、阿梅莉亚和斯嘉丽。艾娃提到：“大卫是无赖或者斯嘉丽是骑士。”大卫表示：“如果大卫是骑士，那么阿梅莉亚是骑士。”索菲娅被听到说：“斯嘉丽不是无赖。”奥萝拉声明：“艾娃是无赖，斯嘉丽是无赖。”阿梅莉亚声称：“索菲娅是骑士。”斯嘉丽指出：“如果索菲娅是无赖，那么艾娃是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是一名骑士  \n(2) 大卫是一名骑士  \n(3) 索菲娅是一名骑士  \n(4) 奥萝拉是一名无赖  \n(5) 阿梅莉亚是一名骑士  \n(6) 斯嘉丽是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：卢克、艾玛、艾米莉、伊芙琳、艾登和莉莉。卢克说：“艾登是无赖或者艾米莉是骑士。”艾玛评论道：“艾米莉是骑士当且仅当艾登是无赖。”艾米莉表示卢克是无赖或者伊芙琳是无赖。“如果伊芙琳是骑士，那么卢克就是骑士。”——伊芙琳。“莉莉是无赖或者艾登是骑士。”——艾登。“艾米莉是无赖而伊芙琳是骑士，”莉莉声称。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 艾玛是一个无赖  \n(3) 艾米莉是一个无赖  \n(4) 伊芙琳是一名骑士  \n(5) 艾登是一个无赖  \n(6) 莉莉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：艾弗里、洛根、佩内洛普、伊丽莎白、佐伊和赖利。艾弗里说道：“如果佩内洛普是骑士，那么佐伊就是骑士。”洛根被听到说：“赖利是无赖当且仅当佐伊是骑士。”佩内洛普说：“佐伊是骑士当且仅当洛根是骑士。”伊丽莎白说：“佐伊不是无赖。”佐伊宣称：“佩内洛普不是骑士。”赖利的陈述是：“洛根是骑士，佐伊是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是无赖  \n(2) 洛根是无赖  \n(3) 佩内洛普是骑士  \n(4) 伊丽莎白是无赖  \n(5) 佐伊是无赖  \n(6) 赖利是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：哈珀、诺亚、詹姆斯、梅森、艾娃和艾米莉。哈珀声称：“艾米莉是无赖，诺亚是骑士。”诺亚说：“詹姆斯是无赖当且仅当哈珀是无赖。”詹姆斯则表示：“诺亚是无赖当且仅当哈珀是无赖。”梅森说：“詹姆斯不是无赖。”艾娃说：“艾米莉是骑士或者哈珀是骑士。”艾米莉提到：“詹姆斯不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是无赖  \n(2) 诺亚是无赖  \n(3) 詹姆斯是骑士  \n(4) 梅森是骑士  \n(5) 艾娃是骑士  \n(6) 艾米莉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：詹姆斯、杰克、维多利亚、奥利维亚、艾玛和索菲娅。詹姆斯说：“索菲娅是无赖或者维多利亚是无赖。”杰克表示：“艾玛是骑士当且仅当索菲娅是骑士。”维多利亚的陈述是：“詹姆斯是骑士当且仅当艾玛是无赖。”奥利维亚说：“杰克是骑士。”艾玛提到：“维多利亚是骑士而索菲娅是骑士。”索菲娅表示奥利维亚是骑士而维多利亚是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是一名骑士  \n(2) 杰克是一名骑士  \n(3) 维多利亚是一名骑士  \n(4) 奥利维亚是一名骑士  \n(5) 艾玛是一名无赖  \n(6) 索菲娅是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：哈珀、佐伊、艾娃、威廉、艾玛和伊森。哈珀声称：“威廉是无赖或者伊森是无赖。”佐伊说：“艾娃是骑士，哈珀是骑士。”根据艾娃的说法，“伊森是无赖，威廉是骑士。”威廉宣称：“伊森是无赖，佐伊是无赖。”艾玛表示：“伊森是无赖当且仅当佐伊是无赖。”伊森说：“伊森是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是一名骑士  \n(2) 佐伊是一个无赖  \n(3) 艾娃是一个无赖  \n(4) 威廉是一个无赖  \n(5) 艾玛是一个无赖  \n(6) 伊森是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了六位居民：维多利亚、卢卡斯、艾登、克洛伊、詹姆斯和哈珀。维多利亚宣称：“克洛伊是无赖。”卢卡斯宣称：“如果哈珀是骑士，那么卢卡斯就是骑士。”艾登说：“克洛伊是无赖当且仅当詹姆斯是骑士。”克洛伊说维多利亚是无赖或者詹姆斯是骑士。在詹姆斯的陈述中：“如果维多利亚是骑士，那么克洛伊就是无赖。”哈珀指出：“詹姆斯是无赖当且仅当克洛伊是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 维多利亚是无赖  \n(2) 卢卡斯是骑士  \n(3) 艾登是无赖  \n(4) 克洛伊是骑士  \n(5) 詹姆斯是骑士  \n(6) 哈珀是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：塞缪尔、佐伊、伊莎贝拉、洛根、迈克尔和威廉。塞缪尔指出：“伊莎贝拉是无赖当且仅当迈克尔是骑士。”佐伊告诉你：“伊莎贝拉是无赖当且仅当威廉是无赖。”伊莎贝拉的陈述是：“佐伊是骑士或者塞缪尔是骑士。”洛根说：“如果佐伊是无赖，那么洛根是骑士。”根据迈克尔的说法：“伊莎贝拉是骑士并且迈克尔是骑士。”威廉评论道：“迈克尔是骑士当且仅当威廉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是无赖  \n(2) 佐伊是骑士  \n(3) 伊莎贝拉是骑士  \n(4) 洛根是骑士  \n(5) 迈克尔是骑士  \n(6) 威廉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：马修、索菲娅、詹姆斯、伊莎贝拉、雅各布和伊芙琳。马修声称：“伊芙琳是骑士，伊莎贝拉是无赖。”索菲娅提到：“詹姆斯是骑士或者詹姆斯是无赖。”詹姆斯说：“马修是骑士，雅各布是骑士。”伊莎贝拉宣称：“如果雅各布是无赖，那么索菲娅就是无赖。”雅各布告诉你他是骑士。伊芙琳说：“马修不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是无赖  \n(2) 索菲娅是骑士  \n(3) 詹姆斯是无赖  \n(4) 伊莎贝拉是骑士  \n(5) 雅各布是骑士  \n(6) 伊芙琳是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：雅各布、艾娃、奥利弗、威廉、克洛伊和大卫。雅各布表示，如果大卫是无赖，那么艾娃就是无赖。艾娃声称：“大卫是骑士，而大卫是无赖。”奥利弗说道：“如果威廉是无赖，那么大卫就是无赖。”威廉声称：“雅各布是无赖，而奥利弗是骑士。”根据克洛伊的说法，“奥利弗是骑士。”大卫告诉你，艾娃是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）雅各布是一名骑士  \n（2）艾娃是一个无赖  \n（3）奥利弗是一个无赖  \n（4）威廉是一个无赖  \n（5）克洛伊是一个无赖  \n（6）大卫是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：詹姆斯、梅森、雅各布、佩内洛普、哈珀和艾玛。詹姆斯评论道：“佩内洛普是无赖或者雅各布是骑士。”梅森说：“哈珀是骑士。”雅各布告诉你，如果梅森是无赖，那么梅森就是骑士。佩内洛普被听到说：“哈珀是无赖，艾玛是无赖。”根据哈珀的说法：“艾玛是骑士或者詹姆斯是骑士。”艾玛表示，如果哈珀是骑士，那么詹姆斯就是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）詹姆斯是一名骑士  \n（2）梅森是一名骑士  \n（3）雅各布是一名骑士  \n（4）佩内洛普是一名无赖  \n（5）哈珀是一名骑士  \n（6）艾玛是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：奥利维亚、米娅、艾娃、奥利弗、赖利和杰克逊。在奥利维亚的话中：“米娅是无赖当且仅当奥利弗是无赖。”根据米娅的说法，“艾娃是骑士或者米娅是骑士。”根据艾娃的说法，“赖利是无赖或者奥利弗是骑士。”奥利弗说米娅是骑士或者艾娃是骑士。在赖利的陈述中：“如果杰克逊是无赖，那么杰克逊就是骑士。”杰克逊指出：“奥利维亚是骑士当且仅当奥利维亚是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是一名骑士  \n(2) 米娅是一名骑士  \n(3) 艾娃是一名骑士  \n(4) 奥利弗是一名骑士  \n(5) 赖利是一名无赖  \n(6) 杰克逊是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：大卫、艾娃、奥萝拉、艾拉、洛根和卢克。大卫告诉你，卢克是骑士当且仅当艾娃是无赖。“如果卢克是无赖，那么洛根就是骑士，”艾娃提到。奥萝拉表示，如果大卫是骑士，那么艾娃就是骑士。艾拉表示，洛根是无赖或者卢克是骑士。“艾娃是骑士或者大卫是骑士，”洛根声称。卢克断言：“奥萝拉是无赖或者洛根是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 大卫是一名骑士  \n(2) 艾娃是一名骑士  \n(3) 奥萝拉是一名骑士  \n(4) 艾拉是一个无赖  \n(5) 洛根是一名骑士  \n(6) 卢克是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：阿比盖尔、阿丽亚、塞巴斯蒂安、亨利、艾娃和本杰明。正如阿比盖尔所说：“阿丽亚是骑士当且仅当本杰明是无赖。”阿丽亚告诉你，阿丽亚是骑士或者本杰明是无赖。“艾娃是无赖或者亨利是骑士，”塞巴斯蒂安宣称。亨利被听到说：“艾娃是骑士并且本杰明是骑士。”艾娃说：“本杰明是无赖并且阿比盖尔是骑士。”本杰明说：“如果阿比盖尔是骑士，那么艾娃是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是无赖  \n(2) 阿丽亚是骑士  \n(3) 塞巴斯蒂安是骑士  \n(4) 亨利是无赖  \n(5) 艾娃是无赖  \n(6) 本杰明是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：塞缪尔、梅森、本杰明、索菲娅、哈珀和阿丽亚。塞缪尔说：“阿丽亚是骑士。”梅森说：“本杰明是无赖当且仅当阿丽亚是骑士。”根据本杰明的说法，“塞缪尔是骑士或者索菲娅是骑士。”索菲娅评论道：“阿丽亚是骑士或者哈珀是无赖。”哈珀被听到说：“哈珀是骑士。”阿丽亚被听到说：“如果本杰明是骑士，那么本杰明是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是无赖  \n(2) 梅森是骑士  \n(3) 本杰明是骑士  \n(4) 索菲娅是骑士  \n(5) 哈珀是无赖  \n(6) 阿丽亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：哈珀、威廉、阿丽亚、塞缪尔、卢卡斯和梅森。哈珀说：“卢卡斯是无赖，塞缪尔是无赖。”威廉说梅森是无赖，塞缪尔是骑士。阿丽亚表示哈珀是骑士，梅森是骑士。塞缪尔声明：“阿丽亚不是无赖。”卢卡斯表示梅森是无赖或者威廉是无赖。梅森告诉你哈珀不是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是无赖  \n(2) 威廉是无赖  \n(3) 阿丽亚是无赖  \n(4) 塞缪尔是无赖  \n(5) 卢卡斯是骑士  \n(6) 梅森是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：迈克尔、艾玛、克洛伊、佐伊、亚历山大和艾拉。迈克尔说：“如果佐伊是骑士，那么克洛伊就是无赖。”艾玛指出：“克洛伊是无赖或者佐伊是无赖。”克洛伊告诉你，迈克尔是无赖或者艾玛是无赖。佐伊说：“迈克尔不是无赖。”亚历山大声明：“克洛伊是无赖。”根据艾拉的说法，“克洛伊是骑士或者亚历山大是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是一名骑士  \n(2) 艾玛是一名骑士  \n(3) 克洛伊是一名无赖  \n(4) 佐伊是一名骑士  \n(5) 亚历山大是一名骑士  \n(6) 艾拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：米娅、克洛伊、大卫、夏洛特、伊丽莎白和奥利维亚。米娅说：“米娅是骑士或者奥利维亚是无赖。”克洛伊说夏洛特是骑士。大卫说：“伊丽莎白是无赖。”夏洛特说：“克洛伊是骑士当且仅当米娅是无赖。”伊丽莎白宣称：“米娅是骑士或者奥利维亚是骑士。”奥利维亚被听到说：“夏洛特是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是无赖  \n(2) 克洛伊是骑士  \n(3) 大卫是无赖  \n(4) 夏洛特是骑士  \n(5) 伊丽莎白是骑士  \n(6) 奥利维亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：卢克、卢卡斯、丹尼尔、斯嘉丽、格蕾丝和塞缪尔。根据卢克的说法：“如果斯嘉丽是无赖，那么卢克就是骑士。”卢卡斯声称：“如果格蕾丝是骑士，那么斯嘉丽就是无赖。”丹尼尔被听到说：“卢卡斯是无赖或者卢克是骑士。”斯嘉丽评论道：“丹尼尔是无赖。”在格蕾丝的一份声明中：“斯嘉丽是骑士。”塞缪尔提到：“如果卢克是骑士，那么丹尼尔就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 卢卡斯是一名骑士  \n(3) 丹尼尔是一名骑士  \n(4) 斯嘉丽是一名无赖  \n(5) 格蕾丝是一名无赖  \n(6) 塞缪尔是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：艾米莉、欧文、米娅、本杰明、马修和伊莎贝拉。艾米莉说：“如果米娅是无赖，那么伊莎贝拉就是无赖。”欧文评论道：“本杰明是无赖。”米娅声称：“欧文不是骑士。”根据本杰明的说法：“马修是无赖或者本杰明是骑士。”马修说：“如果本杰明是无赖，那么伊莎贝拉就是骑士。”伊莎贝拉被听到说：“如果欧文是骑士，那么欧文就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是骑士  \n(2) 欧文是无赖  \n(3) 米娅是骑士  \n(4) 本杰明是骑士  \n(5) 马修是骑士  \n(6) 伊莎贝拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：艾米莉、夏洛特、詹姆斯、卢卡斯、伊芙琳和阿梅莉亚。根据艾米莉的说法：“如果阿梅莉亚是骑士，那么卢卡斯就是无赖。”夏洛特声称：“阿梅莉亚是无赖。”詹姆斯说：“夏洛特不是骑士。”卢卡斯表示：“阿梅莉亚是骑士，夏洛特是骑士。”伊芙琳说：“夏洛特是骑士。”阿梅莉亚说：“艾米莉是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是一名骑士  \n(2) 夏洛特是一名骑士  \n(3) 詹姆斯是一个无赖  \n(4) 卢卡斯是一个无赖  \n(5) 伊芙琳是一名骑士  \n(6) 阿梅莉亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：约瑟夫、索菲娅、艾娃、阿梅莉亚、阿比盖尔和利亚姆。约瑟夫说：“如果艾娃是骑士，那么约瑟夫就是骑士。”索菲娅表示阿比盖尔是骑士或者阿梅莉亚是无赖。艾娃表示阿比盖尔是无赖而阿梅莉亚是骑士。阿梅莉亚声明：“约瑟夫是无赖而利亚姆是无赖。”根据阿比盖尔的说法：“艾娃是无赖当且仅当索菲娅是无赖。”利亚姆声称：“阿梅莉亚不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是一名骑士  \n(2) 索菲娅是一名骑士  \n(3) 艾娃是一名无赖  \n(4) 阿梅莉亚是一名无赖  \n(5) 阿比盖尔是一名无赖  \n(6) 利亚姆是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：奥利弗、佩内洛普、米娅、卢卡斯、索菲娅和迈克尔。根据奥利弗的说法，“卢卡斯是无赖，佩内洛普是骑士”。佩内洛普说：“如果佩内洛普是骑士，那么奥利弗就是骑士”。米娅断言：“卢卡斯不是骑士”。卢卡斯说索菲娅是骑士，奥利弗是骑士。“迈克尔是骑士或者索菲娅是骑士”——索菲娅。迈克尔告诉你，奥利弗是骑士，佩内洛普是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利弗是一名骑士  \n(2) 佩内洛普是一名骑士  \n(3) 米娅是一名骑士  \n(4) 卢卡斯是一名无赖  \n(5) 索菲娅是一名无赖  \n(6) 迈克尔是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：阿比盖尔、艾米莉、洛根、丹尼尔、艾登和艾玛。阿比盖尔声称：“丹尼尔是无赖当且仅当洛根是骑士。”艾米莉评论道：“洛根是骑士。”洛根说：“如果艾登是骑士，那么丹尼尔就是无赖。”丹尼尔说道：“洛根不是骑士。”艾登被听到说：“阿比盖尔是无赖。”在艾玛的话中：“艾登是无赖，洛根是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是一名骑士  \n(2) 艾米莉是一名骑士  \n(3) 洛根是一名骑士  \n(4) 丹尼尔是一个无赖  \n(5) 艾登是一个无赖  \n(6) 艾玛是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：艾拉、亚历山大、塞缪尔、诺亚、卢克和大卫。艾拉说：“亚历山大不是骑士。”亚历山大评论道：“艾拉是骑士或者卢克是无赖。”塞缪尔声明：“卢克是无赖。”诺亚提到：“如果艾拉是无赖，那么卢克就是无赖。”卢克说：“诺亚是骑士，塞缪尔是无赖。”大卫声称：“艾拉是无赖，艾拉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是无赖  \n(2) 亚历山大是骑士  \n(3) 塞缪尔是骑士  \n(4) 诺亚是骑士  \n(5) 卢克是无赖  \n(6) 大卫是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：佐伊、丹尼尔、卢卡斯、艾娃、欧文和阿梅莉亚。佐伊说：“如果阿梅莉亚是骑士，那么艾娃就是骑士。”丹尼尔告诉你，欧文是无赖或者丹尼尔是骑士。卢卡斯说：“丹尼尔不是骑士。”艾娃声明：“佐伊是无赖。”根据欧文的说法：“欧文是骑士或者佐伊是骑士。”根据阿梅莉亚的说法：“丹尼尔是骑士并且佐伊是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佐伊是一名骑士  \n(2) 丹尼尔是一个无赖  \n(3) 卢卡斯是一名骑士  \n(4) 艾娃是一个无赖  \n(5) 欧文是一名骑士  \n(6) 阿梅莉亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：詹姆斯、卢克、阿比盖尔、梅森、维多利亚和佐伊。詹姆斯说：“卢克是骑士，梅森是无赖。”卢克说：“维多利亚是无赖，或者阿比盖尔是无赖。”阿比盖尔表示：“如果维多利亚是骑士，那么阿比盖尔就是骑士。”梅森声称：“维多利亚是无赖，或者詹姆斯是骑士。”维多利亚提到：“如果詹姆斯是无赖，那么阿比盖尔就是骑士。”佐伊说：“卢克是无赖，维多利亚是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）詹姆斯是无赖  \n（2）卢克是无赖  \n（3）阿比盖尔是骑士  \n（4）梅森是无赖  \n（5）维多利亚是骑士  \n（6）佐伊是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：索菲娅、阿丽亚、欧文、伊芙琳、本杰明和艾拉。索菲娅告诉你，索菲娅是骑士当且仅当伊芙琳是无赖。阿丽亚说：“艾拉是无赖，而阿丽亚是骑士。”欧文指出：“索菲娅是骑士。”伊芙琳的陈述是：“艾拉是骑士。”本杰明断言：“索菲娅不是无赖。”艾拉表示，如果本杰明是骑士，那么阿丽亚就是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 阿丽亚是一名骑士  \n(3) 欧文是一名骑士  \n(4) 伊芙琳是一名无赖  \n(5) 本杰明是一名骑士  \n(6) 艾拉是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：亚历山大、丹尼尔、迈克尔、雅各布、阿丽亚和本杰明。亚历山大说：“本杰明是骑士，雅各布是骑士。”丹尼尔宣称：“如果丹尼尔是骑士，那么雅各布就是无赖。”迈克尔说：“如果雅各布是骑士，那么亚历山大就是无赖。”雅各布说：“如果亚历山大是无赖，那么丹尼尔就是无赖。”阿丽亚评论道：“雅各布不是无赖。”本杰明指出：“阿丽亚是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亚历山大是无赖  \n(2) 丹尼尔是骑士  \n(3) 迈克尔是骑士  \n(4) 雅各布是无赖  \n(5) 阿丽亚是无赖  \n(6) 本杰明是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：本杰明、克洛伊、维多利亚、伊莎贝拉、艾拉和艾米莉。本杰明说：“克洛伊不是骑士。”克洛伊被听到说：“克洛伊是骑士。”维多利亚宣称：“克洛伊是无赖，艾米莉是无赖。”伊莎贝拉告诉你本杰明是骑士。艾拉评论道：“本杰明不是无赖。”艾米莉断言：“克洛伊是无赖当且仅当维多利亚是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是无赖  \n(2) 克洛伊是骑士  \n(3) 维多利亚是无赖  \n(4) 伊莎贝拉是无赖  \n(5) 艾拉是无赖  \n(6) 艾米莉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：索菲娅、威廉、阿丽亚、伊丽莎白、欧文和卢卡斯。索菲娅声称：“如果伊丽莎白是无赖，那么阿丽亚就是无赖。”威廉宣称：“欧文是骑士或者卢卡斯是无赖。”阿丽亚评论道：“卢卡斯不是骑士。”伊丽莎白说阿丽亚不是无赖。在欧文的话中：“索菲娅是无赖当且仅当索菲娅是骑士。”卢卡斯说：“欧文是骑士，卢卡斯是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 威廉是一名骑士  \n(3) 阿丽亚是一名骑士  \n(4) 伊丽莎白是一名骑士  \n(5) 欧文是一个无赖  \n(6) 卢卡斯是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：迈克尔、本杰明、塞巴斯蒂安、格蕾丝、伊森和阿丽亚。迈克尔声称：“伊森是无赖或者迈克尔是骑士。”本杰明说道：“如果迈克尔是无赖，那么阿丽亚就是无赖。”塞巴斯蒂安说：“本杰明是骑士。”根据格蕾丝的说法，“塞巴斯蒂安是无赖，阿丽亚是骑士。”有人听到伊森说：“迈克尔是骑士。”阿丽亚则表示：“伊森是骑士或者本杰明是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是一名骑士  \n(2) 本杰明是一名骑士  \n(3) 塞巴斯蒂安是一名骑士  \n(4) 格蕾丝是一名无赖  \n(5) 伊森是一名骑士  \n(6) 阿丽亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：卢卡斯、艾登、索菲娅、亚历山大、米娅和佐伊。卢卡斯宣称：“如果艾登是骑士，那么米娅就是骑士。”艾登指出：“索菲娅是无赖当且仅当卢卡斯是骑士。”索菲娅说亚历山大是骑士或者亚历山大是无赖。亚历山大说：“米娅是无赖当且仅当索菲娅是无赖。”米娅评论道：“佐伊不是骑士。”佐伊说索菲娅是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是一名骑士  \n(2) 艾登是一个无赖  \n(3) 索菲娅是一名骑士  \n(4) 亚历山大是一名骑士  \n(5) 米娅是一名骑士  \n(6) 佐伊是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：阿比盖尔、艾娃、索菲娅、索菲娅、赖利和大卫。“索菲娅不是骑士，”阿比盖尔声称。“索菲娅是无赖，艾娃是骑士，”艾娃提到。索菲娅说赖利不是骑士。索菲娅指出：“索菲娅是无赖或者大卫是无赖。”赖利断言：“索菲娅是骑士或者阿比盖尔是骑士。”大卫表示艾娃是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是一名骑士  \n(2) 艾娃是一个无赖  \n(3) 索菲娅是一个无赖  \n(4) 索菲娅是一名骑士  \n(5) 赖利是一名骑士  \n(6) 大卫是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：艾拉、佩内洛普、利亚姆、雅各布、格蕾丝和詹姆斯。“佩内洛普是无赖或者利亚姆是无赖，”艾拉宣称。佩内洛普说利亚姆是无赖，詹姆斯是无赖。利亚姆评论道：“佩内洛普是无赖。” “格蕾丝是骑士或者詹姆斯是骑士，”雅各布提到。在格蕾丝的陈述中：“艾拉是骑士或者格蕾丝是骑士。”在詹姆斯的陈述中：“雅各布是无赖或者雅各布是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是一名骑士  \n(2) 佩内洛普是一名无赖  \n(3) 利亚姆是一名骑士  \n(4) 雅各布是一名骑士  \n(5) 格蕾丝是一名骑士  \n(6) 詹姆斯是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：米娅、詹姆斯、艾玛、梅森、艾拉和哈珀。“哈珀不是骑士，”米娅提到。“哈珀是骑士，”詹姆斯声称。艾玛断言：“艾玛是骑士，梅森是骑士。”梅森表示：“艾玛是无赖当且仅当艾拉是无赖。”艾拉评论道：“哈珀不是骑士。”根据哈珀的说法，“梅森是骑士或者詹姆斯是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是无赖  \n(2) 詹姆斯是骑士  \n(3) 艾玛是无赖  \n(4) 梅森是骑士  \n(5) 艾拉是无赖  \n(6) 哈珀是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：欧文、塞缪尔、约瑟夫、索菲娅、奥利维亚和佐伊。欧文说：“奥利维亚是骑士当且仅当佐伊是骑士。”塞缪尔说奥利维亚不是无赖。约瑟夫说：“如果佐伊是骑士，那么索菲娅就是无赖。”索菲娅断言：“奥利维亚是无赖当且仅当约瑟夫是无赖。”奥利维亚说：“佐伊是无赖。”佐伊断言：“约瑟夫是无赖当且仅当欧文是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是无赖  \n(2) 塞缪尔是无赖  \n(3) 约瑟夫是骑士  \n(4) 索菲娅是无赖  \n(5) 奥利维亚是无赖  \n(6) 佐伊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：艾拉、克洛伊、利亚姆、约瑟夫、大卫和艾玛。艾拉评论道：“艾玛不是骑士。”根据克洛伊的说法，“约瑟夫是无赖或者克洛伊是骑士。”利亚姆声称：“约瑟夫是骑士，艾拉是骑士。”约瑟夫评论道：“克洛伊不是无赖。”大卫说：“艾玛是骑士，艾拉是骑士。”艾玛表示：“克洛伊是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是一名骑士  \n(2) 克洛伊是一名骑士  \n(3) 利亚姆是一名骑士  \n(4) 约瑟夫是一名骑士  \n(5) 大卫是一名无赖  \n(6) 艾玛是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：诺亚、艾米莉、克洛伊、大卫、卢克和奥利维亚。诺亚的陈述是：“大卫是骑士当且仅当艾米莉是无赖。”艾米莉说：“诺亚不是无赖。”克洛伊声明：“大卫是无赖，艾米莉是骑士。”大卫指出：“诺亚不是无赖。”卢克声明：“奥利维亚是无赖。”奥利维亚评论道：“克洛伊不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是无赖  \n(2) 艾米莉是无赖  \n(3) 克洛伊是无赖  \n(4) 大卫是无赖  \n(5) 卢克是无赖  \n(6) 奥利维亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：伊莎贝拉、艾拉、佐伊、艾米莉、梅森和奥利维亚。伊莎贝拉表示艾拉是无赖，艾米莉是骑士。艾拉提到：“艾拉是骑士或者艾米莉是无赖。”佐伊说：“如果艾拉是无赖，那么佐伊就是骑士。”在艾米莉的陈述中：“梅森是无赖当且仅当奥利维亚是无赖。”梅森表示：“艾拉是骑士，佐伊是无赖。”在奥利维亚的陈述中：“如果伊莎贝拉是无赖，那么艾拉就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是无赖  \n(2) 艾拉是骑士  \n(3) 佐伊是骑士  \n(4) 艾米莉是骑士  \n(5) 梅森是无赖  \n(6) 奥利维亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：塞巴斯蒂安、艾米莉、艾弗里、奥萝拉、艾娃和索菲娅。根据塞巴斯蒂安的说法：“如果艾米莉是无赖，那么艾娃就是骑士。”艾米莉表示索菲娅是骑士或者艾弗里是无赖。有人听到艾弗里说：“艾娃是无赖或者奥萝拉是无赖。”奥萝拉在声明中说：“索菲娅是无赖而奥萝拉是骑士。”有人听到艾娃说：“艾米莉不是骑士。”有人听到索菲娅说：“艾弗里是无赖或者艾弗里是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）塞巴斯蒂安是一名骑士  \n（2）艾米莉是一名骑士  \n（3）艾弗里是一名骑士  \n（4）奥萝拉是一名无赖  \n（5）艾娃是一名无赖  \n（6）索菲娅是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：威廉、利亚姆、奥利维亚、阿比盖尔、亨利和洛根。威廉表示，亨利是骑士当且仅当威廉是骑士。利亚姆说：“洛根是骑士当且仅当奥利维亚是骑士。”奥利维亚说：“洛根是骑士或者威廉是无赖。”阿比盖尔声明：“威廉是骑士当且仅当奥利维亚是无赖。”亨利说利亚姆是骑士，威廉是骑士。“亨利是骑士或者奥利维亚是骑士，”洛根宣称。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 利亚姆是一名骑士  \n(3) 奥利维亚是一名骑士  \n(4) 阿比盖尔是一名无赖  \n(5) 亨利是一名骑士  \n(6) 洛根是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：艾玛、本杰明、约瑟夫、梅森、艾娃和大卫。艾玛告诉你，本杰明是骑士。本杰明被听到说：“大卫是骑士。”约瑟夫提到：“约瑟夫是骑士或者大卫是骑士。”梅森说：“本杰明是骑士，艾玛是无赖。”艾娃声称：“如果艾娃是骑士，那么约瑟夫就是无赖。”大卫声明：“本杰明是骑士，约瑟夫是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是无赖  \n(2) 本杰明是无赖  \n(3) 约瑟夫是无赖  \n(4) 梅森是无赖  \n(5) 艾娃是骑士  \n(6) 大卫是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：亚历山大、米娅、莉莉、艾娃、伊莎贝拉和艾登。亚历山大评论道：“伊莎贝拉不是无赖。”米娅说：“亚历山大是骑士当且仅当伊莎贝拉是骑士。”莉莉提到：“亚历山大是无赖。”艾娃说：“如果艾登是骑士，那么米娅就是无赖。”伊莎贝拉宣称：“艾登是骑士或者艾登是无赖。”艾登断言：“米娅是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亚历山大是一名骑士  \n(2) 米娅是一名骑士  \n(3) 莉莉是一个无赖  \n(4) 艾娃是一个无赖  \n(5) 伊莎贝拉是一名骑士  \n(6) 艾登是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：莉莉、雅各布、卢克、迈克尔、欧文和艾弗里。莉莉的陈述是：“如果雅各布是无赖，那么艾弗里就是无赖。”雅各布说：“莉莉不是骑士。”卢克说：“迈克尔是骑士。”迈克尔的话是：“莉莉不是无赖。”欧文评论道：“艾弗里是骑士，莉莉也是骑士。”艾弗里指出：“如果且仅如果莉莉是骑士，卢克就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是骑士  \n(2) 雅各布是无赖  \n(3) 卢克是骑士  \n(4) 迈克尔是骑士  \n(5) 欧文是无赖  \n(6) 艾弗里是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：奥利弗、诺亚、维多利亚、艾拉、阿梅莉亚和伊森。奥利弗说：“艾拉是无赖或者阿梅莉亚是骑士。”诺亚说：“奥利弗不是无赖。”维多利亚提到：“诺亚是无赖当且仅当阿梅莉亚是无赖。”艾拉说：“维多利亚是骑士或者艾拉是骑士。”阿梅莉亚的陈述是：“奥利弗是骑士而维多利亚是无赖。”伊森说：“维多利亚是无赖而维多利亚是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利弗是无赖  \n(2) 诺亚是无赖  \n(3) 维多利亚是骑士  \n(4) 艾拉是骑士  \n(5) 阿梅莉亚是无赖  \n(6) 伊森是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：艾娃、夏洛特、艾拉、杰克逊、欧文和阿梅莉亚。艾娃说：“夏洛特是无赖，欧文是无赖。”夏洛特声称：“艾娃不是无赖。”艾拉说：“阿梅莉亚是无赖当且仅当杰克逊是无赖。”根据杰克逊的说法：“如果夏洛特是骑士，那么欧文就是无赖。”欧文表示：“夏洛特是无赖当且仅当艾娃是无赖。”阿梅莉亚表示：“夏洛特不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是无赖  \n(2) 夏洛特是无赖  \n(3) 艾拉是骑士  \n(4) 杰克逊是骑士  \n(5) 欧文是骑士  \n(6) 阿梅莉亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：威廉、伊丽莎白、杰克逊、艾玛、阿梅莉亚和塞巴斯蒂安。威廉表示杰克逊是骑士。伊丽莎白说：“阿梅莉亚是骑士或者艾玛是无赖。”杰克逊说：“塞巴斯蒂安是骑士或者威廉是无赖。”根据艾玛的话，“伊丽莎白是骑士或者塞巴斯蒂安是无赖。”阿梅莉亚声明：“杰克逊是骑士当且仅当艾玛是骑士。”塞巴斯蒂安说：“伊丽莎白是骑士或者伊丽莎白是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 伊丽莎白是一名骑士  \n(3) 杰克逊是一名骑士  \n(4) 艾玛是一名骑士  \n(5) 阿梅莉亚是一名骑士  \n(6) 塞巴斯蒂安是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：艾米莉、本杰明、维多利亚、索菲娅、赖利和伊莎贝拉。艾米莉说，维多利亚是无赖当且仅当本杰明是骑士。在本杰明的陈述中：“如果索菲娅是骑士，那么索菲娅就是无赖。”根据维多利亚的说法，“本杰明是无赖。”索菲娅断言：“如果艾米莉是骑士，那么伊莎贝拉就是无赖。”赖利声明：“如果艾米莉是骑士，那么维多利亚就是骑士。”伊莎贝拉表示：“艾米莉不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是一名骑士  \n(2) 本杰明是一名骑士  \n(3) 维多利亚是一名无赖  \n(4) 索菲娅是一名无赖  \n(5) 赖利是一名无赖  \n(6) 伊莎贝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：艾登、伊莎贝拉、艾弗里、奥利维亚、威廉和诺亚。艾登说：“诺亚是无赖，艾弗里是无赖。”伊莎贝拉则说：“艾登是无赖当且仅当诺亚是无赖。”艾弗里的话是：“诺亚是骑士。”奥利维亚告诉你，艾弗里是骑士当且仅当诺亚是无赖。威廉声称：“如果艾弗里是无赖，那么诺亚就是无赖。”诺亚说：“威廉是骑士，伊莎贝拉是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是无赖  \n(2) 伊莎贝拉是无赖  \n(3) 艾弗里是骑士  \n(4) 奥利维亚是无赖  \n(5) 威廉是骑士  \n(6) 诺亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：迈克尔、伊莎贝拉、佐伊、索菲娅、伊芙琳和塞缪尔。迈克尔声称：“佐伊是无赖或者佐伊是骑士。”伊莎贝拉断言：“如果索菲娅是骑士，那么伊芙琳就是无赖。”佐伊说：“伊莎贝拉是骑士或者伊芙琳是无赖。”索菲娅告诉你，伊芙琳是无赖或者塞缪尔是无赖。“佐伊不是骑士，”伊芙琳宣称。塞缪尔断言：“佐伊是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是一名骑士  \n(2) 伊莎贝拉是一名骑士  \n(3) 佐伊是一名骑士  \n(4) 索菲娅是一名骑士  \n(5) 伊芙琳是一名无赖  \n(6) 塞缪尔是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：格蕾丝、塞巴斯蒂安、利亚姆、艾登、莉莉和斯嘉丽。格蕾丝说：“斯嘉丽是一个无赖，而斯嘉丽是一个骑士。”在塞巴斯蒂安的陈述中：“艾登是一个骑士，斯嘉丽是一个骑士。”利亚姆说：“利亚姆是一个骑士，或者莉莉是一个无赖。”艾登告诉你，斯嘉丽是一个骑士，或者斯嘉丽是一个无赖。“利亚姆是一个骑士，塞巴斯蒂安是一个骑士，”莉莉声称。斯嘉丽断言：“如果格蕾丝是一个无赖，那么艾登是一个骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是无赖  \n(2) 塞巴斯蒂安是骑士  \n(3) 利亚姆是骑士  \n(4) 艾登是骑士  \n(5) 莉莉是骑士  \n(6) 斯嘉丽是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：梅森、佩内洛普、本杰明、塞巴斯蒂安、赖利和奥利维亚。梅森说：“赖利是骑士。”佩内洛普评论道：“如果赖利是骑士，那么梅森就是无赖。”本杰明提到：“梅森是无赖。”根据塞巴斯蒂安的说法，“奥利维亚不是骑士。”赖利断言：“如果本杰明是骑士，那么塞巴斯蒂安就是骑士。”奥利维亚说道：“佩内洛普是无赖当且仅当塞巴斯蒂安是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是无赖  \n(2) 佩内洛普是骑士  \n(3) 本杰明是骑士  \n(4) 塞巴斯蒂安是无赖  \n(5) 赖利是无赖  \n(6) 奥利维亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：莉莉、哈珀、艾弗里、奥利维亚、马修和阿梅莉亚。在莉莉的话中：“如果艾弗里是骑士，那么阿梅莉亚就是骑士。”哈珀告诉你莉莉不是骑士。艾弗里指出：“哈珀是无赖或者奥利维亚是无赖。”奥利维亚告诉你，如果莉莉是无赖，那么阿梅莉亚就是骑士。马修告诉你，奥利维亚是骑士当且仅当阿梅莉亚是骑士。阿梅莉亚声明：“艾弗里不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是骑士  \n(2) 哈珀是无赖  \n(3) 艾弗里是骑士  \n(4) 奥利维亚是骑士  \n(5) 马修是骑士  \n(6) 阿梅莉亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：阿丽亚、伊莎贝拉、伊森、阿梅莉亚、梅森和威廉。阿丽亚宣称：“威廉是无赖或者梅森是无赖。”伊莎贝拉提到：“威廉是骑士。”伊森说：“梅森是骑士。”阿梅莉亚说：“伊森是无赖。”梅森说：“阿丽亚是无赖而威廉是无赖。”威廉说伊莎贝拉是无赖或者伊莎贝拉是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿丽亚是一名骑士  \n(2) 伊莎贝拉是一名骑士  \n(3) 伊森是一个无赖  \n(4) 阿梅莉亚是一名骑士  \n(5) 梅森是一个无赖  \n(6) 威廉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：约瑟夫、利亚姆、佐伊、伊莎贝拉、梅森和亨利。约瑟夫声称：“伊莎贝拉是骑士，亨利是无赖。”利亚姆说：“佐伊是骑士。”佐伊说：“伊莎贝拉不是无赖。”伊莎贝拉提到：“如果亨利是骑士，那么梅森就是骑士。”梅森评论道：“约瑟夫是骑士。”亨利说：“如果梅森是无赖，那么利亚姆就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是无赖  \n(2) 利亚姆是无赖  \n(3) 佐伊是无赖  \n(4) 伊莎贝拉是无赖  \n(5) 梅森是无赖  \n(6) 亨利是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：艾登、格蕾丝、佩内洛普、迈克尔、诺亚和伊芙琳。艾登说：“诺亚是骑士。”格蕾丝的陈述是：“诺亚不是骑士。”根据佩内洛普的说法，“诺亚不是无赖。”迈克尔提到：“佩内洛普不是骑士。”诺亚表示，如果艾登是骑士，那么佩内洛普就是骑士。伊芙琳被听到说：“伊芙琳是骑士，佩内洛普是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是一名骑士  \n(2) 格蕾丝是一个无赖  \n(3) 佩内洛普是一名骑士  \n(4) 迈克尔是一个无赖  \n(5) 诺亚是一名骑士  \n(6) 伊芙琳是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：伊莎贝拉、阿梅莉亚、约瑟夫、赖利、维多利亚和詹姆斯。伊莎贝拉告诉你，如果阿梅莉亚是无赖，那么约瑟夫就是无赖。阿梅莉亚被听到说：“维多利亚是无赖。” 约瑟夫说伊莎贝拉是骑士或者詹姆斯是骑士。赖利告诉你伊莎贝拉是骑士，约瑟夫是骑士。维多利亚评论道：“赖利不是骑士。” 詹姆斯表示阿梅莉亚是无赖，伊莎贝拉是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是一名骑士  \n(2) 阿梅莉亚是一名骑士  \n(3) 约瑟夫是一名骑士  \n(4) 赖利是一名骑士  \n(5) 维多利亚是一名无赖  \n(6) 詹姆斯是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：洛根、艾米莉、欧文、艾拉、阿丽亚和赖利。正如洛根所说：“欧文是骑士。”艾米莉声称：“洛根是无赖，洛根是骑士。”欧文的陈述是：“洛根是无赖，赖利是骑士。”根据艾拉的说法：“赖利是骑士当且仅当艾米莉是无赖。”阿丽亚表示洛根不是无赖。赖利说艾米莉是骑士或者赖利是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是无赖  \n(2) 艾米莉是无赖  \n(3) 欧文是无赖  \n(4) 艾拉是无赖  \n(5) 阿丽亚是无赖  \n(6) 赖利是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：伊森、亨利、杰克、雅各布、伊芙琳和本杰明。伊森声称：“本杰明是骑士，伊芙琳是无赖。”亨利指出：“如果雅各布是骑士，那么杰克就是骑士。”杰克宣称：“如果本杰明是无赖，那么亨利就是骑士。”雅各布被听到说：“杰克是无赖当且仅当杰克是骑士。”伊芙琳说：“如果雅各布是骑士，那么杰克就是骑士。”本杰明表示：“如果杰克是骑士，那么杰克就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是无赖  \n(2) 亨利是骑士  \n(3) 杰克是骑士  \n(4) 雅各布是无赖  \n(5) 伊芙琳是骑士  \n(6) 本杰明是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：丹尼尔、米娅、奥利弗、艾弗里、迈克尔和奥利维亚。丹尼尔说：“奥利维亚是无赖当且仅当奥利维亚是骑士。”米娅提到：“迈克尔是无赖当且仅当奥利维亚是无赖。”奥利弗声称：“奥利维亚是无赖。”艾弗里说：“米娅是无赖。”迈克尔说：“奥利弗是骑士。”奥利维亚断言：“艾弗里是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是无赖  \n(2) 米娅是无赖  \n(3) 奥利弗是骑士  \n(4) 艾弗里是骑士  \n(5) 迈克尔是骑士  \n(6) 奥利维亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：格蕾丝、诺亚、夏洛特、奥萝拉、伊莎贝拉和卢克。格蕾丝表示夏洛特是无赖，奥萝拉是骑士。“格蕾丝是骑士，而格蕾丝是无赖，”诺亚宣称。“奥萝拉是无赖或者卢克是骑士，”夏洛特声称。奥萝拉表示夏洛特是无赖或者伊莎贝拉是骑士。“诺亚是无赖，”伊莎贝拉宣称。“伊莎贝拉是骑士”——卢克。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是无赖  \n(2) 诺亚是无赖  \n(3) 夏洛特是骑士  \n(4) 奥萝拉是骑士  \n(5) 伊莎贝拉是骑士  \n(6) 卢克是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：夏洛特、雅各布、威廉、哈珀、阿梅莉亚和利亚姆。夏洛特说：“如果利亚姆是无赖，那么威廉就是无赖。”雅各布说：“夏洛特是无赖，利亚姆是无赖。”威廉表示阿梅莉亚是无赖或者夏洛特是骑士。“威廉不是骑士。”——哈珀。阿梅莉亚说：“威廉不是无赖。”利亚姆表示如果雅各布是无赖，那么利亚姆就是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是一名骑士  \n(2) 雅各布是一个无赖  \n(3) 威廉是一名骑士  \n(4) 哈珀是一个无赖  \n(5) 阿梅莉亚是一名骑士  \n(6) 利亚姆是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：约瑟夫、佐伊、塞巴斯蒂安、卢克、索菲娅和诺亚。正如约瑟夫所说：“塞巴斯蒂安是无赖或者卢克是骑士。”根据佐伊的说法：“如果诺亚是骑士，那么索菲娅就是无赖。”塞巴斯蒂安说，如果约瑟夫是骑士，那么卢克就是无赖。卢克告诉你，约瑟夫是骑士或者佐伊是骑士。索菲娅说，佐伊是骑士而佐伊是无赖。诺亚的话是：“索菲娅是骑士而塞巴斯蒂安是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是一名骑士  \n(2) 佐伊是一名骑士  \n(3) 塞巴斯蒂安是一个无赖  \n(4) 卢克是一名骑士  \n(5) 索菲娅是一个无赖  \n(6) 诺亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：艾登、艾玛、莉莉、杰克、丹尼尔和夏洛特。艾登评论道：“艾玛不是无赖。”艾玛声称：“艾登是无赖或者杰克是骑士。”莉莉提到：“丹尼尔不是无赖。”杰克宣称：“杰克是骑士或者夏洛特是骑士。”丹尼尔说，如果且仅如果莉莉是无赖，夏洛特就是骑士。夏洛特说：“丹尼尔是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是一名骑士  \n(2) 艾玛是一名骑士  \n(3) 莉莉是一名骑士  \n(4) 杰克是一名骑士  \n(5) 丹尼尔是一名骑士  \n(6) 夏洛特是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：艾登、克洛伊、艾弗里、夏洛特、艾米莉和奥萝拉。艾登说道：“艾米莉不是骑士。”克洛伊被听到说：“奥萝拉是骑士或者艾登是骑士。”艾弗里声称：“如果艾米莉是无赖，那么艾米莉就是骑士。”夏洛特提到：“奥萝拉是骑士或者艾登是无赖。”正如艾米莉所说：“克洛伊不是无赖。”奥萝拉表示：“如果艾弗里是骑士，那么夏洛特就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是无赖  \n(2) 克洛伊是骑士  \n(3) 艾弗里是骑士  \n(4) 夏洛特是骑士  \n(5) 艾米莉是骑士  \n(6) 奥萝拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：詹姆斯、莉莉、伊森、索菲娅、索菲娅和伊莎贝拉。詹姆斯说：“莉莉是个无赖。”莉莉声称：“伊森是个骑士。”伊森指出：“伊森是个骑士，伊莎贝拉是个骑士。”索菲娅宣称：“莉莉是个无赖，伊森是个无赖。”根据索菲娅的话，“伊森是个无赖。”伊莎贝拉说：“如果索菲娅是个无赖，那么莉莉就是个无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）詹姆斯是一名骑士  \n（2）莉莉是一个无赖  \n（3）伊森是一个无赖  \n（4）索菲娅是一名骑士  \n（5）索菲娅是一名骑士  \n（6）伊莎贝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：詹姆斯、索菲娅、约瑟夫、伊森、伊芙琳和莉莉。詹姆斯宣称：“如果伊森是无赖，那么约瑟夫就是骑士。”索菲娅断言：“如果伊芙琳是骑士，那么莉莉就是骑士。”约瑟夫被听到说：“约瑟夫是骑士，索菲娅是无赖。”伊森说：“如果索菲娅是骑士，那么索菲娅就是无赖。”伊芙琳声明：“伊森是无赖或者莉莉是骑士。”莉莉表示：“约瑟夫不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是一个无赖  \n(2) 索菲娅是一个骑士  \n(3) 约瑟夫是一个无赖  \n(4) 伊森是一个无赖  \n(5) 伊芙琳是一个骑士  \n(6) 莉莉是一个骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：伊莎贝拉、马修、塞缪尔、约瑟夫、威廉和夏洛特。伊莎贝拉被听到说：“马修是无赖或者夏洛特是骑士。”在马修的话中：“塞缪尔是无赖而且约瑟夫是无赖。”塞缪尔说伊莎贝拉是骑士或者伊莎贝拉是无赖。约瑟夫的声明是：“威廉不是无赖。”威廉宣称：“塞缪尔是无赖。”夏洛特宣称：“马修是骑士当且仅当塞缪尔是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是一名骑士  \n(2) 马修是一个无赖  \n(3) 塞缪尔是一名骑士  \n(4) 约瑟夫是一个无赖  \n(5) 威廉是一个无赖  \n(6) 夏洛特是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：艾拉、梅森、本杰明、奥萝拉、卢卡斯和雅各布。根据艾拉的说法，“奥萝拉是骑士或者本杰明是骑士”。梅森评论道，“本杰明是骑士或者卢卡斯是骑士”。本杰明说梅森是骑士或者奥萝拉是骑士。正如奥萝拉所说，“艾拉是骑士或者卢卡斯是骑士”。卢卡斯断言：“如果艾拉是无赖，那么梅森就是无赖”。“奥萝拉是无赖当且仅当本杰明是骑士，”雅各布提到。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是一名骑士  \n(2) 梅森是一名骑士  \n(3) 本杰明是一名骑士  \n(4) 奥萝拉是一名骑士  \n(5) 卢卡斯是一名骑士  \n(6) 雅各布是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：米娅、佩内洛普、维多利亚、阿梅莉亚、亨利和雅各布。米娅的陈述是：“佩内洛普是骑士。”佩内洛普指出：“如果阿梅莉亚是骑士，那么维多利亚就是无赖。”维多利亚指出：“米娅是无赖当且仅当亨利是无赖。”阿梅莉亚说：“雅各布不是无赖。”亨利说：“雅各布不是无赖。”雅各布声称：“维多利亚不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是骑士  \n(2) 佩内洛普是骑士  \n(3) 维多利亚是无赖  \n(4) 阿梅莉亚是无赖  \n(5) 亨利是无赖  \n(6) 雅各布是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：艾登、奥萝拉、卢克、本杰明、艾米莉和梅森。根据艾登的说法：“如果梅森是无赖，那么梅森就是骑士。”奥萝拉表示本杰明是骑士。卢克指出：“梅森是骑士，而梅森是无赖。”本杰明声称：“梅森是无赖，而本杰明是骑士。”正如艾米莉所说：“如果梅森是无赖，那么卢克就是无赖。”在梅森看来：“奥萝拉是骑士，而卢克是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是无赖  \n(2) 奥萝拉是无赖  \n(3) 卢克是无赖  \n(4) 本杰明是无赖  \n(5) 艾米莉是骑士  \n(6) 梅森是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：洛根、詹姆斯、斯嘉丽、卢卡斯、艾玛和莉莉。“詹姆斯是无赖当且仅当洛根是骑士”——洛根。有人听到詹姆斯说：“如果卢卡斯是无赖，那么洛根就是骑士。”正如斯嘉丽所说：“艾玛是无赖而莉莉是骑士。” “斯嘉丽是骑士当且仅当詹姆斯是无赖”——卢卡斯。艾玛说：“如果莉莉是无赖，那么卢卡斯就是骑士。”莉莉说：“洛根是骑士而莉莉是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是无赖  \n(2) 詹姆斯是无赖  \n(3) 斯嘉丽是无赖  \n(4) 卢卡斯是无赖  \n(5) 艾玛是无赖  \n(6) 莉莉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：哈珀、杰克逊、斯嘉丽、阿比盖尔、奥利弗和丹尼尔。哈珀说：“斯嘉丽是骑士，丹尼尔是骑士。”杰克逊指出：“阿比盖尔是骑士，阿比盖尔是无赖。”在斯嘉丽的话中：“杰克逊不是骑士。”根据阿比盖尔的说法：“如果奥利弗是骑士，那么哈珀就是骑士。”奥利弗的陈述是：“杰克逊是无赖，丹尼尔是骑士。”丹尼尔表示斯嘉丽是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是一名骑士  \n(2) 杰克逊是一名无赖  \n(3) 斯嘉丽是一名骑士  \n(4) 阿比盖尔是一名骑士  \n(5) 奥利弗是一名骑士  \n(6) 丹尼尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：索菲娅、奥萝拉、艾娃、大卫、佩内洛普和威廉。索菲娅说：“威廉是个无赖。”奥萝拉说：“艾娃是个骑士，佩内洛普是个骑士。”艾娃被听到说：“大卫是骑士当且仅当大卫是无赖。”大卫断言：“如果威廉是无赖，那么奥萝拉就是骑士。”佩内洛普宣称：“索菲娅是骑士，奥萝拉是骑士。”威廉说：“大卫是骑士，佩内洛普是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 奥萝拉是一个无赖  \n(3) 艾娃是一个无赖  \n(4) 大卫是一个无赖  \n(5) 佩内洛普是一个无赖  \n(6) 威廉是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：塞巴斯蒂安、阿丽亚、艾娃、奥利维亚、本杰明和夏洛特。塞巴斯蒂安说本杰明是无赖或者阿丽亚是无赖。阿丽亚表示艾娃是无赖。艾娃被听到说：“夏洛特是骑士当且仅当本杰明是骑士。”奥利维亚告诉你，阿丽亚是无赖当且仅当阿丽亚是骑士。“夏洛特不是骑士，”本杰明声称。夏洛特表示奥利维亚是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）塞巴斯蒂安是无赖  \n（2）阿丽亚是骑士  \n（3）艾娃是无赖  \n（4）奥利维亚是无赖  \n（5）本杰明是骑士  \n（6）夏洛特是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：格蕾丝、奥利弗、奥萝拉、索菲娅、塞巴斯蒂安和奥利维亚。根据格蕾丝的说法，“如果格蕾丝是骑士，那么奥萝拉就是无赖。”根据奥利弗的说法，“奥萝拉是无赖。”奥萝拉指出，“当且仅当塞巴斯蒂安是骑士时，奥萝拉才是骑士。”索菲娅说：“奥利弗是无赖。”塞巴斯蒂安提到，“奥萝拉是无赖或者奥萝拉是骑士。”奥利维亚指出，“塞巴斯蒂安不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是一名骑士  \n(2) 奥利弗是一名骑士  \n(3) 奥萝拉是一名无赖  \n(4) 索菲娅是一名无赖  \n(5) 塞巴斯蒂安是一名骑士  \n(6) 奥利维亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：艾玛、伊芙琳、阿丽亚、艾登、索菲娅和艾弗里。艾玛被听到说：“伊芙琳是无赖当且仅当艾弗里是骑士。”伊芙琳声称：“艾弗里是骑士或者艾弗里是无赖。”阿丽亚说艾玛是无赖而伊芙琳是骑士。艾登评论道：“索菲娅是骑士而艾弗里是无赖。”索菲娅在一份声明中说：“阿丽亚不是无赖。”艾弗里表示索菲娅是无赖而艾弗里是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是一名骑士  \n(2) 伊芙琳是一名骑士  \n(3) 阿丽亚是一名无赖  \n(4) 艾登是一名无赖  \n(5) 索菲娅是一名无赖  \n(6) 艾弗里是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：丹尼尔、阿丽亚、欧文、伊森、亚历山大和本杰明。丹尼尔说：“欧文不是骑士。”阿丽亚说：“如果欧文是无赖，那么本杰明就是无赖。”在欧文的话中：“本杰明是无赖。”伊森说：“欧文是骑士。”亚历山大提到：“阿丽亚是骑士当且仅当阿丽亚是无赖。”在本杰明的话中：“伊森是骑士或者欧文是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是一名骑士  \n(2) 阿丽亚是一个无赖  \n(3) 欧文是一个无赖  \n(4) 伊森是一个无赖  \n(5) 亚历山大是一个无赖  \n(6) 本杰明是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：本杰明、艾娃、威廉、卢卡斯、赖利和莉莉。本杰明被听到说：“莉莉是骑士当且仅当艾娃是骑士。”在艾娃的话中：“卢卡斯是骑士或者莉莉是无赖。”威廉断言：“卢卡斯是骑士当且仅当赖利是无赖。”卢卡斯评论道：“赖利是无赖而赖利是骑士。”赖利声明：“莉莉不是无赖。”莉莉说威廉是无赖而威廉是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是无赖  \n(2) 艾娃是骑士  \n(3) 威廉是无赖  \n(4) 卢卡斯是无赖  \n(5) 赖利是无赖  \n(6) 莉莉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：威廉、莉莉、哈珀、丹尼尔、夏洛特和伊丽莎白。威廉告诉你夏洛特是骑士。莉莉被听到说：“威廉是骑士。”哈珀说：“伊丽莎白是无赖，夏洛特是骑士。”正如丹尼尔所说：“如果丹尼尔是骑士，那么威廉就是无赖。”夏洛特宣称：“夏洛特是骑士，伊丽莎白是骑士。”伊丽莎白宣称：“哈珀是无赖或者哈珀是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是无赖  \n(2) 莉莉是无赖  \n(3) 哈珀是无赖  \n(4) 丹尼尔是骑士  \n(5) 夏洛特是无赖  \n(6) 伊丽莎白是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：索菲娅、佩内洛普、艾米莉、艾登、大卫和阿丽亚。索菲娅的陈述是：“佩内洛普是无赖。”佩内洛普说：“佩内洛普是骑士，大卫是骑士。”艾米莉告诉你大卫是骑士。艾登指出：“佩内洛普是骑士或者阿丽亚是无赖。”大卫说：“艾登是无赖，艾登是骑士。”根据阿丽亚的说法：“索菲娅是骑士，大卫是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是骑士  \n(2) 佩内洛普是无赖  \n(3) 艾米莉是无赖  \n(4) 艾登是无赖  \n(5) 大卫是无赖  \n(6) 阿丽亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：伊芙琳、丹尼尔、梅森、索菲娅、佐伊和艾弗里。“佐伊是无赖，伊芙琳是骑士。”——伊芙琳。根据丹尼尔的话：“如果佐伊是无赖，那么索菲娅就是无赖。”梅森说：“伊芙琳是骑士。”索菲娅说：“艾弗里是无赖或者佐伊是骑士。”佐伊宣称：“梅森不是无赖。”艾弗里提到：“佐伊是无赖或者丹尼尔是无赖。”那么，谁是骑士，谁是无赖？",
        "solution_text_format": "(1) 伊芙琳是无赖  \n(2) 丹尼尔是骑士  \n(3) 梅森是无赖  \n(4) 索菲娅是无赖  \n(5) 佐伊是无赖  \n(6) 艾弗里是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：索菲娅、亚历山大、雅各布、哈珀、斯嘉丽和亨利。索菲娅说：“雅各布是骑士，斯嘉丽是骑士。”亚历山大说：“哈珀是无赖，雅各布是无赖。”雅各布告诉你亨利是骑士。“索菲娅是骑士当且仅当亚历山大是骑士。”——哈珀。“亨利是骑士或者雅各布是骑士，”斯嘉丽宣称。根据亨利的话，“索菲娅是无赖或者亚历山大是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 亚历山大是一个无赖  \n(3) 雅各布是一名骑士  \n(4) 哈珀是一个无赖  \n(5) 斯嘉丽是一名骑士  \n(6) 亨利是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：洛根、本杰明、马修、威廉、米娅和格蕾丝。洛根评论道：“如果本杰明是无赖，那么马修就是骑士。”本杰明宣称：“格蕾丝是无赖或者洛根是骑士。”马修说：“米娅是无赖当且仅当格蕾丝是无赖。”威廉声明：“如果本杰明是无赖，那么格蕾丝就是无赖。”米娅断言：“威廉是无赖。”格蕾丝评论道：“本杰明不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是一名骑士  \n(2) 本杰明是一名骑士  \n(3) 马修是一名骑士  \n(4) 威廉是一名骑士  \n(5) 米娅是一名无赖  \n(6) 格蕾丝是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：阿梅莉亚、阿丽亚、亨利、奥利弗、索菲娅和约瑟夫。阿梅莉亚说：“如果奥利弗是骑士，那么阿丽亚就是骑士。”阿丽亚说：“亨利是无赖，奥利弗是骑士。”亨利说：“如果索菲娅是无赖，那么约瑟夫就是骑士。”奥利弗表示，亨利是骑士当且仅当索菲娅是无赖。索菲娅告诉你：“如果奥利弗是骑士，那么亨利就是骑士。”约瑟夫断言：“奥利弗是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是一名骑士  \n(2) 阿丽亚是一个无赖  \n(3) 亨利是一名骑士  \n(4) 奥利弗是一个无赖  \n(5) 索菲娅是一名骑士  \n(6) 约瑟夫是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：维多利亚、艾弗里、杰克逊、索菲娅、格蕾丝和塞缪尔。维多利亚说索菲娅不是骑士。艾弗里表示维多利亚不是骑士。杰克逊告诉你艾弗里是无赖，索菲娅也是无赖。索菲娅说：“艾弗里是无赖，格蕾丝是骑士。”正如格蕾丝所说：“艾弗里是骑士。”塞缪尔表示，格蕾丝是无赖当且仅当杰克逊是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 维多利亚是一名骑士  \n(2) 艾弗里是一个无赖  \n(3) 杰克逊是一名骑士  \n(4) 索菲娅是一个无赖  \n(5) 格蕾丝是一个无赖  \n(6) 塞缪尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：大卫、佐伊、伊森、莉莉、哈珀和艾玛。大卫告诉你，莉莉是无赖当且仅当大卫是骑士。正如佐伊所说：“艾玛是骑士或者大卫是无赖。”伊森说哈珀不是骑士。莉莉说：“如果大卫是骑士，那么莉莉就是骑士。”哈珀声明：“莉莉不是无赖。”艾玛被听到说：“莉莉是骑士当且仅当大卫是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 大卫是骑士  \n(2) 佐伊是无赖  \n(3) 伊森是骑士  \n(4) 莉莉是无赖  \n(5) 哈珀是无赖  \n(6) 艾玛是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：伊芙琳、奥萝拉、艾拉、夏洛特、阿比盖尔和伊莎贝拉。根据伊芙琳的说法：“阿比盖尔是骑士，夏洛特是骑士。”奥萝拉指出：“伊莎贝拉不是骑士。”艾拉声明：“伊芙琳是无赖，阿比盖尔是骑士。”在夏洛特的话中：“艾拉不是无赖。”阿比盖尔说：“艾拉是骑士或者奥萝拉是骑士。”伊莎贝拉告诉你，伊芙琳是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是无赖  \n(2) 奥萝拉是无赖  \n(3) 艾拉是无赖  \n(4) 夏洛特是无赖  \n(5) 阿比盖尔是无赖  \n(6) 伊莎贝拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：伊丽莎白、马修、奥利弗、艾娃、洛根和诺亚。伊丽莎白被听到说：“如果奥利弗是骑士，那么艾娃就是骑士。”马修被听到说：“艾娃是无赖当且仅当伊丽莎白是无赖。”在奥利弗的话中：“伊丽莎白是骑士。”在艾娃的陈述中：“洛根是骑士，艾娃是骑士。”洛根评论道：“艾娃是无赖当且仅当奥利弗是无赖。”诺亚提到：“马修不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是一名骑士  \n(2) 马修是一名骑士  \n(3) 奥利弗是一名骑士  \n(4) 艾娃是一名骑士  \n(5) 洛根是一名骑士  \n(6) 诺亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：塞巴斯蒂安、杰克、伊森、佩内洛普、索菲娅和卢克。塞巴斯蒂安的陈述是：“杰克是骑士当且仅当伊森是无赖。”杰克宣称：“佩内洛普是骑士当且仅当佩内洛普是无赖。”伊森评论道：“佩内洛普是无赖。”佩内洛普指出：“杰克是无赖，索菲娅是无赖。”索菲娅说：“塞巴斯蒂安是无赖或者卢克是骑士。”卢克声称：“佩内洛普是无赖或者杰克是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）塞巴斯蒂安是一名骑士  \n（2）杰克是一个无赖  \n（3）伊森是一名骑士  \n（4）佩内洛普是一个无赖  \n（5）索菲娅是一名骑士  \n（6）卢克是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：伊森、威廉、艾玛、本杰明、伊莎贝拉和米娅。伊森说：“本杰明是无赖或者威廉是无赖。”威廉声称：“米娅是骑士当且仅当伊莎贝拉是骑士。”艾玛声称：“米娅是无赖而伊莎贝拉是骑士。”本杰明评论道：“威廉是骑士而米娅是骑士。”伊莎贝拉评论道：“如果本杰明是骑士，那么艾玛就是无赖。”米娅告诉你伊莎贝拉是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是无赖  \n(2) 威廉是骑士  \n(3) 艾玛是无赖  \n(4) 本杰明是骑士  \n(5) 伊莎贝拉是骑士  \n(6) 米娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：洛根、奥利维亚、艾登、夏洛特、雅各布和佐伊。洛根说：“雅各布是骑士。”奥利维亚指出：“艾登是骑士或者佐伊是无赖。”艾登说：“如果洛根是骑士，那么奥利维亚就是骑士。”夏洛特评论道：“佐伊是骑士或者奥利维亚是骑士。”雅各布说：“艾登是无赖或者夏洛特是无赖。”根据佐伊的说法：“如果且仅如果洛根是骑士，雅各布就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是一个无赖  \n(2) 奥利维亚是一个骑士  \n(3) 艾登是一个骑士  \n(4) 夏洛特是一个骑士  \n(5) 雅各布是一个无赖  \n(6) 佐伊是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：夏洛特、本杰明、塞巴斯蒂安、丹尼尔、詹姆斯和米娅。夏洛特宣称：“如果詹姆斯是骑士，那么塞巴斯蒂安就是无赖。”本杰明断言：“塞巴斯蒂安是无赖。”塞巴斯蒂安表示：“詹姆斯是骑士。”丹尼尔评论道：“米娅是无赖当且仅当塞巴斯蒂安是骑士。”詹姆斯说：“米娅是骑士。”米娅被听到说：“丹尼尔是无赖或者詹姆斯是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是无赖  \n(2) 本杰明是无赖  \n(3) 塞巴斯蒂安是骑士  \n(4) 丹尼尔是无赖  \n(5) 詹姆斯是骑士  \n(6) 米娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：詹姆斯、索菲娅、赖利、杰克逊、杰克和本杰明。詹姆斯告诉你，如果杰克逊是无赖，那么赖利就是无赖。索菲娅说：“赖利是无赖当且仅当詹姆斯是无赖。”赖利的陈述是：“本杰明是无赖或者本杰明是骑士。”杰克逊表示本杰明是无赖或者本杰明是骑士。杰克表示詹姆斯不是骑士。本杰明指出：“如果索菲娅是骑士，那么杰克就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是一名骑士  \n(2) 索菲娅是一名骑士  \n(3) 赖利是一名骑士  \n(4) 杰克逊是一名骑士  \n(5) 杰克是一个无赖  \n(6) 本杰明是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：格蕾丝、米娅、阿梅莉亚、阿比盖尔、斯嘉丽和奥萝拉。在格蕾丝的话中：“斯嘉丽是无赖或者奥萝拉是骑士”。米娅的陈述：“斯嘉丽是骑士当且仅当阿比盖尔是骑士”。阿梅莉亚表示：“阿比盖尔是无赖或者格蕾丝是无赖”。“格蕾丝是无赖而奥萝拉是骑士，”阿比盖尔声称。斯嘉丽指出：“奥萝拉是无赖而格蕾丝是骑士”。“阿比盖尔是无赖”——奥萝拉。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）格蕾丝是一名骑士  \n（2）米娅是一名骑士  \n（3）阿梅莉亚是一名骑士  \n（4）阿比盖尔是一名无赖  \n（5）斯嘉丽是一名无赖  \n（6）奥萝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：索菲娅、赖利、卢卡斯、利亚姆、杰克逊和斯嘉丽。“利亚姆不是骑士”——索菲娅说。“索菲娅是无赖或者卢卡斯是无赖，”赖利宣称。卢卡斯说，如果杰克逊是骑士，那么斯嘉丽就是骑士。利亚姆被听到说：“斯嘉丽是无赖。”杰克逊声明：“如果利亚姆是无赖，那么赖利就是骑士。”根据斯嘉丽的说法，“卢卡斯是无赖当且仅当索菲娅是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 赖利是骑士  \n(3) 卢卡斯是无赖  \n(4) 利亚姆是骑士  \n(5) 杰克逊是骑士  \n(6) 斯嘉丽是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：雅各布、克洛伊、丹尼尔、艾娃、阿丽亚和佩内洛普。雅各布评论道：“丹尼尔是骑士当且仅当雅各布是骑士。”克洛伊被听到说：“如果佩内洛普是骑士，那么雅各布就是无赖。”丹尼尔被听到说：“如果雅各布是无赖，那么克洛伊就是无赖。”艾娃声明：“丹尼尔是骑士，克洛伊是无赖。”正如阿丽亚所说：“佩内洛普是无赖，佩内洛普是骑士。”佩内洛普则说道：“佩内洛普是骑士当且仅当艾娃是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）雅各布是一名骑士  \n（2）克洛伊是一名无赖  \n（3）丹尼尔是一名骑士  \n（4）艾娃是一名骑士  \n（5）阿丽亚是一名无赖  \n（6）佩内洛普是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：雅各布、杰克、伊丽莎白、米娅、佐伊和梅森。雅各布说：“杰克不是无赖。”杰克被听到说：“佐伊是无赖，雅各布是无赖。”伊丽莎白声称：“米娅是无赖。”米娅在一份声明中说：“佐伊不是骑士。”佐伊被听到说：“伊丽莎白是骑士。”梅森断言：“佐伊不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）雅各布是无赖  \n（2）杰克是无赖  \n（3）伊丽莎白是骑士  \n（4）米娅是无赖  \n（5）佐伊是骑士  \n（6）梅森是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：艾米莉、奥利弗、斯嘉丽、艾拉、伊莎贝拉和艾娃。艾米莉声称：“斯嘉丽是骑士当且仅当奥利弗是骑士。”奥利弗说：“伊莎贝拉是骑士当且仅当艾娃是骑士。”斯嘉丽指出：“奥利弗是骑士当且仅当伊莎贝拉是骑士。”艾拉提到：“艾米莉是骑士，艾拉是骑士。”伊莎贝拉说：“奥利弗是无赖或者艾拉是骑士。”艾娃说：“斯嘉丽是无赖当且仅当伊莎贝拉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是无赖  \n(2) 奥利弗是骑士  \n(3) 斯嘉丽是无赖  \n(4) 艾拉是无赖  \n(5) 伊莎贝拉是无赖  \n(6) 艾娃是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：夏洛特、艾拉、亚历山大、艾登、杰克逊和约瑟夫。夏洛特声称：“杰克逊是骑士或者艾拉是骑士。”艾拉则说：“夏洛特不是骑士。”亚历山大评论道：“杰克逊是无赖当且仅当艾登是无赖。”艾登指出：“亚历山大不是无赖。”杰克逊说：“亚历山大是骑士。”约瑟夫则表示：“艾拉不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是一名骑士  \n(2) 艾拉是一个无赖  \n(3) 亚历山大是一名骑士  \n(4) 艾登是一名骑士  \n(5) 杰克逊是一名骑士  \n(6) 约瑟夫是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：伊芙琳、亨利、洛根、艾弗里、丹尼尔和艾登。伊芙琳说丹尼尔是无赖，洛根是骑士。亨利告诉你，洛根是骑士当且仅当艾登是无赖。“丹尼尔是骑士，”洛根声称。有人听到艾弗里说：“亨利不是无赖。” “亨利不是无赖”——丹尼尔。艾登的话是：“亨利不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是无赖  \n(2) 亨利是无赖  \n(3) 洛根是无赖  \n(4) 艾弗里是无赖  \n(5) 丹尼尔是无赖  \n(6) 艾登是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：雅各布、威廉、维多利亚、梅森、格蕾丝和阿梅莉亚。雅各布声称：“梅森是骑士。”威廉说：“威廉是骑士，雅各布是骑士。”维多利亚说：“雅各布是骑士当且仅当雅各布是无赖。”梅森评论道：“威廉是无赖。”格蕾丝表示她是骑士，威廉是骑士。“梅森是无赖，阿梅莉亚是骑士，”阿梅莉亚提到。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）雅各布是一名骑士  \n（2）威廉是一个无赖  \n（3）维多利亚是一个无赖  \n（4）梅森是一名骑士  \n（5）格蕾丝是一个无赖  \n（6）阿梅莉亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：艾米莉、奥利维亚、塞缪尔、利亚姆、伊芙琳和梅森。艾米莉告诉你，伊芙琳不是无赖。奥利维亚说：“梅森是骑士，利亚姆是骑士。”塞缪尔声称：“利亚姆是无赖。”利亚姆说：“奥利维亚不是无赖。”在伊芙琳的话中：“梅森是无赖或者利亚姆是无赖。”梅森说：“利亚姆是无赖并且利亚姆是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是骑士  \n(2) 奥利维亚是无赖  \n(3) 塞缪尔是骑士  \n(4) 利亚姆是无赖  \n(5) 伊芙琳是骑士  \n(6) 梅森是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：梅森、塞缪尔、艾米莉、夏洛特、维多利亚和哈珀。梅森声称：“如果塞缪尔是骑士，那么艾米莉就是无赖。”塞缪尔说：“哈珀不是骑士。”艾米莉说：“当且仅当梅森是无赖时，塞缪尔就是无赖。”夏洛特说艾米莉不是骑士。维多利亚评论道：“夏洛特是骑士或者塞缪尔是骑士。”哈珀宣称：“当且仅当哈珀是骑士时，维多利亚就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是一名骑士  \n(2) 塞缪尔是一个无赖  \n(3) 艾米莉是一个无赖  \n(4) 夏洛特是一名骑士  \n(5) 维多利亚是一名骑士  \n(6) 哈珀是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：丹尼尔、奥利弗、艾娃、维多利亚、佐伊和奥利维亚。丹尼尔声称：“奥利维亚是无赖或者奥利弗是骑士。”奥利弗评论道：“佐伊是无赖而艾娃是无赖。”艾娃声称：“奥利维亚是无赖。”维多利亚告诉你，只有当丹尼尔是骑士时，奥利维亚才是骑士。根据佐伊的说法，“奥利维亚不是骑士。”正如奥利维亚所说，“丹尼尔是骑士或者奥利维亚是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是一名骑士  \n(2) 奥利弗是一名骑士  \n(3) 艾娃是一名无赖  \n(4) 维多利亚是一名骑士  \n(5) 佐伊是一名无赖  \n(6) 奥利维亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：阿比盖尔、梅森、佐伊、亚历山大、卢克和莉莉。根据阿比盖尔的说法，“梅森是骑士当且仅当卢克是无赖。”梅森说：“莉莉是骑士，佐伊是无赖。”佐伊声称：“如果佐伊是骑士，那么卢克就是骑士。”亚历山大宣称：“如果梅森是骑士，那么卢克就是骑士。”卢克评论道：“佐伊是无赖当且仅当亚历山大是无赖。”莉莉提到：“阿比盖尔是无赖或者梅森是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是一名骑士  \n(2) 梅森是一个无赖  \n(3) 佐伊是一名骑士  \n(4) 亚历山大是一名骑士  \n(5) 卢克是一名骑士  \n(6) 莉莉是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：艾弗里、洛根、莉莉、索菲娅、伊森和艾拉。艾弗里声称：“索菲娅是无赖或者莉莉是骑士。”洛根说，如果且仅如果伊森是无赖，那么索菲娅就是无赖。莉莉评论道：“艾拉是骑士，伊森是骑士。”索菲娅说：“如果伊森是无赖，那么伊森就是骑士。”伊森评论道：“艾弗里是骑士或者莉莉是无赖。”艾拉说：“洛根是无赖，索菲娅是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是无赖  \n(2) 洛根是骑士  \n(3) 莉莉是无赖  \n(4) 索菲娅是骑士  \n(5) 伊森是骑士  \n(6) 艾拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：威廉、约瑟夫、艾米莉、詹姆斯、塞巴斯蒂安和艾娃。威廉被听到说：“塞巴斯蒂安是无赖或者艾娃是骑士。”约瑟夫说：“威廉是无赖当且仅当艾娃是无赖。”艾米莉的陈述是：“艾娃是骑士当且仅当约瑟夫是骑士。”詹姆斯声明：“塞巴斯蒂安不是骑士。”塞巴斯蒂安宣称：“如果约瑟夫是骑士，那么艾娃就是无赖。”艾娃表示：“威廉是骑士而约瑟夫是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是无赖  \n(2) 约瑟夫是骑士  \n(3) 艾米莉是无赖  \n(4) 詹姆斯是无赖  \n(5) 塞巴斯蒂安是骑士  \n(6) 艾娃是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：伊丽莎白、艾登、丹尼尔、洛根、奥利弗和塞巴斯蒂安。伊丽莎白声称：“艾登不是骑士。”艾登被听到说：“塞巴斯蒂安是无赖当且仅当塞巴斯蒂安是骑士。”正如丹尼尔所说：“洛根不是骑士。”在洛根的陈述中：“艾登不是骑士。”奥利弗告诉你，塞巴斯蒂安不是无赖。根据塞巴斯蒂安的话：“艾登不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是一名骑士  \n(2) 艾登是一个无赖  \n(3) 丹尼尔是一个无赖  \n(4) 洛根是一名骑士  \n(5) 奥利弗是一名骑士  \n(6) 塞巴斯蒂安是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：艾弗里、夏洛特、卢卡斯、莉莉、索菲娅和维多利亚。艾弗里提到：“夏洛特不是骑士。”夏洛特被听到说：“维多利亚是无赖。”卢卡斯提到：“如果莉莉是骑士，那么索菲娅就是无赖。”莉莉评论道：“卢卡斯不是骑士。”索菲娅断言：“维多利亚是无赖当且仅当维多利亚是骑士。”维多利亚说道：“如果卢卡斯是无赖，那么索菲娅就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是一名骑士  \n(2) 夏洛特是一个无赖  \n(3) 卢卡斯是一名骑士  \n(4) 莉莉是一个无赖  \n(5) 索菲娅是一个无赖  \n(6) 维多利亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：卢卡斯、奥利弗、杰克逊、本杰明、诺亚和卢克。卢卡斯说卢克是骑士。奥利弗的陈述是：“诺亚是无赖”。杰克逊被听到说：“如果卢克是无赖，那么本杰明就是无赖”。根据本杰明的说法，“卢克是无赖，卢卡斯是无赖”。诺亚说奥利弗是无赖，而诺亚是骑士。在卢克的陈述中：“卢卡斯是无赖，诺亚是骑士”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是无赖  \n(2) 奥利弗是骑士  \n(3) 杰克逊是无赖  \n(4) 本杰明是骑士  \n(5) 诺亚是无赖  \n(6) 卢克是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：杰克、艾登、塞缪尔、索菲娅、伊芙琳和艾弗里。杰克说：“如果杰克是骑士，那么艾弗里就是无赖。”艾登评论道：“杰克是骑士。”塞缪尔说：“伊芙琳是骑士，艾登是无赖。”索菲娅说：“杰克不是无赖。”伊芙琳在声明中说：“塞缪尔是无赖，索菲娅是无赖。”艾弗里表示塞缪尔是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克是一名骑士  \n(2) 艾登是一名骑士  \n(3) 塞缪尔是一个无赖  \n(4) 索菲娅是一名骑士  \n(5) 伊芙琳是一个无赖  \n(6) 艾弗里是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：卢卡斯、威廉、塞巴斯蒂安、丹尼尔、艾玛和奥利维亚。卢卡斯表示塞巴斯蒂安是骑士。威廉说：“卢卡斯不是骑士。”塞巴斯蒂安说：“奥利维亚是无赖。”丹尼尔说：“艾玛是骑士，塞巴斯蒂安是无赖。”艾玛声明：“卢卡斯是骑士。”奥利维亚评论道：“塞巴斯蒂安是骑士或者卢卡斯是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是无赖  \n(2) 威廉是骑士  \n(3) 塞巴斯蒂安是无赖  \n(4) 丹尼尔是无赖  \n(5) 艾玛是无赖  \n(6) 奥利维亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：威廉、艾登、斯嘉丽、艾弗里、艾娃和本杰明。威廉说：“如果斯嘉丽是骑士，那么艾娃就是无赖。”艾登表示：“如果本杰明是无赖，那么本杰明就是骑士。”斯嘉丽说：“威廉不是骑士。”艾弗里说：“艾登是无赖。”艾娃说：“斯嘉丽是骑士。”本杰明表示艾娃是骑士，艾弗里是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 艾登是一个无赖  \n(3) 斯嘉丽是一个无赖  \n(4) 艾弗里是一名骑士  \n(5) 艾娃是一个无赖  \n(6) 本杰明是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：杰克逊、亨利、丹尼尔、卢克、塞缪尔和克洛伊。“丹尼尔是个无赖，”杰克逊说。亨利指出：“如果塞缪尔是骑士，那么克洛伊就是骑士。”丹尼尔说卢克是骑士。“克洛伊不是骑士，”卢克宣称。“亨利不是无赖，”塞缪尔提到。克洛伊被听到说：“卢克是个无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是一名骑士  \n(2) 亨利是一名骑士  \n(3) 丹尼尔是一名无赖  \n(4) 卢克是一名无赖  \n(5) 塞缪尔是一名骑士  \n(6) 克洛伊是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：杰克逊、索菲娅、伊莎贝拉、伊丽莎白、艾娃和莉莉。杰克逊的陈述是：“艾娃是骑士当且仅当艾娃是无赖。”索菲娅说：“艾娃是无赖，伊莎贝拉是无赖。”伊莎贝拉声称：“如果艾娃是骑士，那么艾娃就是无赖。”伊丽莎白表示：“艾娃是无赖当且仅当索菲娅是无赖。”艾娃说：“伊莎贝拉是骑士或者索菲娅是无赖。”莉莉的话是：“伊丽莎白是骑士，艾娃是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是无赖  \n(2) 索菲娅是无赖  \n(3) 伊莎贝拉是无赖  \n(4) 伊丽莎白是无赖  \n(5) 艾娃是骑士  \n(6) 莉莉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：塞缪尔、莉莉、阿丽亚、艾弗里、阿比盖尔和本杰明。塞缪尔说：“莉莉是骑士，阿丽亚是骑士。”莉莉说：“塞缪尔是骑士。”阿丽亚告诉你阿比盖尔是骑士。艾弗里的话是：“如果本杰明是骑士，那么本杰明就是无赖。”阿比盖尔说：“艾弗里是无赖，莉莉是无赖。”本杰明评论道：“阿比盖尔是骑士或者莉莉是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是无赖  \n(2) 莉莉是无赖  \n(3) 阿丽亚是骑士  \n(4) 艾弗里是无赖  \n(5) 阿比盖尔是骑士  \n(6) 本杰明是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了6位居民：伊莎贝拉、索菲娅、艾拉、杰克逊、卢克和亨利。伊莎贝拉说：“如果杰克逊是骑士，那么艾拉就是骑士。”索菲娅指出：“伊莎贝拉不是无赖。”艾拉评论道：“亨利是骑士，而伊莎贝拉是无赖。”杰克逊声称：“卢克不是骑士。”卢克声称：“如果伊莎贝拉是无赖，那么索菲娅就是骑士。”亨利说：“卢克是骑士或者卢克是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是一名骑士  \n(2) 索菲娅是一名骑士  \n(3) 艾拉是一名无赖  \n(4) 杰克逊是一名无赖  \n(5) 卢克是一名骑士  \n(6) 亨利是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：夏洛特、亨利、伊丽莎白、奥萝拉、约瑟夫和杰克逊。在夏洛特的话中：“约瑟夫是骑士，而奥萝拉是无赖。”根据亨利的说法，“约瑟夫是无赖当且仅当杰克逊是骑士。”伊丽莎白告诉你，奥萝拉不是无赖。“伊丽莎白是无赖或者伊丽莎白是骑士，”奥萝拉声称。“当且仅当夏洛特是无赖时，奥萝拉是无赖，”约瑟夫宣称。杰克逊告诉你，夏洛特是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是无赖  \n(2) 亨利是无赖  \n(3) 伊丽莎白是骑士  \n(4) 奥萝拉是骑士  \n(5) 约瑟夫是无赖  \n(6) 杰克逊是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：艾玛、洛根、杰克逊、丹尼尔、阿丽亚和亨利。艾玛宣称：“艾玛是骑士当且仅当阿丽亚是无赖。”洛根告诉你：“艾玛是骑士当且仅当丹尼尔是骑士。”根据杰克逊的说法：“阿丽亚是无赖当且仅当亨利是无赖。”丹尼尔的陈述是：“阿丽亚不是骑士。”阿丽亚指出：“丹尼尔是骑士当且仅当亨利是无赖。”亨利评论道：“艾玛是骑士或者杰克逊是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是骑士  \n(2) 洛根是骑士  \n(3) 杰克逊是无赖  \n(4) 丹尼尔是骑士  \n(5) 阿丽亚是无赖  \n(6) 亨利是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：伊丽莎白、索菲娅、维多利亚、阿比盖尔、格蕾丝和卢克。伊丽莎白说：“索菲娅是骑士当且仅当卢克是无赖。”索菲娅则说道：“伊丽莎白是骑士或者格蕾丝是骑士。”维多利亚说：“格蕾丝是无赖而阿比盖尔是骑士。”阿比盖尔说：“维多利亚是无赖或者索菲娅是骑士。”格蕾丝说：“卢克是无赖而伊丽莎白是骑士。”卢克告诉你，索菲娅是骑士而阿比盖尔是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是一名骑士  \n(2) 索菲娅是一名骑士  \n(3) 维多利亚是一名无赖  \n(4) 阿比盖尔是一名骑士  \n(5) 格蕾丝是一名骑士  \n(6) 卢克是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：莉莉、伊莎贝拉、艾拉、詹姆斯、伊丽莎白和塞巴斯蒂安。莉莉说：“詹姆斯不是骑士。”伊莎贝拉指出：“艾拉是骑士或者艾拉是无赖。”艾拉评论道：“莉莉是无赖而莉莉是骑士。”詹姆斯断言：“伊丽莎白是无赖或者艾拉是骑士。”根据伊丽莎白的话：“如果艾拉是无赖，那么伊莎贝拉就是无赖。”在塞巴斯蒂安看来：“莉莉是骑士而伊丽莎白是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是无赖  \n(2) 伊莎贝拉是骑士  \n(3) 艾拉是无赖  \n(4) 詹姆斯是骑士  \n(5) 伊丽莎白是无赖  \n(6) 塞巴斯蒂安是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：威廉、伊森、奥萝拉、艾弗里、阿比盖尔和卢卡斯。威廉声称：“如果阿比盖尔是无赖，那么卢卡斯就是无赖。”伊森评论道：“艾弗里是无赖或者卢卡斯是无赖。”奥萝拉说：“阿比盖尔是骑士当且仅当卢卡斯是骑士。”艾弗里的话是：“如果卢卡斯是骑士，那么伊森就是无赖。”阿比盖尔说，如果卢卡斯是骑士，那么伊森就是无赖。卢卡斯告诉你阿比盖尔是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 伊森是一个无赖  \n(3) 奥萝拉是一名骑士  \n(4) 艾弗里是一名骑士  \n(5) 阿比盖尔是一名骑士  \n(6) 卢卡斯是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：赖利、伊森、亨利、亚历山大、艾玛和伊莎贝拉。赖利说艾玛不是无赖。伊森声称：“赖利是无赖或者伊莎贝拉是骑士。”根据亨利的说法：“赖利是无赖而艾玛是无赖。”亚历山大评论道：“伊森是无赖而亨利是骑士。”在艾玛的话中：“伊森不是无赖。”伊莎贝拉评论道：“如果艾玛是无赖，那么赖利就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是一名骑士  \n(2) 伊森是一名骑士  \n(3) 亨利是一个无赖  \n(4) 亚历山大是一个无赖  \n(5) 艾玛是一名骑士  \n(6) 伊莎贝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：阿梅莉亚、艾娃、奥利维亚、奥利弗、杰克和艾弗里。阿梅莉亚提到：“艾弗里是无赖，奥利弗是骑士。”艾娃说：“杰克是骑士。”奥利维亚说：“奥利弗是骑士或者阿梅莉亚是骑士。”奥利弗评论道：“艾娃是无赖或者奥利维亚是无赖。”杰克告诉你奥利弗不是骑士。艾弗里告诉你艾娃是骑士或者奥利维亚是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是一名骑士  \n(2) 艾娃是一个无赖  \n(3) 奥利维亚是一名骑士  \n(4) 奥利弗是一名骑士  \n(5) 杰克是一个无赖  \n(6) 艾弗里是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：亚历山大、艾拉、奥萝拉、哈珀、艾娃和艾米莉。亚历山大声称：“艾拉是骑士或者艾米莉是无赖。”艾拉宣称：“哈珀是骑士而奥萝拉是无赖。”奥萝拉说艾米莉是骑士。“艾娃不是骑士，”哈珀说。艾娃声称：“艾米莉是无赖而奥萝拉是无赖。”艾米莉提到：“艾米莉是骑士或者奥萝拉是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）亚历山大是无赖  \n（2）艾拉是无赖  \n（3）奥萝拉是骑士  \n（4）哈珀是骑士  \n（5）艾娃是无赖  \n（6）艾米莉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：克洛伊、杰克、艾弗里、迈克尔、塞巴斯蒂安和伊丽莎白。“伊丽莎白不是骑士”——克洛伊说。杰克声明：“塞巴斯蒂安是骑士当且仅当伊丽莎白是骑士。”艾弗里被听到说：“艾弗里是骑士，塞巴斯蒂安是无赖。”在迈克尔的话中：“杰克不是无赖。”塞巴斯蒂安被听到说：“杰克是无赖。”伊丽莎白指出：“塞巴斯蒂安不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）克洛伊是骑士  \n（2）杰克是无赖  \n（3）艾弗里是无赖  \n（4）迈克尔是无赖  \n（5）塞巴斯蒂安是骑士  \n（6）伊丽莎白是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：伊森、阿比盖尔、索菲娅、雅各布、伊芙琳和佩内洛普。伊森宣称：“索菲娅不是无赖。”阿比盖尔说道：“佩内洛普不是无赖。”索菲娅告诉你，佩内洛普是骑士或者伊森是无赖。雅各布说：“伊森是无赖或者伊森是骑士。”伊芙琳表示，伊森是无赖或者佩内洛普是无赖。佩内洛普的陈述是：“伊森是骑士或者伊芙琳是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是一名骑士  \n(2) 阿比盖尔是一名骑士  \n(3) 索菲娅是一名骑士  \n(4) 雅各布是一名骑士  \n(5) 伊芙琳是一名无赖  \n(6) 佩内洛普是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：约瑟夫、雅各布、斯嘉丽、佩内洛普、卢卡斯和洛根。根据约瑟夫的说法，“斯嘉丽是无赖，佩内洛普是骑士”。雅各布被听到说，“卢卡斯是骑士”。斯嘉丽说约瑟夫是骑士，佩内洛普是无赖。“卢卡斯是骑士或者约瑟夫是骑士”——佩内洛普。卢卡斯说约瑟夫不是骑士。洛根说，“斯嘉丽不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是一名骑士  \n(2) 雅各布是一个无赖  \n(3) 斯嘉丽是一个无赖  \n(4) 佩内洛普是一名骑士  \n(5) 卢卡斯是一个无赖  \n(6) 洛根是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：洛根、佐伊、诺亚、卢克、索菲娅和阿梅莉亚。洛根被听到说：“索菲娅是无赖当且仅当诺亚是无赖。”根据佐伊的说法：“洛根是无赖，卢克是骑士。”诺亚的声明是：“洛根是无赖。”卢克评论道：“如果索菲娅是骑士，那么索菲娅就是无赖。”在索菲娅的话中：“佐伊是无赖或者阿梅莉亚是无赖。”阿梅莉亚说：“阿梅莉亚是骑士或者索菲娅是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是无赖  \n(2) 佐伊是骑士  \n(3) 诺亚是骑士  \n(4) 卢克是骑士  \n(5) 索菲娅是无赖  \n(6) 阿梅莉亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：哈珀、诺亚、伊莎贝拉、艾娃、塞缪尔和杰克逊。哈珀提到：“如果伊莎贝拉是骑士，那么伊莎贝拉就是无赖。”诺亚说：“如果哈珀是骑士，那么伊莎贝拉就是骑士。”伊莎贝拉断言：“杰克逊是无赖当且仅当哈珀是骑士。”艾娃说：“杰克逊是骑士。”塞缪尔说：“如果伊莎贝拉是骑士，那么诺亚就是骑士。”杰克逊声称：“诺亚是骑士或者塞缪尔是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是无赖  \n(2) 诺亚是骑士  \n(3) 伊莎贝拉是骑士  \n(4) 艾娃是骑士  \n(5) 塞缪尔是骑士  \n(6) 杰克逊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：索菲娅、伊莎贝拉、莉莉、艾玛、塞缪尔和伊丽莎白。索菲娅说：“伊莎贝拉是骑士，塞缪尔是骑士。”伊莎贝拉宣称：“伊丽莎白是骑士。”莉莉评论道：“艾玛是骑士，塞缪尔是骑士。”艾玛提到：“索菲娅是无赖或者伊丽莎白是骑士。”塞缪尔评论道：“如果索菲娅是骑士，那么伊丽莎白就是骑士。”伊丽莎白说莉莉是无赖，伊莎贝拉是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 伊莎贝拉是无赖  \n(3) 莉莉是骑士  \n(4) 艾玛是骑士  \n(5) 塞缪尔是骑士  \n(6) 伊丽莎白是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：伊森、卢克、欧文、奥利弗、艾拉和索菲娅。伊森说：“奥利弗不是无赖。”卢克说：“如果索菲娅是无赖，那么卢克就是骑士。”欧文声称：“卢克是无赖。”奥利弗评论道：“如果艾拉是骑士，那么欧文就是无赖。”艾拉说欧文是骑士，而艾拉也是骑士。“欧文是骑士或者艾拉是无赖，”索菲娅声称。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是一名骑士  \n(2) 卢克是一名骑士  \n(3) 欧文是一个无赖  \n(4) 奥利弗是一名骑士  \n(5) 艾拉是一个无赖  \n(6) 索菲娅是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：艾拉、本杰明、佩内洛普、哈珀、米娅和艾米莉。艾拉提到：“本杰明不是无赖。”本杰明声称：“如果哈珀是骑士，那么本杰明就是骑士。”佩内洛普说：“艾拉不是无赖。”根据哈珀的说法：“佩内洛普是骑士或者艾拉是骑士。”米娅声称：“艾米莉是骑士或者艾拉是骑士。”艾米莉说哈珀是无赖或者艾拉是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是一名骑士  \n(2) 本杰明是一名骑士  \n(3) 佩内洛普是一名骑士  \n(4) 哈珀是一名骑士  \n(5) 米娅是一名骑士  \n(6) 艾米莉是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：卢克、阿梅莉亚、艾米莉、艾玛、哈珀和斯嘉丽。卢克评论道：“艾米莉是无赖当且仅当卢克是骑士。”阿梅莉亚说：“卢克不是骑士。”艾米莉的陈述是：“如果斯嘉丽是无赖，那么阿梅莉亚就是骑士。”艾玛被听到说：“卢克不是骑士。”哈珀告诉你，卢克是骑士或者斯嘉丽是骑士。斯嘉丽声明：“哈珀是无赖或者艾米莉是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 阿梅莉亚是一个无赖  \n(3) 艾米莉是一个无赖  \n(4) 艾玛是一个无赖  \n(5) 哈珀是一名骑士  \n(6) 斯嘉丽是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：哈珀、伊森、艾玛、洛根、欧文和卢克。根据哈珀的说法：“艾玛是无赖当且仅当洛根是骑士。”伊森的陈述是：“如果洛根是无赖，那么欧文就是无赖。”艾玛声称：“如果卢克是骑士，那么欧文就是无赖。”洛根的陈述是：“哈珀是无赖当且仅当洛根是骑士。”欧文宣称：“卢克是无赖而哈珀是骑士。”在卢克的话中：“艾玛是骑士或者卢克是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是无赖  \n(2) 伊森是骑士  \n(3) 艾玛是骑士  \n(4) 洛根是骑士  \n(5) 欧文是无赖  \n(6) 卢克是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：艾登、奥利弗、克洛伊、梅森、利亚姆和莉莉。艾登声称：“利亚姆不是骑士。”奥利弗说：“艾登不是无赖。”克洛伊说梅森不是骑士。“艾登是骑士，克洛伊是骑士，”梅森提到。根据利亚姆的说法，“艾登是无赖，莉莉是无赖。”莉莉说梅森是无赖，而梅森是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是无赖  \n(2) 奥利弗是无赖  \n(3) 克洛伊是骑士  \n(4) 梅森是无赖  \n(5) 利亚姆是骑士  \n(6) 莉莉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了6位居民：塞巴斯蒂安、詹姆斯、丹尼尔、奥利维亚、梅森和索菲娅。塞巴斯蒂安提到：“如果詹姆斯是骑士，那么梅森就是无赖。”詹姆斯表示，只有当奥利维亚是骑士时，塞巴斯蒂安才是无赖。丹尼尔说：“梅森是无赖，索菲娅是骑士。”奥利维亚说塞巴斯蒂安是无赖或者梅森是无赖。在梅森的陈述中：“梅森是骑士或者索菲娅是骑士。”索菲娅断言：“丹尼尔不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）塞巴斯蒂安是无赖  \n（2）詹姆斯是骑士  \n（3）丹尼尔是无赖  \n（4）奥利维亚是骑士  \n（5）梅森是骑士  \n（6）索菲娅是骑士"
    }
]