[
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：丹尼尔、欧文、克洛伊、艾娃、约瑟夫、亚历山大、赖利和诺亚。丹尼尔的陈述是：“约瑟夫是无赖，欧文是无赖。”欧文被听到说：“艾娃是骑士，丹尼尔是骑士。”克洛伊评论道：“赖利不是无赖。”艾娃表示：“诺亚是骑士当且仅当约瑟夫是骑士。”约瑟夫说：“如果艾娃是骑士，那么亚历山大是骑士。”亚历山大评论道：“艾娃是骑士当且仅当丹尼尔是无赖。”赖利说道：“艾娃不是无赖。”诺亚表示欧文是骑士或者丹尼尔是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是无赖  \n(2) 欧文是无赖  \n(3) 克洛伊是骑士  \n(4) 艾娃是骑士  \n(5) 约瑟夫是骑士  \n(6) 亚历山大是骑士  \n(7) 赖利是骑士  \n(8) 诺亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：马修、艾米莉、亚历山大、索菲娅、维多利亚、阿比盖尔、伊莎贝拉和梅森。马修声称：“索菲娅是骑士，伊莎贝拉是无赖。”艾米莉表示梅森是骑士或者阿比盖尔是骑士。亚历山大指出：“如果梅森是无赖，那么伊莎贝拉就是无赖。”索菲娅说：“如果阿比盖尔是骑士，那么梅森就是骑士。”维多利亚告诉你，维多利亚是骑士或者索菲娅是无赖。阿比盖尔说：“亚历山大不是骑士。”在伊莎贝拉看来：“阿比盖尔是无赖或者梅森是无赖。”梅森表示维多利亚是骑士而维多利亚是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是无赖  \n(2) 艾米莉是骑士  \n(3) 亚历山大是无赖  \n(4) 索菲娅是无赖  \n(5) 维多利亚是骑士  \n(6) 阿比盖尔是骑士  \n(7) 伊莎贝拉是骑士  \n(8) 梅森是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：卢克、阿丽亚、阿梅莉亚、斯嘉丽、本杰明、索菲娅、大卫和迈克尔。“索菲娅是骑士，本杰明是骑士，”卢克声称。阿丽亚被听到说：“迈克尔是骑士”。阿梅莉亚评论道：“迈克尔不是无赖”。“本杰明是无赖，”斯嘉丽声称。本杰明说道：“迈克尔是无赖，阿梅莉亚是无赖”。索菲娅指出：“阿梅莉亚是无赖”。大卫评论道：“斯嘉丽是无赖或者卢克是骑士”。“斯嘉丽是无赖当且仅当大卫是骑士，”迈克尔声称。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是无赖  \n(2) 阿丽亚是骑士  \n(3) 阿梅莉亚是骑士  \n(4) 斯嘉丽是骑士  \n(5) 本杰明是无赖  \n(6) 索菲娅是无赖  \n(7) 大卫是无赖  \n(8) 迈克尔是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：塞缪尔、卢克、伊莎贝拉、雅各布、伊丽莎白、佐伊、亚历山大和杰克。塞缪尔说：“伊丽莎白不是无赖。”卢克说：“伊丽莎白不是无赖。”伊莎贝拉被听到说：“杰克是无赖或者伊丽莎白是无赖。”雅各布说：“卢克是骑士。”伊丽莎白指出：“伊莎贝拉不是无赖。”佐伊说：“如果伊丽莎白是骑士，那么亚历山大是骑士。”亚历山大说伊莎贝拉是骑士。杰克表示塞缪尔是无赖或者卢克是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是一名骑士  \n(2) 卢克是一名骑士  \n(3) 伊莎贝拉是一名骑士  \n(4) 雅各布是一名骑士  \n(5) 伊丽莎白是一名骑士  \n(6) 佐伊是一名骑士  \n(7) 亚历山大是一名骑士  \n(8) 杰克是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：亚历山大、哈珀、伊芙琳、杰克逊、詹姆斯、杰克、阿梅莉亚和卢卡斯。“杰克是骑士，”亚历山大说。哈珀被听到说：“卢卡斯是骑士或者伊芙琳是无赖。”伊芙琳说：“詹姆斯是无赖。”杰克逊评论道：“杰克是骑士而阿梅莉亚是无赖。”詹姆斯声称：“卢卡斯不是骑士。”杰克评论道：“哈珀是无赖。”阿梅莉亚说：“亚历山大是无赖而杰克是骑士。”卢卡斯声明：“亚历山大是无赖当且仅当哈珀是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亚历山大是无赖  \n(2) 哈珀是骑士  \n(3) 伊芙琳是骑士  \n(4) 杰克逊是无赖  \n(5) 詹姆斯是无赖  \n(6) 杰克是无赖  \n(7) 阿梅莉亚是无赖  \n(8) 卢卡斯是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：利亚姆、伊丽莎白、奥萝拉、欧文、卢克、本杰明、塞缪尔和格蕾丝。利亚姆说：“本杰明是骑士或者塞缪尔是骑士。”伊丽莎白评论道：“格蕾丝是骑士或者欧文是骑士。”奥萝拉宣称：“本杰明是骑士或者卢克是无赖。”欧文表示，塞缪尔是骑士当且仅当卢克是骑士。卢克说：“如果利亚姆是无赖，那么格蕾丝就是骑士。”本杰明断言：“如果伊丽莎白是无赖，那么欧文就是骑士。”塞缪尔的陈述是：“伊丽莎白是骑士。”格蕾丝则表示：“伊丽莎白是骑士并且利亚姆是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是一名骑士  \n(2) 伊丽莎白是一名骑士  \n(3) 奥萝拉是一名骑士  \n(4) 欧文是一名骑士  \n(5) 卢克是一名骑士  \n(6) 本杰明是一名骑士  \n(7) 塞缪尔是一名骑士  \n(8) 格蕾丝是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：艾米莉、本杰明、阿比盖尔、佩内洛普、塞缪尔、索菲娅、利亚姆和诺亚。“塞缪尔是骑士，佩内洛普是骑士，”艾米莉提到。 本杰明说利亚姆是骑士。阿比盖尔说：“阿比盖尔是骑士当且仅当本杰明是无赖。” “艾米莉不是无赖，”佩内洛普声称。塞缪尔说艾米莉是无赖，佩内洛普是无赖。“利亚姆不是无赖，”索菲娅提到。利亚姆告诉你，塞缪尔是无赖当且仅当阿比盖尔是骑士。诺亚评论道：“索菲娅是无赖当且仅当塞缪尔是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）艾米莉是无赖  \n（2）本杰明是无赖  \n（3）阿比盖尔是骑士  \n（4）佩内洛普是无赖  \n（5）塞缪尔是骑士  \n（6）索菲娅是无赖  \n（7）利亚姆是无赖  \n（8）诺亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：塞巴斯蒂安、大卫、维多利亚、伊森、艾娃、佩内洛普、卢卡斯和亚历山大。塞巴斯蒂安提到：“佩内洛普是骑士当且仅当艾娃是骑士。”大卫说：“卢卡斯是骑士而艾娃是无赖。”维多利亚被听到说：“艾娃是无赖而大卫是无赖。”伊森声称：“大卫是无赖而卢卡斯是无赖。”艾娃指出：“亚历山大是无赖而伊森是骑士。”佩内洛普说：“维多利亚不是无赖。”卢卡斯说：“亚历山大是无赖而维多利亚是骑士。”亚历山大声明：“伊森是骑士当且仅当大卫是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）塞巴斯蒂安是无赖  \n（2）大卫是无赖  \n（3）维多利亚是无赖  \n（4）伊森是骑士  \n（5）艾娃是骑士  \n（6）佩内洛普是无赖  \n（7）卢卡斯是无赖  \n（8）亚历山大是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：亨利、洛根、詹姆斯、莉莉、佐伊、斯嘉丽、维多利亚和梅森。亨利评论道：“亨利是骑士，斯嘉丽是无赖。”正如洛根所说：“詹姆斯是骑士或者佐伊是无赖。”詹姆斯告诉你亨利是骑士，佐伊是骑士。莉莉告诉你斯嘉丽是无赖。“莉莉是无赖而莉莉是骑士”——佐伊说。斯嘉丽声明：“亨利是无赖或者维多利亚是无赖。”根据维多利亚的说法，“佐伊不是无赖。”梅森声称：“莉莉是无赖或者斯嘉丽是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）亨利是无赖  \n（2）洛根是骑士  \n（3）詹姆斯是无赖  \n（4）莉莉是无赖  \n（5）佐伊是无赖  \n（6）斯嘉丽是骑士  \n（7）维多利亚是无赖  \n（8）梅森是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：塞巴斯蒂安、洛根、米娅、伊森、赖利、哈珀、马修和艾登。塞巴斯蒂安的陈述是：“艾登是骑士或者哈珀是无赖”。洛根被听到说：“伊森是骑士或者艾登是骑士”。米娅被听到说：“马修是无赖而哈珀是骑士”。伊森评论道：“洛根是骑士”。赖利说道：“如果哈珀是骑士，那么洛根就是骑士”。哈珀评论道：“伊森不是无赖”。马修指出：“塞巴斯蒂安是骑士而米娅是无赖”。“洛根是无赖”——艾登。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞巴斯蒂安是无赖  \n(2) 洛根是骑士  \n(3) 米娅是骑士  \n(4) 伊森是骑士  \n(5) 赖利是骑士  \n(6) 哈珀是骑士  \n(7) 马修是无赖  \n(8) 艾登是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：马修、艾米莉、奥萝拉、雅各布、阿梅莉亚、利亚姆、詹姆斯和亚历山大。“艾米莉不是骑士，”马修说。正如艾米莉所说：“如果马修是骑士，那么亚历山大就是骑士。” “艾米莉不是无赖，”奥萝拉声称。“亚历山大是无赖，詹姆斯是无赖，”雅各布说。阿梅莉亚说艾米莉是骑士或者奥萝拉是骑士。“艾米莉是无赖，亚历山大是骑士，”利亚姆声称。“利亚姆是骑士当且仅当奥萝拉是无赖，”詹姆斯声称。亚历山大断言：“如果亚历山大是骑士，那么雅各布就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是无赖  \n(2) 艾米莉是骑士  \n(3) 奥萝拉是骑士  \n(4) 雅各布是无赖  \n(5) 阿梅莉亚是骑士  \n(6) 利亚姆是无赖  \n(7) 詹姆斯是骑士  \n(8) 亚历山大是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：艾弗里、雅各布、艾米莉、欧文、克洛伊、塞巴斯蒂安、洛根和杰克。在艾弗里的话中：“雅各布不是无赖。”雅各布告诉你杰克是骑士，塞巴斯蒂安是无赖。“杰克是无赖，杰克是骑士，”艾米莉宣称。欧文被听到说：“艾米莉是无赖。”在克洛伊的陈述中：“塞巴斯蒂安是无赖或者洛根是骑士。”塞巴斯蒂安表示艾弗里是无赖，艾米莉是骑士。洛根评论道：“克洛伊是无赖或者杰克是骑士。” “克洛伊是骑士或者塞巴斯蒂安是骑士，”杰克声称。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是一名骑士  \n(2) 雅各布是一名骑士  \n(3) 艾米莉是一名无赖  \n(4) 欧文是一名骑士  \n(5) 克洛伊是一名骑士  \n(6) 塞巴斯蒂安是一名无赖  \n(7) 洛根是一名骑士  \n(8) 杰克是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：梅森、艾米莉、卢克、詹姆斯、赖利、阿梅莉亚、亚历山大和丹尼尔。梅森说：“艾米莉是无赖，丹尼尔是骑士。”根据艾米莉的说法：“梅森是骑士。”卢克断言：“如果阿梅莉亚是无赖，那么亚历山大就是骑士。”詹姆斯表示梅森是无赖或者卢克是骑士。赖利声明：“梅森是骑士或者亚历山大是骑士。”在阿梅莉亚的陈述中：“艾米莉是无赖当且仅当阿梅莉亚是骑士。”亚历山大表示：“阿梅莉亚是无赖当且仅当卢克是骑士。”丹尼尔评论道：“梅森是无赖当且仅当亚历山大是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是无赖  \n(2) 艾米莉是无赖  \n(3) 卢克是骑士  \n(4) 詹姆斯是骑士  \n(5) 赖利是骑士  \n(6) 阿梅莉亚是无赖  \n(7) 亚历山大是骑士  \n(8) 丹尼尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：伊芙琳、佐伊、洛根、斯嘉丽、诺亚、卢克、米娅和雅各布。“雅各布是个无赖，”伊芙琳说。佐伊提到：“卢克是骑士，伊芙琳是骑士。”洛根宣称：“佐伊不是无赖。”斯嘉丽评论道：“卢克是无赖，佐伊是骑士。”诺亚被听到说：“斯嘉丽是个无赖。”卢克表示，洛根是骑士或者卢克是骑士。“佐伊是无赖或者米娅是骑士，”米娅宣称。雅各布被听到说：“卢克是骑士，洛根是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是一名骑士  \n(2) 佐伊是一个无赖  \n(3) 洛根是一个无赖  \n(4) 斯嘉丽是一个无赖  \n(5) 诺亚是一名骑士  \n(6) 卢克是一个无赖  \n(7) 米娅是一名骑士  \n(8) 雅各布是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：洛根、伊莎贝拉、艾米莉、维多利亚、约瑟夫、雅各布、亨利和格蕾丝。洛根说：“伊莎贝拉是骑士或者雅各布是无赖。”伊莎贝拉说：“亨利是无赖或者雅各布是无赖。”艾米莉说：“艾米莉是骑士并且格蕾丝是骑士。”维多利亚被听到说：“洛根是骑士并且格蕾丝是无赖。”约瑟夫声明：“伊莎贝拉是无赖或者亨利是骑士。”雅各布说：“洛根不是骑士。”亨利评论道：“伊莎贝拉是骑士。”格蕾丝说：“艾米莉不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是一名骑士  \n(2) 伊莎贝拉是一名骑士  \n(3) 艾米莉是一名无赖  \n(4) 维多利亚是一名无赖  \n(5) 约瑟夫是一名骑士  \n(6) 雅各布是一名无赖  \n(7) 亨利是一名骑士  \n(8) 格蕾丝是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：杰克逊、大卫、哈珀、克洛伊、詹姆斯、洛根、莉莉和佐伊。杰克逊说：“佐伊是骑士。”大卫说：“詹姆斯是骑士，大卫是骑士。”哈珀说：“莉莉是无赖。”克洛伊声明：“大卫是骑士当且仅当詹姆斯是骑士。”詹姆斯评论道：“如果詹姆斯是骑士，那么克洛伊是无赖。”洛根说：“大卫是无赖或者大卫是骑士。”莉莉评论：“大卫不是无赖。”佐伊说洛根是骑士，詹姆斯是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）杰克逊是一名骑士  \n（2）大卫是一个无赖  \n（3）哈珀是一名骑士  \n（4）克洛伊是一个无赖  \n（5）詹姆斯是一名骑士  \n（6）洛根是一名骑士  \n（7）莉莉是一个无赖  \n（8）佐伊是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：索菲娅、利亚姆、夏洛特、佐伊、维多利亚、艾米莉、杰克和赖利。索菲娅说维多利亚是无赖或者维多利亚是骑士。利亚姆声明：“如果维多利亚是骑士，那么索菲娅就是骑士。”夏洛特告诉你赖利是无赖或者杰克是骑士。“利亚姆是骑士，杰克是无赖” - 佐伊。维多利亚声明：“佐伊不是无赖。”艾米莉评论：“赖利是无赖，杰克是骑士。”杰克告诉你索菲娅不是骑士。在赖利的话中：“艾米莉不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 利亚姆是一名骑士  \n(3) 夏洛特是一名骑士  \n(4) 佐伊是一名骑士  \n(5) 维多利亚是一名骑士  \n(6) 艾米莉是一名无赖  \n(7) 杰克是一名无赖  \n(8) 赖利是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：迈克尔、艾弗里、诺亚、杰克、亨利、阿梅莉亚、夏洛特和佩内洛普。“夏洛特是个无赖”——迈克尔说。艾弗里告诉你，如果佩内洛普是个无赖，那么诺亚就是骑士。诺亚表示阿梅莉亚不是无赖。“如果诺亚是个无赖，那么亨利就是骑士，”杰克提到。“迈克尔是个无赖，而亨利是骑士”——亨利说。阿梅莉亚表示，如果佩内洛普是个无赖，那么艾弗里就是骑士。夏洛特指出，“杰克是无赖当且仅当艾弗里是无赖”。正如佩内洛普所说，“艾弗里是无赖当且仅当佩内洛普是骑士”。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是无赖  \n(2) 艾弗里是无赖  \n(3) 诺亚是无赖  \n(4) 杰克是无赖  \n(5) 亨利是无赖  \n(6) 阿梅莉亚是无赖  \n(7) 夏洛特是骑士  \n(8) 佩内洛普是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：艾弗里、奥萝拉、索菲娅、迈克尔、夏洛特、佩内洛普、佐伊和维多利亚。艾弗里说：“索菲娅是无赖，而艾弗里是骑士。”奥萝拉说：“迈克尔是骑士。”索菲娅表示，夏洛特是骑士或者艾弗里是无赖。“迈克尔是骑士，佩内洛普是无赖，”迈克尔宣称。夏洛特说：“佩内洛普是无赖或者迈克尔是骑士。”有人听到佩内洛普说：“迈克尔是骑士。”在佐伊的话中：“如果佐伊是骑士，那么迈克尔就是无赖。”维多利亚说：“夏洛特不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是无赖  \n(2) 奥萝拉是无赖  \n(3) 索菲娅是骑士  \n(4) 迈克尔是无赖  \n(5) 夏洛特是骑士  \n(6) 佩内洛普是无赖  \n(7) 佐伊是骑士  \n(8) 维多利亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：米娅、伊森、亚历山大、诺亚、杰克逊、艾娃、阿比盖尔和艾登。米娅表示，如果伊森是无赖，那么米娅就是骑士。伊森评论道：“米娅是无赖。”亚历山大说伊森是骑士。诺亚表示米娅是骑士。杰克逊声明：“诺亚是无赖。”艾娃说亚历山大是骑士，伊森是无赖。“诺亚是无赖，阿比盖尔是骑士”——阿比盖尔。“伊森是骑士或者艾娃是无赖”——艾登。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是骑士  \n(2) 伊森是无赖  \n(3) 亚历山大是无赖  \n(4) 诺亚是骑士  \n(5) 杰克逊是无赖  \n(6) 艾娃是无赖  \n(7) 阿比盖尔是无赖  \n(8) 艾登是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：约瑟夫、卢克、哈珀、索菲娅、迈克尔、佩内洛普、亨利和克洛伊。约瑟夫说：“克洛伊是无赖或者卢克是无赖。”卢克声明：“佩内洛普不是骑士。”哈珀指出：“迈克尔不是骑士。”索菲娅被听到说：“如果卢克是无赖，那么亨利就是无赖。”迈克尔表示约瑟夫是无赖。“卢克是无赖”——佩内洛普。亨利表示如果卢克是骑士，那么佩内洛普就是无赖。“约瑟夫是骑士，亨利是骑士”——克洛伊。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是一名骑士  \n(2) 卢克是一个无赖  \n(3) 哈珀是一名骑士  \n(4) 索菲娅是一个无赖  \n(5) 迈克尔是一个无赖  \n(6) 佩内洛普是一名骑士  \n(7) 亨利是一名骑士  \n(8) 克洛伊是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：塞缪尔、阿梅莉亚、伊丽莎白、阿比盖尔、约瑟夫、米娅、伊芙琳和威廉。塞缪尔声称：“约瑟夫是无赖，米娅是骑士。”阿梅莉亚的陈述是：“约瑟夫是骑士，塞缪尔是骑士。”伊丽莎白评论道：“阿梅莉亚是无赖当且仅当约瑟夫是骑士。”阿比盖尔提到：“伊丽莎白是无赖当且仅当伊丽莎白是骑士。”约瑟夫评论道：“如果米娅是骑士，那么阿梅莉亚就是无赖。”米娅说：“阿比盖尔是无赖。”伊芙琳评论道：“伊丽莎白是无赖。”威廉表示威廉是骑士，约瑟夫是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是无赖  \n(2) 阿梅莉亚是无赖  \n(3) 伊丽莎白是骑士  \n(4) 阿比盖尔是无赖  \n(5) 约瑟夫是骑士  \n(6) 米娅是骑士  \n(7) 伊芙琳是无赖  \n(8) 威廉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：本杰明、伊森、亚历山大、米娅、卢克、伊丽莎白、奥利维亚和哈珀。“奥利维亚是无赖或者伊丽莎白是骑士，”本杰明提到。“亚历山大是骑士或者米娅是骑士，”伊森宣称。“如果奥利维亚是无赖，那么哈珀就是骑士，”亚历山大提到。米娅说：“伊森是骑士当且仅当伊森是无赖。” “奥利维亚是骑士当且仅当哈珀是骑士，”卢克声称。正如伊丽莎白所说：“卢克是骑士。”在奥利维亚的陈述中：“如果伊森是无赖，那么亚历山大就是无赖。”在哈珀的陈述中：“奥利维亚是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是一名骑士  \n(2) 伊森是一名骑士  \n(3) 亚历山大是一名骑士  \n(4) 米娅是一名无赖  \n(5) 卢克是一名骑士  \n(6) 伊丽莎白是一名骑士  \n(7) 奥利维亚是一名骑士  \n(8) 哈珀是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：威廉、佐伊、伊森、詹姆斯、迈克尔、亨利、佩内洛普和奥利弗。“迈克尔是骑士，”威廉宣称。佐伊说道：“伊森是骑士或者奥利弗是无赖。”根据伊森的说法：“迈克尔是无赖，而伊森是骑士。”在詹姆斯看来：“佐伊是无赖或者伊森是骑士。”迈克尔说：“威廉是骑士或者奥利弗是骑士。”亨利说：“伊森不是无赖。”根据佩内洛普的说法：“詹姆斯是骑士当且仅当奥利弗是无赖。”奥利弗说：“佐伊是骑士或者詹姆斯是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 佐伊是一个无赖  \n(3) 伊森是一个无赖  \n(4) 詹姆斯是一名骑士  \n(5) 迈克尔是一名骑士  \n(6) 亨利是一个无赖  \n(7) 佩内洛普是一个无赖  \n(8) 奥利弗是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：诺亚、克洛伊、佐伊、卢克、米娅、塞巴斯蒂安、詹姆斯和哈珀。“米娅是骑士，”诺亚宣称。克洛伊说：“佐伊不是骑士。”佐伊说：“詹姆斯不是骑士。”卢克表示：“米娅是骑士，诺亚是无赖。”米娅说詹姆斯不是无赖。塞巴斯蒂安断言：“诺亚是骑士当且仅当哈珀是骑士。”詹姆斯说：“克洛伊是无赖当且仅当诺亚是无赖。”哈珀告诉你卢克不是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是一名骑士  \n(2) 克洛伊是一名骑士  \n(3) 佐伊是一名无赖  \n(4) 卢克是一名无赖  \n(5) 米娅是一名骑士  \n(6) 塞巴斯蒂安是一名无赖  \n(7) 詹姆斯是一名骑士  \n(8) 哈珀是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：马修、米娅、威廉、索菲娅、塞缪尔、艾米莉、艾弗里和伊莎贝拉。马修说：“伊莎贝拉不是骑士。”米娅则说：“米娅是骑士或者威廉是骑士。”威廉提到：“艾弗里是无赖或者艾弗里是骑士。”索菲娅被听到说：“米娅不是无赖。”塞缪尔评论道：“威廉是骑士或者索菲娅是骑士。”艾米莉告诉你，伊莎贝拉不是无赖。艾弗里被听到说：“如果米娅是无赖，那么塞缪尔就是骑士。”根据伊莎贝拉的说法：“米娅是骑士当且仅当艾弗里是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是一名骑士  \n(2) 米娅是一名骑士  \n(3) 威廉是一名骑士  \n(4) 索菲娅是一名骑士  \n(5) 塞缪尔是一名骑士  \n(6) 艾米莉是一名无赖  \n(7) 艾弗里是一名骑士  \n(8) 伊莎贝拉是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：阿丽亚、艾娃、阿梅莉亚、塞巴斯蒂安、詹姆斯、利亚姆、本杰明和梅森。阿丽亚被听到说：“艾娃是骑士或者本杰明是无赖。”艾娃说：“本杰明是无赖或者詹姆斯是骑士。”阿梅莉亚说：“利亚姆是骑士并且本杰明是骑士。”塞巴斯蒂安说：“梅森是无赖并且阿丽亚是骑士。”根据詹姆斯的说法：“如果阿丽亚是骑士，那么利亚姆是骑士。”利亚姆断言：“塞巴斯蒂安是无赖或者本杰明是骑士。”本杰明说塞巴斯蒂安是无赖或者阿丽亚是骑士。“阿丽亚是无赖并且阿丽亚是骑士，”梅森宣称。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿丽亚是一名骑士  \n(2) 艾娃是一名骑士  \n(3) 阿梅莉亚是一名骑士  \n(4) 塞巴斯蒂安是一名骑士  \n(5) 詹姆斯是一名骑士  \n(6) 利亚姆是一名骑士  \n(7) 本杰明是一名骑士  \n(8) 梅森是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：艾弗里、艾米莉、塞缪尔、阿比盖尔、迈克尔、诺亚、亨利和夏洛特。艾弗里声称：“诺亚是无赖当且仅当塞缪尔是骑士。”艾米莉的陈述是：“亨利是无赖。”塞缪尔评论道：“阿比盖尔不是骑士。”阿比盖尔表示，如果诺亚是骑士，那么夏洛特就是无赖。迈克尔说：“诺亚不是骑士。”诺亚提到：“亨利是无赖或者塞缪尔是骑士。”亨利说，迈克尔是骑士当且仅当阿比盖尔是无赖。“如果迈克尔是骑士，那么亨利就是骑士，”夏洛特声称。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是无赖  \n(2) 艾米莉是骑士  \n(3) 塞缪尔是骑士  \n(4) 阿比盖尔是无赖  \n(5) 迈克尔是无赖  \n(6) 诺亚是骑士  \n(7) 亨利是无赖  \n(8) 夏洛特是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：洛根、卢卡斯、伊丽莎白、诺亚、艾娃、哈珀、夏洛特和杰克逊。洛根指出：“杰克逊是无赖当且仅当伊丽莎白是无赖。”卢卡斯声称：“杰克逊不是骑士。”伊丽莎白说：“艾娃不是骑士。”诺亚说：“夏洛特是无赖。”艾娃说：“如果伊丽莎白是无赖，那么诺亚就是无赖。”哈珀指出：“杰克逊是无赖。”夏洛特声称：“杰克逊是无赖或者伊丽莎白是骑士。”杰克逊说：“杰克逊是骑士当且仅当洛根是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是一名骑士  \n(2) 卢卡斯是一名骑士  \n(3) 伊丽莎白是一个无赖  \n(4) 诺亚是一个无赖  \n(5) 艾娃是一名骑士  \n(6) 哈珀是一名骑士  \n(7) 夏洛特是一名骑士  \n(8) 杰克逊是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：利亚姆、索菲娅、诺亚、亚历山大、迈克尔、格蕾丝、梅森和艾拉。利亚姆说：“索菲娅不是骑士。”索菲娅则说：“亚历山大是无赖。”诺亚评论道：“梅森不是骑士。”亚历山大声明：“梅森是骑士当且仅当亚历山大是骑士。”迈克尔断言：“诺亚是无赖或者梅森是无赖。”格蕾丝告诉你，利亚姆是骑士当且仅当迈克尔是无赖。“索菲娅是无赖，”梅森宣称。艾拉说：“如果亚历山大是骑士，那么梅森就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是一名骑士  \n(2) 索菲娅是一名无赖  \n(3) 诺亚是一名无赖  \n(4) 亚历山大是一名骑士  \n(5) 迈克尔是一名骑士  \n(6) 格蕾丝是一名无赖  \n(7) 梅森是一名骑士  \n(8) 艾拉是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：哈珀、迈克尔、马修、艾弗里、杰克、亨利、欧文和利亚姆。“迈克尔不是骑士，”哈珀声称。迈克尔说马修是无赖或者利亚姆是骑士。马修指出：“杰克是骑士或者亨利是无赖。”艾弗里断言：“如果欧文是无赖，那么亨利是无赖。”杰克说：“当且仅当哈珀是骑士时，杰克才是骑士。”亨利在一份声明中说：“哈珀是骑士或者杰克是骑士。”欧文说：“亨利不是骑士。”利亚姆说：“艾弗里是骑士而艾弗里是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是一名骑士  \n(2) 迈克尔是一名无赖  \n(3) 马修是一名骑士  \n(4) 艾弗里是一名无赖  \n(5) 杰克是一名骑士  \n(6) 亨利是一名骑士  \n(7) 欧文是一名无赖  \n(8) 利亚姆是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：奥利维亚、赖利、威廉、亨利、伊莎贝拉、夏洛特、伊芙琳和伊丽莎白。奥利维亚说伊莎贝拉是个无赖。赖利声称：“伊莎贝拉是骑士或者奥利维亚是无赖。”威廉评论道：“如果亨利是无赖，那么伊芙琳就是无赖。”亨利说：“赖利是无赖当且仅当亨利是骑士。”伊莎贝拉说：“如果亨利是骑士，那么亨利就是无赖。”夏洛特表示：“如果赖利是骑士，那么夏洛特就是骑士。”伊芙琳的声明是：“夏洛特不是无赖。”伊丽莎白说：“奥利维亚是骑士并且奥利维亚是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是骑士  \n(2) 赖利是无赖  \n(3) 威廉是骑士  \n(4) 亨利是骑士  \n(5) 伊莎贝拉是无赖  \n(6) 夏洛特是骑士  \n(7) 伊芙琳是骑士  \n(8) 伊丽莎白是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：索菲娅、威廉、欧文、亨利、阿比盖尔、佩内洛普、格蕾丝和克洛伊。索菲娅说：“亨利是个无赖。”威廉评论道：“欧文不是骑士。”欧文被听到说：“克洛伊是骑士，阿比盖尔是骑士。”亨利说：“格蕾丝不是骑士。”根据阿比盖尔的话，“克洛伊是骑士或者佩内洛普是骑士。”佩内洛普提到：“欧文不是骑士。”根据格蕾丝的话，“索菲娅是骑士或者佩内洛普是骑士。”在克洛伊的话中：“如果欧文是骑士，那么亨利就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 威廉是一个无赖  \n(3) 欧文是一名骑士  \n(4) 亨利是一个无赖  \n(5) 阿比盖尔是一名骑士  \n(6) 佩内洛普是一个无赖  \n(7) 格蕾丝是一名骑士  \n(8) 克洛伊是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：詹姆斯、约瑟夫、大卫、艾拉、阿丽亚、本杰明、马修和佩内洛普。詹姆斯说：“本杰明是无赖当且仅当马修是无赖。”约瑟夫宣称：“阿丽亚是无赖当且仅当本杰明是无赖。”大卫告诉你，如果大卫是骑士，那么佩内洛普就是骑士。艾拉说，如果詹姆斯是骑士，那么阿丽亚就是骑士。“如果艾拉是骑士，那么大卫就是骑士，”阿丽亚声称。本杰明评论道：“约瑟夫是骑士或者佩内洛普是无赖。”马修告诉你，艾拉是骑士而艾拉是无赖。佩内洛普说：“大卫是无赖或者詹姆斯是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）詹姆斯是骑士  \n（2）约瑟夫是无赖  \n（3）大卫是骑士  \n（4）艾拉是骑士  \n（5）阿丽亚是骑士  \n（6）本杰明是无赖  \n（7）马修是无赖  \n（8）佩内洛普是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：杰克、艾米莉、伊芙琳、艾拉、斯嘉丽、杰克逊、威廉和艾弗里。“伊芙琳不是骑士，”杰克提到。艾米莉说：“威廉是骑士当且仅当杰克逊是骑士。”伊芙琳指出：“如果斯嘉丽是无赖，那么艾拉就是骑士。”根据艾拉的说法，“艾弗里是无赖。”斯嘉丽的陈述是：“威廉不是无赖。”杰克逊说：“伊芙琳是无赖，斯嘉丽是无赖。”威廉提到：“艾米莉是无赖或者斯嘉丽是骑士。”艾弗里告诉你杰克是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）杰克是无赖  \n（2）艾米莉是无赖  \n（3）伊芙琳是骑士  \n（4）艾拉是无赖  \n（5）斯嘉丽是骑士  \n（6）杰克逊是无赖  \n（7）威廉是骑士  \n（8）艾弗里是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：梅森、马修、克洛伊、奥萝拉、利亚姆、迈克尔、维多利亚和丹尼尔。梅森表示，如果且仅如果奥萝拉是骑士，那么奥萝拉就是无赖。“如果克洛伊是无赖，那么克洛伊就是骑士，”马修声称。“如果迈克尔是骑士，那么马修就是骑士，”克洛伊提到。“迈克尔不是骑士，”奥萝拉提到。利亚姆表示，维多利亚是骑士或者迈克尔是骑士。迈克尔被听到说：“克洛伊是无赖，维多利亚是无赖。”维多利亚说：“马修是无赖当且仅当迈克尔是骑士。”丹尼尔断言：“如果迈克尔是无赖，那么克洛伊就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是无赖  \n(2) 马修是骑士  \n(3) 克洛伊是骑士  \n(4) 奥萝拉是骑士  \n(5) 利亚姆是骑士  \n(6) 迈克尔是无赖  \n(7) 维多利亚是骑士  \n(8) 丹尼尔是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：格蕾丝、利亚姆、阿比盖尔、梅森、雅各布、亨利、艾弗里和伊莎贝拉。格蕾丝说：“梅森是骑士，伊莎贝拉是骑士。”利亚姆说：“如果艾弗里是骑士，那么亨利就是骑士。”根据阿比盖尔的说法，“阿比盖尔是骑士或者艾弗里是骑士。”梅森表示利亚姆不是无赖。雅各布说：“利亚姆是无赖或者伊莎贝拉是无赖。”亨利评论道：“梅森是骑士，阿比盖尔是无赖。”艾弗里指出：“亨利是骑士当且仅当伊莎贝拉是无赖。”伊莎贝拉说：“雅各布是骑士当且仅当雅各布是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）格蕾丝是无赖  \n（2）利亚姆是骑士  \n（3）阿比盖尔是骑士  \n（4）梅森是骑士  \n（5）雅各布是骑士  \n（6）亨利是无赖  \n（7）艾弗里是无赖  \n（8）伊莎贝拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：塞缪尔、阿梅莉亚、亚历山大、艾娃、詹姆斯、艾登、迈克尔和奥利维亚。塞缪尔提到：“詹姆斯是无赖当且仅当亚历山大是骑士。”阿梅莉亚声称：“亚历山大是无赖，艾登是骑士。”在亚历山大的话中：“迈克尔是无赖当且仅当塞缪尔是无赖。”艾娃告诉你，如果艾登是骑士，那么阿梅莉亚就是骑士。“亚历山大不是骑士”——詹姆斯。艾登指出：“奥利维亚是无赖当且仅当艾娃是骑士。”迈克尔评论道：“艾娃是骑士，奥利维亚是无赖。”奥利维亚表示亚历山大是无赖或者詹姆斯是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是一名骑士  \n(2) 阿梅莉亚是一名无赖  \n(3) 亚历山大是一名无赖  \n(4) 艾娃是一名骑士  \n(5) 詹姆斯是一名骑士  \n(6) 艾登是一名无赖  \n(7) 迈克尔是一名无赖  \n(8) 奥利维亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：斯嘉丽、克洛伊、伊丽莎白、奥萝拉、阿梅莉亚、索菲娅、伊莎贝拉和阿丽亚。斯嘉丽评论道：“阿丽亚是无赖，奥萝拉是无赖。”克洛伊断言：“阿梅莉亚不是骑士。”伊丽莎白被听到说：“伊莎贝拉是无赖，索菲娅是无赖。”奥萝拉指出：“克洛伊是骑士，阿丽亚是骑士。”阿梅莉亚声称：“奥萝拉是无赖。”索菲娅告诉你，奥萝拉不是骑士。伊莎贝拉评论道：“阿梅莉亚是无赖，伊丽莎白是骑士。”阿丽亚说道：“索菲娅不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 斯嘉丽是骑士  \n(2) 克洛伊是无赖  \n(3) 伊丽莎白是无赖  \n(4) 奥萝拉是无赖  \n(5) 阿梅莉亚是骑士  \n(6) 索菲娅是骑士  \n(7) 伊莎贝拉是无赖  \n(8) 阿丽亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：米娅、卢克、维多利亚、哈珀、索菲娅、佐伊、莉莉和艾弗里。“维多利亚是无赖或者艾弗里是无赖”——米娅说。卢克声明：“哈珀是骑士或者米娅是骑士”。维多利亚提到：“莉莉是骑士”。哈珀告诉你，佐伊不是无赖。索菲娅说佐伊是无赖而维多利亚是骑士。“莉莉不是无赖”——佐伊说。在莉莉的陈述中：“如果索菲娅是骑士，那么维多利亚是骑士”。正如艾弗里所说：“佐伊是无赖”。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是骑士  \n(2) 卢克是骑士  \n(3) 维多利亚是骑士  \n(4) 哈珀是骑士  \n(5) 索菲娅是无赖  \n(6) 佐伊是骑士  \n(7) 莉莉是骑士  \n(8) 艾弗里是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：威廉、伊芙琳、塞巴斯蒂安、亚历山大、马修、伊莎贝拉、佐伊和杰克。威廉说：“马修是骑士当且仅当塞巴斯蒂安是无赖。”伊芙琳说：“杰克是无赖或者佐伊是无赖。”塞巴斯蒂安提到：“马修是无赖。”亚历山大评论道：“伊芙琳不是无赖。”马修说：“威廉是无赖或者亚历山大是无赖。”伊莎贝拉说：“亚历山大是骑士或者威廉是骑士。”佐伊表示威廉是骑士或者伊芙琳是无赖。杰克提到：“塞巴斯蒂安是骑士而伊芙琳是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 伊芙琳是一名骑士  \n(3) 塞巴斯蒂安是一名骑士  \n(4) 亚历山大是一名骑士  \n(5) 马修是一名无赖  \n(6) 伊莎贝拉是一名骑士  \n(7) 佐伊是一名骑士  \n(8) 杰克是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：阿丽亚、洛根、诺亚、利亚姆、索菲娅、艾米莉、约瑟夫和索菲娅。阿丽亚说：“艾米莉是骑士，约瑟夫是骑士。”洛根说：“阿丽亚是骑士，或者约瑟夫是骑士。”诺亚说：“索菲娅是无赖，或者索菲娅是骑士。”利亚姆告诉你诺亚是骑士。索菲娅提到：“利亚姆是无赖。”艾米莉说：“诺亚不是无赖。”约瑟夫说：“艾米莉是无赖，洛根是骑士。”索菲娅告诉你：“如果洛根是无赖，那么洛根就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿丽亚是无赖  \n(2) 洛根是无赖  \n(3) 诺亚是骑士  \n(4) 利亚姆是骑士  \n(5) 索菲娅是无赖  \n(6) 艾米莉是骑士  \n(7) 约瑟夫是无赖  \n(8) 索菲娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：伊芙琳、克洛伊、约瑟夫、哈珀、艾登、阿丽亚、赖利和米娅。“阿丽亚是无赖或者米娅是骑士，”伊芙琳说。克洛伊表示赖利不是无赖。“哈珀不是无赖，”约瑟夫声称。哈珀评论道：“如果赖利是骑士，那么米娅就是无赖。”艾登在一份声明中说：“哈珀是骑士或者米娅是骑士。”阿丽亚提到：“如果赖利是骑士，那么哈珀就是无赖。”赖利指出：“克洛伊是骑士，约瑟夫是无赖。”米娅说：“阿丽亚不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是无赖  \n(2) 克洛伊是无赖  \n(3) 约瑟夫是骑士  \n(4) 哈珀是骑士  \n(5) 艾登是骑士  \n(6) 阿丽亚是骑士  \n(7) 赖利是无赖  \n(8) 米娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：索菲娅、亨利、利亚姆、艾登、阿比盖尔、杰克逊、米娅和雅各布。“索菲娅是骑士，雅各布是骑士”——索菲娅说。亨利说，如果雅各布是骑士，那么利亚姆就是无赖。利亚姆声明：“阿比盖尔是无赖，米娅是骑士。”艾登断言：“亨利是骑士当且仅当杰克逊是无赖。”阿比盖尔告诉你，如果索菲娅是骑士，那么米娅就是骑士。杰克逊说：“索菲娅是无赖或者艾登是骑士。”米娅被听到说：“利亚姆是骑士，阿比盖尔是无赖。”雅各布被听到说：“艾登不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）索菲娅是无赖  \n（2）亨利是骑士  \n（3）利亚姆是无赖  \n（4）艾登是无赖  \n（5）阿比盖尔是骑士  \n（6）杰克逊是骑士  \n（7）米娅是无赖  \n（8）雅各布是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：奥利维亚、哈珀、艾登、艾拉、迈克尔、阿梅莉亚、本杰明和奥利弗。奥利维亚说：“奥利弗是骑士。”哈珀断言：“迈克尔不是骑士。”艾登说：“阿梅莉亚是骑士，奥利维亚是无赖。”艾拉说：“哈珀是骑士或者奥利维亚是骑士。”迈克尔的陈述是：“艾登是无赖当且仅当奥利弗是骑士。”阿梅莉亚说：“艾拉不是骑士。”本杰明表示艾拉是无赖，奥利维亚是骑士。“奥利弗是骑士当且仅当艾登是骑士，”奥利弗声称。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是无赖  \n(2) 哈珀是无赖  \n(3) 艾登是骑士  \n(4) 艾拉是无赖  \n(5) 迈克尔是骑士  \n(6) 阿梅莉亚是骑士  \n(7) 本杰明是无赖  \n(8) 奥利弗是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：亚历山大、卢克、亨利、阿比盖尔、伊丽莎白、迈克尔、伊莎贝拉和格蕾丝。亚历山大说：“格蕾丝是骑士或者伊莎贝拉是无赖。”卢克的陈述是：“亨利是骑士。”亨利断言：“如果格蕾丝是骑士，那么阿比盖尔就是骑士。”阿比盖尔评论道：“伊丽莎白是无赖，亨利也是无赖。”伊丽莎白告诉你，伊莎贝拉是骑士。迈克尔表示：“卢克是骑士当且仅当格蕾丝是无赖。”伊莎贝拉评论道：“迈克尔是骑士或者伊莎贝拉是骑士。”格蕾丝说：“迈克尔是骑士或者阿比盖尔是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）亚历山大是骑士  \n（2）卢克是无赖  \n（3）亨利是无赖  \n（4）阿比盖尔是无赖  \n（5）伊丽莎白是骑士  \n（6）迈克尔是骑士  \n（7）伊莎贝拉是骑士  \n（8）格蕾丝是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：格蕾丝、佐伊、夏洛特、赖利、伊芙琳、迈克尔、约瑟夫和詹姆斯。格蕾丝说，如果詹姆斯是骑士，那么夏洛特就是无赖。佐伊说：“约瑟夫是骑士或者詹姆斯是无赖。”夏洛特被听到说：“佐伊是骑士。”赖利说：“佐伊是骑士或者迈克尔是无赖。”伊芙琳表示詹姆斯不是无赖。迈克尔的陈述是：“赖利是无赖当且仅当夏洛特是骑士。”约瑟夫告诉你迈克尔是无赖而詹姆斯是骑士。詹姆斯被听到说：“佐伊是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是无赖  \n(2) 佐伊是骑士  \n(3) 夏洛特是骑士  \n(4) 赖利是骑士  \n(5) 伊芙琳是骑士  \n(6) 迈克尔是无赖  \n(7) 约瑟夫是骑士  \n(8) 詹姆斯是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：赖利、伊芙琳、艾弗里、伊莎贝拉、艾登、伊森、格蕾丝和夏洛特。赖利的陈述是：“格蕾丝不是无赖。”伊芙琳说：“伊莎贝拉不是骑士。”艾弗里告诉你，伊芙琳不是骑士。“如果夏洛特是骑士，那么伊森就是无赖，”伊莎贝拉宣称。艾登断言：“艾弗里是无赖当且仅当夏洛特是无赖。”伊森评论道：“如果赖利是无赖，那么格蕾丝就是骑士。”格蕾丝提到：“伊森是骑士，伊芙琳是骑士。”夏洛特声明：“如果伊森是骑士，那么伊森就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是无赖  \n(2) 伊芙琳是无赖  \n(3) 艾弗里是骑士  \n(4) 伊莎贝拉是骑士  \n(5) 艾登是骑士  \n(6) 伊森是无赖  \n(7) 格蕾丝是无赖  \n(8) 夏洛特是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：利亚姆、威廉、佩内洛普、卢克、索菲娅、大卫、约瑟夫和莉莉。利亚姆评论道：“卢克不是骑士。”威廉的陈述是：“利亚姆是骑士当且仅当大卫是无赖。”佩内洛普说，索菲娅是无赖当且仅当约瑟夫是无赖。“佩内洛普是骑士而大卫是骑士，”卢克声称。索菲娅被听到说：“如果佩内洛普是骑士，那么莉莉就是无赖。”大卫说：“如果利亚姆是无赖，那么大卫就是骑士。”约瑟夫说索菲娅不是骑士。“如果威廉是无赖，那么约瑟夫就是无赖，”莉莉说。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是一名骑士  \n(2) 威廉是一个无赖  \n(3) 佩内洛普是一个无赖  \n(4) 卢克是一个无赖  \n(5) 索菲娅是一名骑士  \n(6) 大卫是一名骑士  \n(7) 约瑟夫是一个无赖  \n(8) 莉莉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：斯嘉丽、威廉、亚历山大、杰克、詹姆斯、杰克逊、艾拉和奥利维亚。斯嘉丽评论道：“杰克是骑士或者艾拉是无赖。”根据威廉的说法，“威廉是骑士并且艾拉是骑士。”亚历山大被听到说：“杰克逊是无赖并且詹姆斯是无赖。”在杰克的话中：“如果艾拉是骑士，那么杰克逊就是无赖。”詹姆斯评论道：“杰克不是无赖。”杰克逊表示威廉不是无赖。艾拉告诉你杰克不是无赖。在奥利维亚的陈述中：“詹姆斯是无赖并且威廉是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 斯嘉丽是一名骑士  \n(2) 威廉是一个无赖  \n(3) 亚历山大是一个无赖  \n(4) 杰克是一名骑士  \n(5) 詹姆斯是一名骑士  \n(6) 杰克逊是一个无赖  \n(7) 艾拉是一名骑士  \n(8) 奥利维亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：格蕾丝、赖利、卢克、马修、佩内洛普、米娅、夏洛特和卢卡斯。格蕾丝被听到说：“夏洛特是骑士当且仅当夏洛特是无赖。”赖利声明：“佩内洛普是无赖，卢卡斯是无赖。”卢克被听到说：“赖利是无赖当且仅当卢卡斯是骑士。”马修宣称：“夏洛特不是骑士。”佩内洛普声称：“如果卢克是无赖，那么米娅是无赖。”米娅声称：“赖利是骑士当且仅当马修是无赖。”夏洛特声明：“卢卡斯不是骑士。”卢卡斯声称：“夏洛特是无赖，夏洛特是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是无赖  \n(2) 赖利是无赖  \n(3) 卢克是无赖  \n(4) 马修是无赖  \n(5) 佩内洛普是骑士  \n(6) 米娅是无赖  \n(7) 夏洛特是骑士  \n(8) 卢卡斯是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：诺亚、赖利、约瑟夫、艾玛、迈克尔、杰克逊、卢卡斯和哈珀。诺亚说：“迈克尔是骑士。”赖利被听到说：“哈珀是骑士当且仅当迈克尔是骑士。”在约瑟夫的话中：“艾玛是无赖或者艾玛是骑士。”艾玛评论道：“如果杰克逊是骑士，那么杰克逊就是无赖。”迈克尔说：“赖利是骑士或者卢卡斯是无赖。”杰克逊声称：“卢卡斯是无赖或者哈珀是无赖。”卢卡斯的声明是：“约瑟夫不是骑士。”哈珀则表示：“约瑟夫是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是一名骑士  \n(2) 赖利是一名无赖  \n(3) 约瑟夫是一名骑士  \n(4) 艾玛是一名无赖  \n(5) 迈克尔是一名骑士  \n(6) 杰克逊是一名骑士  \n(7) 卢卡斯是一名无赖  \n(8) 哈珀是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：迈克尔、雅各布、约瑟夫、阿比盖尔、亚历山大、艾娃、索菲娅和艾弗里。迈克尔说：“索菲娅不是骑士。”雅各布说：“阿比盖尔是骑士或者迈克尔是无赖。”约瑟夫宣称：“迈克尔是无赖，艾弗里是无赖。”阿比盖尔评论道：“艾弗里是无赖。”亚历山大指出：“索菲娅是骑士或者约瑟夫是骑士。”艾娃说：“如果亚历山大是骑士，那么艾弗里是骑士。”索菲娅评论道：“亚历山大是无赖当且仅当雅各布是骑士。”艾弗里的声明是：“亚历山大是无赖或者索菲娅是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是一名骑士  \n(2) 雅各布是一个无赖  \n(3) 约瑟夫是一个无赖  \n(4) 阿比盖尔是一个无赖  \n(5) 亚历山大是一个无赖  \n(6) 艾娃是一名骑士  \n(7) 索菲娅是一个无赖  \n(8) 艾弗里是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：威廉、艾玛、塞巴斯蒂安、佐伊、洛根、塞缪尔、佩内洛普和伊森。威廉说：“塞缪尔是骑士，塞巴斯蒂安是无赖。”艾玛说：“洛根不是无赖。”塞巴斯蒂安宣称：“只有佐伊是无赖时，塞缪尔才是骑士。”佐伊宣称：“艾玛是无赖，威廉是无赖。”洛根被听到说：“塞巴斯蒂安是无赖。”塞缪尔说：“只有伊森是骑士时，洛根才是无赖。”佩内洛普说：“威廉是骑士或者艾玛是无赖。”伊森告诉你，佩内洛普是骑士，艾玛是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是无赖  \n(2) 艾玛是无赖  \n(3) 塞巴斯蒂安是骑士  \n(4) 佐伊是骑士  \n(5) 洛根是无赖  \n(6) 塞缪尔是无赖  \n(7) 佩内洛普是骑士  \n(8) 伊森是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：佐伊、艾弗里、亚历山大、塞巴斯蒂安、诺亚、洛根、艾玛和塞缪尔。佐伊说：“诺亚是无赖，塞巴斯蒂安是无赖。”艾弗里声称：“佐伊是无赖或者塞缪尔是无赖。”亚历山大提到：“佐伊是骑士当且仅当塞巴斯蒂安是无赖。”塞巴斯蒂安说：“如果艾弗里是无赖，那么塞缪尔就是骑士。”诺亚说：“佐伊不是无赖。”洛根宣称：“亚历山大是无赖或者艾弗里是骑士。”艾玛被听到说：“如果艾弗里是无赖，那么塞缪尔就是无赖。”塞缪尔说：“艾玛是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佐伊是无赖  \n(2) 艾弗里是骑士  \n(3) 亚历山大是骑士  \n(4) 塞巴斯蒂安是骑士  \n(5) 诺亚是无赖  \n(6) 洛根是骑士  \n(7) 艾玛是骑士  \n(8) 塞缪尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：格蕾丝、佐伊、伊丽莎白、维多利亚、约瑟夫、塞巴斯蒂安、诺亚和米娅。格蕾丝说：“伊丽莎白是无赖，诺亚是无赖。”佐伊表示，如果米娅是骑士，那么维多利亚就是骑士。伊丽莎白被听到说：“维多利亚是无赖。”维多利亚被听到说：“约瑟夫是骑士，格蕾丝是骑士。”约瑟夫断言：“格蕾丝是骑士，伊丽莎白是骑士。”塞巴斯蒂安宣称：“诺亚是骑士。”诺亚评论道：“佐伊是骑士或者伊丽莎白是骑士。”米娅断言：“维多利亚不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）格蕾丝是无赖  \n（2）佐伊是无赖  \n（3）伊丽莎白是骑士  \n（4）维多利亚是无赖  \n（5）约瑟夫是无赖  \n（6）塞巴斯蒂安是骑士  \n（7）诺亚是骑士  \n（8）米娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：艾拉、卢克、克洛伊、艾登、哈珀、艾玛、梅森和奥萝拉。正如艾拉所说：“艾登是无赖，梅森是骑士。”卢克被听到说：“哈珀不是骑士。”克洛伊声明：“梅森不是骑士。”艾登宣称：“艾玛是骑士当且仅当梅森是无赖。”哈珀说：“克洛伊不是骑士。”艾玛被听到说：“卢克是无赖。”梅森说：“克洛伊是无赖或者艾拉是无赖。”在奥萝拉的话中：“梅森是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是一名骑士  \n(2) 卢克是一个无赖  \n(3) 克洛伊是一个无赖  \n(4) 艾登是一个无赖  \n(5) 哈珀是一名骑士  \n(6) 艾玛是一名骑士  \n(7) 梅森是一名骑士  \n(8) 奥萝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：莉莉、伊芙琳、索菲娅、艾登、奥利弗、梅森、杰克和亨利。莉莉提到：“艾登是骑士，亨利是无赖。”伊芙琳声称：“如果伊芙琳是骑士，那么索菲娅就是骑士。”索菲娅表示莉莉是无赖或者莉莉是骑士。艾登声称：“奥利弗是骑士或者艾登是骑士。”奥利弗评论道：“如果伊芙琳是骑士，那么奥利弗就是骑士。”梅森提到：“索菲娅是骑士。”杰克说：“只有当伊芙琳是骑士时，奥利弗才是骑士。”亨利声明：“莉莉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是无赖  \n(2) 伊芙琳是骑士  \n(3) 索菲娅是骑士  \n(4) 艾登是无赖  \n(5) 奥利弗是无赖  \n(6) 梅森是骑士  \n(7) 杰克是无赖  \n(8) 亨利是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：杰克逊、索菲娅、莉莉、赖利、伊森、阿比盖尔、亨利和詹姆斯。杰克逊告诉你：“如果赖利是骑士，那么詹姆斯就是无赖。”索菲娅声称：“赖利是骑士，阿比盖尔是骑士。”莉莉声称：“亨利是无赖或者杰克逊是骑士。”赖利被听到说：“亨利不是骑士。”伊森的陈述是：“杰克逊是骑士或者莉莉是无赖。”阿比盖尔提到：“如果伊森是骑士，那么索菲娅就是无赖。”亨利表示赖利是骑士或者伊森是骑士。詹姆斯评论道：“如果阿比盖尔是无赖，那么杰克逊就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是一名骑士  \n(2) 索菲娅是一个无赖  \n(3) 莉莉是一名骑士  \n(4) 赖利是一个无赖  \n(5) 伊森是一名骑士  \n(6) 阿比盖尔是一名骑士  \n(7) 亨利是一名骑士  \n(8) 詹姆斯是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：格蕾丝、赖利、塞缪尔、亚历山大、诺亚、欧文、奥利维亚和詹姆斯。格蕾丝说：“奥利维亚是骑士，欧文是无赖。”赖利宣称：“如果诺亚是骑士，那么塞缪尔就是骑士。”塞缪尔被听到说：“如果詹姆斯是无赖，那么赖利就是骑士。”亚历山大说：“塞缪尔是无赖当且仅当亚历山大是骑士。”诺亚注意到：“如果诺亚是骑士，那么亚历山大就是骑士。”欧文声称：“如果詹姆斯是无赖，那么赖利就是骑士。”奥利维亚被听到说：“如果亚历山大是无赖，那么詹姆斯就是无赖。”詹姆斯宣称：“詹姆斯是骑士或者亚历山大是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是一名骑士  \n(2) 赖利是一个无赖  \n(3) 塞缪尔是一个无赖  \n(4) 亚历山大是一名骑士  \n(5) 诺亚是一名骑士  \n(6) 欧文是一个无赖  \n(7) 奥利维亚是一名骑士  \n(8) 詹姆斯是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：奥利维亚、马修、艾拉、欧文、艾玛、雅各布、米娅和大卫。奥利维亚告诉你，米娅是骑士当且仅当艾拉是骑士。马修说：“雅各布是无赖，米娅是骑士。”艾拉宣称：“艾拉是骑士当且仅当艾玛是骑士。”欧文说：“艾拉是骑士。”艾玛提到：“马修不是无赖。”雅各布告诉你，奥利维亚是骑士。米娅表示，如果奥利维亚是骑士，那么雅各布是骑士。大卫说，欧文是无赖当且仅当艾玛是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是无赖  \n(2) 马修是骑士  \n(3) 艾拉是无赖  \n(4) 欧文是无赖  \n(5) 艾玛是骑士  \n(6) 雅各布是无赖  \n(7) 米娅是骑士  \n(8) 大卫是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：索菲娅、艾娃、莉莉、佩内洛普、阿梅莉亚、塞巴斯蒂安、伊森和卢克。“阿梅莉亚是无赖，佩内洛普是无赖，”索菲娅声称。艾娃指出：“索菲娅是骑士，或者莉莉是无赖。”莉莉告诉你索菲娅是骑士。“阿梅莉亚是无赖，或者索菲娅是骑士，”佩内洛普提到。“如果卢克是无赖，那么索菲娅就是无赖，”阿梅莉亚宣称。塞巴斯蒂安指出：“莉莉是骑士。” “塞巴斯蒂安不是无赖，”伊森提到。在卢克的陈述中：“莉莉不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 艾娃是骑士  \n(3) 莉莉是无赖  \n(4) 佩内洛普是无赖  \n(5) 阿梅莉亚是骑士  \n(6) 塞巴斯蒂安是无赖  \n(7) 伊森是无赖  \n(8) 卢克是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：迈克尔、艾玛、索菲娅、阿丽亚、亨利、克洛伊、格蕾丝和约瑟夫。“如果克洛伊是无赖，那么克洛伊就是骑士。”——迈克尔说。“如果约瑟夫是无赖，那么阿丽亚就是无赖，”艾玛声称。索菲娅表示，艾玛是无赖当且仅当格蕾丝是无赖。阿丽亚说阿丽亚是骑士或者约瑟夫是骑士。在亨利的陈述中：“迈克尔不是骑士。”克洛伊说：“如果克洛伊是骑士，那么阿丽亚就是骑士。”正如格蕾丝所说：“如果亨利是无赖，那么阿丽亚就是骑士。”约瑟夫说：“如果亨利是无赖，那么克洛伊就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是一名骑士  \n(2) 艾玛是一名骑士  \n(3) 索菲娅是一名骑士  \n(4) 阿丽亚是一名骑士  \n(5) 亨利是一名无赖  \n(6) 克洛伊是一名骑士  \n(7) 格蕾丝是一名骑士  \n(8) 约瑟夫是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：阿丽亚、丹尼尔、维多利亚、奥萝拉、艾玛、洛根、索菲娅和佐伊。“维多利亚是个无赖，”阿丽亚宣称。丹尼尔说：“佐伊是个无赖。”维多利亚告诉你，如果阿丽亚是骑士，那么洛根就是骑士。“佐伊是个无赖，丹尼尔也是个无赖，”奥萝拉说。艾玛的声明是：“阿丽亚是骑士当且仅当洛根是骑士。”洛根声称：“维多利亚是骑士当且仅当佐伊是骑士。”索菲娅被听到说：“奥萝拉是个无赖或者丹尼尔是个无赖。”佐伊评论道：“奥萝拉是骑士当且仅当阿丽亚是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿丽亚是无赖  \n(2) 丹尼尔是无赖  \n(3) 维多利亚是骑士  \n(4) 奥萝拉是无赖  \n(5) 艾玛是无赖  \n(6) 洛根是骑士  \n(7) 索菲娅是骑士  \n(8) 佐伊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：诺亚、卢卡斯、克洛伊、奥利维亚、索菲娅、迈克尔、詹姆斯和赖利。诺亚说：“奥利维亚是无赖，詹姆斯是无赖。”卢卡斯提到：“詹姆斯是无赖或者迈克尔是无赖。”克洛伊说：“诺亚不是骑士。”奥利维亚说：“如果迈克尔是骑士，那么诺亚就是无赖。”索菲娅被听到说：“卢卡斯是骑士当且仅当奥利维亚是无赖。”迈克尔提到：“如果克洛伊是骑士，那么迈克尔就是骑士。”詹姆斯说：“迈克尔是无赖或者卢卡斯是骑士。”赖利评论道：“索菲娅是骑士或者卢卡斯是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是一个无赖  \n(2) 卢卡斯是一个骑士  \n(3) 克洛伊是一个骑士  \n(4) 奥利维亚是一个骑士  \n(5) 索菲娅是一个无赖  \n(6) 迈克尔是一个无赖  \n(7) 詹姆斯是一个骑士  \n(8) 赖利是一个骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：艾玛、雅各布、奥利维亚、塞巴斯蒂安、詹姆斯、斯嘉丽、欧文和米娅。艾玛说：“斯嘉丽是骑士当且仅当詹姆斯是无赖。”雅各布表示欧文是骑士。奥利维亚评论道：“如果欧文是无赖，那么米娅就是骑士。”塞巴斯蒂安评论道：“詹姆斯是骑士。”在詹姆斯的话中：“米娅是骑士，米娅是无赖。”斯嘉丽声称：“米娅是无赖，斯嘉丽是骑士。”欧文的陈述是：“如果米娅是无赖，那么塞巴斯蒂安就是无赖。”米娅断言：“雅各布是骑士，塞巴斯蒂安是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是无赖  \n(2) 雅各布是骑士  \n(3) 奥利维亚是骑士  \n(4) 塞巴斯蒂安是无赖  \n(5) 詹姆斯是无赖  \n(6) 斯嘉丽是无赖  \n(7) 欧文是骑士  \n(8) 米娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：佩内洛普、伊森、艾娃、伊莎贝拉、奥萝拉、塞缪尔、哈珀和艾玛。佩内洛普说：“佩内洛普是骑士。”伊森说：“如果艾娃是无赖，那么伊森就是骑士。”艾娃说：“哈珀是骑士或者艾玛是骑士。”伊莎贝拉指出：“如果奥萝拉是骑士，那么佩内洛普就是骑士。”奥萝拉评论道：“哈珀是无赖或者伊莎贝拉是骑士。”塞缪尔指出：“伊莎贝拉是骑士或者艾玛是无赖。”哈珀声称：“奥萝拉是骑士或者佩内洛普是无赖。”艾玛说：“伊森是无赖而哈珀是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是一名骑士  \n(2) 伊森是一名骑士  \n(3) 艾娃是一名骑士  \n(4) 伊莎贝拉是一名骑士  \n(5) 奥萝拉是一名骑士  \n(6) 塞缪尔是一名骑士  \n(7) 哈珀是一名骑士  \n(8) 艾玛是一名无赖"
    },
    {
        "quiz": "一个非常特别的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：格蕾丝、艾登、克洛伊、马修、杰克、卢卡斯、阿梅莉亚和米娅。格蕾丝的陈述是：“如果卢卡斯是无赖，那么阿梅莉亚就是无赖。”艾登指出：“卢卡斯是无赖当且仅当艾登是骑士。”克洛伊的陈述是：“杰克是骑士。”根据马修的说法：“克洛伊是无赖，艾登是骑士。”杰克评论道：“如果卢卡斯是无赖，那么阿梅莉亚就是骑士。”卢卡斯提到：“马修不是无赖。”阿梅莉亚提到：“如果艾登是无赖，那么格蕾丝就是骑士。”米娅被听到说：“阿梅莉亚不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是无赖  \n(2) 艾登是骑士  \n(3) 克洛伊是骑士  \n(4) 马修是无赖  \n(5) 杰克是骑士  \n(6) 卢卡斯是无赖  \n(7) 阿梅莉亚是骑士  \n(8) 米娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：阿比盖尔、夏洛特、威廉、伊芙琳、维多利亚、索菲娅、伊莎贝拉和奥萝拉。根据阿比盖尔的说法，“如果伊莎贝拉是骑士，那么阿比盖尔就是骑士。”夏洛特评论道，“威廉是无赖，伊莎贝拉是无赖。”威廉说阿比盖尔是无赖。伊芙琳提到，“如果威廉是骑士，那么索菲娅就是骑士。”维多利亚说阿比盖尔不是骑士。索菲娅说，“伊莎贝拉是无赖，威廉是骑士。”伊莎贝拉说，“索菲娅是骑士，阿比盖尔是无赖。”奥萝拉说，“伊芙琳是骑士或者伊莎贝拉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是一名骑士  \n(2) 夏洛特是一名骑士  \n(3) 威廉是一个无赖  \n(4) 伊芙琳是一名骑士  \n(5) 维多利亚是一个无赖  \n(6) 索菲娅是一个无赖  \n(7) 伊莎贝拉是一个无赖  \n(8) 奥萝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：亨利、伊丽莎白、塞缪尔、艾米莉、索菲娅、本杰明、梅森和詹姆斯。亨利告诉你梅森是骑士，索菲娅是无赖。伊丽莎白说：“亨利不是无赖。”塞缪尔指出：“索菲娅是骑士。”在艾米莉的话中：“詹姆斯是骑士或者伊丽莎白是无赖。”索菲娅的陈述是：“伊丽莎白是无赖，本杰明是无赖。”本杰明说亨利是骑士。梅森声明：“索菲娅是无赖当且仅当伊丽莎白是无赖。”詹姆斯评论道：“梅森是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是无赖  \n(2) 伊丽莎白是无赖  \n(3) 塞缪尔是骑士  \n(4) 艾米莉是骑士  \n(5) 索菲娅是骑士  \n(6) 本杰明是无赖  \n(7) 梅森是无赖  \n(8) 詹姆斯是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：格蕾丝、索菲娅、艾娃、大卫、伊莎贝拉、亨利、威廉和伊丽莎白。格蕾丝说：“艾娃是骑士当且仅当亨利是骑士。”索菲娅告诉你，如果艾娃是骑士，那么艾娃就是无赖。“大卫是无赖，格蕾丝是骑士，”艾娃声称。大卫断言：“索菲娅不是骑士。”伊莎贝拉宣称：“如果索菲娅是骑士，那么格蕾丝就是无赖。”亨利说，如果索菲娅是无赖，那么艾娃就是骑士。威廉说：“伊丽莎白是无赖，伊莎贝拉是无赖。”伊丽莎白说：“亨利是骑士或者伊丽莎白是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是无赖  \n(2) 索菲娅是骑士  \n(3) 艾娃是无赖  \n(4) 大卫是无赖  \n(5) 伊莎贝拉是骑士  \n(6) 亨利是骑士  \n(7) 威廉是无赖  \n(8) 伊丽莎白是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：詹姆斯、伊丽莎白、佩内洛普、卢卡斯、梅森、奥利弗、佐伊和艾玛。詹姆斯说：“奥利弗是个无赖。”伊丽莎白表示佩内洛普是无赖或者梅森是无赖。“艾玛不是无赖，”佩内洛普提到。卢卡斯的声明是：“伊丽莎白是无赖或者梅森是无赖。”梅森断言：“如果伊丽莎白是无赖，那么伊丽莎白就是骑士。”奥利弗宣称：“佩内洛普不是骑士。”佐伊说：“梅森是无赖。”艾玛说：“佩内洛普是无赖，卢卡斯是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是无赖  \n(2) 伊丽莎白是骑士  \n(3) 佩内洛普是无赖  \n(4) 卢卡斯是无赖  \n(5) 梅森是骑士  \n(6) 奥利弗是骑士  \n(7) 佐伊是无赖  \n(8) 艾玛是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：塞缪尔、威廉、艾弗里、维多利亚、梅森、诺亚、奥利弗和奥利维亚。塞缪尔说：“奥利维亚不是无赖。”威廉指出：“如果奥利弗是骑士，那么梅森就是骑士。”艾弗里提到：“奥利维亚是无赖或者奥利弗是无赖。”维多利亚声称：“奥利弗不是无赖。”梅森声称：“诺亚是骑士，奥利维亚是骑士。”诺亚声称：“梅森是骑士。”奥利弗说道：“奥利维亚是无赖。”奥利维亚评论道：“维多利亚是骑士，而维多利亚是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是无赖  \n(2) 威廉是无赖  \n(3) 艾弗里是骑士  \n(4) 维多利亚是骑士  \n(5) 梅森是无赖  \n(6) 诺亚是无赖  \n(7) 奥利弗是骑士  \n(8) 奥利维亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：奥利弗、卢克、亨利、莉莉、杰克逊、诺亚、约瑟夫和索菲娅。奥利弗声称：“杰克逊是骑士或者卢克是无赖。”卢克断言：“杰克逊是骑士或者约瑟夫是骑士。”亨利被听到说：“奥利弗不是无赖。”莉莉的话是：“诺亚是骑士当且仅当索菲娅是骑士。”杰克逊评论道：“莉莉不是骑士。”诺亚被听到说：“如果奥利弗是骑士，那么约瑟夫是骑士。”约瑟夫声明：“索菲娅是骑士当且仅当诺亚是无赖。”索菲娅指出：“莉莉是无赖当且仅当奥利弗是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利弗是一名骑士  \n(2) 卢克是一个无赖  \n(3) 亨利是一名骑士  \n(4) 莉莉是一名骑士  \n(5) 杰克逊是一个无赖  \n(6) 诺亚是一个无赖  \n(7) 约瑟夫是一个无赖  \n(8) 索菲娅是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：本杰明、亚历山大、哈珀、伊芙琳、艾玛、艾拉、艾娃和赖利。本杰明说：“艾玛是无赖当且仅当哈珀是无赖。”亚历山大说：“艾娃是无赖或者艾玛是骑士。”根据哈珀的说法：“艾娃是无赖并且艾娃是骑士。”伊芙琳宣称：“如果艾娃是无赖，那么艾拉就是无赖。”艾玛表示：“亚历山大是骑士当且仅当本杰明是无赖。”艾拉被听到说：“如果赖利是骑士，那么艾拉就是骑士。”在艾娃的话中：“本杰明不是无赖。”在赖利的话中：“哈珀是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是无赖  \n(2) 亚历山大是骑士  \n(3) 哈珀是无赖  \n(4) 伊芙琳是无赖  \n(5) 艾玛是骑士  \n(6) 艾拉是骑士  \n(7) 艾娃是无赖  \n(8) 赖利是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：阿比盖尔、梅森、赖利、维多利亚、伊森、雅各布、夏洛特和卢卡斯。阿比盖尔被听到说：“维多利亚是个无赖。”梅森被听到说：“卢卡斯是骑士当且仅当夏洛特是骑士。”赖利被听到说：“维多利亚是个无赖或者维多利亚是个骑士。”维多利亚说：“梅森是个无赖。”伊森指出：“阿比盖尔是骑士并且阿比盖尔是个无赖。”雅各布评论道：“伊森是个无赖。”夏洛特指出：“如果伊森是骑士，那么卢卡斯是骑士。”卢卡斯声明：“如果梅森是骑士，那么雅各布是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是一名骑士  \n(2) 梅森是一名骑士  \n(3) 赖利是一名骑士  \n(4) 维多利亚是一个无赖  \n(5) 伊森是一个无赖  \n(6) 雅各布是一名骑士  \n(7) 夏洛特是一名骑士  \n(8) 卢卡斯是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：阿梅莉亚、威廉、梅森、卢卡斯、詹姆斯、维多利亚、丹尼尔和赖利。阿梅莉亚表示，维多利亚是骑士当且仅当卢卡斯是骑士。威廉告诉你，如果丹尼尔是无赖，那么詹姆斯就是无赖。梅森被听到说：“如果阿梅莉亚是骑士，那么卢卡斯就是骑士。”卢卡斯的陈述是：“詹姆斯是骑士或者丹尼尔是骑士。”根据詹姆斯的说法，“梅森是无赖或者维多利亚是无赖。”维多利亚说：“赖利不是骑士。”正如丹尼尔所说，“威廉是骑士。”赖利提到：“阿梅莉亚是无赖当且仅当威廉是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是无赖  \n(2) 威廉是无赖  \n(3) 梅森是骑士  \n(4) 卢卡斯是骑士  \n(5) 詹姆斯是骑士  \n(6) 维多利亚是无赖  \n(7) 丹尼尔是无赖  \n(8) 赖利是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：艾玛、莉莉、艾弗里、奥萝拉、伊芙琳、诺亚、阿比盖尔和格蕾丝。艾玛说：“诺亚是个无赖。”根据莉莉的说法：“如果阿比盖尔是骑士，那么诺亚就是无赖。”艾弗里告诉你：“如果格蕾丝是无赖，那么艾弗里就是骑士。”奥萝拉说格蕾丝是骑士，伊芙琳也是骑士。伊芙琳说：“莉莉是无赖或者奥萝拉是无赖。”诺亚评论道：“伊芙琳是骑士，而伊芙琳是无赖。”在阿比盖尔的话中：“艾弗里是骑士当且仅当莉莉是无赖。”格蕾丝则表示：“伊芙琳是无赖当且仅当艾弗里是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是骑士  \n(2) 莉莉是骑士  \n(3) 艾弗里是无赖  \n(4) 奥萝拉是无赖  \n(5) 伊芙琳是骑士  \n(6) 诺亚是无赖  \n(7) 阿比盖尔是骑士  \n(8) 格蕾丝是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：杰克、詹姆斯、丹尼尔、卢克、艾登、威廉、大卫和奥利维亚。“卢克是骑士，”杰克宣称。有人听到詹姆斯说：“威廉是骑士，奥利维亚是骑士。”丹尼尔评论道：“威廉是骑士或者威廉是无赖。”卢克宣称：“詹姆斯是无赖或者丹尼尔是骑士。”艾登说：“丹尼尔是骑士或者詹姆斯是骑士。”威廉表示，如果詹姆斯是骑士，那么艾登就是无赖。大卫指出：“如果威廉是无赖，那么杰克就是无赖。”奥利维亚声明：“威廉是无赖，大卫是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克是骑士  \n(2) 詹姆斯是无赖  \n(3) 丹尼尔是骑士  \n(4) 卢克是骑士  \n(5) 艾登是骑士  \n(6) 威廉是骑士  \n(7) 大卫是骑士  \n(8) 奥利维亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：欧文、阿梅莉亚、艾米莉、杰克、迈克尔、约瑟夫、塞巴斯蒂安和艾拉。欧文说：“艾拉是骑士或者约瑟夫是骑士。”阿梅莉亚提到：“塞巴斯蒂安是无赖或者阿梅莉亚是骑士。”艾米莉说：“欧文是无赖。”杰克说：“迈克尔是骑士而约瑟夫是无赖。”迈克尔表示：“当且仅当杰克是骑士时，迈克尔才是骑士。”约瑟夫告诉你：“当且仅当杰克是无赖时，塞巴斯蒂安才是无赖。”塞巴斯蒂安说：“塞巴斯蒂安是骑士或者艾拉是无赖。”艾拉则说：“欧文不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是骑士  \n(2) 阿梅莉亚是骑士  \n(3) 艾米莉是无赖  \n(4) 杰克是骑士  \n(5) 迈克尔是骑士  \n(6) 约瑟夫是无赖  \n(7) 塞巴斯蒂安是无赖  \n(8) 艾拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：艾登、赖利、夏洛特、威廉、迈克尔、佐伊、伊莎贝拉和塞缪尔。艾登说：“艾登是骑士或者迈克尔是骑士。”赖利被听到说：“如果塞缪尔是骑士，那么艾登就是无赖。”根据夏洛特的说法，“塞缪尔是无赖或者艾登是无赖。”威廉评论道：“赖利不是无赖。”迈克尔提到：“塞缪尔是无赖当且仅当伊莎贝拉是无赖。”佐伊说，如果赖利是无赖，那么威廉就是无赖。伊莎贝拉断言：“威廉是骑士。”塞缪尔评论道：“艾登是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是一名骑士  \n(2) 赖利是一名骑士  \n(3) 夏洛特是一名骑士  \n(4) 威廉是一名骑士  \n(5) 迈克尔是一名无赖  \n(6) 佐伊是一名骑士  \n(7) 伊莎贝拉是一名骑士  \n(8) 塞缪尔是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：詹姆斯、奥萝拉、迈克尔、斯嘉丽、阿梅莉亚、本杰明、亨利和夏洛特。在詹姆斯的话中：“夏洛特是无赖当且仅当阿梅莉亚是骑士。”在奥萝拉的话中：“迈克尔是骑士或者本杰明是无赖。”迈克尔宣称：“詹姆斯是骑士当且仅当斯嘉丽是骑士。”斯嘉丽告诉你，奥萝拉不是无赖。在阿梅莉亚的话中：“奥萝拉是骑士当且仅当斯嘉丽是骑士。”根据本杰明的说法，“迈克尔是骑士而奥萝拉是无赖。”亨利被听到说：“阿梅莉亚不是骑士。”夏洛特评论道：“如果迈克尔是无赖，那么阿梅莉亚就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是无赖  \n(2) 奥萝拉是骑士  \n(3) 迈克尔是无赖  \n(4) 斯嘉丽是骑士  \n(5) 阿梅莉亚是骑士  \n(6) 本杰明是无赖  \n(7) 亨利是无赖  \n(8) 夏洛特是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：本杰明、利亚姆、亚历山大、艾娃、雅各布、马修、梅森和艾玛。根据本杰明的说法：“艾娃是骑士当且仅当本杰明是骑士。”利亚姆声称：“如果艾玛是骑士，那么本杰明就是无赖。”亚历山大声称：“如果本杰明是无赖，那么利亚姆就是无赖。”在艾娃的话中：“亚历山大是骑士，利亚姆是无赖。”雅各布说：“艾玛是无赖，梅森是无赖。”马修表示艾玛不是无赖。梅森说：“如果本杰明是无赖，那么利亚姆就是无赖。”艾玛说：“艾娃是骑士当且仅当雅各布是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是一名骑士  \n(2) 利亚姆是一个无赖  \n(3) 亚历山大是一名骑士  \n(4) 艾娃是一名骑士  \n(5) 雅各布是一个无赖  \n(6) 马修是一名骑士  \n(7) 梅森是一名骑士  \n(8) 艾玛是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：大卫、阿比盖尔、卢卡斯、佐伊、伊森、威廉、哈珀和伊莎贝拉。“阿比盖尔是骑士，威廉是骑士。”——大卫。阿比盖尔告诉你哈珀不是无赖。卢卡斯指出：“如果威廉是骑士，那么佐伊就是骑士。”根据佐伊的说法，“大卫是无赖当且仅当威廉是骑士。”伊森声称：“卢卡斯不是无赖。”威廉说：“哈珀是无赖，阿比盖尔是无赖。”哈珀断言：“伊森是无赖。”伊莎贝拉提到：“哈珀不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）大卫是无赖  \n（2）阿比盖尔是无赖  \n（3）卢卡斯是骑士  \n（4）佐伊是骑士  \n（5）伊森是骑士  \n（6）威廉是骑士  \n（7）哈珀是无赖  \n（8）伊莎贝拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：佐伊、奥利弗、亚历山大、索菲娅、杰克、艾玛、卢克和艾米莉。佐伊被听到说：“索菲娅是骑士。”在奥利弗的话中：“艾玛不是骑士。”亚历山大评论道：“索菲娅是无赖或者索菲娅是骑士。”索菲娅说：“杰克不是骑士。”杰克说奥利弗是骑士。艾玛指出：“卢克不是骑士。”卢克说：“索菲娅是骑士当且仅当佐伊是无赖。”艾米莉说：“索菲娅是无赖当且仅当杰克是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佐伊是一名骑士  \n(2) 奥利弗是一个无赖  \n(3) 亚历山大是一名骑士  \n(4) 索菲娅是一名骑士  \n(5) 杰克是一个无赖  \n(6) 艾玛是一名骑士  \n(7) 卢克是一个无赖  \n(8) 艾米莉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：卢克、欧文、杰克逊、伊芙琳、亨利、索菲娅、诺亚和约瑟夫。“杰克逊是骑士当且仅当欧文是骑士”——卢克说。“杰克逊是无赖当且仅当索菲娅是无赖，”欧文声称。杰克逊表示约瑟夫是无赖。正如伊芙琳所说：“欧文不是骑士。”亨利也说：“欧文不是骑士。”在索菲娅的话中：“欧文是骑士并且欧文是无赖。”诺亚被听到说：“卢克是无赖或者约瑟夫是无赖。”约瑟夫说：“诺亚是无赖当且仅当索菲娅是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是无赖  \n(2) 欧文是骑士  \n(3) 杰克逊是无赖  \n(4) 伊芙琳是无赖  \n(5) 亨利是无赖  \n(6) 索菲娅是无赖  \n(7) 诺亚是骑士  \n(8) 约瑟夫是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：艾登、阿梅莉亚、约瑟夫、艾米莉、艾娃、本杰明、奥利维亚和奥萝拉。根据艾登的说法，“奥利维亚是骑士，本杰明是骑士”。根据阿梅莉亚的说法，“艾娃不是骑士”。约瑟夫告诉你，约瑟夫是骑士或者奥利维亚是骑士。艾米莉提到，“奥利维亚不是骑士”。“本杰明是无赖当且仅当奥萝拉是骑士，”艾娃宣称。“如果艾米莉是无赖，那么艾登就是骑士，”本杰明宣称。“本杰明是骑士，”奥利维亚提到。“艾米莉是无赖，”奥萝拉提到。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是一名骑士  \n(2) 阿梅莉亚是一名骑士  \n(3) 约瑟夫是一名骑士  \n(4) 艾米莉是一名无赖  \n(5) 艾娃是一名无赖  \n(6) 本杰明是一名骑士  \n(7) 奥利维亚是一名骑士  \n(8) 奥萝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：米娅、克洛伊、约瑟夫、伊丽莎白、塞巴斯蒂安、奥萝拉、亚历山大和索菲娅。米娅提到：“伊丽莎白是无赖或者塞巴斯蒂安是骑士。”克洛伊说：“如果亚历山大是骑士，那么索菲娅就是无赖。”约瑟夫的声明是：“如果克洛伊是无赖，那么克洛伊就是骑士。”伊丽莎白的话是：“如果亚历山大是无赖，那么克洛伊就是骑士。”塞巴斯蒂安的声明是：“伊丽莎白是骑士。”奥萝拉指出：“亚历山大不是骑士。”亚历山大说：“克洛伊是无赖或者米娅是无赖。”索菲娅说：“克洛伊不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是骑士  \n(2) 克洛伊是无赖  \n(3) 约瑟夫是无赖  \n(4) 伊丽莎白是骑士  \n(5) 塞巴斯蒂安是骑士  \n(6) 奥萝拉是无赖  \n(7) 亚历山大是骑士  \n(8) 索菲娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：大卫、克洛伊、伊芙琳、本杰明、杰克逊、马修、詹姆斯和伊森。大卫声称：“伊森是个无赖。”克洛伊表示，只有詹姆斯是骑士时，伊森才是骑士。伊芙琳的陈述是：“伊芙琳是骑士或者本杰明是骑士。”本杰明指出：“如果詹姆斯是骑士，那么克洛伊就是无赖。”杰克逊声称：“大卫是无赖，克洛伊也是无赖。”马修说：“本杰明是无赖当且仅当大卫是无赖。”根据詹姆斯的说法：“伊芙琳是无赖当且仅当大卫是无赖。”伊森指出：“大卫是无赖当且仅当本杰明是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）大卫是无赖  \n（2）克洛伊是骑士  \n（3）伊芙琳是无赖  \n（4）本杰明是无赖  \n（5）杰克逊是无赖  \n（6）马修是骑士  \n（7）詹姆斯是骑士  \n（8）伊森是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：赖利、伊丽莎白、马修、艾娃、夏洛特、亚历山大、艾米莉和阿比盖尔。赖利评论道：“亚历山大是骑士。”伊丽莎白指出：“夏洛特是骑士或者马修是无赖。”马修表示夏洛特是无赖，而马修是骑士。艾娃说：“艾娃是骑士或者艾米莉是骑士。”夏洛特告诉你亚历山大是骑士或者马修是骑士。亚历山大断言：“马修是无赖。”根据艾米莉的话：“艾娃是无赖或者伊丽莎白是骑士。”在阿比盖尔的话中：“夏洛特是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是一名骑士  \n(2) 伊丽莎白是一名骑士  \n(3) 马修是一名无赖  \n(4) 艾娃是一名骑士  \n(5) 夏洛特是一名骑士  \n(6) 亚历山大是一名骑士  \n(7) 艾米莉是一名骑士  \n(8) 阿比盖尔是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：格蕾丝、艾弗里、本杰明、伊莎贝拉、迈克尔、奥利维亚、艾登和欧文。格蕾丝评论道：“奥利维亚是无赖，本杰明是无赖。”艾弗里断言：“如果奥利维亚是无赖，那么本杰明就是无赖。”本杰明声明：“如果伊莎贝拉是无赖，那么伊莎贝拉就是骑士。”伊莎贝拉说：“本杰明是无赖当且仅当格蕾丝是骑士。”迈克尔断言：“本杰明是骑士当且仅当艾弗里是无赖。”奥利维亚说艾登是无赖，迈克尔是骑士。“如果本杰明是骑士，那么伊莎贝拉就是骑士。”艾登说。欧文评论道：“迈克尔是骑士当且仅当艾弗里是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是无赖  \n(2) 艾弗里是无赖  \n(3) 本杰明是骑士  \n(4) 伊莎贝拉是骑士  \n(5) 迈克尔是骑士  \n(6) 奥利维亚是无赖  \n(7) 艾登是骑士  \n(8) 欧文是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：赖利、索菲娅、本杰明、阿梅莉亚、丹尼尔、伊莎贝拉、迈克尔和克洛伊。赖利说：“伊莎贝拉不是无赖。”索菲娅说：“克洛伊是骑士，丹尼尔是骑士。”根据本杰明的说法，“伊莎贝拉是无赖。”阿梅莉亚指出：“丹尼尔不是无赖。”根据丹尼尔的说法，“克洛伊是无赖当且仅当迈克尔是无赖。”伊莎贝拉的陈述是：“本杰明是骑士或者丹尼尔是无赖。”迈克尔说：“克洛伊不是骑士。”在克洛伊的话中：“本杰明不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是骑士  \n(2) 索菲娅是无赖  \n(3) 本杰明是无赖  \n(4) 阿梅莉亚是无赖  \n(5) 丹尼尔是无赖  \n(6) 伊莎贝拉是骑士  \n(7) 迈克尔是无赖  \n(8) 克洛伊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：阿比盖尔、艾拉、夏洛特、塞巴斯蒂安、斯嘉丽、艾娃、赖利和奥利弗。阿比盖尔被听到说：“艾娃不是无赖。”艾拉说：“艾娃是骑士当且仅当阿比盖尔是无赖。”夏洛特说：“如果艾拉是骑士，那么阿比盖尔就是无赖。”塞巴斯蒂安说：“赖利是无赖，赖利是骑士。”斯嘉丽声称：“夏洛特是骑士当且仅当奥利弗是无赖。”根据艾娃的说法：“斯嘉丽不是骑士。”赖利评论道：“如果艾拉是骑士，那么斯嘉丽就是骑士。”奥利弗评论道：“艾拉不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是一名骑士  \n(2) 艾拉是一个无赖  \n(3) 夏洛特是一名骑士  \n(4) 塞巴斯蒂安是一个无赖  \n(5) 斯嘉丽是一个无赖  \n(6) 艾娃是一名骑士  \n(7) 赖利是一名骑士  \n(8) 奥利弗是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：塞巴斯蒂安、伊芙琳、雅各布、奥萝拉、阿梅莉亚、哈珀、米娅和格蕾丝。塞巴斯蒂安说道：“米娅是骑士当且仅当格蕾丝是骑士。”伊芙琳说雅各布是骑士或者格蕾丝是骑士。雅各布提到：“哈珀是无赖当且仅当塞巴斯蒂安是骑士。”奥萝拉指出：“伊芙琳是无赖。”阿梅莉亚评论道：“如果塞巴斯蒂安是无赖，那么米娅就是骑士。”哈珀声明：“阿梅莉亚是骑士或者塞巴斯蒂安是无赖。”米娅提到：“如果哈珀是骑士，那么塞巴斯蒂安就是无赖。”格蕾丝说：“如果伊芙琳是无赖，那么伊芙琳就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）塞巴斯蒂安是一名骑士  \n（2）伊芙琳是一个无赖  \n（3）雅各布是一个无赖  \n（4）奥萝拉是一名骑士  \n（5）阿梅莉亚是一名骑士  \n（6）哈珀是一名骑士  \n（7）米娅是一个无赖  \n（8）格蕾丝是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：阿比盖尔、艾娃、雅各布、佩内洛普、伊森、塞缪尔、卢克和亚历山大。阿比盖尔声称：“如果伊森是骑士，那么伊森就是无赖。”艾娃表示亚历山大是无赖，阿比盖尔是骑士。“伊森是无赖当且仅当雅各布是骑士，”雅各布声称。“伊森不是无赖”——佩内洛普。伊森告诉你艾娃是骑士。“亚历山大是骑士”——塞缪尔。正如卢克所说，“雅各布是骑士当且仅当塞缪尔是无赖。”亚历山大声称：“卢克是骑士，佩内洛普是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是一名骑士  \n(2) 艾娃是一个无赖  \n(3) 雅各布是一个无赖  \n(4) 佩内洛普是一个无赖  \n(5) 伊森是一个无赖  \n(6) 塞缪尔是一名骑士  \n(7) 卢克是一名骑士  \n(8) 亚历山大是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：伊丽莎白、杰克、艾米莉、艾弗里、詹姆斯、佐伊、利亚姆和夏洛特。伊丽莎白的陈述是：“艾弗里是无赖。”杰克的陈述是：“伊丽莎白是无赖，艾米莉是骑士。”艾米莉说：“夏洛特是骑士，或者利亚姆是骑士。”根据艾弗里的说法：“如果伊丽莎白是无赖，那么艾米莉是骑士。”詹姆斯评论道：“利亚姆是无赖。”佐伊宣称：“如果利亚姆是无赖，那么夏洛特是骑士。”根据利亚姆的说法：“伊丽莎白是无赖，或者夏洛特是无赖。”夏洛特说：“如果杰克是无赖，那么詹姆斯是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是无赖  \n(2) 杰克是骑士  \n(3) 艾米莉是骑士  \n(4) 艾弗里是骑士  \n(5) 詹姆斯是无赖  \n(6) 佐伊是骑士  \n(7) 利亚姆是骑士  \n(8) 夏洛特是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：杰克逊、梅森、卢卡斯、亨利、詹姆斯、迈克尔、威廉和艾玛。杰克逊评论道：“迈克尔是无赖或者亨利是骑士。”梅森说：“詹姆斯是无赖当且仅当威廉是无赖。”卢卡斯声称：“艾玛是骑士，迈克尔是骑士。”亨利说：“如果迈克尔是无赖，那么威廉就是骑士。”詹姆斯表示杰克逊是骑士或者亨利是无赖。迈克尔说：“梅森是无赖，詹姆斯是无赖。”威廉在声明中说：“迈克尔是无赖或者梅森是无赖。”艾玛评论道：“詹姆斯是无赖，迈克尔是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是一名骑士  \n(2) 梅森是一名骑士  \n(3) 卢卡斯是一个无赖  \n(4) 亨利是一名骑士  \n(5) 詹姆斯是一名骑士  \n(6) 迈克尔是一个无赖  \n(7) 威廉是一名骑士  \n(8) 艾玛是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：阿丽亚、欧文、艾登、奥利弗、克洛伊、奥利维亚、雅各布和伊森。阿丽亚说：“克洛伊不是骑士。”欧文断言：“如果克洛伊是无赖，那么雅各布就是无赖。”艾登声明：“伊森是骑士或者欧文是骑士。”奥利弗说：“如果奥利维亚是无赖，那么伊森就是骑士。”克洛伊提到：“伊森是骑士当且仅当欧文是无赖。”奥利维亚声称：“艾登不是无赖。”雅各布告诉你，伊森不是骑士。根据伊森的说法，“欧文不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿丽亚是无赖  \n(2) 欧文是骑士  \n(3) 艾登是骑士  \n(4) 奥利弗是骑士  \n(5) 克洛伊是骑士  \n(6) 奥利维亚是骑士  \n(7) 雅各布是骑士  \n(8) 伊森是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：杰克逊、艾玛、洛根、阿丽亚、格蕾丝、利亚姆、佩内洛普和马修。杰克逊说：“如果马修是骑士，那么利亚姆就是无赖。”艾玛声明：“如果马修是无赖，那么利亚姆就是无赖。”洛根提到：“马修是无赖，杰克逊是无赖。”阿丽亚说：“艾玛是无赖，利亚姆是骑士。”格蕾丝的话是：“杰克逊是无赖，利亚姆是骑士。”利亚姆指出：“马修是无赖，佩内洛普是骑士。”佩内洛普声称：“艾玛是骑士当且仅当马修是无赖。”马修说：“如果阿丽亚是骑士，那么格蕾丝就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）杰克逊是一名骑士  \n（2）艾玛是一名骑士  \n（3）洛根是一个无赖  \n（4）阿丽亚是一个无赖  \n（5）格蕾丝是一个无赖  \n（6）利亚姆是一个无赖  \n（7）佩内洛普是一个无赖  \n（8）马修是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：约瑟夫、奥利维亚、阿梅莉亚、格蕾丝、艾米莉、迈克尔、诺亚和卢克。约瑟夫说：“艾米莉是无赖或者阿梅莉亚是骑士。”奥利维亚说：“诺亚是无赖当且仅当奥利维亚是骑士。”阿梅莉亚说：“奥利维亚是无赖而卢克是无赖。”格蕾丝表示约瑟夫是无赖而诺亚是无赖。正如艾米莉所说：“奥利维亚不是无赖。”迈克尔告诉你约瑟夫是骑士而约瑟夫是无赖。诺亚说：“约瑟夫是骑士。”卢克说：“阿梅莉亚是无赖而迈克尔是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是无赖  \n(2) 奥利维亚是骑士  \n(3) 阿梅莉亚是无赖  \n(4) 格蕾丝是骑士  \n(5) 艾米莉是骑士  \n(6) 迈克尔是无赖  \n(7) 诺亚是无赖  \n(8) 卢克是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：本杰明、奥利维亚、詹姆斯、奥萝拉、迈克尔、杰克逊、梅森和伊莎贝拉。根据本杰明的说法：“伊莎贝拉是骑士当且仅当杰克逊是骑士。”在奥利维亚的陈述中：“如果本杰明是骑士，那么奥利维亚就是骑士。”在詹姆斯的话中：“本杰明不是无赖。”奥萝拉提到：“梅森不是骑士。”迈克尔说：“奥利维亚是无赖。”在杰克逊的陈述中：“如果伊莎贝拉是骑士，那么奥萝拉就是骑士。”梅森表示：“如果本杰明是骑士，那么本杰明就是无赖。”伊莎贝拉断言：“本杰明不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是无赖  \n(2) 奥利维亚是骑士  \n(3) 詹姆斯是无赖  \n(4) 奥萝拉是无赖  \n(5) 迈克尔是无赖  \n(6) 杰克逊是无赖  \n(7) 梅森是骑士  \n(8) 伊莎贝拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：艾娃、洛根、杰克、莉莉、迈克尔、佩内洛普、索菲娅和杰克逊。艾娃被听到说：“莉莉是骑士。”洛根被听到说：“杰克不是无赖。”杰克说：“艾娃不是骑士。”莉莉说佩内洛普是无赖。迈克尔的话是：“如果杰克是骑士，那么洛根就是无赖。”佩内洛普说：“洛根是骑士或者艾娃是骑士。”索菲娅被听到说：“如果洛根是骑士，那么艾娃就是无赖。”杰克逊评论道：“索菲娅是骑士，艾娃是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是无赖  \n(2) 洛根是骑士  \n(3) 杰克是骑士  \n(4) 莉莉是无赖  \n(5) 迈克尔是无赖  \n(6) 佩内洛普是骑士  \n(7) 索菲娅是骑士  \n(8) 杰克逊是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：塞巴斯蒂安、奥利维亚、哈珀、塞缪尔、亚历山大、索菲娅、利亚姆和威廉。塞巴斯蒂安说索菲娅是骑士或者索菲娅是无赖。奥利维亚宣称：“利亚姆不是无赖。”哈珀宣称：“亚历山大是无赖或者威廉是骑士。”塞缪尔声称：“塞巴斯蒂安是骑士。”在亚历山大的话中：“塞巴斯蒂安是骑士。”索菲娅评论道：“利亚姆是无赖或者利亚姆是骑士。”利亚姆声称：“奥利维亚是无赖而哈珀是骑士。”威廉表示哈珀不是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）塞巴斯蒂安是一名骑士  \n（2）奥利维亚是一个无赖  \n（3）哈珀是一个无赖  \n（4）塞缪尔是一名骑士  \n（5）亚历山大是一名骑士  \n（6）索菲娅是一名骑士  \n（7）利亚姆是一个无赖  \n（8）威廉是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：卢克、艾娃、索菲娅、艾玛、阿丽亚、马修、夏洛特和梅森。“马修是骑士，”卢克声称。艾娃说：“梅森是无赖或者阿丽亚是无赖。”索菲娅说：“夏洛特不是无赖。”艾玛被听到说：“如果梅森是无赖，那么索菲娅就是骑士。”阿丽亚说：“马修是骑士当且仅当卢克是骑士。”马修表示索菲娅是无赖。夏洛特断言：“艾玛是骑士。”梅森说：“马修是骑士，阿丽亚是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是无赖  \n(2) 艾娃是骑士  \n(3) 索菲娅是骑士  \n(4) 艾玛是骑士  \n(5) 阿丽亚是骑士  \n(6) 马修是无赖  \n(7) 夏洛特是骑士  \n(8) 梅森是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：洛根、阿丽亚、米娅、伊莎贝拉、杰克、维多利亚、伊芙琳和诺亚。“伊芙琳是骑士，洛根是骑士，”洛根宣称。阿丽亚声称：“如果诺亚是无赖，那么杰克就是骑士。” “阿丽亚是无赖，”米娅声称。“当且仅当阿丽亚是无赖时，米娅就是无赖，”伊莎贝拉声称。在杰克的话中：“如果阿丽亚是无赖，那么洛根就是骑士。” “阿丽亚是骑士，”维多利亚提到。伊芙琳评论道：“如果伊莎贝拉是无赖，那么洛根就是无赖。”诺亚声称：“如果杰克是骑士，那么阿丽亚就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是无赖  \n(2) 阿丽亚是骑士  \n(3) 米娅是无赖  \n(4) 伊莎贝拉是无赖  \n(5) 杰克是骑士  \n(6) 维多利亚是骑士  \n(7) 伊芙琳是骑士  \n(8) 诺亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：洛根、艾登、约瑟夫、丹尼尔、阿比盖尔、伊莎贝拉、卢卡斯和阿丽亚。洛根说道：“丹尼尔不是无赖。”艾登指出：“阿比盖尔是无赖当且仅当洛根是无赖。”约瑟夫宣称：“洛根是骑士，伊莎贝拉是无赖。”丹尼尔宣称：“如果阿丽亚是骑士，那么洛根就是无赖。”阿比盖尔被听到说：“洛根是无赖，卢卡斯是无赖。”伊莎贝拉说：“丹尼尔是骑士。”卢卡斯说：“约瑟夫是骑士。”阿丽亚提到：“艾登是无赖，约瑟夫是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是一名骑士  \n(2) 艾登是一个无赖  \n(3) 约瑟夫是一个无赖  \n(4) 丹尼尔是一名骑士  \n(5) 阿比盖尔是一个无赖  \n(6) 伊莎贝拉是一名骑士  \n(7) 卢卡斯是一个无赖  \n(8) 阿丽亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：伊莎贝拉、杰克、杰克逊、欧文、诺亚、伊森、阿梅莉亚和大卫。伊莎贝拉说：“杰克逊是骑士或者杰克逊是无赖。”杰克说：“诺亚是骑士。”杰克逊提到：“欧文是骑士或者伊莎贝拉是骑士。”欧文说：“如果欧文是骑士，那么阿梅莉亚是无赖。”诺亚告诉你，如果阿梅莉亚是骑士，那么欧文是无赖。伊森的声明是：“阿梅莉亚是无赖，诺亚是骑士。”根据阿梅莉亚的说法：“大卫是骑士，伊森是骑士。”大卫表示，如果阿梅莉亚是无赖，那么伊莎贝拉是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是一名骑士  \n(2) 杰克是一名骑士  \n(3) 杰克逊是一名骑士  \n(4) 欧文是一名骑士  \n(5) 诺亚是一名骑士  \n(6) 伊森是一名骑士  \n(7) 阿梅莉亚是一名无赖  \n(8) 大卫是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：詹姆斯、本杰明、诺亚、伊丽莎白、艾弗里、艾登、佩内洛普和杰克逊。詹姆斯表示诺亚是一个无赖。本杰明表示詹姆斯是一个骑士。诺亚说：“杰克逊是一个无赖，艾弗里是一个骑士。”伊丽莎白表示佩内洛普是一个骑士。艾弗里指出：“艾弗里是一个骑士，或者詹姆斯是一个骑士。”有人听到艾登说：“本杰明是一个无赖，或者诺亚是一个无赖。”根据佩内洛普的说法：“艾登不是一个骑士。”杰克逊的声明是：“诺亚是一个骑士，或者诺亚是一个无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）詹姆斯是一名骑士  \n（2）本杰明是一名骑士  \n（3）诺亚是一个无赖  \n（4）伊丽莎白是一个无赖  \n（5）艾弗里是一名骑士  \n（6）艾登是一名骑士  \n（7）佩内洛普是一个无赖  \n（8）杰克逊是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：维多利亚、杰克逊、梅森、艾弗里、丹尼尔、艾玛、伊莎贝拉和阿梅莉亚。维多利亚说：“艾玛是骑士。”杰克逊说：“丹尼尔是无赖或者伊莎贝拉是骑士。”梅森表示，如果阿梅莉亚是无赖，那么丹尼尔就是骑士。艾弗里说，如果伊莎贝拉是骑士，那么杰克逊就是无赖。丹尼尔被听到说：“伊莎贝拉是无赖。”艾玛告诉你，如果梅森是骑士，那么伊莎贝拉就是无赖。根据伊莎贝拉的话：“如果艾玛是无赖，那么艾弗里就是骑士。”阿梅莉亚说：“艾弗里是骑士或者丹尼尔是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 维多利亚是一名骑士  \n(2) 杰克逊是一名骑士  \n(3) 梅森是一个无赖  \n(4) 艾弗里是一个无赖  \n(5) 丹尼尔是一个无赖  \n(6) 艾玛是一名骑士  \n(7) 伊莎贝拉是一名骑士  \n(8) 阿梅莉亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：伊莎贝拉、克洛伊、维多利亚、本杰明、迈克尔、亚历山大、艾米莉和索菲娅。伊莎贝拉说：“迈克尔是骑士当且仅当迈克尔是无赖。”克洛伊说：“本杰明是无赖或者迈克尔是骑士。”维多利亚说，如果本杰明是骑士，那么迈克尔是骑士。本杰明说：“维多利亚不是骑士。”迈克尔说：“如果伊莎贝拉是骑士，那么亚历山大是骑士。”亚历山大说：“如果索菲娅是骑士，那么伊莎贝拉是骑士。”艾米莉断言：“伊莎贝拉是骑士当且仅当维多利亚是骑士。”索菲娅评论道：“维多利亚是骑士当且仅当伊莎贝拉是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是无赖  \n(2) 克洛伊是骑士  \n(3) 维多利亚是骑士  \n(4) 本杰明是无赖  \n(5) 迈克尔是骑士  \n(6) 亚历山大是无赖  \n(7) 艾米莉是无赖  \n(8) 索菲娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：梅森、奥利维亚、大卫、格蕾丝、艾拉、伊莎贝拉、索菲娅和艾登。梅森声称：“大卫不是无赖。”在奥利维亚看来：“艾拉不是骑士。”大卫说：“大卫是骑士。”格蕾丝说：“伊莎贝拉是骑士，艾登是无赖。”艾拉表示：“伊莎贝拉是骑士，索菲娅是无赖。”伊莎贝拉告诉你，如果奥利维亚是骑士，那么索菲娅就是无赖。索菲娅说：“如果梅森是骑士，那么艾拉就是骑士。”根据艾登的说法：“梅森是无赖当且仅当格蕾丝是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）梅森是无赖  \n（2）奥利维亚是骑士  \n（3）大卫是无赖  \n（4）格蕾丝是无赖  \n（5）艾拉是无赖  \n（6）伊莎贝拉是无赖  \n（7）索菲娅是骑士  \n（8）艾登是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：梅森、亚历山大、奥萝拉、欧文、阿比盖尔、索菲娅、艾玛和伊芙琳。“梅森是骑士，”梅森宣称。亚历山大声称：“欧文是骑士或者梅森是骑士。”奥萝拉的陈述是：“亚历山大是骑士当且仅当艾玛是无赖。”欧文说：“梅森是无赖而伊芙琳是骑士。”阿比盖尔声称：“梅森是骑士或者伊芙琳是骑士。”索菲娅被听到说：“如果奥萝拉是骑士，那么梅森是无赖。”在艾玛的话中：“欧文是无赖或者奥萝拉是骑士。”伊芙琳声称：“如果索菲娅是无赖，那么亚历山大是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是骑士  \n(2) 亚历山大是骑士  \n(3) 奥萝拉是无赖  \n(4) 欧文是无赖  \n(5) 阿比盖尔是骑士  \n(6) 索菲娅是骑士  \n(7) 艾玛是骑士  \n(8) 伊芙琳是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：卢克、利亚姆、斯嘉丽、塞巴斯蒂安、杰克、索菲娅、艾拉和约瑟夫。“艾拉是无赖，”卢克声称。利亚姆断言：“塞巴斯蒂安是骑士或者艾拉是骑士。”斯嘉丽说，如果且仅如果艾拉是骑士，约瑟夫就是无赖。塞巴斯蒂安声明：“杰克是无赖。”杰克断言：“约瑟夫是骑士或者斯嘉丽是无赖。” “杰克是骑士，”索菲娅声称。“利亚姆是骑士，斯嘉丽是骑士，”艾拉声称。约瑟夫被听到说：“杰克不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 利亚姆是一个无赖  \n(3) 斯嘉丽是一个无赖  \n(4) 塞巴斯蒂安是一个无赖  \n(5) 杰克是一名骑士  \n(6) 索菲娅是一名骑士  \n(7) 艾拉是一个无赖  \n(8) 约瑟夫是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：奥利维亚、丹尼尔、塞缪尔、杰克逊、梅森、佐伊、夏洛特和詹姆斯。奥利维亚声称：“如果夏洛特是无赖，那么塞缪尔就是骑士。”丹尼尔评论道：“杰克逊是无赖。”塞缪尔声称：“佐伊是无赖或者梅森是无赖。”根据杰克逊的说法，“奥利维亚是无赖。”梅森说：“詹姆斯是骑士当且仅当梅森是骑士。”佐伊告诉你梅森不是无赖。夏洛特声称：“塞缪尔是骑士或者奥利维亚是骑士。”詹姆斯表示：“杰克逊是无赖而塞缪尔是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是一名骑士  \n(2) 丹尼尔是一名骑士  \n(3) 塞缪尔是一名骑士  \n(4) 杰克逊是一名无赖  \n(5) 梅森是一名无赖  \n(6) 佐伊是一名无赖  \n(7) 夏洛特是一名骑士  \n(8) 詹姆斯是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：赖利、洛根、本杰明、佩内洛普、哈珀、阿丽亚、亨利和奥利维亚。赖利告诉你佩内洛普是个无赖。洛根说：“如果哈珀是个无赖，那么本杰明就是个无赖。” “奥利维亚是个无赖”——本杰明。佩内洛普告诉你，如果哈珀是个骑士，那么亨利就是个无赖。哈珀评论道：“如果本杰明是个骑士，那么佩内洛普就是个无赖。”在阿丽亚的话中：“哈珀是个骑士当且仅当本杰明是个无赖。”在亨利的话中：“阿丽亚是个无赖当且仅当赖利是个无赖。”在奥利维亚的话中：“亨利不是个骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是无赖  \n(2) 洛根是骑士  \n(3) 本杰明是无赖  \n(4) 佩内洛普是骑士  \n(5) 哈珀是骑士  \n(6) 阿丽亚是骑士  \n(7) 亨利是无赖  \n(8) 奥利维亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：赖利、威廉、本杰明、伊莎贝拉、佐伊、莉莉、梅森和伊森。“如果莉莉是无赖，那么佐伊就是无赖，”赖利说。威廉说本杰明不是无赖。本杰明表示如果佐伊是骑士，那么威廉就是骑士。伊莎贝拉评论道：“威廉不是无赖。”佐伊说：“本杰明是骑士或者威廉是骑士。”莉莉表示梅森是骑士或者赖利是骑士。“佐伊是无赖或者赖利是无赖，”梅森提到。伊森说：“梅森是骑士而佐伊是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是一名骑士  \n(2) 威廉是一名骑士  \n(3) 本杰明是一名骑士  \n(4) 伊莎贝拉是一名骑士  \n(5) 佐伊是一名骑士  \n(6) 莉莉是一名骑士  \n(7) 梅森是一名无赖  \n(8) 伊森是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：利亚姆、迈克尔、伊莎贝拉、夏洛特、奥萝拉、哈珀、马修和梅森。利亚姆评论道：“伊莎贝拉是骑士。”迈克尔说：“伊莎贝拉是骑士。”伊莎贝拉告诉你，迈克尔是无赖当且仅当迈克尔是骑士。夏洛特说：“梅森不是无赖。”奥萝拉提到：“哈珀是无赖当且仅当迈克尔是无赖。”在哈珀的话中：“梅森是无赖当且仅当马修是骑士。”马修提到：“夏洛特是无赖，迈克尔是无赖。”梅森表示，迈克尔是骑士当且仅当奥萝拉是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是无赖  \n(2) 迈克尔是无赖  \n(3) 伊莎贝拉是无赖  \n(4) 夏洛特是骑士  \n(5) 奥萝拉是无赖  \n(6) 哈珀是骑士  \n(7) 马修是无赖  \n(8) 梅森是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：佐伊、艾玛、索菲娅、奥萝拉、亨利、诺亚、杰克和阿比盖尔。佐伊表示奥萝拉是骑士，索菲娅是无赖。艾玛被听到说：“佐伊不是无赖。”索菲娅声明：“如果佐伊是骑士，那么索菲娅就是骑士。”奥萝拉断言：“阿比盖尔是骑士。”在亨利看来：“如果阿比盖尔是骑士，那么佐伊就是无赖。”诺亚断言：“如果奥萝拉是无赖，那么索菲娅就是骑士。”根据杰克的说法：“艾玛不是无赖。”根据阿比盖尔的说法：“诺亚不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佐伊是无赖  \n(2) 艾玛是无赖  \n(3) 索菲娅是骑士  \n(4) 奥萝拉是无赖  \n(5) 亨利是骑士  \n(6) 诺亚是骑士  \n(7) 杰克是无赖  \n(8) 阿比盖尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：欧文、塞缪尔、奥利弗、詹姆斯、伊莎贝拉、阿梅莉亚、维多利亚和阿丽亚。欧文评论道：“伊莎贝拉不是无赖。”塞缪尔表示，如果伊莎贝拉是无赖，那么维多利亚就是骑士。奥利弗告诉你阿丽亚是无赖。詹姆斯说，伊莎贝拉是骑士当且仅当阿丽亚是骑士。伊莎贝拉说：“维多利亚是骑士或者阿梅莉亚是无赖。”阿梅莉亚说：“维多利亚是无赖或者塞缪尔是无赖。”维多利亚说：“阿梅莉亚是无赖当且仅当阿梅莉亚是骑士。”阿丽亚说，詹姆斯是骑士当且仅当阿丽亚是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是无赖  \n(2) 塞缪尔是无赖  \n(3) 奥利弗是骑士  \n(4) 詹姆斯是骑士  \n(5) 伊莎贝拉是无赖  \n(6) 阿梅莉亚是骑士  \n(7) 维多利亚是无赖  \n(8) 阿丽亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：艾弗里、索菲娅、赖利、艾登、奥利弗、艾米莉、维多利亚和迈克尔。艾弗里表示，如果维多利亚是骑士，那么索菲娅就是无赖。索菲娅说，艾登是骑士当且仅当奥利弗是无赖。赖利的陈述是：“艾米莉不是无赖。”艾登指出：“迈克尔是无赖或者赖利是骑士。”奥利弗声明：“艾弗里是骑士或者赖利是无赖。”艾米莉说：“维多利亚是骑士或者赖利是骑士。”维多利亚被听到说：“奥利弗是骑士或者艾弗里是骑士。”迈克尔说艾弗里是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是一名骑士  \n(2) 索菲娅是一个无赖  \n(3) 赖利是一名骑士  \n(4) 艾登是一名骑士  \n(5) 奥利弗是一名骑士  \n(6) 艾米莉是一名骑士  \n(7) 维多利亚是一名骑士  \n(8) 迈克尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：本杰明、格蕾丝、伊森、伊丽莎白、奥萝拉、亨利、斯嘉丽和莉莉。“如果伊森是无赖，那么伊森就是骑士。”——本杰明。格蕾丝表示，亨利是无赖当且仅当莉莉是无赖。“伊丽莎白不是无赖，”伊森提到。伊丽莎白断言：“本杰明是骑士或者斯嘉丽是无赖。” “本杰明是无赖。”——奥萝拉。根据亨利的说法，“伊丽莎白是骑士。”在斯嘉丽的话中：“伊森是骑士。” “亨利不是无赖，”莉莉宣称。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是一名骑士  \n(2) 格蕾丝是一名骑士  \n(3) 伊森是一名骑士  \n(4) 伊丽莎白是一名骑士  \n(5) 奥萝拉是一名无赖  \n(6) 亨利是一名骑士  \n(7) 斯嘉丽是一名骑士  \n(8) 莉莉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：佩内洛普、利亚姆、阿梅莉亚、阿比盖尔、奥利维亚、艾米莉、米娅和洛根。佩内洛普说：“奥利维亚不是无赖。”利亚姆断言：“奥利维亚是无赖。”阿梅莉亚提到：“阿比盖尔是骑士，利亚姆是骑士。”根据阿比盖尔的说法，“利亚姆是无赖。”奥利维亚评论道：“洛根不是无赖。”艾米莉宣称：“阿梅莉亚是骑士，米娅是骑士。”米娅评论道：“如果阿比盖尔是无赖，那么利亚姆就是无赖。”洛根告诉你阿梅莉亚不是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是骑士  \n(2) 利亚姆是无赖  \n(3) 阿梅莉亚是无赖  \n(4) 阿比盖尔是骑士  \n(5) 奥利维亚是骑士  \n(6) 艾米莉是无赖  \n(7) 米娅是骑士  \n(8) 洛根是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：詹姆斯、梅森、诺亚、杰克逊、杰克、艾拉、莉莉和奥萝拉。“如果莉莉是骑士，那么杰克逊就是骑士，”詹姆斯宣称。“詹姆斯是骑士”——梅森。诺亚告诉你，艾拉不是无赖。杰克逊说：“如果莉莉是骑士，那么杰克就是无赖。” “如果诺亚是无赖，那么奥萝拉就是无赖”——杰克。艾拉评论道：“梅森是无赖。” “艾拉不是无赖”——莉莉。奥萝拉指出：“如果奥萝拉是骑士，那么杰克逊就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是无赖  \n(2) 梅森是无赖  \n(3) 诺亚是骑士  \n(4) 杰克逊是无赖  \n(5) 杰克是骑士  \n(6) 艾拉是骑士  \n(7) 莉莉是骑士  \n(8) 奥萝拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：詹姆斯、威廉、卢卡斯、大卫、本杰明、伊丽莎白、丹尼尔和利亚姆。在詹姆斯的陈述中：“丹尼尔是骑士当且仅当丹尼尔是无赖。”威廉表示，丹尼尔是骑士当且仅当本杰明是骑士。卢卡斯声明：“卢卡斯是骑士，伊丽莎白是无赖。”大卫断言：“詹姆斯不是无赖。”本杰明说：“詹姆斯是无赖。”伊丽莎白指出：“如果大卫是无赖，那么詹姆斯是无赖。”丹尼尔告诉你，如果卢卡斯是骑士，那么威廉是无赖。利亚姆断言：“大卫是骑士或者伊丽莎白是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是无赖  \n(2) 威廉是骑士  \n(3) 卢卡斯是无赖  \n(4) 大卫是无赖  \n(5) 本杰明是骑士  \n(6) 伊丽莎白是骑士  \n(7) 丹尼尔是骑士  \n(8) 利亚姆是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：杰克逊、约瑟夫、马修、诺亚、奥萝拉、夏洛特、大卫和雅各布。杰克逊说大卫不是骑士。约瑟夫说：“如果诺亚是骑士，那么大卫就是骑士。”马修说：“诺亚是无赖当且仅当诺亚是骑士。”诺亚声明：“如果夏洛特是骑士，那么杰克逊就是骑士。”奥萝拉说杰克逊不是骑士。夏洛特说：“雅各布是无赖，大卫是骑士。”大卫说：“诺亚是无赖或者马修是骑士。”雅各布指出：“夏洛特是骑士，大卫是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是一名骑士  \n(2) 约瑟夫是一个无赖  \n(3) 马修是一个无赖  \n(4) 诺亚是一名骑士  \n(5) 奥萝拉是一个无赖  \n(6) 夏洛特是一个无赖  \n(7) 大卫是一个无赖  \n(8) 雅各布是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：艾米莉、夏洛特、艾玛、诺亚、约瑟夫、卢卡斯、斯嘉丽和杰克。艾米莉说斯嘉丽是骑士或者杰克是骑士。夏洛特说：“艾玛是骑士。”艾玛说如果艾玛是骑士，那么诺亚就是无赖。“夏洛特是骑士当且仅当卢卡斯是无赖，”诺亚宣称。约瑟夫说：“艾米莉是骑士或者杰克是无赖。”卢卡斯说：“艾米莉是骑士。”斯嘉丽声称：“卢卡斯是骑士或者卢卡斯是无赖。”杰克的声明是：“诺亚不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是一名骑士  \n(2) 夏洛特是一名骑士  \n(3) 艾玛是一名骑士  \n(4) 诺亚是一名无赖  \n(5) 约瑟夫是一名骑士  \n(6) 卢卡斯是一名骑士  \n(7) 斯嘉丽是一名骑士  \n(8) 杰克是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：杰克、夏洛特、奥利弗、卢克、迈克尔、洛根、艾登和亚历山大。杰克说：“亚历山大不是骑士。”夏洛特声明：“奥利弗是骑士。”奥利弗指出：“艾登是无赖，洛根是无赖。”卢克说：“迈克尔不是骑士。”迈克尔评论道：“洛根是无赖或者夏洛特是无赖。”洛根说：“艾登不是无赖。”艾登断言：“洛根是骑士当且仅当夏洛特是无赖。”亚历山大评论道：“奥利弗不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）杰克是无赖  \n（2）夏洛特是无赖  \n（3）奥利弗是无赖  \n（4）卢克是无赖  \n（5）迈克尔是骑士  \n（6）洛根是骑士  \n（7）艾登是骑士  \n（8）亚历山大是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：伊森、阿丽亚、詹姆斯、雅各布、卢卡斯、卢克、斯嘉丽和伊莎贝拉。根据伊森的说法，“卢卡斯是一个无赖”。阿丽亚说：“伊莎贝拉是一个无赖，卢克是一个骑士。”詹姆斯表示伊莎贝拉是一个骑士。雅各布说：“如果阿丽亚是一个骑士，那么詹姆斯就是一个骑士。”卢卡斯声明：“伊莎贝拉是一个无赖。”卢克说：“伊森是一个骑士，或者斯嘉丽是一个无赖。”斯嘉丽断言：“阿丽亚是一个骑士。”伊莎贝拉声称：“雅各布是一个骑士，或者卢克是一个骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是一名骑士  \n(2) 阿丽亚是一个无赖  \n(3) 詹姆斯是一名骑士  \n(4) 雅各布是一名骑士  \n(5) 卢卡斯是一个无赖  \n(6) 卢克是一名骑士  \n(7) 斯嘉丽是一个无赖  \n(8) 伊莎贝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：詹姆斯、艾登、伊森、夏洛特、阿丽亚、马修、伊丽莎白和亨利。詹姆斯说：“伊丽莎白不是骑士。”艾登说：“马修是无赖或者马修是骑士。”伊森的陈述是：“如果伊丽莎白是骑士，那么马修就是骑士。”夏洛特评论道：“如果艾登是无赖，那么马修就是无赖。”阿丽亚说詹姆斯是骑士。马修说：“詹姆斯是骑士或者亨利是无赖。”伊丽莎白说：“马修是无赖而伊森是骑士。”亨利宣称：“如果阿丽亚是无赖，那么詹姆斯就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）詹姆斯是一名骑士  \n（2）艾登是一名骑士  \n（3）伊森是一名骑士  \n（4）夏洛特是一名骑士  \n（5）阿丽亚是一名骑士  \n（6）马修是一名骑士  \n（7）伊丽莎白是一名无赖  \n（8）亨利是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：马修、赖利、诺亚、阿丽亚、维多利亚、莉莉、詹姆斯和伊莎贝拉。“赖利不是无赖，”马修宣称。“如果赖利是骑士，那么莉莉就是无赖，”赖利宣称。“如果阿丽亚是无赖，那么赖利就是骑士，”诺亚宣称。阿丽亚表示，如果马修是骑士，那么赖利就是无赖。根据维多利亚的说法，“马修是无赖或者伊莎贝拉是骑士。” “诺亚不是骑士，”莉莉提到。“诺亚不是无赖，”詹姆斯宣称。“阿丽亚是无赖，赖利是无赖，”伊莎贝拉提到。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是一名骑士  \n(2) 赖利是一名骑士  \n(3) 诺亚是一名骑士  \n(4) 阿丽亚是一名无赖  \n(5) 维多利亚是一名无赖  \n(6) 莉莉是一名无赖  \n(7) 詹姆斯是一名骑士  \n(8) 伊莎贝拉是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：伊丽莎白、莉莉、阿梅莉亚、梅森、夏洛特、亨利、艾玛和杰克逊。伊丽莎白声称：“亨利是个无赖。”莉莉提到：“夏洛特是个无赖或者伊丽莎白是个无赖。”阿梅莉亚声称：“梅森是个骑士或者夏洛特是个无赖。”梅森指出：“如果亨利是个无赖，那么阿梅莉亚就是个骑士。”夏洛特告诉你艾玛不是骑士。亨利声明：“伊丽莎白是个骑士或者艾玛是个骑士。”艾玛说：“莉莉是个无赖或者阿梅莉亚是个骑士。”杰克逊说：“梅森不是个无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是无赖  \n(2) 莉莉是骑士  \n(3) 阿梅莉亚是骑士  \n(4) 梅森是骑士  \n(5) 夏洛特是无赖  \n(6) 亨利是骑士  \n(7) 艾玛是骑士  \n(8) 杰克逊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：米娅、伊丽莎白、本杰明、佐伊、卢克、克洛伊、卢卡斯和哈珀。“如果伊丽莎白是无赖，那么佐伊就是骑士，”米娅说。伊丽莎白声称：“如果佐伊是骑士，那么哈珀就是骑士。”本杰明在一份声明中说：“如果伊丽莎白是无赖，那么克洛伊就是骑士。”佐伊说：“哈珀是骑士或者佐伊是骑士。”卢克声明：“伊丽莎白是骑士。”克洛伊声称：“如果米娅是骑士，那么佐伊就是骑士。”卢卡斯说：“克洛伊是骑士或者佐伊是无赖。”哈珀提到：“米娅是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是一名骑士  \n(2) 伊丽莎白是一名骑士  \n(3) 本杰明是一名骑士  \n(4) 佐伊是一名骑士  \n(5) 卢克是一名骑士  \n(6) 克洛伊是一名骑士  \n(7) 卢卡斯是一名骑士  \n(8) 哈珀是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：梅森、杰克、迈克尔、莉莉、夏洛特、塞巴斯蒂安、诺亚和约瑟夫。梅森说：“迈克尔是无赖当且仅当塞巴斯蒂安是无赖。”杰克说：“诺亚是无赖，梅森是骑士。”迈克尔的陈述是：“莉莉是无赖当且仅当莉莉是骑士。”莉莉表示：“梅森不是无赖。”夏洛特提到：“杰克是骑士或者莉莉是骑士。”塞巴斯蒂安表示诺亚是无赖当且仅当迈克尔是骑士。诺亚说：“夏洛特是骑士当且仅当梅森是骑士。”约瑟夫说梅森是无赖或者夏洛特是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是无赖  \n(2) 杰克是无赖  \n(3) 迈克尔是无赖  \n(4) 莉莉是无赖  \n(5) 夏洛特是无赖  \n(6) 塞巴斯蒂安是骑士  \n(7) 诺亚是骑士  \n(8) 约瑟夫是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：索菲娅、艾玛、詹姆斯、阿梅莉亚、奥利弗、阿丽亚、斯嘉丽和艾拉。索菲娅说：“如果艾拉是骑士，那么艾玛就是骑士。”艾玛说：“索菲娅是无赖当且仅当詹姆斯是骑士。”詹姆斯断言：“阿丽亚不是骑士。”阿梅莉亚说：“斯嘉丽是骑士当且仅当奥利弗是骑士。”奥利弗告诉你，斯嘉丽是无赖当且仅当艾玛是无赖。阿丽亚告诉你，索菲娅是骑士。斯嘉丽的陈述是：“阿丽亚是骑士，詹姆斯是骑士。”艾拉声称：“如果艾玛是无赖，那么斯嘉丽就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是骑士  \n(2) 艾玛是骑士  \n(3) 詹姆斯是无赖  \n(4) 阿梅莉亚是骑士  \n(5) 奥利弗是无赖  \n(6) 阿丽亚是骑士  \n(7) 斯嘉丽是无赖  \n(8) 艾拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：阿比盖尔、卢克、艾弗里、艾米莉、卢卡斯、亚历山大、奥利弗和塞巴斯蒂安。阿比盖尔的陈述是：“如果艾弗里是骑士，那么卢卡斯就是无赖。”卢克表示塞巴斯蒂安是无赖或者阿比盖尔是骑士。“如果亚历山大是无赖，那么卢克就是无赖。”——艾弗里。艾米莉的陈述是：“卢卡斯是无赖，卢克是骑士。”卢卡斯说：“艾弗里是骑士，亚历山大是无赖。”亚历山大告诉你卢克是骑士或者塞巴斯蒂安是骑士。“卢卡斯是骑士，艾米莉是骑士。”——奥利弗。塞巴斯蒂安的话是：“亚历山大是骑士，卢克是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是一名骑士  \n(2) 卢克是一名骑士  \n(3) 艾弗里是一名骑士  \n(4) 艾米莉是一名骑士  \n(5) 卢卡斯是一个无赖  \n(6) 亚历山大是一名骑士  \n(7) 奥利弗是一个无赖  \n(8) 塞巴斯蒂安是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：艾娃、诺亚、威廉、索菲娅、伊森、卢克、佩内洛普和格蕾丝。“诺亚不是无赖，”艾娃宣称。诺亚说：“佩内洛普不是无赖。”威廉的陈述是：“索菲娅是骑士当且仅当佩内洛普是无赖。”索菲娅告诉你卢克不是无赖。“索菲娅是无赖当且仅当索菲娅是骑士，”伊森声称。卢克说：“艾娃是骑士或者佩内洛普是骑士。”佩内洛普指出：“威廉是骑士而索菲娅是骑士。”格蕾丝告诉你佩内洛普是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是无赖  \n(2) 诺亚是无赖  \n(3) 威廉是无赖  \n(4) 索菲娅是无赖  \n(5) 伊森是无赖  \n(6) 卢克是无赖  \n(7) 佩内洛普是无赖  \n(8) 格蕾丝是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：马修、艾娃、佐伊、奥利维亚、夏洛特、利亚姆、艾拉和詹姆斯。“利亚姆是个无赖，”马修声称。艾娃表示，如果且仅如果利亚姆是个无赖，那么奥利维亚就是个无赖。佐伊说，如果马修是个骑士，那么利亚姆就是个无赖。在奥利维亚的陈述中：“詹姆斯是个骑士当且仅当詹姆斯是个无赖”。夏洛特声明：“艾娃是个骑士，艾拉是个骑士”。利亚姆表示夏洛特是个无赖，而奥利维亚是个骑士。正如艾拉所说：“詹姆斯是个骑士，詹姆斯是个无赖”。詹姆斯声明：“艾拉不是骑士”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是一名骑士  \n(2) 艾娃是一名骑士  \n(3) 佐伊是一名骑士  \n(4) 奥利维亚是一名无赖  \n(5) 夏洛特是一名无赖  \n(6) 利亚姆是一名无赖  \n(7) 艾拉是一名无赖  \n(8) 詹姆斯是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：阿丽亚、大卫、杰克、奥利维亚、莉莉、艾拉、索菲娅和佩内洛普。阿丽亚提到：“索菲娅是无赖当且仅当莉莉是骑士。”大卫指出：“如果莉莉是骑士，那么莉莉就是无赖。”杰克声称：“佩内洛普是骑士或者佩内洛普是无赖。”根据奥利维亚的说法，“莉莉是骑士。”莉莉表示：“阿丽亚是骑士。”艾拉说：“阿丽亚不是无赖。”索菲娅表示大卫是骑士或者杰克是无赖。佩内洛普告诉你艾拉是无赖而阿丽亚是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿丽亚是一名骑士  \n(2) 大卫是一个无赖  \n(3) 杰克是一名骑士  \n(4) 奥利维亚是一名骑士  \n(5) 莉莉是一名骑士  \n(6) 艾拉是一名骑士  \n(7) 索菲娅是一个无赖  \n(8) 佩内洛普是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：索菲娅、本杰明、马修、杰克、艾玛、阿丽亚、洛根和伊芙琳。索菲娅的陈述是：“如果杰克是骑士，那么洛根就是骑士。”本杰明表示阿丽亚是无赖或者艾玛是骑士。“如果且仅如果索菲娅是骑士，艾玛就是无赖。”——马修。杰克告诉你艾玛是骑士。艾玛提到：“洛根是无赖或者阿丽亚是骑士。”在阿丽亚的话中：“本杰明是无赖。”洛根提到：“马修不是无赖。”伊芙琳提到：“马修是无赖或者马修是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 本杰明是一名骑士  \n(3) 马修是一名骑士  \n(4) 杰克是一个无赖  \n(5) 艾玛是一个无赖  \n(6) 阿丽亚是一个无赖  \n(7) 洛根是一名骑士  \n(8) 伊芙琳是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：本杰明、亚历山大、克洛伊、艾米莉、赖利、伊森、马修和丹尼尔。“如果伊森是骑士，那么马修就是无赖，”本杰明提到。亚历山大说：“艾米莉是无赖当且仅当丹尼尔是骑士。”克洛伊断言：“本杰明是骑士。”艾米莉表示，如果赖利是无赖，那么亚历山大就是无赖。赖利说：“亚历山大是无赖或者伊森是无赖。”伊森说亚历山大不是骑士。马修被听到说：“丹尼尔是骑士当且仅当马修是骑士。”丹尼尔表示马修是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是一名骑士  \n(2) 亚历山大是一个无赖  \n(3) 克洛伊是一名骑士  \n(4) 艾米莉是一名骑士  \n(5) 赖利是一名骑士  \n(6) 伊森是一名骑士  \n(7) 马修是一个无赖  \n(8) 丹尼尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：威廉、阿丽亚、阿梅莉亚、奥利维亚、夏洛特、维多利亚、艾娃和赖利。威廉说：“阿丽亚是无赖或者奥利维亚是无赖。”阿丽亚说夏洛特是骑士。“奥利维亚是骑士”——阿梅莉亚说。奥利维亚说：“威廉是骑士，夏洛特是无赖。”夏洛特说阿梅莉亚是骑士当且仅当奥利维亚是无赖。“奥利维亚是无赖，维多利亚是骑士，”维多利亚宣称。“奥利维亚是无赖，阿丽亚是无赖，”艾娃宣称。赖利评论道：“威廉是骑士，阿梅莉亚是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 阿丽亚是一个无赖  \n(3) 阿梅莉亚是一名骑士  \n(4) 奥利维亚是一名骑士  \n(5) 夏洛特是一个无赖  \n(6) 维多利亚是一个无赖  \n(7) 艾娃是一个无赖  \n(8) 赖利是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：威廉、阿丽亚、丹尼尔、哈珀、格蕾丝、卢卡斯、艾米莉和詹姆斯。威廉宣称：“如果阿丽亚是骑士，那么卢卡斯就是无赖。”阿丽亚宣称：“卢卡斯是无赖或者格蕾丝是骑士。”丹尼尔表示：“哈珀是骑士当且仅当卢卡斯是无赖。”哈珀提到：“格蕾丝是无赖或者格蕾丝是骑士。”格蕾丝说：“阿丽亚是骑士或者卢卡斯是骑士。”卢卡斯评论道：“如果丹尼尔是骑士，那么格蕾丝就是骑士。”艾米莉告诉你，威廉是无赖当且仅当格蕾丝是无赖。詹姆斯断言：“阿丽亚是骑士而丹尼尔是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是无赖  \n(2) 阿丽亚是骑士  \n(3) 丹尼尔是无赖  \n(4) 哈珀是骑士  \n(5) 格蕾丝是骑士  \n(6) 卢卡斯是骑士  \n(7) 艾米莉是无赖  \n(8) 詹姆斯是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：佐伊、雅各布、杰克、赖利、迈克尔、卢克、利亚姆和佩内洛普。佐伊说：“佩内洛普是无赖或者赖利是骑士。”雅各布说：“佩内洛普是无赖并且利亚姆是骑士。”杰克告诉你，雅各布不是无赖。赖利表示迈克尔是骑士。迈克尔说：“佩内洛普是无赖并且利亚姆是骑士。”卢克说：“赖利是骑士当且仅当利亚姆是骑士。”利亚姆在声明中说：“佐伊不是骑士。”佩内洛普说：“雅各布是骑士并且佩内洛普是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佐伊是一名骑士  \n(2) 雅各布是一个无赖  \n(3) 杰克是一个无赖  \n(4) 赖利是一个无赖  \n(5) 迈克尔是一个无赖  \n(6) 卢克是一名骑士  \n(7) 利亚姆是一个无赖  \n(8) 佩内洛普是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：亨利、雅各布、米娅、洛根、本杰明、艾米莉、奥萝拉和索菲娅。亨利宣称：“米娅是骑士或者索菲娅是无赖。”雅各布提到：“米娅是骑士或者奥萝拉是无赖。”米娅说道：“如果亨利是无赖，那么洛根就是骑士。”洛根的陈述是：“如果亨利是无赖，那么亨利就是骑士。”本杰明指出：“如果本杰明是骑士，那么索菲娅就是无赖。”艾米莉宣称：“奥萝拉是无赖。”奥萝拉提到：“本杰明是无赖，亨利是无赖。”索菲娅说道：“当且仅当本杰明是骑士时，艾米莉是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是一名骑士  \n(2) 雅各布是一名骑士  \n(3) 米娅是一名骑士  \n(4) 洛根是一名骑士  \n(5) 本杰明是一名骑士  \n(6) 艾米莉是一名骑士  \n(7) 奥萝拉是一个无赖  \n(8) 索菲娅是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：雅各布、伊丽莎白、约瑟夫、哈珀、塞巴斯蒂安、亚历山大、佩内洛普和卢卡斯。“塞巴斯蒂安是骑士或者亚历山大是骑士，”雅各布宣称。根据伊丽莎白的说法，“哈珀是骑士当且仅当佩内洛普是无赖”。约瑟夫说雅各布是无赖，而雅各布是骑士。“约瑟夫是骑士，”哈珀声称。根据塞巴斯蒂安的说法，“伊丽莎白是无赖当且仅当塞巴斯蒂安是骑士”。在亚历山大的话中：“哈珀是骑士或者雅各布是无赖”。佩内洛普的声明是：“塞巴斯蒂安不是骑士”。卢卡斯评论道：“亚历山大不是无赖”。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）雅各布是一名骑士  \n（2）伊丽莎白是一个无赖  \n（3）约瑟夫是一个无赖  \n（4）哈珀是一个无赖  \n（5）塞巴斯蒂安是一名骑士  \n（6）亚历山大是一个无赖  \n（7）佩内洛普是一个无赖  \n（8）卢卡斯是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：索菲娅、威廉、本杰明、杰克、雅各布、夏洛特、塞缪尔和伊莎贝拉。索菲娅声称：“威廉是无赖当且仅当雅各布是骑士。”威廉则说：“塞缪尔是无赖当且仅当杰克是骑士。”本杰明提到：“威廉是无赖。”杰克说：“夏洛特不是无赖。”雅各布说：“本杰明是骑士或者夏洛特是骑士。”夏洛特被听到说：“如果威廉是无赖，那么杰克是骑士。”塞缪尔说：“索菲娅是骑士而夏洛特是无赖。”伊莎贝拉提到：“本杰明是骑士当且仅当本杰明是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 威廉是骑士  \n(3) 本杰明是无赖  \n(4) 杰克是骑士  \n(5) 雅各布是骑士  \n(6) 夏洛特是骑士  \n(7) 塞缪尔是无赖  \n(8) 伊莎贝拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：本杰明、赖利、威廉、雅各布、马修、大卫、卢克和哈珀。本杰明告诉你雅各布不是无赖。赖利声称：“赖利是骑士或者雅各布是骑士”。威廉被听到说：“本杰明是骑士当且仅当大卫是骑士”。在雅各布看来：“如果哈珀是无赖，那么本杰明就是骑士”。正如马修所说：“卢克是骑士当且仅当赖利是无赖”。“马修是无赖而本杰明是无赖，”大卫提到。卢克声称：“雅各布是无赖”。“马修是骑士或者马修是无赖” - 哈珀。那谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是一名骑士  \n(2) 赖利是一名骑士  \n(3) 威廉是一个无赖  \n(4) 雅各布是一名骑士  \n(5) 马修是一名骑士  \n(6) 大卫是一个无赖  \n(7) 卢克是一个无赖  \n(8) 哈珀是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：伊森、维多利亚、杰克、欧文、佐伊、斯嘉丽、雅各布和洛根。正如伊森所说：“佐伊是骑士，斯嘉丽是骑士。”维多利亚表示佐伊是骑士，洛根是骑士。杰克表示佐伊是骑士。“斯嘉丽是骑士或者雅各布是骑士，”欧文声称。佐伊表示如果杰克是骑士，那么洛根就是无赖。“伊森是无赖当且仅当雅各布是骑士，”斯嘉丽提到。雅各布说：“斯嘉丽不是骑士。” “伊森是无赖，”洛根宣称。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是一名骑士  \n(2) 维多利亚是一个无赖  \n(3) 杰克是一名骑士  \n(4) 欧文是一名骑士  \n(5) 佐伊是一名骑士  \n(6) 斯嘉丽是一名骑士  \n(7) 雅各布是一个无赖  \n(8) 洛根是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：伊森、克洛伊、艾玛、卢克、阿丽亚、佩内洛普、约瑟夫和卢卡斯。伊森说：“克洛伊是个无赖。”克洛伊被听到说：“佩内洛普不是无赖。”根据艾玛的说法：“卢卡斯是骑士或者佩内洛普是无赖。”卢克提到：“阿丽亚是骑士，佩内洛普是骑士。”在阿丽亚的话中：“克洛伊是骑士或者佩内洛普是无赖。”佩内洛普声称：“卢卡斯是个无赖。”约瑟夫表示，如果且仅如果约瑟夫是骑士，艾玛就是无赖。卢卡斯断言：“约瑟夫是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是无赖  \n(2) 克洛伊是骑士  \n(3) 艾玛是无赖  \n(4) 卢克是骑士  \n(5) 阿丽亚是骑士  \n(6) 佩内洛普是骑士  \n(7) 约瑟夫是无赖  \n(8) 卢卡斯是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：奥利弗、梅森、亨利、伊莎贝拉、夏洛特、亚历山大、莉莉和杰克逊。奥利弗说：“亚历山大不是无赖。”梅森告诉你亨利是骑士。亨利说：“夏洛特是无赖或者莉莉是无赖。”根据伊莎贝拉的说法，“亚历山大是无赖。”夏洛特说亨利是无赖当且仅当莉莉是无赖。根据亚历山大的说法，“莉莉是无赖。”莉莉说：“伊莎贝拉是骑士或者亚历山大是无赖。”杰克逊评论道：“夏洛特是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利弗是一名骑士  \n(2) 梅森是一名骑士  \n(3) 亨利是一名骑士  \n(4) 伊莎贝拉是一个无赖  \n(5) 夏洛特是一个无赖  \n(6) 亚历山大是一名骑士  \n(7) 莉莉是一个无赖  \n(8) 杰克逊是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：大卫、艾娃、丹尼尔、塞缪尔、诺亚、艾米莉、索菲娅和伊丽莎白。大卫说：“索菲娅是无赖或者索菲娅是骑士。”艾娃提到：“丹尼尔是无赖当且仅当塞缪尔是骑士。”丹尼尔说塞缪尔是无赖或者艾娃是无赖。塞缪尔指出：“大卫是无赖。”诺亚告诉你：“如果大卫是骑士，那么艾米莉是无赖。”艾米莉声明：“索菲娅不是无赖。”索菲娅提到：“塞缪尔是无赖当且仅当丹尼尔是无赖。”伊丽莎白被听到说：“塞缪尔是无赖而艾娃是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 大卫是一名骑士  \n(2) 艾娃是一名骑士  \n(3) 丹尼尔是一名骑士  \n(4) 塞缪尔是一个无赖  \n(5) 诺亚是一名骑士  \n(6) 艾米莉是一个无赖  \n(7) 索菲娅是一个无赖  \n(8) 伊丽莎白是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：杰克逊、杰克、塞巴斯蒂安、艾娃、约瑟夫、佩内洛普、艾拉和伊丽莎白。杰克逊说：“伊丽莎白是骑士或者艾拉是骑士。”杰克声称：“杰克逊是无赖或者杰克是骑士。”有人听到塞巴斯蒂安说：“佩内洛普不是无赖。”艾娃声称：“塞巴斯蒂安不是无赖。”约瑟夫告诉你，如果艾娃是无赖，那么伊丽莎白就是无赖。根据佩内洛普的说法：“如果杰克逊是骑士，那么艾拉就是无赖。”艾拉表示，如果且仅如果杰克逊是无赖，艾娃就是无赖。“杰克是骑士而约瑟夫是无赖，”伊丽莎白声称。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）杰克逊是无赖  \n（2）杰克是骑士  \n（3）塞巴斯蒂安是骑士  \n（4）艾娃是骑士  \n（5）约瑟夫是骑士  \n（6）佩内洛普是骑士  \n（7）艾拉是无赖  \n（8）伊丽莎白是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：梅森、威廉、佩内洛普、米娅、本杰明、艾玛、奥利弗和伊森。梅森评论道：“伊森是无赖，佩内洛普是无赖。”威廉告诉你本杰明是无赖，而威廉是骑士。佩内洛普告诉你：“如果奥利弗是无赖，那么艾玛就是骑士。”米娅表示艾玛是无赖。本杰明说：“如果奥利弗是骑士，那么佩内洛普就是骑士。”艾玛宣称：“如果威廉是骑士，那么梅森就是骑士。”奥利弗说：“伊森不是骑士。”伊森宣称：“佩内洛普是骑士当且仅当梅森是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是无赖  \n(2) 威廉是无赖  \n(3) 佩内洛普是骑士  \n(4) 米娅是无赖  \n(5) 本杰明是骑士  \n(6) 艾玛是骑士  \n(7) 奥利弗是骑士  \n(8) 伊森是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：索菲娅、夏洛特、伊丽莎白、奥利弗、奥利维亚、赖利、奥萝拉和格蕾丝。索菲娅说：“赖利是骑士当且仅当奥利弗是无赖。”夏洛特则说：“奥利弗是骑士，伊丽莎白是骑士。”伊丽莎白宣称：“奥利维亚是骑士当且仅当奥萝拉是无赖。”奥利弗说：“夏洛特是骑士。”奥利维亚断言：“奥利弗是无赖。”赖利声称：“如果格蕾丝是无赖，那么奥利维亚是骑士。”奥萝拉说：“夏洛特不是骑士。”格蕾丝表示夏洛特是无赖或者奥萝拉是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 夏洛特是一名无赖  \n(3) 伊丽莎白是一名无赖  \n(4) 奥利弗是一名无赖  \n(5) 奥利维亚是一名骑士  \n(6) 赖利是一名骑士  \n(7) 奥萝拉是一名骑士  \n(8) 格蕾丝是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：莉莉、杰克逊、詹姆斯、奥萝拉、艾米莉、夏洛特、塞缪尔和威廉。莉莉说：“如果威廉是无赖，那么奥萝拉就是无赖。”杰克逊被听到说：“夏洛特是骑士。”詹姆斯说：“艾米莉不是骑士。”奥萝拉声称：“如果莉莉是无赖，那么夏洛特就是骑士。”艾米莉宣称：“如果艾米莉是骑士，那么奥萝拉就是骑士。”夏洛特说：“当且仅当莉莉是无赖时，奥萝拉是骑士。”塞缪尔被听到说：“如果夏洛特是骑士，那么杰克逊就是无赖。”威廉声称：“莉莉是骑士，艾米莉是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是无赖  \n(2) 杰克逊是骑士  \n(3) 詹姆斯是无赖  \n(4) 奥萝拉是骑士  \n(5) 艾米莉是骑士  \n(6) 夏洛特是骑士  \n(7) 塞缪尔是无赖  \n(8) 威廉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：夏洛特、索菲娅、艾米莉、塞巴斯蒂安、詹姆斯、维多利亚、塞缪尔和艾弗里。夏洛特表示，如果艾米莉是骑士，那么塞巴斯蒂安就是骑士。索菲娅提到：“塞缪尔不是骑士。”艾米莉表示维多利亚是骑士。塞巴斯蒂安宣称：“如果塞缪尔是骑士，那么夏洛特就是无赖。”詹姆斯提到：“如果詹姆斯是骑士，那么塞缪尔就是无赖。”维多利亚说塞缪尔不是无赖。塞缪尔说：“夏洛特是无赖，索菲娅是骑士。”艾弗里说：“维多利亚是无赖或者塞巴斯蒂安是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是一名骑士  \n(2) 索菲娅是一名骑士  \n(3) 艾米莉是一名无赖  \n(4) 塞巴斯蒂安是一名骑士  \n(5) 詹姆斯是一名骑士  \n(6) 维多利亚是一名无赖  \n(7) 塞缪尔是一名无赖  \n(8) 艾弗里是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：艾拉、索菲娅、大卫、莉莉、威廉、斯嘉丽、本杰明和阿比盖尔。艾拉说：“威廉不是无赖。”索菲娅说：“斯嘉丽是骑士或者索菲娅是骑士。”大卫评论道：“如果阿比盖尔是骑士，那么阿比盖尔就是无赖。”莉莉宣称：“如果威廉是无赖，那么艾拉就是无赖。”威廉的陈述是：“本杰明是骑士，艾拉是骑士。”斯嘉丽被听到说：“如果斯嘉丽是骑士，那么大卫就是无赖。”本杰明说：“艾拉是骑士，斯嘉丽是无赖。”阿比盖尔宣称：“大卫不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是无赖  \n(2) 索菲娅是骑士  \n(3) 大卫是无赖  \n(4) 莉莉是骑士  \n(5) 威廉是无赖  \n(6) 斯嘉丽是骑士  \n(7) 本杰明是无赖  \n(8) 阿比盖尔是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：卢卡斯、艾弗里、雅各布、利亚姆、迈克尔、欧文、塞巴斯蒂安和维多利亚。卢卡斯说：“如果且仅如果欧文是骑士，那么欧文就是无赖。”艾弗里说：“迈克尔是无赖。”雅各布说：“如果利亚姆是无赖，那么利亚姆就是骑士。”利亚姆说：“利亚姆是骑士或者艾弗里是无赖。”迈克尔说：“雅各布不是骑士。”欧文说：“塞巴斯蒂安是无赖，卢卡斯是骑士。”塞巴斯蒂安说：“艾弗里是骑士或者卢卡斯是无赖。”维多利亚告诉你，利亚姆是无赖或者艾弗里是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是无赖  \n(2) 艾弗里是骑士  \n(3) 雅各布是骑士  \n(4) 利亚姆是骑士  \n(5) 迈克尔是无赖  \n(6) 欧文是无赖  \n(7) 塞巴斯蒂安是骑士  \n(8) 维多利亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：艾米莉、艾登、詹姆斯、佐伊、艾娃、赖利、奥萝拉和伊丽莎白。正如艾米莉所说：“詹姆斯是无赖当且仅当奥萝拉是骑士。”艾登评论道：“伊丽莎白是骑士，艾登是骑士。”詹姆斯宣称：“伊丽莎白是骑士，赖利是无赖。”佐伊告诉你，艾米莉是骑士，奥萝拉是骑士。艾娃评论道：“詹姆斯不是骑士。”根据赖利的说法，“艾登不是骑士。”奥萝拉表示艾米莉是无赖，伊丽莎白是骑士。伊丽莎白告诉你，艾米莉是无赖或者奥萝拉是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）艾米莉是无赖  \n（2）艾登是骑士  \n（3）詹姆斯是骑士  \n（4）佐伊是无赖  \n（5）艾娃是无赖  \n（6）赖利是无赖  \n（7）奥萝拉是骑士  \n（8）伊丽莎白是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：丹尼尔、杰克、卢克、马修、斯嘉丽、梅森、米娅和奥萝拉。丹尼尔被听到说：“米娅是骑士或者马修是骑士。”杰克声称：“如果奥萝拉是无赖，那么马修就是骑士。”卢克告诉你，米娅是无赖或者斯嘉丽是无赖。马修说，如果且仅如果卢克是骑士，那么梅森就是无赖。“如果卢克是骑士，那么丹尼尔就是骑士，”斯嘉丽提到。梅森告诉你，米娅是骑士如果且仅如果卢克是无赖。米娅声称：“卢克是无赖或者丹尼尔是无赖。”根据奥萝拉的说法，“梅森是无赖如果且仅如果米娅是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）丹尼尔是一名骑士  \n（2）杰克是一名骑士  \n（3）卢克是一名无赖  \n（4）马修是一名骑士  \n（5）斯嘉丽是一名骑士  \n（6）梅森是一名骑士  \n（7）米娅是一名骑士  \n（8）奥萝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：迈克尔、艾拉、杰克逊、诺亚、佩内洛普、奥利弗、伊莎贝拉和大卫。迈克尔说：“如果诺亚是无赖，那么大卫就是骑士。”艾拉说：“如果杰克逊是无赖，那么诺亚就是无赖。”杰克逊说：“如果佩内洛普是骑士，那么奥利弗就是骑士。”诺亚说：“如果伊莎贝拉是骑士，那么奥利弗就是骑士。”佩内洛普说：“奥利弗是骑士。”奥利弗告诉你：“如果艾拉是无赖，那么大卫就是骑士。”伊莎贝拉表示：“奥利弗是无赖或者佩内洛普是无赖。”大卫指出：“伊莎贝拉是骑士，佩内洛普是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是无赖  \n(2) 艾拉是骑士  \n(3) 杰克逊是骑士  \n(4) 诺亚是无赖  \n(5) 佩内洛普是骑士  \n(6) 奥利弗是骑士  \n(7) 伊莎贝拉是无赖  \n(8) 大卫是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：艾弗里、伊芙琳、艾玛、奥利弗、马修、杰克逊、格蕾丝和詹姆斯。艾弗里说：“伊芙琳是骑士当且仅当艾弗里是骑士。”伊芙琳则说：“艾弗里是骑士当且仅当马修是无赖。”艾玛声称：“伊芙琳是无赖或者格蕾丝是骑士。”奥利弗声称：“如果艾弗里是骑士，那么伊芙琳就是骑士。”马修说伊芙琳是无赖，杰克逊也是无赖。杰克逊说：“伊芙琳是无赖或者艾弗里是骑士。”格蕾丝说：“伊芙琳是骑士，马修是无赖。”詹姆斯宣称：“如果马修是无赖，那么杰克逊就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是一名骑士  \n(2) 伊芙琳是一名骑士  \n(3) 艾玛是一名骑士  \n(4) 奥利弗是一名骑士  \n(5) 马修是一名无赖  \n(6) 杰克逊是一名骑士  \n(7) 格蕾丝是一名骑士  \n(8) 詹姆斯是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：索菲娅、欧文、亨利、格蕾丝、艾米莉、哈珀、洛根和莉莉。“哈珀是无赖，哈珀是骑士，”索菲娅说。欧文的话是：“格蕾丝是无赖，哈珀是骑士。”根据亨利的说法，“洛根是骑士或者欧文是骑士。”格蕾丝宣称：“洛根是骑士，亨利是骑士。”艾米莉说欧文是骑士，而欧文是无赖。哈珀评论道：“亨利不是骑士。”洛根说：“亨利是骑士当且仅当艾米莉是无赖。”莉莉被听到说：“格蕾丝是骑士当且仅当索菲娅是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 欧文是无赖  \n(3) 亨利是骑士  \n(4) 格蕾丝是骑士  \n(5) 艾米莉是无赖  \n(6) 哈珀是无赖  \n(7) 洛根是骑士  \n(8) 莉莉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：本杰明、哈珀、阿比盖尔、杰克、伊丽莎白、索菲娅、欧文和威廉。本杰明表示杰克是骑士，而杰克是无赖。“如果阿比盖尔是无赖，那么欧文就是无赖，”哈珀提到。阿比盖尔的声明是：“如果杰克是无赖，那么威廉就是骑士。”杰克声称：“阿比盖尔是骑士当且仅当阿比盖尔是无赖。”伊丽莎白指出：“本杰明不是骑士。”索菲娅的声明是：“杰克是无赖，欧文是骑士。”欧文说本杰明是无赖，伊丽莎白是无赖。威廉表示阿比盖尔是无赖或者伊丽莎白是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是无赖  \n(2) 哈珀是无赖  \n(3) 阿比盖尔是骑士  \n(4) 杰克是无赖  \n(5) 伊丽莎白是骑士  \n(6) 索菲娅是无赖  \n(7) 欧文是无赖  \n(8) 威廉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：伊莎贝拉、欧文、迈克尔、利亚姆、梅森、亨利、奥利维亚和艾登。伊莎贝拉说：“利亚姆是无赖或者梅森是无赖。”欧文说：“梅森是无赖。”迈克尔声称：“亨利是无赖当且仅当伊莎贝拉是骑士。”利亚姆告诉你，艾登是无赖或者欧文是骑士。梅森指出：“亨利是无赖。”亨利评论道：“迈克尔是无赖而伊莎贝拉是无赖。”奥利维亚说：“梅森是无赖而迈克尔是骑士。”艾登说：“如果奥利维亚是无赖，那么伊莎贝拉就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是一名骑士  \n(2) 欧文是一个无赖  \n(3) 迈克尔是一名骑士  \n(4) 利亚姆是一个无赖  \n(5) 梅森是一名骑士  \n(6) 亨利是一个无赖  \n(7) 奥利维亚是一个无赖  \n(8) 艾登是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：梅森、大卫、欧文、阿梅莉亚、哈珀、詹姆斯、迈克尔和塞巴斯蒂安。梅森评论道：“欧文是个无赖。”大卫宣称：“哈珀是骑士，梅森也是骑士。”根据欧文的说法，“大卫是无赖或者塞巴斯蒂安是骑士。”阿梅莉亚说：“欧文是骑士。”哈珀提到：“詹姆斯是无赖当且仅当詹姆斯是骑士。”詹姆斯告诉你，迈克尔是骑士或者大卫是无赖。迈克尔说阿梅莉亚是骑士或者梅森是骑士。塞巴斯蒂安声明：“梅森是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是无赖  \n(2) 大卫是无赖  \n(3) 欧文是骑士  \n(4) 阿梅莉亚是骑士  \n(5) 哈珀是无赖  \n(6) 詹姆斯是骑士  \n(7) 迈克尔是骑士  \n(8) 塞巴斯蒂安是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：米娅、艾米莉、欧文、艾拉、奥萝拉、艾娃、奥利维亚和大卫。根据米娅的说法，“欧文是无赖，艾娃是骑士”。正如艾米莉所说，“艾娃是无赖当且仅当大卫是无赖”。欧文声称：“艾米莉是骑士当且仅当奥利维亚是无赖”。艾拉评论道，“奥利维亚是骑士当且仅当艾娃是骑士”。奥萝拉评论道，“艾米莉是无赖”。艾娃告诉你，如果艾拉是骑士，那么奥萝拉就是骑士。奥利维亚表示，如果欧文是无赖，那么米娅就是骑士。大卫说，“奥萝拉是无赖或者艾米莉是骑士”。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是无赖  \n(2) 艾米莉是无赖  \n(3) 欧文是骑士  \n(4) 艾拉是骑士  \n(5) 奥萝拉是骑士  \n(6) 艾娃是骑士  \n(7) 奥利维亚是骑士  \n(8) 大卫是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：伊芙琳、奥萝拉、亚历山大、大卫、奥利弗、约瑟夫、梅森和阿丽亚。伊芙琳评论道：“奥萝拉是无赖或者亚历山大是骑士。”奥萝拉提到：“只有当伊芙琳是骑士时，奥利弗才是骑士。”亚历山大表示约瑟夫是骑士，阿丽亚是骑士。大卫指出：“奥萝拉不是无赖。”奥利弗指出：“大卫不是骑士。”约瑟夫说：“大卫是无赖，梅森是骑士。”梅森断言：“如果阿丽亚是无赖，那么约瑟夫就是无赖。”阿丽亚宣称：“只有当大卫是骑士时，奥萝拉才是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是无赖  \n(2) 奥萝拉是骑士  \n(3) 亚历山大是无赖  \n(4) 大卫是骑士  \n(5) 奥利弗是无赖  \n(6) 约瑟夫是无赖  \n(7) 梅森是骑士  \n(8) 阿丽亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：索菲娅、阿丽亚、杰克逊、伊森、詹姆斯、雅各布、洛根和诺亚。索菲娅评论道：“洛根是无赖，雅各布是无赖。”阿丽亚说：“雅各布不是骑士。”杰克逊说，如果且仅如果诺亚是无赖，那么索菲娅就是骑士。伊森告诉你，詹姆斯不是无赖。詹姆斯说：“如果杰克逊是骑士，那么雅各布就是骑士。”雅各布说：“詹姆斯是无赖，或者杰克逊是骑士。”洛根提到：“伊森不是无赖。”诺亚说：“洛根是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 阿丽亚是骑士  \n(3) 杰克逊是无赖  \n(4) 伊森是骑士  \n(5) 詹姆斯是骑士  \n(6) 雅各布是无赖  \n(7) 洛根是骑士  \n(8) 诺亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：马修、威廉、艾拉、詹姆斯、迈克尔、艾娃、塞缪尔和格蕾丝。马修宣称：“如果迈克尔是无赖，那么艾娃就是无赖。”威廉说：“迈克尔不是骑士。”艾拉提到：“格蕾丝是骑士当且仅当艾拉是骑士。”詹姆斯说：“格蕾丝是无赖或者艾拉是骑士。”迈克尔被听到说：“如果艾娃是骑士，那么格蕾丝就是无赖。”艾娃评论道：“如果迈克尔是骑士，那么格蕾丝就是骑士。”塞缪尔表示格蕾丝是骑士，艾娃是骑士。正如格蕾丝所说：“艾拉是骑士当且仅当威廉是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是无赖  \n(2) 威廉是骑士  \n(3) 艾拉是无赖  \n(4) 詹姆斯是无赖  \n(5) 迈克尔是无赖  \n(6) 艾娃是骑士  \n(7) 塞缪尔是骑士  \n(8) 格蕾丝是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：杰克、亚历山大、大卫、索菲娅、佩内洛普、艾拉、佐伊和丹尼尔。杰克告诉你，大卫是无赖当且仅当佩内洛普是无赖。亚历山大的话是：“如果大卫是无赖，那么杰克就是无赖。”大卫提到：“丹尼尔是无赖或者佩内洛普是骑士。”索菲娅说杰克不是骑士。佩内洛普说：“亚历山大不是骑士。”艾拉表示艾拉是骑士，佩内洛普是骑士。佐伊说：“如果索菲娅是骑士，那么艾拉就是骑士。”丹尼尔被听到说：“丹尼尔是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）杰克是无赖  \n（2）亚历山大是骑士  \n（3）大卫是骑士  \n（4）索菲娅是骑士  \n（5）佩内洛普是无赖  \n（6）艾拉是无赖  \n（7）佐伊是无赖  \n（8）丹尼尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：洛根、欧文、阿梅莉亚、阿丽亚、维多利亚、詹姆斯、约瑟夫和雅各布。洛根声称：“如果阿丽亚是无赖，那么阿梅莉亚就是无赖。”欧文评论道：“洛根是骑士。”阿梅莉亚提到：“欧文是无赖或者约瑟夫是无赖。”阿丽亚在一份声明中说：“欧文是骑士。”维多利亚说，如果阿梅莉亚是无赖，那么维多利亚就是骑士。詹姆斯说：“阿丽亚是骑士，阿梅莉亚是无赖。”约瑟夫声称：“詹姆斯是无赖当且仅当阿丽亚是骑士。”雅各布评论道：“维多利亚不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是无赖  \n(2) 欧文是无赖  \n(3) 阿梅莉亚是骑士  \n(4) 阿丽亚是无赖  \n(5) 维多利亚是骑士  \n(6) 詹姆斯是无赖  \n(7) 约瑟夫是无赖  \n(8) 雅各布是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：夏洛特、亚历山大、诺亚、约瑟夫、阿梅莉亚、杰克逊、艾弗里和本杰明。夏洛特说，如果且仅如果夏洛特是骑士，那么约瑟夫就是无赖。在亚历山大的陈述中：“杰克逊不是骑士”。在诺亚的陈述中：“夏洛特不是无赖”。正如约瑟夫所说：“亚历山大是骑士”。阿梅莉亚说艾弗里是骑士，诺亚是骑士。杰克逊被听到说：“如果亚历山大是无赖，那么夏洛特就是骑士”。“本杰明是无赖，杰克逊是无赖，”艾弗里宣称。在本杰明的话中：“亚历山大是骑士，诺亚是无赖”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是一名骑士  \n(2) 亚历山大是一个无赖  \n(3) 诺亚是一名骑士  \n(4) 约瑟夫是一个无赖  \n(5) 阿梅莉亚是一个无赖  \n(6) 杰克逊是一名骑士  \n(7) 艾弗里是一个无赖  \n(8) 本杰明是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：诺亚、雅各布、索菲娅、斯嘉丽、欧文、亨利、艾登和格蕾丝。诺亚说：“亨利是个无赖。”雅各布表示欧文不是骑士。“索菲娅是骑士当且仅当艾登是骑士，”索菲娅宣称。斯嘉丽说：“格蕾丝是无赖当且仅当亨利是无赖。”欧文说：“格蕾丝是骑士或者诺亚是无赖。”亨利说：“如果欧文是无赖，那么索菲娅就是骑士。”艾登提到：“索菲娅不是无赖。”格蕾丝宣称：“雅各布是无赖或者雅各布是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是无赖  \n(2) 雅各布是无赖  \n(3) 索菲娅是骑士  \n(4) 斯嘉丽是骑士  \n(5) 欧文是骑士  \n(6) 亨利是骑士  \n(7) 艾登是骑士  \n(8) 格蕾丝是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：艾弗里、艾拉、卢卡斯、伊莎贝拉、艾玛、艾米莉、卢克和奥利维亚。艾弗里说：“伊莎贝拉是骑士，卢克是无赖。”艾拉评论道：“艾弗里是骑士，或者伊莎贝拉是无赖。”卢卡斯说：“艾拉是无赖，伊莎贝拉是无赖。”伊莎贝拉指出：“伊莎贝拉是骑士，艾米莉是无赖。”根据艾玛的说法，“奥利维亚是无赖。”艾米莉宣称：“如果艾弗里是骑士，那么伊莎贝拉是骑士。”卢克被听到说：“伊莎贝拉是无赖。”奥利维亚说：“如果艾弗里是骑士，那么卢卡斯是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是无赖  \n(2) 艾拉是骑士  \n(3) 卢卡斯是无赖  \n(4) 伊莎贝拉是无赖  \n(5) 艾玛是无赖  \n(6) 艾米莉是骑士  \n(7) 卢克是骑士  \n(8) 奥利维亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：迈克尔、艾娃、塞巴斯蒂安、格蕾丝、洛根、本杰明、威廉和伊莎贝拉。迈克尔说：“威廉是无赖或者艾娃是无赖。”艾娃表示格蕾丝是无赖。塞巴斯蒂安说：“威廉不是无赖。”格蕾丝说塞巴斯蒂安不是无赖。正如洛根所说：“威廉是无赖而且塞巴斯蒂安是无赖。”本杰明说：“塞巴斯蒂安不是无赖。”威廉声称：“当且仅当洛根是无赖时，威廉是骑士。”伊莎贝拉评论道：“如果洛根是无赖，那么本杰明就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是一名骑士  \n(2) 艾娃是一个无赖  \n(3) 塞巴斯蒂安是一名骑士  \n(4) 格蕾丝是一名骑士  \n(5) 洛根是一个无赖  \n(6) 本杰明是一名骑士  \n(7) 威廉是一名骑士  \n(8) 伊莎贝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：塞巴斯蒂安、亨利、约瑟夫、欧文、艾登、大卫、艾弗里和艾米莉。塞巴斯蒂安提到：“艾登是无赖或者大卫是骑士。”亨利被听到说：“亨利是骑士或者欧文是骑士。”约瑟夫被听到说：“大卫是无赖当且仅当塞巴斯蒂安是无赖。”在欧文的话中：“大卫是骑士当且仅当艾米莉是骑士。”艾登评论道：“塞巴斯蒂安不是无赖。”根据大卫的说法：“塞巴斯蒂安是无赖或者大卫是骑士。”在艾弗里的话中：“艾登是骑士或者塞巴斯蒂安是无赖。”艾米莉说：“大卫是无赖当且仅当艾弗里是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞巴斯蒂安是一名骑士  \n(2) 亨利是一名骑士  \n(3) 约瑟夫是一名骑士  \n(4) 欧文是一名骑士  \n(5) 艾登是一名骑士  \n(6) 大卫是一名骑士  \n(7) 艾弗里是一名骑士  \n(8) 艾米莉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：杰克、艾娃、艾登、索菲娅、阿丽亚、伊莎贝拉、丹尼尔和洛根。杰克说：“如果丹尼尔是无赖，那么阿丽亚就是骑士。”艾娃的话是：“艾娃是骑士或者艾登是骑士。”艾登宣称：“杰克是无赖或者伊莎贝拉是骑士。”索菲娅被听到说：“阿丽亚是无赖或者丹尼尔是无赖。”阿丽亚指出：“艾登是无赖当且仅当艾娃是无赖。”伊莎贝拉断言：“如果洛根是骑士，那么丹尼尔就是无赖。”丹尼尔断言：“杰克是骑士或者洛根是骑士。”洛根指出：“索菲娅是骑士或者艾登是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）杰克是骑士  \n（2）艾娃是骑士  \n（3）艾登是无赖  \n（4）索菲娅是骑士  \n（5）阿丽亚是无赖  \n（6）伊莎贝拉是无赖  \n（7）丹尼尔是骑士  \n（8）洛根是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：大卫、阿丽亚、洛根、马修、亚历山大、欧文、本杰明和艾米莉。在大卫的话中：“本杰明是骑士或者马修是骑士。”阿丽亚提到：“欧文是无赖或者亚历山大是骑士。”洛根宣称：“大卫不是无赖。”马修说：“阿丽亚是骑士并且本杰明是无赖。”亚历山大说：“本杰明是骑士并且大卫是骑士。”欧文宣称：“本杰明是骑士并且大卫是骑士。”本杰明断言：“马修是骑士当且仅当亚历山大是无赖。”艾米莉指出：“如果马修是无赖，那么亚历山大是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 大卫是一名骑士  \n(2) 阿丽亚是一名骑士  \n(3) 洛根是一名骑士  \n(4) 马修是一名无赖  \n(5) 亚历山大是一名骑士  \n(6) 欧文是一名骑士  \n(7) 本杰明是一名骑士  \n(8) 艾米莉是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：梅森、大卫、艾弗里、伊莎贝拉、哈珀、索菲娅、奥利弗和约瑟夫。梅森声称：“如果大卫是骑士，那么约瑟夫就是骑士。”大卫说：“索菲娅是无赖。”艾弗里表示伊莎贝拉是无赖，约瑟夫也是无赖。伊莎贝拉声称：“如果索菲娅是无赖，那么大卫就是骑士。”哈珀说：“大卫不是骑士。”索菲娅告诉你梅森是无赖，伊莎贝拉也是无赖。奥利弗指出：“如果索菲娅是骑士，那么索菲娅就是无赖。”约瑟夫声称：“伊莎贝拉是骑士或者大卫是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是一名骑士  \n(2) 大卫是一名骑士  \n(3) 艾弗里是一个无赖  \n(4) 伊莎贝拉是一名骑士  \n(5) 哈珀是一个无赖  \n(6) 索菲娅是一个无赖  \n(7) 奥利弗是一名骑士  \n(8) 约瑟夫是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：詹姆斯、大卫、哈珀、马修、卢克、丹尼尔、艾弗里和索菲娅。“丹尼尔是骑士，”詹姆斯宣称。大卫告诉你，如果且仅如果詹姆斯是无赖，那么索菲娅就是无赖。哈珀评论道：“丹尼尔不是骑士。”马修告诉你，如果詹姆斯是骑士，那么詹姆斯就是无赖。“如果索菲娅是骑士，那么艾弗里就是无赖，”卢克声称。丹尼尔表示索菲娅是无赖。根据艾弗里的说法，“哈珀不是骑士。”索菲娅表示卢克不是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）詹姆斯是骑士  \n（2）大卫是无赖  \n（3）哈珀是无赖  \n（4）马修是无赖  \n（5）卢克是骑士  \n（6）丹尼尔是骑士  \n（7）艾弗里是骑士  \n（8）索菲娅是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：艾拉、雅各布、马修、艾玛、艾米莉、哈珀、莉莉和艾弗里。艾拉说：“莉莉是骑士或者雅各布是骑士。”雅各布评论道：“艾玛是无赖或者哈珀是骑士。”马修断言：“艾拉是骑士并且雅各布是骑士。”正如艾玛所说：“莉莉是无赖当且仅当莉莉是骑士。”在艾米莉的话中：“艾拉不是骑士。”哈珀说：“艾拉不是骑士。”莉莉被听到说：“如果艾玛是骑士，那么艾米莉就是无赖。”艾弗里指出：“雅各布是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是一名骑士  \n(2) 雅各布是一名骑士  \n(3) 马修是一名骑士  \n(4) 艾玛是一名无赖  \n(5) 艾米莉是一名无赖  \n(6) 哈珀是一名无赖  \n(7) 莉莉是一名骑士  \n(8) 艾弗里是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：斯嘉丽、佩内洛普、卢克、索菲娅、克洛伊、丹尼尔、约瑟夫和亚历山大。斯嘉丽说：“斯嘉丽是骑士，克洛伊是无赖。”佩内洛普告诉你，亚历山大是骑士或者约瑟夫是无赖。卢克的话是：“斯嘉丽是骑士当且仅当索菲娅是骑士。”索菲娅告诉你，亚历山大是骑士，卢克是骑士。克洛伊说：“斯嘉丽是无赖或者斯嘉丽是骑士。”丹尼尔的陈述是：“如果丹尼尔是骑士，那么亚历山大是无赖。”约瑟夫声明：“索菲娅是骑士，佩内洛普是骑士。”亚历山大评论道：“索菲娅是骑士或者卢克是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 斯嘉丽是无赖  \n(2) 佩内洛普是骑士  \n(3) 卢克是骑士  \n(4) 索菲娅是无赖  \n(5) 克洛伊是骑士  \n(6) 丹尼尔是骑士  \n(7) 约瑟夫是无赖  \n(8) 亚历山大是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：梅森、艾弗里、米娅、诺亚、丹尼尔、奥利弗、约瑟夫和艾拉。梅森说：“如果米娅是骑士，那么艾拉就是无赖。”艾弗里说：“梅森是无赖或者艾拉是骑士。”米娅说：“诺亚是骑士。”诺亚说：“约瑟夫是无赖，而诺亚是骑士。”丹尼尔表示：“如果约瑟夫是无赖，那么奥利弗就是无赖。”奥利弗说：“艾拉是骑士。”约瑟夫评论道：“丹尼尔是骑士。”艾拉声称：“米娅是无赖当且仅当奥利弗是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是无赖  \n(2) 艾弗里是骑士  \n(3) 米娅是骑士  \n(4) 诺亚是骑士  \n(5) 丹尼尔是无赖  \n(6) 奥利弗是骑士  \n(7) 约瑟夫是无赖  \n(8) 艾拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：伊森、卢卡斯、亚历山大、阿梅莉亚、洛根、梅森、威廉和利亚姆。伊森说，阿梅莉亚是骑士当且仅当亚历山大是无赖。卢卡斯告诉你，伊森是骑士或者梅森是无赖。亚历山大指出：“洛根是骑士，伊森是骑士。”阿梅莉亚提到：“梅森是无赖，威廉是无赖。”洛根宣称：“亚历山大不是骑士。”梅森告诉你，卢卡斯不是骑士。威廉评论道：“梅森是骑士或者洛根是无赖。”利亚姆的声明是：“伊森是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是无赖  \n(2) 卢卡斯是无赖  \n(3) 亚历山大是无赖  \n(4) 阿梅莉亚是无赖  \n(5) 洛根是骑士  \n(6) 梅森是骑士  \n(7) 威廉是骑士  \n(8) 利亚姆是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：伊莎贝拉、艾玛、佩内洛普、亚历山大、伊森、洛根、哈珀和塞缪尔。伊莎贝拉说：“伊森是骑士，亚历山大是无赖。”艾玛评论道：“伊莎贝拉是无赖。”佩内洛普断言：“亚历山大是骑士，哈珀是骑士。”亚历山大被听到说：“塞缪尔是骑士当且仅当亚历山大是骑士。”伊森指出：“洛根是骑士当且仅当伊莎贝拉是无赖。”洛根评论道：“伊莎贝拉是骑士。”哈珀的声明是：“亚历山大是无赖当且仅当伊森是骑士。”塞缪尔指出：“洛根是骑士或者佩内洛普是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是无赖  \n(2) 艾玛是骑士  \n(3) 佩内洛普是骑士  \n(4) 亚历山大是骑士  \n(5) 伊森是无赖  \n(6) 洛根是无赖  \n(7) 哈珀是骑士  \n(8) 塞缪尔是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：大卫、马修、洛根、斯嘉丽、奥利维亚、艾娃、伊芙琳和本杰明。大卫告诉你洛根不是无赖。马修告诉你斯嘉丽是骑士当且仅当大卫是无赖。根据洛根的说法，“斯嘉丽不是无赖”。斯嘉丽说伊芙琳是骑士或者艾娃是骑士。奥利维亚被听到说：“如果本杰明是无赖，那么奥利维亚就是骑士。”艾娃声称：“大卫是骑士。”在伊芙琳的陈述中：“马修是无赖当且仅当斯嘉丽是无赖。”根据本杰明的说法，“洛根是骑士而大卫是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "（1）大卫是一名骑士  \n（2）马修是一个无赖  \n（3）洛根是一名骑士  \n（4）斯嘉丽是一名骑士  \n（5）奥利维亚是一名骑士  \n（6）艾娃是一名骑士  \n（7）伊芙琳是一个无赖  \n（8）本杰明是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：卢卡斯、杰克逊、伊芙琳、迈克尔、塞巴斯蒂安、米娅、艾娃和莉莉。“米娅是个无赖，”卢卡斯声称。“卢卡斯是个无赖，卢卡斯是个骑士，”杰克逊提到。“杰克逊不是骑士，”伊芙琳提到。迈克尔指出：“卢卡斯是个无赖或者迈克尔是个骑士。”根据塞巴斯蒂安的说法，“莉莉是个骑士。”米娅提到：“如果杰克逊是个骑士，那么米娅就是个骑士。”艾娃宣称：“莉莉是个无赖或者卢卡斯是个骑士。”莉莉声称：“如果伊芙琳是个骑士，那么杰克逊就是个骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是无赖  \n(2) 杰克逊是无赖  \n(3) 伊芙琳是骑士  \n(4) 迈克尔是骑士  \n(5) 塞巴斯蒂安是无赖  \n(6) 米娅是骑士  \n(7) 艾娃是骑士  \n(8) 莉莉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：索菲娅、诺亚、斯嘉丽、杰克逊、艾弗里、丹尼尔、阿比盖尔和格蕾丝。索菲娅被听到说：“索菲娅是骑士或者阿比盖尔是无赖。”诺亚指出：“索菲娅是无赖当且仅当格蕾丝是无赖。”斯嘉丽说格蕾丝是无赖，杰克逊也是无赖。“索菲娅不是骑士，”杰克逊声称。“如果格蕾丝是无赖，那么丹尼尔就是无赖，”艾弗里宣称。丹尼尔说斯嘉丽是骑士。阿比盖尔指出：“斯嘉丽是骑士。”正如格蕾丝所说：“杰克逊不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 诺亚是一个无赖  \n(3) 斯嘉丽是一名骑士  \n(4) 杰克逊是一个无赖  \n(5) 艾弗里是一个无赖  \n(6) 丹尼尔是一名骑士  \n(7) 阿比盖尔是一名骑士  \n(8) 格蕾丝是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：伊芙琳、雅各布、亚历山大、亨利、伊丽莎白、阿丽亚、莉莉和伊森。伊芙琳表示雅各布不是骑士。在雅各布的陈述中：“伊森不是无赖”。在亚历山大的陈述中：“雅各布是骑士当且仅当雅各布是无赖”。亨利表示伊丽莎白是骑士。在伊丽莎白的话中：“伊芙琳是骑士当且仅当伊森是无赖”。阿丽亚评论道：“伊森是无赖”。“伊森是无赖当且仅当伊芙琳是无赖，”莉莉提到。在伊森的陈述中：“如果莉莉是骑士，那么亚历山大是骑士”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是无赖  \n(2) 雅各布是骑士  \n(3) 亚历山大是无赖  \n(4) 亨利是骑士  \n(5) 伊丽莎白是骑士  \n(6) 阿丽亚是无赖  \n(7) 莉莉是无赖  \n(8) 伊森是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：马修、塞巴斯蒂安、诺亚、佐伊、伊丽莎白、阿梅莉亚、莉莉和索菲娅。马修说阿梅莉亚是骑士，索菲娅是无赖。塞巴斯蒂安说：“诺亚是无赖或者诺亚是骑士。”诺亚说：“阿梅莉亚是骑士当且仅当索菲娅是无赖。”佐伊的陈述是：“莉莉是无赖当且仅当索菲娅是骑士。”伊丽莎白说：“索菲娅是骑士，诺亚是骑士。”阿梅莉亚说：“诺亚是无赖并且诺亚是骑士。”莉莉评论道：“诺亚是无赖当且仅当佐伊是骑士。”索菲娅指出：“诺亚是无赖或者莉莉是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是无赖  \n(2) 塞巴斯蒂安是骑士  \n(3) 诺亚是骑士  \n(4) 佐伊是骑士  \n(5) 伊丽莎白是骑士  \n(6) 阿梅莉亚是无赖  \n(7) 莉莉是无赖  \n(8) 索菲娅是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：本杰明、索菲娅、利亚姆、大卫、约瑟夫、奥利弗、索菲娅和诺亚。在本杰明的话中：“如果索菲娅是骑士，那么诺亚就是无赖。”索菲娅说：“大卫不是无赖。”根据利亚姆的说法：“约瑟夫是无赖当且仅当诺亚是无赖。”大卫说：“利亚姆是骑士。”约瑟夫评论道：“本杰明不是骑士。”在奥利弗的话中：“约瑟夫是无赖或者利亚姆是无赖。”索菲娅表示奥利弗是无赖，索菲娅是无赖。诺亚声明：“奥利弗是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是一名骑士  \n(2) 索菲娅是一名骑士  \n(3) 利亚姆是一名骑士  \n(4) 大卫是一名骑士  \n(5) 约瑟夫是一个无赖  \n(6) 奥利弗是一名骑士  \n(7) 索菲娅是一个无赖  \n(8) 诺亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：莉莉、诺亚、伊芙琳、卢卡斯、维多利亚、克洛伊、梅森和艾弗里。正如莉莉所说：“克洛伊是无赖或者克洛伊是骑士。”诺亚声称：“维多利亚不是无赖。”伊芙琳指出：“梅森不是无赖。”卢卡斯被听到说：“克洛伊是无赖而梅森是骑士。”维多利亚宣称：“伊芙琳是无赖当且仅当莉莉是骑士。”克洛伊评论道：“伊芙琳是骑士而诺亚是骑士。”正如梅森所说：“艾弗里是骑士而梅森是骑士。”艾弗里声称：“梅森是骑士而伊芙琳是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是骑士  \n(2) 诺亚是骑士  \n(3) 伊芙琳是无赖  \n(4) 卢卡斯是无赖  \n(5) 维多利亚是骑士  \n(6) 克洛伊是无赖  \n(7) 梅森是无赖  \n(8) 艾弗里是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：伊莎贝拉、索菲娅、阿比盖尔、阿丽亚、艾玛、丹尼尔、斯嘉丽和欧文。伊莎贝拉评论道：“索菲娅是骑士或者阿丽亚是无赖。”索菲娅说阿比盖尔是骑士，艾玛是无赖。阿比盖尔说：“斯嘉丽是无赖当且仅当阿丽亚是无赖。”阿丽亚断言：“如果斯嘉丽是骑士，那么索菲娅就是无赖。”艾玛评论道：“欧文是骑士，伊莎贝拉是无赖。”在丹尼尔的一句话中：“伊莎贝拉是无赖。”斯嘉丽被听到说：“阿丽亚是骑士或者索菲娅是骑士。”欧文被听到说：“斯嘉丽是骑士，阿丽亚是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是无赖  \n(2) 索菲娅是无赖  \n(3) 阿比盖尔是骑士  \n(4) 阿丽亚是骑士  \n(5) 艾玛是骑士  \n(6) 丹尼尔是骑士  \n(7) 斯嘉丽是骑士  \n(8) 欧文是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：莉莉、约瑟夫、杰克逊、雅各布、索菲娅、艾登、伊森和大卫。莉莉说杰克逊是骑士。约瑟夫声称：“杰克逊不是无赖。”杰克逊评论道：“伊森是骑士或者伊森是无赖。”雅各布声称：“索菲娅是无赖，艾登是骑士。”索菲娅指出：“约瑟夫是骑士。”艾登说杰克逊是无赖，杰克逊是骑士。伊森说：“莉莉是无赖或者艾登是骑士。”大卫提到：“艾登是无赖，艾登是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是骑士  \n(2) 约瑟夫是骑士  \n(3) 杰克逊是骑士  \n(4) 雅各布是无赖  \n(5) 索菲娅是骑士  \n(6) 艾登是无赖  \n(7) 伊森是无赖  \n(8) 大卫是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了8位居民：米娅、迈克尔、艾弗里、阿比盖尔、卢卡斯、夏洛特、哈珀和亚历山大。“如果米娅是骑士，那么亚历山大就是骑士，”米娅声称。迈克尔说阿比盖尔是无赖，哈珀是骑士。艾弗里的话是：“卢卡斯是无赖当且仅当迈克尔是骑士。”阿比盖尔提到：“迈克尔是无赖。”卢卡斯表示夏洛特不是骑士。夏洛特的声明是：“哈珀是骑士或者迈克尔是无赖。”哈珀提到：“阿比盖尔不是无赖。”亚历山大说：“卢卡斯是无赖，夏洛特是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是一名骑士  \n(2) 迈克尔是一个无赖  \n(3) 艾弗里是一个无赖  \n(4) 阿比盖尔是一名骑士  \n(5) 卢卡斯是一个无赖  \n(6) 夏洛特是一名骑士  \n(7) 哈珀是一名骑士  \n(8) 亚历山大是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：艾拉、卢卡斯、本杰明、克洛伊、迈克尔、雅各布、艾玛和约瑟夫。艾拉告诉你迈克尔是骑士。卢卡斯说：“迈克尔是无赖或者艾玛是骑士。”本杰明被听到说：“艾拉是无赖当且仅当雅各布是无赖。”克洛伊宣称：“约瑟夫是骑士当且仅当迈克尔是无赖。”迈克尔表示：“如果雅各布是骑士，那么克洛伊是骑士。”雅各布的陈述是：“克洛伊是无赖，卢卡斯是无赖。”艾玛被听到说：“克洛伊不是骑士。”约瑟夫声称：“如果艾玛是骑士，那么迈克尔是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是一名骑士  \n(2) 卢卡斯是一名骑士  \n(3) 本杰明是一个无赖  \n(4) 克洛伊是一个无赖  \n(5) 迈克尔是一名骑士  \n(6) 雅各布是一个无赖  \n(7) 艾玛是一名骑士  \n(8) 约瑟夫是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：艾玛、艾娃、索菲娅、卢卡斯、阿丽亚、佩内洛普、艾登和约瑟夫。“艾登是骑士，”艾玛宣称。艾娃说：“如果且仅如果艾玛是骑士，佩内洛普就是无赖。”索菲娅指出：“艾娃是骑士，佩内洛普是无赖。”卢卡斯的陈述是：“索菲娅不是骑士。”阿丽亚说，如果艾登是无赖，那么卢卡斯就是骑士。“阿丽亚是无赖，”佩内洛普提到。“如果艾玛是无赖，那么佩内洛普就是无赖，”艾登声称。“艾娃是无赖，索菲娅是骑士，”约瑟夫声称。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是骑士  \n(2) 艾娃是骑士  \n(3) 索菲娅是骑士  \n(4) 卢卡斯是无赖  \n(5) 阿丽亚是骑士  \n(6) 佩内洛普是无赖  \n(7) 艾登是骑士  \n(8) 约瑟夫是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：卢克、阿丽亚、艾玛、利亚姆、索菲娅、格蕾丝、艾登和奥利弗。根据卢克的说法：“如果索菲娅是骑士，那么艾玛就是骑士。”阿丽亚说艾登是无赖，利亚姆是骑士。艾玛声称：“卢克不是无赖。”利亚姆提到：“阿丽亚是无赖或者索菲娅是骑士。”根据索菲娅的说法：“利亚姆是骑士当且仅当奥利弗是无赖。”格蕾丝的声明是：“格蕾丝是骑士，奥利弗是无赖。”艾登指出：“利亚姆是骑士或者格蕾丝是无赖。”奥利弗被听到说：“利亚姆是骑士或者卢克是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 阿丽亚是一个无赖  \n(3) 艾玛是一名骑士  \n(4) 利亚姆是一名骑士  \n(5) 索菲娅是一个无赖  \n(6) 格蕾丝是一个无赖  \n(7) 艾登是一名骑士  \n(8) 奥利弗是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了8位居民：奥利维亚、詹姆斯、约瑟夫、塞缪尔、索菲娅、伊森、艾米莉和杰克逊。奥利维亚说：“艾米莉不是无赖。”詹姆斯声称：“艾米莉是骑士，塞缪尔是骑士。”约瑟夫表示塞缪尔是骑士或者艾米莉是无赖。塞缪尔被听到说：“詹姆斯是无赖。”索菲娅被听到说：“奥利维亚是无赖，艾米莉是无赖。”伊森说，如果且仅如果塞缪尔是无赖，艾米莉就是无赖。艾米莉表示约瑟夫是无赖，塞缪尔是骑士。根据杰克逊的说法：“如果杰克逊是骑士，那么约瑟夫就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是无赖  \n(2) 詹姆斯是无赖  \n(3) 约瑟夫是骑士  \n(4) 塞缪尔是骑士  \n(5) 索菲娅是骑士  \n(6) 伊森是无赖  \n(7) 艾米莉是无赖  \n(8) 杰克逊是骑士"
    }
]