[
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ईथन, अबिगेल, डेविड, और नूह। ईथन ने कहा: \"डेविड एक धूर्त है या अबिगेल एक धूर्त है\"। अबिगेल को यह कहते हुए सुना गया, \"अगर अबिगेल एक शूरवीर है तो डेविड एक शूरवीर है\"। \"नूह एक शूरवीर है और ईथन एक धूर्त है\" - डेविड। नूह ने कहा, \"अबिगेल एक धूर्त है यदि और केवल यदि ईथन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक धूर्त है  \n(2) अबिगेल एक शूरवीर है  \n(3) डेविड एक शूरवीर है  \n(4) नूह एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एलिज़ाबेथ, सोफिया, मेसन, और अबिगेल। एलिज़ाबेथ ने कहा, \"अबिगेल एक धूर्त है और मेसन एक धूर्त है\"। सोफिया के शब्दों में: \"अगर अबिगेल एक धूर्त है तो अबिगेल एक शूरवीर है\"। \"मेसेन एक शूरवीर है और अबिगेल एक शूरवीर है,\" मेसन ने घोषणा की। \"मेसेन एक शूरवीर है और अबिगेल एक शूरवीर है,\" अबिगेल ने उल्लेख किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक शूरवीर है  \n(2) सोफिया एक धूर्त है  \n(3) मेसन एक धूर्त है  \n(4) अबिगेल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: लुकास, हार्पर, अमेलिया, और एमिली। जैसा कि लुकास ने कहा, \"लुकास एक शूरवीर है या हार्पर एक शूरवीर है\"। \"लुकास एक शूरवीर है या लुकास एक धूर्त है,\" हार्पर ने घोषित किया। अमेलिया ने asserted किया: \"लुकास एक शूरवीर है और हार्पर एक धूर्त है\"। एमिली के एक बयान में: \"अगर हार्पर एक धूर्त है तो अमेलिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक शूरवीर है  \n(2) हार्पर एक शूरवीर है  \n(3) अमेलिया एक धूर्त है  \n(4) एमिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: यूसुफ, सोफिया, विलियम, और क्लोई। \"अगर यूसुफ एक शूरवीर है तो विलियम एक शूरवीर है,\" यूसुफ ने दावा किया। सोफिया के शब्दों में: \"यूसुफ एक शूरवीर है या क्लोई एक शूरवीर है\"। विलियम के एक बयान में: \"यूसुफ एक धूर्त नहीं है\"। क्लोई को यह कहते हुए सुना गया, \"विलियम एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) यूसुफ एक शूरवीर है  \n(2) सोफिया एक शूरवीर है  \n(3) विलियम एक शूरवीर है  \n(4) क्लोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: स्कारलेट, हार्पर, हेनरी, और अलेक्जेंडर। स्कारलेट के अनुसार, \"अलेक्जेंडर एक धूर्त है यदि और केवल यदि अलेक्जेंडर एक शूरवीर है\"। हार्पर को यह कहते हुए सुना गया, \"यदि स्कारलेट एक शूरवीर है तो हार्पर एक शूरवीर है\"। हेनरी ने टिप्पणी की, \"हार्पर एक शूरवीर है या अलेक्जेंडर एक धूर्त है\"। \"हेनरी एक धूर्त नहीं है,\" अलेक्जेंडर ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) स्कारलेट एक धूर्त है  \n(2) हार्पर एक शूरवीर है  \n(3) हेनरी एक शूरवीर है  \n(4) अलेक्जेंडर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: राइली, ओवेन, ओलिवर, और अमेलिया। राइली ने कहा कि अमेलिया एक धूर्त नहीं है। ओवेन ने आपको बताया कि ओलिवर एक धूर्त है या अमेलिया एक धूर्त है। जैसे ओलिवर ने कहा, \"राइली एक शूरवीर है और अमेलिया एक धूर्त है\"। अमेलिया ने कहा कि ओलिवर एक शूरवीर है और अमेलिया एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक धूर्त है  \n(2) ओवेन एक शूरवीर है  \n(3) ओलिवर एक धूर्त है  \n(4) अमेलिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एमिली, एलिज़ाबेथ, यूसुफ, और लियम। एमिली ने कहा, \"लियम धूर्त नहीं है।\" एलिज़ाबेथ ने टिप्पणी की, \"अगर एमिली धूर्त है तो यूसुफ शूरवीर है।\" यूसुफ ने कहा, \"अगर लियम धूर्त है तो एलिज़ाबेथ धूर्त है।\" लियम ने asserted किया: \"यूसुफ शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक शूरवीर है  \n(2) एलिज़ाबेथ एक शूरवीर है  \n(3) यूसुफ एक शूरवीर है  \n(4) लियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: हार्पर, अबिगेल, एवा, और ईथन। हार्पर के शब्दों में: \"अगर एवा एक धूर्त है तो अबिगेल एक शूरवीर है\"। अबिगेल ने कहा, \"एवा एक धूर्त है\"। एवा ने आपको बताया कि अगर एवा एक शूरवीर है तो हार्पर एक शूरवीर है। ईथन को यह कहते हुए सुना गया, \"एवा एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक शूरवीर है  \n(2) अबिगेल एक धूर्त है  \n(3) एवा एक शूरवीर है  \n(4) ईथन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ऐडन, मेसन, ज़ोई, और अलेक्जेंडर। ऐडन ने कहा, \"अलेक्जेंडर शूरवीर नहीं है\"। मेसन ने कहा, \"ऐडन शूरवीर है या अलेक्जेंडर शूरवीर है\"। ज़ोई ने कहा, \"ऐडन शूरवीर है या मेसन शूरवीर है\"। अलेक्जेंडर ने कहा कि ज़ोई धूर्त है या ज़ोई शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक धूर्त है  \n(2) मेसन एक शूरवीर है  \n(3) ज़ोई एक शूरवीर है  \n(4) अलेक्जेंडर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: जैक्सन, विक्टोरिया, यूसुफ, और ईथन। जैक्सन ने कहा, \"ईथन एक शूरवीर है\"। विक्टोरिया ने कहा कि ईथन एक धूर्त है और जैक्सन एक धूर्त है। यूसुफ ने टिप्पणी की, \"जैक्सन एक धूर्त है यदि और केवल यदि ईथन एक धूर्त है\"। ईथन ने टिप्पणी की, \"विक्टोरिया एक शूरवीर है या यूसुफ एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक शूरवीर है  \n(2) विक्टोरिया एक धूर्त है  \n(3) यूसुफ एक शूरवीर है  \n(4) ईथन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: लिली, लियम, पेनलोप, और शार्लट। \"लियम एक धूर्त है और लियम एक शूरवीर है,\" लिली ने घोषित किया। लियम ने कहा कि अगर लियम एक शूरवीर है तो शार्लट एक धूर्त है। पेनलोप के अनुसार, \"लियम एक धूर्त है\"। शार्लट ने कहा, \"लियम एक धूर्त है या शार्लट एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लिली एक धूर्त है  \n(2) लियम एक शूरवीर है  \n(3) पेनलोप एक धूर्त है  \n(4) शार्लट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: सेबेस्टियन, सैमुएल, राइली, और लोगन। जैसे सेबेस्टियन ने कहा, \"सैमुएल एक शूरवीर है और लोगन एक धूर्त है\"। सैमुएल के एक बयान में: \"सेबेस्टियन एक शूरवीर है यदि और केवल यदि सैमुएल एक शूरवीर है\"। राइली ने कहा: \"यदि लोगन एक शूरवीर है तो राइली एक शूरवीर है\"। लोगन ने कहा: \"राइली एक धूर्त है या सेबेस्टियन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सेबेस्टियन एक शूरवीर है  \n(2) सैमुएल एक शूरवीर है  \n(3) राइली एक शूरवीर है  \n(4) लोगन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: यूसुफ, हार्पर, याकूब, और लिली। यूसुफ ने कहा, \"लिली एक धूर्त है।\" हार्पर को यह कहते हुए सुना गया, \"लिली एक धूर्त है।\" \"लिली एक धूर्त है और याकूब एक शूरवीर है\" - याकूब। लिली ने कहा, \"हार्पर एक शूरवीर है या याकूब एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) यूसुफ एक धूर्त है  \n(2) हार्पर एक धूर्त है  \n(3) याकूब एक धूर्त है  \n(4) लिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: जेम्स, एवा, लोगन, और अलेक्जेंडर। जेम्स ने कहा कि अलेक्जेंडर एक शूरवीर है यदि और केवल यदि एवा एक धूर्त है। एवा को यह कहते हुए सुना गया, \"लोगन एक शूरवीर है यदि और केवल यदि अलेक्जेंडर एक शूरवीर है\"। लोगन ने आपको बताया कि लोगन एक शूरवीर है यदि और केवल यदि जेम्स एक धूर्त है। अलेक्जेंडर ने कहा, \"यदि लोगन एक धूर्त है तो अलेक्जेंडर एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक धूर्त है  \n(2) एवा एक शूरवीर है  \n(3) लोगन एक शूरवीर है  \n(4) अलेक्जेंडर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ओवेन, मैथ्यू, एवलिन, और विलियम। \"मैथ्यू एक शूरवीर है,\" ओवेन ने घोषणा की। मैथ्यू ने कहा कि विलियम एक धूर्त है और एवलिन एक धूर्त है। एवलिन ने कहा कि अगर एवलिन एक शूरवीर है तो ओवेन एक धूर्त है। विलियम ने कहा: \"मैथ्यू एक शूरवीर है यदि और केवल यदि एवलिन एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओवेन एक धूर्त है  \n(2) मैथ्यू एक धूर्त है  \n(3) एवलिन एक शूरवीर है  \n(4) विलियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एला, शार्लट, ज़ोई, और सैमुएल। एला के शब्दों में: \"ज़ोई एक शूरवीर है और सैमुएल एक शूरवीर है\"। शार्लट ने कहा: \"एला एक धूर्त है या ज़ोई एक शूरवीर है\"। ज़ोई को यह कहते हुए सुना गया, \"अगर शार्लट एक धूर्त है तो एला एक शूरवीर है\"। सैमुएल ने कहा कि ज़ोई एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक धूर्त है  \n(2) शार्लट एक शूरवीर है  \n(3) ज़ोई एक शूरवीर है  \n(4) सैमुएल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एलिज़ाबेथ, क्लोई, बेंजामिन, और लियम। एलिज़ाबेथ ने टिप्पणी की, \"क्लोई एक धूर्त है और बेंजामिन एक शूरवीर है\"। क्लोई ने कहा, \"एलिज़ाबेथ एक शूरवीर है यदि और केवल यदि लियम एक धूर्त है\"। बेंजामिन के शब्दों में: \"लियम एक धूर्त है या क्लोई एक धूर्त है\"। लियम के शब्दों में: \"लियम एक शूरवीर है और बेंजामिन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक धूर्त है  \n(2) क्लोई एक शूरवीर है  \n(3) बेंजामिन एक धूर्त है  \n(4) लियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: डैनियल, लुकास, क्लोई, और अलेक्जेंडर। \"अलेक्जेंडर एक शूरवीर है\" - डैनियल। लुकास ने कहा, \"अलेक्जेंडर एक शूरवीर है\"। \"डैनियल एक शूरवीर है और अलेक्जेंडर एक धूर्त है\" - क्लोई। अलेक्जेंडर ने आपको बताया कि क्लोई एक शूरवीर है और अलेक्जेंडर एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक धूर्त है  \n(2) लुकास एक धूर्त है  \n(3) क्लोई एक धूर्त है  \n(4) अलेक्जेंडर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: पेनलोप, मैथ्यू, बेंजामिन, और सेबेस्टियन। \"अगर सेबेस्टियन एक धूर्त है तो पेनलोप एक शूरवीर है,\" पेनलोप ने घोषणा की। मैथ्यू ने कहा, \"अगर मैथ्यू एक शूरवीर है तो बेंजामिन एक धूर्त है।\" बेंजामिन ने टिप्पणी की, \"पेनलोप एक धूर्त है यदि और केवल यदि सेबेस्टियन एक शूरवीर है।\" सेबेस्टियन ने कहा, \"पेनलोप एक शूरवीर है या मैथ्यू एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक शूरवीर है  \n(2) मैथ्यू एक शूरवीर है  \n(3) बेंजामिन एक धूर्त है  \n(4) सेबेस्टियन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: जेम्स, ईथन, सैमुएल, और एमिली। \"एमिली शूरवीर नहीं है\" - जेम्स। ईथन ने कहा कि एमिली एक धूर्त है। सैमुएल ने कहा, \"ईथन एक शूरवीर है और एमिली एक शूरवीर है\"। एमिली को यह कहते हुए सुना गया, \"सैमुएल एक शूरवीर है या सैमुएल एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक धूर्त है  \n(2) ईथन एक धूर्त है  \n(3) सैमुएल एक धूर्त है  \n(4) एमिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: डेविड, मेसन, सैमुएल, और डैनियल। \"अगर मेसन एक शूरवीर है तो सैमुएल एक धूर्त है,\" डेविड ने घोषणा की। \"मेसन एक शूरवीर है यदि और केवल यदि डेविड एक धूर्त है,\" मेसन ने घोषणा की। सैमुएल ने टिप्पणी की, \"डैनियल एक शूरवीर है या डेविड एक धूर्त है।\" डैनियल ने व्यक्त किया कि डेविड एक शूरवीर है और सैमुएल एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक धूर्त है  \n(2) मेसन एक शूरवीर है  \n(3) सैमुएल एक शूरवीर है  \n(4) डैनियल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एमिली, अबिगेल, हार्पर, और जेम्स। एमिली को यह कहते हुए सुना गया, \"अगर जेम्स एक शूरवीर है तो जेम्स एक धूर्त है।\" अबिगेल ने टिप्पणी की, \"जेम्स एक धूर्त है।\" हार्पर ने कहा, \"एमिली एक धूर्त है यदि और केवल यदि हार्पर एक शूरवीर है।\" \"अगर हार्पर एक शूरवीर है तो अबिगेल एक शूरवीर है\" - जेम्स। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक धूर्त है  \n(2) अबिगेल एक धूर्त है  \n(3) हार्पर एक धूर्त है  \n(4) जेम्स एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: लुकास, सोफिया, सोफिया, और माइकल। लुकास ने कहा, \"अगर सोफिया एक शूरवीर है तो सोफिया एक धूर्त है।\" सोफिया ने asserted किया: \"लुकास एक शूरवीर है और सोफिया एक शूरवीर है।\" \"अगर सोफिया एक धूर्त है तो माइकल एक धूर्त है,\" सोफिया ने दावा किया। माइकल ने कहा, \"अगर सोफिया एक धूर्त है तो सोफिया एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक शूरवीर है  \n(2) सोफिया एक धूर्त है  \n(3) सोफिया एक धूर्त है  \n(4) माइकल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: मिया, एवलिन, सोफिया, और शार्लट। मिया ने कहा, \"सोफिया एक धूर्त है या शार्लट एक धूर्त है\"। एवलिन ने टिप्पणी की, \"मिया एक धूर्त है या मिया एक शूरवीर है\"। सोफिया के एक बयान में: \"यदि एवलिन एक शूरवीर है तो शार्लट एक धूर्त है\"। शार्लट ने कहा, \"मिया एक शूरवीर नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक शूरवीर है  \n(2) एवलिन एक शूरवीर है  \n(3) सोफिया एक शूरवीर है  \n(4) शार्लट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ग्रेस, नूह, ओलिवर, और शार्लट। ग्रेस ने कहा: \"ओलिवर एक धूर्त है और शार्लट एक शूरवीर है\"। नूह ने टिप्पणी की, \"ओलिवर एक शूरवीर है\"। ओलिवर ने आपको बताया कि शार्लट एक धूर्त है यदि और केवल यदि शार्लट एक शूरवीर है। शार्लट ने कहा, \"ओलिवर एक धूर्त है या ग्रेस एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक शूरवीर है  \n(2) नूह एक धूर्त है  \n(3) ओलिवर एक धूर्त है  \n(4) शार्लट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: जेम्स, एवरी, एलिज़ाबेथ, और सेबेस्टियन। जेम्स ने टिप्पणी की, \"सेबेस्टियन एक धूर्त नहीं है\"। \"जेम्स एक शूरवीर है या एलिज़ाबेथ एक शूरवीर है\" - एवरी। एलिज़ाबेथ ने कहा, \"एलिज़ाबेथ एक शूरवीर है।\" सेबेस्टियन को यह कहते हुए सुना गया, \"अगर एलिज़ाबेथ एक शूरवीर है तो जेम्स एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) एवरी एक शूरवीर है  \n(3) एलिज़ाबेथ एक धूर्त है  \n(4) सेबेस्टियन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ग्रेस, ईथन, हार्पर, और लियम। ग्रेस के एक बयान में: \"ईथन एक धूर्त है या लियम एक धूर्त है\"। ईथन के अनुसार, \"ग्रेस एक धूर्त नहीं है\"। हार्पर के अनुसार, \"अगर ग्रेस एक धूर्त है तो हार्पर एक शूरवीर है\"। लियम के अनुसार, \"लियम एक शूरवीर है और हार्पर एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक शूरवीर है  \n(2) ईथन एक शूरवीर है  \n(3) हार्पर एक शूरवीर है  \n(4) लियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एवलिन, आरिया, एलिज़ाबेथ, और एमिली। एवलिन के अनुसार, \"एलिज़ाबेथ एक शूरवीर नहीं है।\" \"एमिली एक शूरवीर नहीं है,\" आरिया ने दावा किया। \"आरिया एक धूर्त है और आरिया एक शूरवीर है,\" एलिज़ाबेथ ने घोषणा की। \"एलिज़ाबेथ एक धूर्त है,\" एमिली ने घोषणा की। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एवलिन एक शूरवीर है  \n(2) आरिया एक धूर्त है  \n(3) एलिज़ाबेथ एक धूर्त है  \n(4) एमिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: बेंजामिन, एवा, नूह, और स्कारलेट। बेंजामिन के शब्दों में: \"स्कारलेट एक धूर्त है\"। एवा ने कहा, \"स्कारलेट एक धूर्त है और बेंजामिन एक शूरवीर है\"। नूह ने कहा कि नूह एक शूरवीर है यदि और केवल यदि स्कारलेट एक शूरवीर है। स्कारलेट ने टिप्पणी की, \"नूह एक धूर्त है या एवा एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक धूर्त है  \n(2) एवा एक धूर्त है  \n(3) नूह एक धूर्त है  \n(4) स्कारलेट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: मेसन, इसाबेला, एमिली, और विक्टोरिया। मेसन ने आपको बताया कि इसाबेला एक शूरवीर नहीं है। इसाबेला के एक बयान में: \"अगर विक्टोरिया एक धूर्त है तो विक्टोरिया एक शूरवीर है\"। एमिली ने कहा, \"मेसन एक धूर्त नहीं है\"। विक्टोरिया ने कहा, \"इसाबेला एक धूर्त है या एमिली एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) इसाबेला एक शूरवीर है  \n(3) एमिली एक धूर्त है  \n(4) विक्टोरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एला, लियम, राइली, और लिली। \"लियम एक धूर्त है,\" एला ने घोषणा की। लियम ने आपको बताया कि एला एक शूरवीर है और राइली एक धूर्त है। राइली के अनुसार, \"लियम एक शूरवीर है या एला एक शूरवीर है\"। लिली के अनुसार, \"एला एक शूरवीर है यदि और केवल यदि लियम एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक शूरवीर है  \n(2) लियम एक धूर्त है  \n(3) राइली एक शूरवीर है  \n(4) लिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: बेंजामिन, नूह, इसाबेला, और सोफिया। बेंजामिन ने कहा, \"अगर सोफिया एक शूरवीर है तो इसाबेला एक शूरवीर है।\" नूह को यह कहते हुए सुना गया, \"सोफिया एक धूर्त नहीं है।\" \"बेंजामिन एक धूर्त है,\" इसाबेला ने कहा। \"इसाबेला एक शूरवीर है,\" सोफिया ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक शूरवीर है  \n(2) नूह एक धूर्त है  \n(3) इसाबेला एक धूर्त है  \n(4) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: माइकल, राइली, मैथ्यू, और मिया। \"अगर राइली एक शूरवीर है तो माइकल एक शूरवीर है,\" माइकल ने घोषणा की। राइली के शब्दों में: \"मैथ्यू एक शूरवीर है और राइली एक शूरवीर है\"। \"अगर राइली एक शूरवीर है तो राइली एक धूर्त है,\" मैथ्यू ने दावा किया। मिया को यह कहते हुए सुना गया, \"मैथ्यू एक शूरवीर है या मिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक शूरवीर है  \n(2) राइली एक धूर्त है  \n(3) मैथ्यू एक शूरवीर है  \n(4) मिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: जेम्स, ल्यूक, औरोरा, और स्कारलेट। जेम्स ने टिप्पणी की, \"ल्यूक एक धूर्त है और औरोरा एक धूर्त है\"। ल्यूक ने कहा, \"जेम्स एक धूर्त नहीं है\"। औरोरा ने आपको बताया कि जेम्स एक धूर्त है यदि और केवल यदि ल्यूक एक धूर्त है। स्कारलेट ने आपको बताया कि ल्यूक एक धूर्त है या स्कारलेट एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक धूर्त है  \n(2) ल्यूक एक धूर्त है  \n(3) औरोरा एक शूरवीर है  \n(4) स्कारलेट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ऐडन, मिया, एलिज़ाबेथ, और सेबेस्टियन। \"मिया एक शूरवीर है\" - ऐडन। \"ऐडन एक शूरवीर है या सेबेस्टियन एक धूर्त है,\" मिया ने दावा किया। एलिज़ाबेथ को यह कहते हुए सुना गया, \"ऐडन एक शूरवीर है यदि और केवल यदि मिया एक शूरवीर है\"। सेबेस्टियन को यह कहते हुए सुना गया, \"मिया एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ऐडन एक शूरवीर है  \n(2) मिया एक शूरवीर है  \n(3) एलिज़ाबेथ एक शूरवीर है  \n(4) सेबेस्टियन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: याकूब, लियम, एमिली, और सोफिया। याकूब ने कहा: \"सोफिया एक धूर्त है या लियम एक शूरवीर है।\" लियम ने कहा, \"एमिली एक शूरवीर है या याकूब एक शूरवीर है।\" एमिली ने कहा, \"सोफिया एक शूरवीर है या सोफिया एक धूर्त है।\" \"एमिली एक शूरवीर है या एमिली एक धूर्त है,\" सोफिया ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) याकूब एक शूरवीर है  \n(2) लियम एक शूरवीर है  \n(3) एमिली एक शूरवीर है  \n(4) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: लोगन, एला, इसाबेला, और ओवेन। लोगन ने कहा, \"ओवेन एक धूर्त है और इसाबेला एक शूरवीर है\"। एला ने कहा, \"इसाबेला एक धूर्त है\"। इसाबेला को यह कहते हुए सुना गया, \"लोगन एक धूर्त है या एला एक शूरवीर है\"। ओवेन ने कहा, \"ओवेन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक धूर्त है  \n(2) एला एक धूर्त है  \n(3) इसाबेला एक शूरवीर है  \n(4) ओवेन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: लुकास, ओलिविया, आरिया, और शार्लट। लुकास ने कहा: \"ओलिविया एक शूरवीर है यदि और केवल यदि आरिया एक धूर्त है\"। ओलिविया के शब्दों में: \"शार्लट एक शूरवीर है यदि और केवल यदि आरिया एक शूरवीर है\"। \"लुकास एक धूर्त है और ओलिविया एक धूर्त है,\" आरिया ने दावा किया। शार्लट ने कहा, \"ओलिविया एक धूर्त है या लुकास एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक शूरवीर है  \n(2) ओलिविया एक शूरवीर है  \n(3) आरिया एक धूर्त है  \n(4) शार्लट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: मेसन, औरोरा, पेनलोप, और लुकास। मेसन को यह कहते हुए सुना गया, \"लुकास एक शूरवीर है\"। औरोरा ने कहा कि अगर पेनलोप एक शूरवीर है तो पेनलोप एक धूर्त है। पेनलोप ने कहा, \"मेसन एक धूर्त है या लुकास एक शूरवीर है\"। लुकास ने कहा, \"पेनलोप एक शूरवीर है और औरोरा एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) औरोरा एक धूर्त है  \n(3) पेनलोप एक शूरवीर है  \n(4) लुकास एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: जेम्स, मैथ्यू, सोफिया, और एवलिन। जेम्स के एक बयान में: \"मैथ्यू एक धूर्त है या एवलिन एक धूर्त है\"। मैथ्यू ने कहा कि सोफिया एक धूर्त नहीं है। सोफिया ने कहा: \"एवलिन एक धूर्त नहीं है\"। एवलिन के एक बयान में: \"सोफिया एक शूरवीर है यदि और केवल यदि जेम्स एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) मैथ्यू एक धूर्त है  \n(3) सोफिया एक धूर्त है  \n(4) एवलिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: जैक, क्लोई, विलियम, और ल्यूक। जैक ने कहा, \"ल्यूक एक शूरवीर है\"। क्लोई ने कहा, \"जैक एक धूर्त है या विलियम एक शूरवीर है\"। विलियम ने टिप्पणी की, \"अगर ल्यूक एक शूरवीर है तो जैक एक शूरवीर है\"। ल्यूक ने कहा, \"जैक एक शूरवीर है और जैक एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक एक धूर्त है  \n(2) क्लोई एक शूरवीर है  \n(3) विलियम एक शूरवीर है  \n(4) ल्यूक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: नूह, सोफिया, एलिज़ाबेथ, और एला। नूह ने कहा कि सोफिया एक शूरवीर है। सोफिया ने कहा, \"नूह एक धूर्त है या एलिज़ाबेथ एक शूरवीर है।\" \"अगर एला एक धूर्त है तो सोफिया एक धूर्त है\" - एलिज़ाबेथ। एला को यह कहते हुए सुना गया, \"एला एक शूरवीर है और एलिज़ाबेथ एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक शूरवीर है  \n(2) सोफिया एक शूरवीर है  \n(3) एलिज़ाबेथ एक शूरवीर है  \n(4) एला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: जेम्स, सैमुएल, हेनरी, और ल्यूक। जेम्स ने टिप्पणी की, \"हेनरी एक शूरवीर है\"। सैमुएल ने कहा कि ल्यूक एक धूर्त है। हेनरी ने आपको बताया कि सैमुएल एक शूरवीर है और ल्यूक एक शूरवीर है। जैसे ल्यूक ने कहा, \"जेम्स एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) जेम्स एक धूर्त है  \n(2) सैमुएल एक शूरवीर है  \n(3) हेनरी एक धूर्त है  \n(4) ल्यूक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एमिली, लोगन, स्कारलेट, और मेसन। एमिली ने कहा, \"लोगन एक धूर्त नहीं है\"। लोगन को यह कहते हुए सुना गया, \"एमिली एक शूरवीर है या मेसन एक शूरवीर है\"। स्कारलेट को यह कहते हुए सुना गया, \"एमिली एक शूरवीर है यदि और केवल यदि मेसन एक शूरवीर है\"। मेसन ने कहा, \"स्कारलेट एक शूरवीर है या लोगन एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक शूरवीर है  \n(2) लोगन एक शूरवीर है  \n(3) स्कारलेट एक शूरवीर है  \n(4) मेसन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: विक्टोरिया, स्कारलेट, एवलिन, और लुकास। \"लुकास एक शूरवीर है और स्कारलेट एक धूर्त है,\" विक्टोरिया ने घोषणा की। स्कारलेट ने टिप्पणी की, \"स्कारलेट एक शूरवीर है और एवलिन एक धूर्त है\"। जैसे एवलिन ने कहा, \"विक्टोरिया एक शूरवीर है\"। लुकास के अनुसार, \"अगर लुकास एक शूरवीर है तो एवलिन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विक्टोरिया एक शूरवीर है  \n(2) स्कारलेट एक धूर्त है  \n(3) एवलिन एक शूरवीर है  \n(4) लुकास एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ओवेन, माइकल, अलेक्जेंडर, और लोगन। \"माइकल एक धूर्त नहीं है,\" ओवेन ने घोषणा की। माइकल को यह कहते हुए सुना गया, \"ओवेन एक शूरवीर है और ओवेन एक धूर्त है\"। अलेक्जेंडर ने कहा, \"माइकल एक धूर्त है या ओवेन एक शूरवीर है\"। जैसे लोगन ने कहा, \"माइकल एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओवेन एक धूर्त है  \n(2) माइकल एक धूर्त है  \n(3) अलेक्जेंडर एक शूरवीर है  \n(4) लोगन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: डैनियल, डेविड, बेंजामिन, और लिली। डैनियल के अनुसार, \"अगर बेंजामिन धूर्त है तो लिली शूरवीर है।\" \"डेविड शूरवीर है या लिली धूर्त है,\" डेविड ने दावा किया। बेंजामिन ने कहा, \"डैनियल शूरवीर नहीं है।\" लिली ने आपको बताया कि डेविड धूर्त नहीं है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक शूरवीर है  \n(2) डेविड एक शूरवीर है  \n(3) बेंजामिन एक धूर्त है  \n(4) लिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: विक्टोरिया, बेंजामिन, सेबेस्टियन, और सोफिया। विक्टोरिया ने कहा, \"सेबेस्टियन एक शूरवीर है यदि और केवल यदि सेबेस्टियन एक धूर्त है\"। बेंजामिन ने कहा कि सोफिया एक शूरवीर है और सोफिया एक धूर्त है। जैसे सेबेस्टियन ने कहा, \"यदि बेंजामिन एक धूर्त है तो विक्टोरिया एक शूरवीर है\"। सोफिया को यह कहते हुए सुना गया, \"बेंजामिन एक शूरवीर है या विक्टोरिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विक्टोरिया एक धूर्त है  \n(2) बेंजामिन एक धूर्त है  \n(3) सेबेस्टियन एक धूर्त है  \n(4) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: डेविड, ज़ोई, लियम, और विलियम। डेविड ने कहा कि विलियम एक धूर्त है यदि और केवल यदि लियम एक धूर्त है। ज़ोई ने कहा, \"विलियम एक धूर्त है और डेविड एक शूरवीर है\"। लियम ने आपको बताया कि विलियम एक शूरवीर है यदि और केवल यदि विलियम एक धूर्त है। विलियम ने आपको बताया कि लियम एक धूर्त है यदि और केवल यदि लियम एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक शूरवीर है  \n(2) ज़ोई एक शूरवीर है  \n(3) लियम एक धूर्त है  \n(4) विलियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ऐडन, स्कारलेट, माइकल, और मिया। \"अगर मिया एक शूरवीर है तो मिया एक धूर्त है\" - ऐडन। स्कारलेट ने टिप्पणी की, \"मिया एक शूरवीर है या स्कारलेट एक शूरवीर है\"। \"ऐडन एक शूरवीर है या स्कारलेट एक शूरवीर है\" - माइकल। \"माइकल एक धूर्त नहीं है\" - मिया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक धूर्त है  \n(2) स्कारलेट एक शूरवीर है  \n(3) माइकल एक शूरवीर है  \n(4) मिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: बेंजामिन, हार्पर, ल्यूक, और ओवेन। बेंजामिन ने टिप्पणी की, \"बेंजामिन एक शूरवीर है यदि और केवल यदि ल्यूक एक धूर्त है।\" हार्पर ने कहा, \"ओवेन एक धूर्त नहीं है।\" \"बेंजामिन एक धूर्त है और ओवेन एक शूरवीर है,\" ल्यूक ने घोषित किया। \"बेंजामिन एक शूरवीर नहीं है,\" ओवेन ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक शूरवीर है  \n(2) हार्पर एक धूर्त है  \n(3) ल्यूक एक धूर्त है  \n(4) ओवेन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एवा, डैनियल, हेनरी, और डेविड। एवा ने कहा कि हेनरी एक धूर्त है यदि और केवल यदि हेनरी एक शूरवीर है। डैनियल ने कहा कि एवा एक शूरवीर है या एवा एक धूर्त है। \"यदि डेविड एक धूर्त है तो डैनियल एक शूरवीर है,\" हेनरी ने कहा। डेविड ने टिप्पणी की, \"हेनरी एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक धूर्त है  \n(2) डैनियल एक शूरवीर है  \n(3) हेनरी एक शूरवीर है  \n(4) डेविड एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: सेबेस्टियन, लोगन, एवरी, और डैनियल। सेबेस्टियन ने आपको बताया कि सेबेस्टियन एक शूरवीर है। लोगन को यह कहते हुए सुना गया, \"एवरी एक धूर्त है यदि और केवल यदि सेबेस्टियन एक धूर्त है\"। एवरी ने कहा, \"यदि लोगन एक धूर्त है तो सेबेस्टियन एक शूरवीर है\"। डैनियल ने कहा कि सेबेस्टियन एक धूर्त है और डैनियल एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सेबेस्टियन एक शूरवीर है  \n(2) लोगन एक शूरवीर है  \n(3) एवरी एक शूरवीर है  \n(4) डैनियल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: विलियम, एम्मा, ग्रेस, और आरिया। विलियम ने कहा, \"विलियम एक शूरवीर है और आरिया एक शूरवीर है\"। जैसे एम्मा ने कहा, \"ग्रेस एक धूर्त है\"। \"अगर विलियम एक धूर्त है तो आरिया एक शूरवीर है,\" ग्रेस ने कहा। आरिया को यह कहते हुए सुना गया, \"अगर ग्रेस एक शूरवीर है तो विलियम एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक धूर्त है  \n(2) एम्मा एक धूर्त है  \n(3) ग्रेस एक शूरवीर है  \n(4) आरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एला, ओलिवर, यूसुफ, और एवा। एला ने कहा कि एला एक शूरवीर है और ओलिवर एक धूर्त है। \"अगर ओलिवर एक शूरवीर है तो यूसुफ एक शूरवीर है,\" ओलिवर ने घोषणा की। यूसुफ को यह कहते हुए सुना गया, \"एला एक शूरवीर नहीं है\"। एवा ने आपको बताया कि एवा एक शूरवीर है या एला एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक धूर्त है  \n(2) ओलिवर एक शूरवीर है  \n(3) यूसुफ एक शूरवीर है  \n(4) एवा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ग्रेस, डेविड, आरिया, और मिया। ग्रेस को यह कहते हुए सुना गया, \"अगर मिया एक धूर्त है तो आरिया एक शूरवीर है\"। डेविड ने आपको बताया कि अगर डेविड एक शूरवीर है तो ग्रेस एक धूर्त है। आरिया ने asserted किया: \"मिया एक शूरवीर है यदि और केवल यदि डेविड एक शूरवीर है\"। जैसे मिया ने कहा, \"डेविड एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक धूर्त है  \n(2) डेविड एक शूरवीर है  \n(3) आरिया एक धूर्त है  \n(4) मिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ओलिवर, पेनलोप, विक्टोरिया, और सैमुएल। ओलिवर ने कहा कि अगर पेनलोप एक शूरवीर है तो सैमुएल एक धूर्त है। पेनलोप को यह कहते हुए सुना गया, \"सैमुएल एक धूर्त है या पेनलोप एक शूरवीर है\"। विक्टोरिया ने टिप्पणी की, \"पेनलोप एक धूर्त है\"। सैमुएल ने कहा कि विक्टोरिया एक धूर्त है और पेनलोप एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिवर एक शूरवीर है  \n(2) पेनलोप एक शूरवीर है  \n(3) विक्टोरिया एक धूर्त है  \n(4) सैमुएल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: विक्टोरिया, एवरी, अबिगेल, और मेसन। जैसे विक्टोरिया ने कहा, \"अबिगेल एक शूरवीर है\"। एवरी ने कहा: \"मेसन एक धूर्त है या अबिगेल एक शूरवीर है\"। अबिगेल के एक बयान में: \"अबिगेल एक शूरवीर है या विक्टोरिया एक धूर्त है\"। जैसे मेसन ने कहा, \"विक्टोरिया एक धूर्त है और एवरी एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विक्टोरिया एक शूरवीर है  \n(2) एवरी एक शूरवीर है  \n(3) अबिगेल एक शूरवीर है  \n(4) मेसन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ईथन, अलेक्जेंडर, सोफिया, और ज़ोई। \"अलेक्जेंडर एक धूर्त है या सोफिया एक धूर्त है\" - ईथन। अलेक्जेंडर ने टिप्पणी की, \"अगर ज़ोई एक शूरवीर है तो अलेक्जेंडर एक शूरवीर है\"। सोफिया ने कहा कि ईथन एक धूर्त नहीं है। ज़ोई ने टिप्पणी की, \"ईथन एक धूर्त है या सोफिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक शूरवीर है  \n(2) अलेक्जेंडर एक धूर्त है  \n(3) सोफिया एक शूरवीर है  \n(4) ज़ोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: शार्लट, ओवेन, नूह, और राइली। शार्लट ने टिप्पणी की, \"नूह एक धूर्त है\"। ओवेन ने कहा, \"राइली एक शूरवीर है यदि और केवल यदि शार्लट एक शूरवीर है\"। नूह ने आपको बताया कि ओवेन एक शूरवीर है। राइली ने कहा, \"नूह एक धूर्त है या राइली एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) शार्लट एक धूर्त है  \n(2) ओवेन एक शूरवीर है  \n(3) नूह एक शूरवीर है  \n(4) राइली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: मिया, एवरी, ल्यूक, और नूह। मिया ने कहा कि एवरी एक शूरवीर है यदि और केवल यदि एवरी एक धूर्त है। जैसे एवरी ने कहा, \"ल्यूक एक शूरवीर है या ल्यूक एक धूर्त है\"। ल्यूक को यह कहते हुए सुना गया, \"मिया एक शूरवीर है यदि और केवल यदि एवरी एक धूर्त है\"। नूह ने कहा, \"यदि ल्यूक एक धूर्त है तो एवरी एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक धूर्त है  \n(2) एवरी एक शूरवीर है  \n(3) ल्यूक एक शूरवीर है  \n(4) नूह एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ओलिवर, ईथन, ग्रेस, और एवा। जैसे ओलिवर ने कहा, \"ईथन एक धूर्त है या ग्रेस एक शूरवीर है\"। ईथन ने कहा, \"ग्रेस एक धूर्त है और ग्रेस एक शूरवीर है\"। \"ग्रेस एक शूरवीर है और ईथन एक शूरवीर है\" - ग्रेस। जैसे एवा ने कहा, \"ग्रेस एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिवर एक शूरवीर है  \n(2) ईथन एक धूर्त है  \n(3) ग्रेस एक धूर्त है  \n(4) एवा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ओवेन, एम्मा, अलेक्जेंडर, और औरोरा। ओवेन ने कहा, \"एम्मा एक शूरवीर है या अलेक्जेंडर एक धूर्त है।\" \"अगर अलेक्जेंडर एक शूरवीर है तो ओवेन एक धूर्त है,\" एम्मा ने घोषणा की। अलेक्जेंडर ने आपको बताया कि औरोरा एक धूर्त नहीं है। औरोरा ने कहा कि एम्मा एक धूर्त है और अलेक्जेंडर एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओवेन एक शूरवीर है  \n(2) एम्मा एक शूरवीर है  \n(3) अलेक्जेंडर एक धूर्त है  \n(4) औरोरा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: याकूब, मैथ्यू, एवरी, और जैक्सन। याकूब के एक बयान में: \"मैथ्यू एक धूर्त है\"। \"मैथ्यू एक शूरवीर है यदि और केवल यदि याकूब एक शूरवीर है,\" मैथ्यू ने उल्लेख किया। एवरी के अनुसार, \"याकूब एक शूरवीर है या याकूब एक धूर्त है\"। जैक्सन ने कहा कि याकूब एक धूर्त है और एवरी एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) याकूब एक शूरवीर है  \n(2) मैथ्यू एक धूर्त है  \n(3) एवरी एक शूरवीर है  \n(4) जैक्सन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: हेनरी, एवा, शार्लट, और नूह। हेनरी ने टिप्पणी की, \"एवा एक धूर्त है और हेनरी एक शूरवीर है\"। एवा के एक बयान में: \"नूह एक धूर्त नहीं है\"। शार्लट ने कहा, \"एवा एक धूर्त नहीं है।\" नूह ने कहा: \"हेनरी एक शूरवीर है या हेनरी एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हेनरी एक धूर्त है  \n(2) एवा एक शूरवीर है  \n(3) शार्लट एक शूरवीर है  \n(4) नूह एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: लोगन, ओलिविया, ऐडन, और एम्मा। जैसे लोगन ने कहा, \"ओलिविया एक धूर्त है और ऐडन एक धूर्त है\"। ओलिविया ने कहा: \"अगर लोगन एक धूर्त है तो लोगन एक शूरवीर है\"। ऐडन ने कहा: \"अगर लोगन एक धूर्त है तो ओलिविया एक धूर्त है\"। एम्मा ने कहा कि ओलिविया एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक धूर्त है  \n(2) ओलिविया एक धूर्त है  \n(3) ऐडन एक शूरवीर है  \n(4) एम्मा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: विलियम, हेनरी, पेनलोप, और एवा। \"अगर पेनलोप एक शूरवीर है तो पेनलोप एक धूर्त है,\" विलियम ने दावा किया। हेनरी ने कहा, \"विलियम एक शूरवीर नहीं है\"। पेनलोप ने कहा, \"एवा एक शूरवीर है\"। एवा ने कहा, \"विलियम एक शूरवीर है यदि और केवल यदि हेनरी एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) हेनरी एक धूर्त है  \n(3) पेनलोप एक धूर्त है  \n(4) एवा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: विक्टोरिया, लुकास, राइली, और क्लोई। विक्टोरिया ने टिप्पणी की, \"राइली शूरवीर नहीं है\"। लुकास ने asserted किया: \"अगर विक्टोरिया शूरवीर है तो राइली शूरवीर है\"। \"अगर विक्टोरिया धूर्त है तो क्लोई धूर्त है\" - राइली। क्लोई ने टिप्पणी की, \"लुकास शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विक्टोरिया एक धूर्त है  \n(2) लुकास एक शूरवीर है  \n(3) राइली एक शूरवीर है  \n(4) क्लोई एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एमिली, विलियम, माइकल, और मिया। एमिली के अनुसार, \"अगर मिया एक शूरवीर है तो विलियम एक धूर्त है।\" \"मिया एक शूरवीर नहीं है,\" विलियम ने घोषणा की। माइकल ने कहा, \"विलियम एक धूर्त है।\" \"अगर विलियम एक शूरवीर है तो माइकल एक धूर्त है,\" मिया ने उल्लेख किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक शूरवीर है  \n(2) विलियम एक धूर्त है  \n(3) माइकल एक शूरवीर है  \n(4) मिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: अलेक्जेंडर, सोफिया, मेसन, और यूसुफ। \"सोफिया शूरवीर नहीं है,\" अलेक्जेंडर ने घोषणा की। जैसे सोफिया ने कहा, \"मेसन धूर्त है\"। जैसे मेसन ने कहा, \"अगर सोफिया धूर्त है तो अलेक्जेंडर शूरवीर है\"। यूसुफ ने टिप्पणी की, \"अलेक्जेंडर शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अलेक्जेंडर एक शूरवीर है  \n(2) सोफिया एक धूर्त है  \n(3) मेसन एक शूरवीर है  \n(4) यूसुफ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: मिया, सोफिया, विक्टोरिया, और विलियम। मिया ने कहा, \"सोफिया एक शूरवीर है या सोफिया एक धूर्त है।\" सोफिया को यह कहते हुए सुना गया, \"अगर मिया एक शूरवीर है तो विक्टोरिया एक धूर्त है।\" विक्टोरिया ने कहा, \"सोफिया एक धूर्त है या मिया एक शूरवीर है।\" विलियम के अनुसार, \"विक्टोरिया एक धूर्त है और सोफिया एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक शूरवीर है  \n(2) सोफिया एक धूर्त है  \n(3) विक्टोरिया एक शूरवीर है  \n(4) विलियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: हार्पर, शार्लट, सोफिया, और लियम। हार्पर के अनुसार, \"शार्लट एक शूरवीर है\"। शार्लट ने कहा कि सोफिया एक शूरवीर है। \"सोफिया एक शूरवीर है और लियम एक शूरवीर है,\" सोफिया ने उल्लेख किया। लियम के एक बयान में: \"सोफिया एक शूरवीर है यदि और केवल यदि शार्लट एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) हार्पर एक धूर्त है  \n(2) शार्लट एक धूर्त है  \n(3) सोफिया एक धूर्त है  \n(4) लियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एवा, ओलिविया, मैथ्यू, और एला। एवा ने कहा, \"एवा एक शूरवीर है और मैथ्यू एक धूर्त है।\" ओलिविया ने कहा, \"एला एक शूरवीर है या एवा एक शूरवीर है।\" मैथ्यू के एक बयान में: \"ओलिविया एक धूर्त है यदि और केवल यदि मैथ्यू एक शूरवीर है।\" एला ने कहा, \"मैथ्यू एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक धूर्त है  \n(2) ओलिविया एक धूर्त है  \n(3) मैथ्यू एक धूर्त है  \n(4) एला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ओलिवर, एवरी, ज़ोई, और सेबेस्टियन। ओलिवर ने कहा, \"एवरी एक धूर्त नहीं है\"। एवरी ने कहा, \"ज़ोई एक धूर्त है और सेबेस्टियन एक धूर्त है।\" ज़ोई ने टिप्पणी की, \"सेबेस्टियन एक धूर्त नहीं है\"। सेबेस्टियन ने टिप्पणी की, \"एवरी एक शूरवीर है और एवरी एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिवर एक शूरवीर है  \n(2) एवरी एक शूरवीर है  \n(3) ज़ोई एक धूर्त है  \n(4) सेबेस्टियन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: लिली, एवा, हेनरी, और अमेलिया। लिली ने कहा कि एवा एक धूर्त है और लिली एक शूरवीर है। एवा को यह कहते हुए सुना गया, \"हेनरी एक धूर्त है यदि और केवल यदि एवा एक शूरवीर है\"। हेनरी ने आपको बताया कि हेनरी एक शूरवीर है या एवा एक धूर्त है। अमेलिया ने कहा: \"हेनरी एक धूर्त है यदि और केवल यदि लिली एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लिली एक धूर्त है  \n(2) एवा एक शूरवीर है  \n(3) हेनरी एक धूर्त है  \n(4) अमेलिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: मैथ्यू, हार्पर, लिली, और लोगन। \"लिली एक धूर्त है और हार्पर एक शूरवीर है,\" मैथ्यू ने घोषणा की। हार्पर के अनुसार, \"लिली एक धूर्त है या लिली एक शूरवीर है\"। लिली ने कहा: \"मैथ्यू एक शूरवीर है और लोगन एक शूरवीर है\"। लोगन के शब्दों में: \"हार्पर एक शूरवीर है और हार्पर एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक शूरवीर है  \n(2) हार्पर एक शूरवीर है  \n(3) लिली एक धूर्त है  \n(4) लोगन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: मेसन, लिली, लुकास, और हेनरी। मेसन को यह कहते हुए सुना गया, \"मेसन एक शूरवीर है और लुकास एक धूर्त है\"। \"अगर मेसन एक धूर्त है तो लुकास एक धूर्त है,\" लिली ने घोषणा की। लुकास को यह कहते हुए सुना गया, \"अगर हेनरी एक धूर्त है तो हेनरी एक शूरवीर है\"। हेनरी ने नोट किया, \"मेसन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) लिली एक शूरवीर है  \n(3) लुकास एक धूर्त है  \n(4) हेनरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: माइकल, सेबेस्टियन, एम्मा, और ओवेन। माइकल के एक बयान में: \"एम्मा एक धूर्त है यदि और केवल यदि ओवेन एक धूर्त है\"। सेबेस्टियन ने कहा, \"माइकल एक धूर्त है।\" एम्मा ने कहा कि माइकल एक शूरवीर नहीं है। \"माइकल एक धूर्त है यदि और केवल यदि ओवेन एक शूरवीर है\" - ओवेन। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक धूर्त है  \n(2) सेबेस्टियन एक शूरवीर है  \n(3) एम्मा एक शूरवीर है  \n(4) ओवेन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: शार्लट, मिया, विक्टोरिया, और याकूब। जैसे शार्लट ने कहा, \"मिया एक शूरवीर है या याकूब एक धूर्त है\"। मिया ने asserted किया: \"शार्लट एक शूरवीर नहीं है\"। \"याकूब एक शूरवीर है,\" विक्टोरिया ने दावा किया। याकूब के अनुसार, \"याकूब एक शूरवीर है और मिया एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) शार्लट एक शूरवीर है  \n(2) मिया एक धूर्त है  \n(3) विक्टोरिया एक धूर्त है  \n(4) याकूब एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: लुकास, क्लोई, राइली, और डेविड। \"राइली एक शूरवीर है यदि और केवल यदि क्लोई एक धूर्त है,\" लुकास ने घोषणा की। क्लोई ने टिप्पणी की, \"राइली एक शूरवीर है और लुकास एक धूर्त है।\" \"लुकास एक धूर्त है,\" राइली ने उल्लेख किया। डेविड के शब्दों में: \"राइली एक शूरवीर है और क्लोई एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक धूर्त है  \n(2) क्लोई एक शूरवीर है  \n(3) राइली एक शूरवीर है  \n(4) डेविड एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: मिया, विक्टोरिया, अमेलिया, और डैनियल। \"मिया एक शूरवीर है यदि और केवल यदि विक्टोरिया एक धूर्त है,\" मिया ने दावा किया। \"यदि डैनियल एक धूर्त है तो अमेलिया एक धूर्त है,\" विक्टोरिया ने उल्लेख किया। अमेलिया ने asserted: \"यदि मिया एक शूरवीर है तो विक्टोरिया एक शूरवीर है\"। \"डैनियल एक शूरवीर है और विक्टोरिया एक धूर्त है,\" डैनियल ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक धूर्त है  \n(2) विक्टोरिया एक धूर्त है  \n(3) अमेलिया एक शूरवीर है  \n(4) डैनियल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: बेंजामिन, लुकास, अलेक्जेंडर, और डैनियल। जैसा कि बेंजामिन ने कहा, \"अगर लुकास एक शूरवीर है तो डैनियल एक शूरवीर है\"। लुकास के शब्दों में: \"डैनियल एक धूर्त नहीं है\"। \"बेंजामिन एक शूरवीर है और लुकास एक धूर्त है\" - अलेक्जेंडर। डैनियल के एक बयान में: \"बेंजामिन एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक शूरवीर है  \n(2) लुकास एक शूरवीर है  \n(3) अलेक्जेंडर एक धूर्त है  \n(4) डैनियल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एवा, लियम, लोगन, और अमेलिया। एवा ने कहा कि लियम एक धूर्त है यदि और केवल यदि लोगन एक शूरवीर है। \"अमेलिया एक शूरवीर नहीं है,\" लियम ने दावा किया। \"यदि लियम एक शूरवीर है तो अमेलिया एक धूर्त है,\" लोगन ने दावा किया। \"लियम एक धूर्त है यदि और केवल यदि एवा एक शूरवीर है,\" अमेलिया ने उल्लेख किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक शूरवीर है  \n(2) लियम एक धूर्त है  \n(3) लोगन एक शूरवीर है  \n(4) अमेलिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: सोफिया, मिया, हार्पर, और एमिली। सोफिया के शब्दों में: \"हार्पर एक शूरवीर है और मिया एक शूरवीर है\"। \"अगर हार्पर एक शूरवीर है तो हार्पर एक धूर्त है,\" मिया ने कहा। हार्पर ने नोट किया, \"एमिली एक शूरवीर है यदि और केवल यदि मिया एक धूर्त है\"। \"अगर हार्पर एक शूरवीर है तो मिया एक शूरवीर है,\" एमिली ने घोषित किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) मिया एक शूरवीर है  \n(3) हार्पर एक धूर्त है  \n(4) एमिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: माइकल, जैक्सन, एलिज़ाबेथ, और डैनियल। \"एलिज़ाबेथ एक धूर्त है,\" माइकल ने दावा किया। जैक्सन ने कहा कि डैनियल एक धूर्त है यदि और केवल यदि माइकल एक शूरवीर है। \"माइकल एक शूरवीर है यदि और केवल यदि डैनियल एक शूरवीर है,\" एलिज़ाबेथ ने घोषणा की। \"जैक्सन एक धूर्त है या माइकल एक धूर्त है,\" डैनियल ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक शूरवीर है  \n(2) जैक्सन एक शूरवीर है  \n(3) एलिज़ाबेथ एक धूर्त है  \n(4) डैनियल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: राइली, अबिगेल, ओलिवर, और स्कारलेट। राइली ने कहा कि स्कारलेट एक धूर्त है और राइली एक शूरवीर है। जैसे अबिगेल ने कहा, \"राइली एक शूरवीर नहीं है\"। जैसे ओलिवर ने कहा, \"अबिगेल एक धूर्त है और राइली एक धूर्त है\"। \"अगर ओलिवर एक शूरवीर है तो अबिगेल एक शूरवीर है,\" स्कारलेट ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक धूर्त है  \n(2) अबिगेल एक शूरवीर है  \n(3) ओलिवर एक धूर्त है  \n(4) स्कारलेट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: पेनलोप, अमेलिया, एवा, और लुकास। पेनलोप ने कहा: \"एवा एक शूरवीर नहीं है\"। अमेलिया ने remarked किया, \"पेनलोप एक धूर्त है या लुकास एक शूरवीर है\"। एवा ने कहा, \"अगर अमेलिया एक धूर्त है तो पेनलोप एक धूर्त है\"। लुकास ने कहा, \"पेनलोप एक धूर्त नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक धूर्त है  \n(2) अमेलिया एक शूरवीर है  \n(3) एवा एक शूरवीर है  \n(4) लुकास एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: सैमुएल, पेनलोप, मेसन, और डेविड। सैमुएल को यह कहते हुए सुना गया, \"पेनलोप एक शूरवीर है यदि और केवल यदि मेसन एक धूर्त है\"। पेनलोप ने कहा कि डेविड एक धूर्त है और पेनलोप एक शूरवीर है। मेसन ने asserted किया: \"पेनलोप एक धूर्त है\"। \"मेसन एक धूर्त है यदि और केवल यदि पेनलोप एक शूरवीर है\" - डेविड। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक शूरवीर है  \n(2) पेनलोप एक धूर्त है  \n(3) मेसन एक शूरवीर है  \n(4) डेविड एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: सैमुएल, अलेक्जेंडर, अमेलिया, और लिली। सैमुएल ने कहा, \"सैमुएल एक शूरवीर है और अलेक्जेंडर एक शूरवीर है\"। \"सैमुएल एक धूर्त है\" - अलेक्जेंडर। अमेलिया ने कहा: \"सैमुएल एक धूर्त नहीं है\"। लिली ने कहा, \"अगर सैमुएल एक शूरवीर है तो अमेलिया एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक धूर्त है  \n(2) अलेक्जेंडर एक शूरवीर है  \n(3) अमेलिया एक धूर्त है  \n(4) लिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: सोफिया, अमेलिया, एलिज़ाबेथ, और अबिगेल। सोफिया ने टिप्पणी की, \"अमेलिया एक शूरवीर है\"। अमेलिया ने asserted किया: \"सोफिया एक धूर्त है और अमेलिया एक शूरवीर है\"। एलिज़ाबेथ ने कहा, \"एलिज़ाबेथ एक शूरवीर है या सोफिया एक धूर्त है।\" जैसा कि अबिगेल ने कहा, \"यदि अमेलिया एक धूर्त है तो एलिज़ाबेथ एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) अमेलिया एक धूर्त है  \n(3) एलिज़ाबेथ एक शूरवीर है  \n(4) अबिगेल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: सेबेस्टियन, अमेलिया, राइली, और इसाबेला। सेबेस्टियन ने आपको बताया कि इसाबेला एक शूरवीर है यदि और केवल यदि राइली एक शूरवीर है। अमेलिया के शब्दों में: \"सेबेस्टियन एक शूरवीर नहीं है\"। राइली ने कहा, \"यदि इसाबेला एक शूरवीर है तो अमेलिया एक शूरवीर है\"। \"इसाबेला एक शूरवीर है और सेबेस्टियन एक धूर्त है,\" इसाबेला ने घोषणा की। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सेबेस्टियन एक धूर्त है  \n(2) अमेलिया एक शूरवीर है  \n(3) राइली एक शूरवीर है  \n(4) इसाबेला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: सैमुएल, लिली, हार्पर, और मेसन। \"सैमुएल एक शूरवीर है या लिली एक धूर्त है,\" सैमुएल ने घोषणा की। लिली ने कहा, \"अगर हार्पर एक धूर्त है तो मेसन एक शूरवीर है।\" हार्पर ने कहा, \"अगर मेसन एक धूर्त है तो सैमुएल एक धूर्त है।\" मेसन ने कहा: \"अगर हार्पर एक शूरवीर है तो सैमुएल एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक धूर्त है  \n(2) लिली एक शूरवीर है  \n(3) हार्पर एक शूरवीर है  \n(4) मेसन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: लिली, ईथन, जैक, और एमिली। जैसे लिली ने कहा, \"जैक धूर्त नहीं है\"। \"अगर लिली धूर्त है तो लिली शूरवीर है,\" ईथन ने कहा। जैक के अनुसार, \"ईथन धूर्त है या लिली शूरवीर है\"। \"लिली धूर्त है\" - एमिली। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लिली एक शूरवीर है  \n(2) ईथन एक शूरवीर है  \n(3) जैक एक शूरवीर है  \n(4) एमिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ओवेन, जेम्स, लोगन, और मिया। ओवेन के शब्दों में: \"लोगन एक धूर्त है यदि और केवल यदि जेम्स एक शूरवीर है\"। जेम्स ने कहा, \"यदि मिया एक शूरवीर है तो जेम्स एक शूरवीर है\"। लोगन ने कहा, \"यदि जेम्स एक धूर्त है तो मिया एक शूरवीर है\"। मिया ने कहा, \"ओवेन एक शूरवीर है यदि और केवल यदि लोगन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओवेन एक धूर्त है  \n(2) जेम्स एक शूरवीर है  \n(3) लोगन एक शूरवीर है  \n(4) मिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: आरिया, ओलिवर, माइकल, और एवरी। \"अगर ओलिवर एक धूर्त है तो एवरी एक शूरवीर है,\" आरिया ने घोषणा की। ओलिवर को यह कहते हुए सुना गया, \"अगर आरिया एक शूरवीर है तो एवरी एक धूर्त है\"। माइकल के शब्दों में: \"ओलिवर एक धूर्त है या आरिया एक धूर्त है\"। एवरी के शब्दों में: \"अगर माइकल एक शूरवीर है तो एवरी एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) आरिया एक शूरवीर है  \n(2) ओलिवर एक धूर्त है  \n(3) माइकल एक शूरवीर है  \n(4) एवरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ऐडन, शार्लट, सोफिया, और सेबेस्टियन। ऐडन के अनुसार, \"शार्लट एक धूर्त है\"। शार्लट के एक बयान में: \"सोफिया एक धूर्त है यदि और केवल यदि सोफिया एक शूरवीर है\"। जैसा कि सोफिया ने कहा, \"ऐडन एक शूरवीर है और सेबेस्टियन एक शूरवीर है\"। \"शार्लट एक शूरवीर है और ऐडन एक शूरवीर है,\" सेबेस्टियन ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक शूरवीर है  \n(2) शार्लट एक धूर्त है  \n(3) सोफिया एक धूर्त है  \n(4) सेबेस्टियन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: हेनरी, जेम्स, एम्मा, और इसाबेला। \"अगर हेनरी एक शूरवीर है तो जेम्स एक धूर्त है,\" हेनरी ने घोषित किया। जेम्स ने कहा, \"इसाबेला एक धूर्त है यदि और केवल यदि एम्मा एक शूरवीर है\"। जैसे एम्मा ने कहा, \"जेम्स एक शूरवीर है यदि और केवल यदि हेनरी एक धूर्त है\"। इसाबेला ने कहा, \"हेनरी एक शूरवीर है और जेम्स एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हेनरी एक शूरवीर है  \n(2) जेम्स एक धूर्त है  \n(3) एम्मा एक शूरवीर है  \n(4) इसाबेला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: नूह, ल्यूक, सैमुएल, और विक्टोरिया। नूह ने आपको बताया कि अगर विक्टोरिया एक शूरवीर है तो ल्यूक एक शूरवीर है। ल्यूक ने कहा, \"सैमुएल एक शूरवीर है या नूह एक शूरवीर है\"। \"विक्टोरिया एक शूरवीर है या विक्टोरिया एक धूर्त है,\" सैमुएल ने उल्लेख किया। विक्टोरिया ने कहा कि अगर सैमुएल एक धूर्त है तो ल्यूक एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक शूरवीर है  \n(2) ल्यूक एक शूरवीर है  \n(3) सैमुएल एक शूरवीर है  \n(4) विक्टोरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: लियम, एम्मा, ल्यूक, और ओलिवर। \"लियम एक शूरवीर है या एम्मा एक शूरवीर है\" - लियम। एम्मा के शब्दों में: \"लियम एक धूर्त है या लियम एक शूरवीर है\"। ल्यूक के शब्दों में: \"लियम एक शूरवीर है यदि और केवल यदि लियम एक धूर्त है\"। ओलिवर ने कहा कि लियम एक शूरवीर है और एम्मा एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक शूरवीर है  \n(2) एम्मा एक शूरवीर है  \n(3) ल्यूक एक धूर्त है  \n(4) ओलिवर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: नूह, डैनियल, डेविड, और पेनलोप। \"डेविड एक शूरवीर है और डैनियल एक धूर्त है,\" नूह ने घोषणा की। डैनियल ने कहा कि डैनियल एक शूरवीर है और डेविड एक शूरवीर है। डेविड को यह कहते हुए सुना गया, \"डैनियल एक शूरवीर नहीं है\"। पेनलोप ने कहा कि अगर डैनियल एक धूर्त है तो नूह एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक शूरवीर है  \n(2) डैनियल एक धूर्त है  \n(3) डेविड एक शूरवीर है  \n(4) पेनलोप एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ओलिविया, डैनियल, पेनलोप, और सेबेस्टियन। ओलिविया ने कहा, \"अगर सेबेस्टियन एक शूरवीर है तो पेनलोप एक धूर्त है।\" जैसा कि डैनियल ने कहा, \"सेबेस्टियन एक धूर्त नहीं है।\" पेनलोप के एक बयान में: \"अगर सेबेस्टियन एक धूर्त है तो डैनियल एक धूर्त है।\" सेबेस्टियन ने कहा, \"अगर ओलिविया एक शूरवीर है तो डैनियल एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक धूर्त है  \n(2) डैनियल एक शूरवीर है  \n(3) पेनलोप एक शूरवीर है  \n(4) सेबेस्टियन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एला, ज़ोई, डैनियल, और एवा। एला ने कहा, \"अगर ज़ोई एक धूर्त है तो एवा एक धूर्त है।\" ज़ोई ने asserted: \"एवा एक धूर्त है और डैनियल एक धूर्त है।\" डैनियल ने asserted: \"अगर एवा एक शूरवीर है तो ज़ोई एक धूर्त है।\" एवा ने नोट किया, \"डैनियल एक धूर्त है या ज़ोई एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक धूर्त है  \n(2) ज़ोई एक धूर्त है  \n(3) डैनियल एक शूरवीर है  \n(4) एवा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एवलिन, लियम, नूह, और माइकल। जैसे कि एवलिन ने कहा, \"नूह एक धूर्त है या लियम एक शूरवीर है\"। लियम ने कहा: \"नूह एक धूर्त नहीं है\"। नूह ने कहा, \"अगर माइकल एक धूर्त है तो नूह एक शूरवीर है\"। माइकल ने टिप्पणी की, \"नूह एक धूर्त है या एवलिन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक शूरवीर है  \n(2) लियम एक शूरवीर है  \n(3) नूह एक शूरवीर है  \n(4) माइकल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ल्यूक, एम्मा, ओलिवर, और इसाबेला। ल्यूक के एक बयान में: \"एम्मा एक धूर्त नहीं है\"। एम्मा ने कहा कि अगर ल्यूक एक धूर्त है तो ओलिवर एक धूर्त है। \"अगर इसाबेला एक शूरवीर है तो इसाबेला एक धूर्त है,\" ओलिवर ने उल्लेख किया। \"एम्मा एक शूरवीर है या ओलिवर एक शूरवीर है,\" इसाबेला ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) एम्मा एक शूरवीर है  \n(3) ओलिवर एक धूर्त है  \n(4) इसाबेला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: अलेक्जेंडर, ल्यूक, एवा, और विलियम। अलेक्जेंडर ने कहा कि ल्यूक एक धूर्त नहीं है। ल्यूक ने आपको बताया कि एवा एक धूर्त है और विलियम एक धूर्त है। एवा ने कहा कि विलियम एक धूर्त है। विलियम ने कहा कि अगर अलेक्जेंडर एक शूरवीर है तो ल्यूक एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अलेक्जेंडर एक धूर्त है  \n(2) ल्यूक एक धूर्त है  \n(3) एवा एक धूर्त है  \n(4) विलियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: डेविड, सोफिया, औरोरा, और जैक्सन। डेविड के शब्दों में: \"औरोरा एक शूरवीर है या डेविड एक शूरवीर है\"। सोफिया ने कहा, \"अगर सोफिया एक शूरवीर है तो जैक्सन एक शूरवीर है\"। औरोरा ने कहा, \"डेविड एक शूरवीर नहीं है\"। जैक्सन को यह कहते हुए सुना गया, \"सोफिया एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक शूरवीर है  \n(2) सोफिया एक शूरवीर है  \n(3) औरोरा एक धूर्त है  \n(4) जैक्सन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: लुकास, सेबेस्टियन, ईथन, और राइली। लुकास के अनुसार, \"सेबेस्टियन एक धूर्त है यदि और केवल यदि ईथन एक शूरवीर है\"। सेबेस्टियन ने कहा कि लुकास एक शूरवीर है। ईथन को यह कहते हुए सुना गया, \"लुकास एक शूरवीर है यदि और केवल यदि राइली एक शूरवीर है\"। राइली ने आपको बताया कि सेबेस्टियन एक शूरवीर है या ईथन एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक धूर्त है  \n(2) सेबेस्टियन एक धूर्त है  \n(3) ईथन एक धूर्त है  \n(4) राइली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एला, सेबेस्टियन, लुकास, और एवा। एला को यह कहते हुए सुना गया, \"एवा एक शूरवीर है\"। सेबेस्टियन को यह कहते हुए सुना गया, \"अगर एवा एक शूरवीर है तो एवा एक धूर्त है\"। लुकास को यह कहते हुए सुना गया, \"अगर एला एक शूरवीर है तो एवा एक धूर्त है\"। एवा ने कहा, \"लुकास एक धूर्त है या लुकास एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक शूरवीर है  \n(2) सेबेस्टियन एक धूर्त है  \n(3) लुकास एक धूर्त है  \n(4) एवा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: विलियम, एला, लुकास, और याकूब। विलियम ने कहा, \"अगर याकूब धूर्त है तो एला धूर्त है।\" एला ने आपको बताया कि विलियम धूर्त है या लुकास धूर्त है। लुकास ने कहा कि अगर याकूब शूरवीर है तो विलियम धूर्त है। याकूब ने कहा, \"एला शूरवीर है और विलियम धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) एला एक धूर्त है  \n(3) लुकास एक शूरवीर है  \n(4) याकूब एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: राइली, अमेलिया, विलियम, और डैनियल। \"अगर डैनियल एक धूर्त है तो विलियम एक धूर्त है,\" राइली ने घोषणा की। \"डैनियल एक धूर्त है यदि और केवल यदि विलियम एक शूरवीर है\" - अमेलिया। जैसे विलियम ने कहा, \"डैनियल एक धूर्त नहीं है\"। \"राइली एक शूरवीर नहीं है,\" डैनियल ने उल्लेख किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक शूरवीर है  \n(2) अमेलिया एक धूर्त है  \n(3) विलियम एक धूर्त है  \n(4) डैनियल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ओवेन, इसाबेला, नूह, और जैक्सन। ओवेन ने कहा: \"इसाबेला एक शूरवीर है\"। इसाबेला ने कहा, \"अगर नूह एक शूरवीर है तो जैक्सन एक धूर्त है\"। नूह ने कहा कि जैक्सन एक धूर्त है और नूह एक शूरवीर है। जैक्सन के एक बयान में: \"ओवेन एक शूरवीर है या नूह एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ओवेन एक शूरवीर है  \n(2) इसाबेला एक शूरवीर है  \n(3) नूह एक धूर्त है  \n(4) जैक्सन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: राइली, पेनलोप, इसाबेला, और अलेक्जेंडर। राइली ने कहा कि अलेक्जेंडर एक शूरवीर है और पेनलोप एक शूरवीर है। पेनलोप ने कहा कि इसाबेला एक धूर्त है यदि और केवल यदि इसाबेला एक शूरवीर है। इसाबेला ने कहा, \"राइली एक शूरवीर है या अलेक्जेंडर एक शूरवीर है।\" \"राइली एक शूरवीर है और राइली एक धूर्त है,\" अलेक्जेंडर ने उल्लेख किया। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) राइली एक धूर्त है  \n(2) पेनलोप एक धूर्त है  \n(3) इसाबेला एक धूर्त है  \n(4) अलेक्जेंडर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: क्लोई, औरोरा, जैक, और ओलिवर। जैसे कि क्लोई ने कहा, \"ओलिवर एक शूरवीर है यदि और केवल यदि जैक एक धूर्त है\"। औरोरा को यह कहते हुए सुना गया, \"यदि ओलिवर एक शूरवीर है तो क्लोई एक शूरवीर है\"। जैक ने कहा कि क्लोई एक शूरवीर है। ओलिवर ने कहा कि क्लोई एक धूर्त है यदि और केवल यदि औरोरा एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) क्लोई एक शूरवीर है  \n(2) औरोरा एक शूरवीर है  \n(3) जैक एक शूरवीर है  \n(4) ओलिवर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ओलिविया, आरिया, स्कारलेट, और बेंजामिन। ओलिविया को यह कहते हुए सुना गया, \"स्कारलेट एक धूर्त है\"। आरिया ने टिप्पणी की, \"अगर स्कारलेट एक शूरवीर है तो बेंजामिन एक शूरवीर है\"। स्कारलेट ने कहा, \"ओलिविया एक शूरवीर है और बेंजामिन एक शूरवीर है।\" \"स्कारलेट एक धूर्त नहीं है,\" बेंजामिन ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक शूरवीर है  \n(2) आरिया एक शूरवीर है  \n(3) स्कारलेट एक धूर्त है  \n(4) बेंजामिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: अमेलिया, ओलिविया, हेनरी, और औरोरा। अमेलिया ने टिप्पणी की, \"औरोरा एक शूरवीर है या हेनरी एक शूरवीर है।\" ओलिविया ने कहा, \"हेनरी एक धूर्त है।\" \"ओलिविया एक धूर्त है या ओलिविया एक शूरवीर है,\" हेनरी ने दावा किया। \"अमेलिया एक धूर्त है\" - औरोरा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक शूरवीर है  \n(2) ओलिविया एक धूर्त है  \n(3) हेनरी एक शूरवीर है  \n(4) औरोरा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: विलियम, ईथन, लिली, और अमेलिया। \"लिली एक शूरवीर है,\" विलियम ने दावा किया। ईथन ने कहा, \"लिली एक धूर्त है या अमेलिया एक धूर्त है।\" जैसे लिली ने कहा, \"ईथन एक धूर्त है यदि और केवल यदि अमेलिया एक धूर्त है।\" \"ईथन एक शूरवीर है यदि और केवल यदि ईथन एक धूर्त है,\" अमेलिया ने उल्लेख किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक धूर्त है  \n(2) ईथन एक शूरवीर है  \n(3) लिली एक धूर्त है  \n(4) अमेलिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एवलिन, मेसन, लियम, और पेनलोप। \"लियम धूर्त नहीं है,\" एवलिन ने घोषणा की। मेसन के अनुसार, \"लियम एक शूरवीर है या लियम एक धूर्त है\"। लियम के शब्दों में: \"मेसन एक धूर्त है और एवलिन एक शूरवीर है\"। पेनलोप के अनुसार: \"पेनलोप एक शूरवीर है और एवलिन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक धूर्त है  \n(2) मेसन एक शूरवीर है  \n(3) लियम एक धूर्त है  \n(4) पेनलोप एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: नूह, अलेक्जेंडर, पेनलोप, और क्लोई। नूह ने कहा कि पेनलोप एक शूरवीर है और क्लोई एक धूर्त है। अलेक्जेंडर ने कहा कि अगर पेनलोप एक शूरवीर है तो क्लोई भी एक शूरवीर है। पेनलोप के अनुसार, \"पेनलोप एक शूरवीर है और क्लोई एक धूर्त है\"। \"अगर नूह एक धूर्त है तो अलेक्जेंडर एक शूरवीर है,\" क्लोई ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक धूर्त है  \n(2) अलेक्जेंडर एक शूरवीर है  \n(3) पेनलोप एक धूर्त है  \n(4) क्लोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: शार्लट, आरिया, विलियम, और राइली। \"आरिया एक शूरवीर है और राइली एक धूर्त है,\" शार्लट ने कहा। आरिया ने कहा कि राइली एक शूरवीर है या राइली एक धूर्त है। विलियम ने कहा: \"शार्लट एक धूर्त है यदि और केवल यदि राइली एक शूरवीर है\"। राइली के एक बयान में: \"यदि आरिया एक शूरवीर है तो विलियम एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक धूर्त है  \n(2) आरिया एक शूरवीर है  \n(3) विलियम एक शूरवीर है  \n(4) राइली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: जैक्सन, सेबेस्टियन, डैनियल, और लिली। जैक्सन को यह कहते हुए सुना गया, \"अगर लिली एक धूर्त है तो जैक्सन एक शूरवीर है\"। सेबेस्टियन को यह कहते हुए सुना गया, \"जैक्सन एक शूरवीर है यदि और केवल यदि डैनियल एक धूर्त है\"। \"डैनियल एक शूरवीर है यदि और केवल यदि सेबेस्टियन एक धूर्त है,\" डैनियल ने कहा। जैसा कि लिली ने कहा, \"जैक्सन एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक शूरवीर है  \n(2) सेबेस्टियन एक धूर्त है  \n(3) डैनियल एक शूरवीर है  \n(4) लिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: पेनलोप, ईथन, ऐडन, और एवलिन। पेनलोप ने कहा: \"ऐडन एक धूर्त है या ईथन एक धूर्त है\"। ईथन के एक बयान में: \"यदि ऐडन एक शूरवीर है तो एवलिन एक शूरवीर है\"। ऐडन ने कहा कि यदि ऐडन एक शूरवीर है तो एवलिन एक धूर्त है। एवलिन ने कहा, \"ईथन एक धूर्त है यदि और केवल यदि ईथन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक शूरवीर है  \n(2) ईथन एक धूर्त है  \n(3) ऐडन एक शूरवीर है  \n(4) एवलिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ओलिविया, माइकल, एलिज़ाबेथ, और जैक्सन। ओलिविया को यह कहते हुए सुना गया, \"अगर माइकल एक धूर्त है तो जैक्सन एक शूरवीर है।\" माइकल ने कहा कि ओलिविया एक शूरवीर है यदि और केवल यदि जैक्सन एक धूर्त है। \"माइकल एक शूरवीर है,\" एलिज़ाबेथ ने कहा। \"ओलिविया एक शूरवीर नहीं है\" - जैक्सन। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक शूरवीर है  \n(2) माइकल एक शूरवीर है  \n(3) एलिज़ाबेथ एक शूरवीर है  \n(4) जैक्सन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: क्लोई, ज़ोई, डेविड, और शार्लट। \"ज़ोई एक धूर्त है यदि और केवल यदि शार्लट एक धूर्त है\" - क्लोई। \"क्लोई एक शूरवीर नहीं है,\" ज़ोई ने घोषणा की। डेविड के अनुसार, \"शार्लट एक धूर्त नहीं है\"। जैसे शार्लट ने कहा, \"ज़ोई एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) क्लोई एक धूर्त है  \n(2) ज़ोई एक शूरवीर है  \n(3) डेविड एक धूर्त है  \n(4) शार्लट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: लोगन, लियम, शार्लट, और हार्पर। लोगन ने कहा, \"लोगन एक शूरवीर है या हार्पर एक शूरवीर है\"। लियम के अनुसार, \"शार्लट एक धूर्त है\"। शार्लट के एक बयान में: \"लोगन एक शूरवीर है\"। हार्पर ने कहा, \"लियम एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) लोगन एक शूरवीर है  \n(2) लियम एक धूर्त है  \n(3) शार्लट एक शूरवीर है  \n(4) हार्पर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: पेनलोप, ल्यूक, नूह, और औरोरा। पेनलोप ने कहा, \"ल्यूक एक धूर्त है या औरोरा एक शूरवीर है\"। \"नूह एक शूरवीर है या नूह एक धूर्त है\" - ल्यूक। जैसे नूह ने कहा, \"ल्यूक एक धूर्त है या औरोरा एक धूर्त है\"। \"औरोरा एक शूरवीर है यदि और केवल यदि नूह एक धूर्त है,\" औरोरा ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक शूरवीर है  \n(2) ल्यूक एक शूरवीर है  \n(3) नूह एक धूर्त है  \n(4) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एलिज़ाबेथ, बेंजामिन, ऐडन, और एम्मा। एलिज़ाबेथ के शब्दों में: \"एम्मा एक धूर्त है और ऐडन एक शूरवीर है\"। बेंजामिन ने कहा, \"एलिज़ाबेथ एक शूरवीर है यदि और केवल यदि एम्मा एक शूरवीर है\"। ऐडन ने कहा, \"एम्मा एक धूर्त नहीं है\"। एम्मा के एक बयान में: \"एलिज़ाबेथ एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक धूर्त है  \n(2) बेंजामिन एक शूरवीर है  \n(3) ऐडन एक धूर्त है  \n(4) एम्मा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: क्लोई, विक्टोरिया, डैनियल, और बेंजामिन। क्लोई ने कहा, \"विक्टोरिया एक शूरवीर है\"। विक्टोरिया ने कहा, \"डैनियल एक धूर्त है और विक्टोरिया एक शूरवीर है\"। डैनियल ने कहा, \"क्लोई एक शूरवीर है यदि और केवल यदि विक्टोरिया एक धूर्त है\"। बेंजामिन ने कहा, \"यदि बेंजामिन एक शूरवीर है तो विक्टोरिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) क्लोई एक शूरवीर है  \n(2) विक्टोरिया एक शूरवीर है  \n(3) डैनियल एक धूर्त है  \n(4) बेंजामिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: विलियम, सोफिया, औरोरा, और ईथन। विलियम के शब्दों में: \"औरोरा एक शूरवीर है यदि और केवल यदि ईथन एक धूर्त है।\" \"यदि विलियम एक शूरवीर है तो विलियम एक धूर्त है,\" सोफिया ने घोषणा की। औरोरा ने नोट किया, \"विलियम एक धूर्त नहीं है।\" ईथन ने remarked किया, \"औरोरा एक शूरवीर नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) सोफिया एक धूर्त है  \n(3) औरोरा एक शूरवीर है  \n(4) ईथन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: औरोरा, लोगन, शार्लट, और एवलिन। औरोरा ने कहा: \"लोगन एक धूर्त है और शार्लट एक शूरवीर है\"। लोगन को यह कहते हुए सुना गया, \"औरोरा एक धूर्त है और एवलिन एक धूर्त है\"। शार्लट ने कहा, \"अगर शार्लट एक शूरवीर है तो एवलिन एक शूरवीर है\"। एवलिन ने टिप्पणी की, \"औरोरा एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) औरोरा एक शूरवीर है  \n(2) लोगन एक धूर्त है  \n(3) शार्लट एक शूरवीर है  \n(4) एवलिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: मैथ्यू, ज़ोई, विलियम, और यूसुफ। मैथ्यू ने आपको बताया कि यूसुफ एक शूरवीर नहीं है। ज़ोई ने कहा कि मैथ्यू एक धूर्त है यदि और केवल यदि मैथ्यू एक शूरवीर है। \"मैथ्यू एक धूर्त है यदि और केवल यदि यूसुफ एक धूर्त है,\" विलियम ने उल्लेख किया। यूसुफ के शब्दों में: \"ज़ोई एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक शूरवीर है  \n(2) ज़ोई एक धूर्त है  \n(3) विलियम एक धूर्त है  \n(4) यूसुफ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: अमेलिया, लुकास, मेसन, और सोफिया। अमेलिया ने कहा कि सोफिया एक धूर्त है या मेसन एक शूरवीर है। लुकास के अनुसार, \"अगर अमेलिया एक धूर्त है तो लुकास एक शूरवीर है\"। \"अगर सोफिया एक धूर्त है तो सोफिया एक शूरवीर है\" - मेसन। सोफिया ने कहा: \"लुकास एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक शूरवीर है  \n(2) लुकास एक शूरवीर है  \n(3) मेसन एक शूरवीर है  \n(4) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: सैमुएल, जेम्स, लुकास, और सोफिया। सैमुएल ने कहा, \"लुकास एक धूर्त है और सोफिया एक शूरवीर है\"। \"जेम्स एक शूरवीर है और सोफिया एक धूर्त है\" - जेम्स। लुकास ने कहा, \"अगर सैमुएल एक धूर्त है तो जेम्स एक धूर्त है\"। जैसा कि सोफिया ने कहा, \"अगर लुकास एक धूर्त है तो जेम्स एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक धूर्त है  \n(2) जेम्स एक धूर्त है  \n(3) लुकास एक शूरवीर है  \n(4) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: अमेलिया, इसाबेला, डैनियल, और डेविड। जैसे अमेलिया ने कहा, \"इसाबेला शूरवीर है यदि और केवल यदि अमेलिया शूरवीर है\"। इसाबेला ने कहा, \"अमेलिया शूरवीर है यदि और केवल यदि डेविड धूर्त है\"। \"डेविड धूर्त है यदि और केवल यदि डैनियल शूरवीर है,\" डैनियल ने दावा किया। डेविड को यह कहते हुए सुना गया, \"डैनियल धूर्त है यदि और केवल यदि इसाबेला धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक शूरवीर है  \n(2) इसाबेला एक शूरवीर है  \n(3) डैनियल एक धूर्त है  \n(4) डेविड एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: जैक, लुकास, औरोरा, और एवरी। \"जैक एक शूरवीर है और औरोरा एक शूरवीर है,\" जैक ने दावा किया। लुकास के शब्दों में: \"जैक एक धूर्त नहीं है\"। \"अगर जैक एक शूरवीर है तो जैक एक धूर्त है,\" औरोरा ने दावा किया। जैसा कि एवरी ने कहा, \"जैक एक धूर्त है यदि और केवल यदि औरोरा एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक एक धूर्त है  \n(2) लुकास एक धूर्त है  \n(3) औरोरा एक शूरवीर है  \n(4) एवरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: जैक, एलिज़ाबेथ, एला, और माइकल। जैक ने कहा, \"माइकल एक शूरवीर है यदि और केवल यदि एलिज़ाबेथ एक धूर्त है\"। एलिज़ाबेथ के शब्दों में: \"एला एक शूरवीर है या एला एक धूर्त है\"। एला ने कहा, \"जैक एक धूर्त है या एलिज़ाबेथ एक धूर्त है\"। माइकल के शब्दों में: \"यदि एला एक शूरवीर है तो माइकल एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) जैक एक धूर्त है  \n(2) एलिज़ाबेथ एक शूरवीर है  \n(3) एला एक शूरवीर है  \n(4) माइकल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एवा, सोफिया, ओलिवर, और मेसन। \"सोफिया एक धूर्त है,\" एवा ने दावा किया। सोफिया ने टिप्पणी की, \"मेसन एक धूर्त नहीं है\"। ओलिवर ने नोट किया, \"एवा एक शूरवीर है या मेसन एक धूर्त है\"। \"अगर मेसन एक शूरवीर है तो सोफिया एक शूरवीर है\" - मेसन। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक धूर्त है  \n(2) सोफिया एक शूरवीर है  \n(3) ओलिवर एक धूर्त है  \n(4) मेसन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ओलिविया, जैक, लिली, और बेंजामिन। ओलिविया ने कहा कि लिली एक शूरवीर है। \"ओलिविया एक धूर्त है,\" जैक ने कहा। लिली ने कहा, \"जैक एक धूर्त है और बेंजामिन एक धूर्त है\"। बेंजामिन ने कहा, \"लिली एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक धूर्त है  \n(2) जैक एक शूरवीर है  \n(3) लिली एक धूर्त है  \n(4) बेंजामिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: क्लोई, ज़ोई, जैक, और सोफिया। क्लोई ने कहा, \"जैक एक धूर्त है।\" ज़ोई ने नोट किया, \"जैक एक शूरवीर है।\" जैक ने कहा कि ज़ोई एक धूर्त है और क्लोई एक धूर्त है। सोफिया ने कहा कि क्लोई एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) क्लोई एक शूरवीर है  \n(2) ज़ोई एक धूर्त है  \n(3) जैक एक धूर्त है  \n(4) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एला, अलेक्जेंडर, एम्मा, और लिली। एला ने टिप्पणी की, \"एम्मा एक धूर्त है और एला एक शूरवीर है\"। अलेक्जेंडर को यह कहते हुए सुना गया, \"एम्मा एक शूरवीर है और लिली एक शूरवीर है\"। एम्मा ने कहा, \"एला एक धूर्त नहीं है\"। \"एम्मा एक शूरवीर है और अलेक्जेंडर एक शूरवीर है\" - लिली। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक धूर्त है  \n(2) अलेक्जेंडर एक धूर्त है  \n(3) एम्मा एक धूर्त है  \n(4) लिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एलिज़ाबेथ, ईथन, अबिगेल, और लिली। एलिज़ाबेथ को यह कहते हुए सुना गया, \"अगर ईथन एक शूरवीर है तो अबिगेल एक शूरवीर है\"। ईथन ने कहा, \"लिली एक धूर्त है या एलिज़ाबेथ एक धूर्त है\"। अबिगेल ने कहा, \"एलिज़ाबेथ एक शूरवीर है यदि और केवल यदि ईथन एक शूरवीर है\"। \"ईथन एक धूर्त है यदि और केवल यदि लिली एक शूरवीर है\" - लिली। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक शूरवीर है  \n(2) ईथन एक धूर्त है  \n(3) अबिगेल एक धूर्त है  \n(4) लिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: आरिया, अमेलिया, औरोरा, और एवा। आरिया ने टिप्पणी की, \"अमेलिया एक धूर्त है यदि और केवल यदि औरोरा एक धूर्त है\"। \"औरोरा एक धूर्त है या औरोरा एक शूरवीर है,\" अमेलिया ने दावा किया। औरोरा के अनुसार, \"एवा एक धूर्त है\"। \"एवा एक शूरवीर है या औरोरा एक शूरवीर है\" - एवा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) आरिया एक धूर्त है  \n(2) अमेलिया एक शूरवीर है  \n(3) औरोरा एक धूर्त है  \n(4) एवा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एलिज़ाबेथ, हार्पर, विलियम, और बेंजामिन। एलिज़ाबेथ के शब्दों में: \"विलियम एक शूरवीर है और हार्पर एक शूरवीर है\"। हार्पर ने कहा, \"बेंजामिन एक शूरवीर नहीं है\"। विलियम ने कहा कि बेंजामिन एक शूरवीर है। \"हार्पर एक शूरवीर है और बेंजामिन एक शूरवीर है\" - बेंजामिन। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक धूर्त है  \n(2) हार्पर एक शूरवीर है  \n(3) विलियम एक धूर्त है  \n(4) बेंजामिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ओलिवर, यूसुफ, क्लोई, और लोगन। ओलिवर ने कहा कि लोगन शूरवीर नहीं है। यूसुफ ने कहा, \"लोगन शूरवीर है या ओलिवर शूरवीर है\"। क्लोई ने कहा, \"अगर ओलिवर धूर्त है तो लोगन धूर्त है\"। \"ओलिवर शूरवीर है और क्लोई धूर्त है,\" लोगन ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिवर एक शूरवीर है  \n(2) यूसुफ एक शूरवीर है  \n(3) क्लोई एक शूरवीर है  \n(4) लोगन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: जैक्सन, एलिज़ाबेथ, एवलिन, और मेसन। जैक्सन के अनुसार, \"एवलिन एक धूर्त है\"। एलिज़ाबेथ के शब्दों में: \"मेसन एक शूरवीर है यदि और केवल यदि एवलिन एक शूरवीर है\"। \"यदि जैक्सन एक धूर्त है तो मेसन एक शूरवीर है,\" एवलिन ने कहा। मेसन ने आपको बताया कि यदि जैक्सन एक धूर्त है तो एलिज़ाबेथ एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक धूर्त है  \n(2) एलिज़ाबेथ एक शूरवीर है  \n(3) एवलिन एक शूरवीर है  \n(4) मेसन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: हेनरी, लोगन, सोफिया, और ग्रेस। हेनरी ने कहा, \"लोगन एक शूरवीर है यदि और केवल यदि सोफिया एक शूरवीर है\"। लोगन ने आपको बताया कि ग्रेस एक शूरवीर है यदि और केवल यदि सोफिया एक शूरवीर है। सोफिया ने कहा कि हेनरी एक शूरवीर है यदि और केवल यदि ग्रेस एक धूर्त है। ग्रेस ने टिप्पणी की, \"हेनरी एक धूर्त है या ग्रेस एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हेनरी एक शूरवीर है  \n(2) लोगन एक धूर्त है  \n(3) सोफिया एक धूर्त है  \n(4) ग्रेस एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: क्लोई, मिया, एवरी, और यूसुफ। क्लोई को यह कहते हुए सुना गया, \"मिया धूर्त नहीं है\"। \"मिया एक शूरवीर है या क्लोई एक धूर्त है\" - मिया। एवरी ने आपको बताया कि एवरी एक शूरवीर है या मिया एक शूरवीर है। \"मिया एक शूरवीर है यदि और केवल यदि एवरी एक धूर्त है,\" यूसुफ ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) क्लोई एक शूरवीर है  \n(2) मिया एक शूरवीर है  \n(3) एवरी एक शूरवीर है  \n(4) यूसुफ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ल्यूक, अमेलिया, हेनरी, और लिली। ल्यूक ने कहा, \"हेनरी एक धूर्त है यदि और केवल यदि लिली एक धूर्त है।\" \"लिली एक शूरवीर है या हेनरी एक शूरवीर है,\" अमेलिया ने घोषणा की। \"अमेलिया एक धूर्त है या ल्यूक एक शूरवीर है,\" हेनरी ने घोषणा की। \"ल्यूक एक शूरवीर है यदि और केवल यदि अमेलिया एक शूरवीर है,\" लिली ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) अमेलिया एक शूरवीर है  \n(3) हेनरी एक शूरवीर है  \n(4) लिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ऐडन, मैथ्यू, एला, और राइली। ऐडन ने आपको बताया कि एला एक धूर्त है। मैथ्यू ने कहा, \"राइली एक धूर्त नहीं है।\" \"ऐडन एक धूर्त है यदि और केवल यदि राइली एक शूरवीर है\" - एला। राइली ने आपको बताया कि ऐडन एक शूरवीर है और राइली एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक शूरवीर है  \n(2) मैथ्यू एक शूरवीर है  \n(3) एला एक धूर्त है  \n(4) राइली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ल्यूक, हार्पर, पेनलोप, और औरोरा। ल्यूक के शब्दों में: \"पेनलोप एक शूरवीर है यदि और केवल यदि पेनलोप एक धूर्त है\"। हार्पर ने कहा, \"औरोरा एक धूर्त है और हार्पर एक शूरवीर है।\" पेनलोप ने कहा कि ल्यूक एक धूर्त है। औरोरा ने कहा, \"हार्पर एक शूरवीर है यदि और केवल यदि औरोरा एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक धूर्त है  \n(2) हार्पर एक शूरवीर है  \n(3) पेनलोप एक शूरवीर है  \n(4) औरोरा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: माइकल, सेबेस्टियन, बेंजामिन, और इसाबेला। माइकल ने कहा, \"इसाबेला एक धूर्त है और सेबेस्टियन एक धूर्त है।\" सेबेस्टियन ने कहा, \"सेबेस्टियन एक शूरवीर है।\" बेंजामिन ने कहा: \"अगर इसाबेला एक शूरवीर है तो इसाबेला एक धूर्त है।\" इसाबेला ने कहा, \"सेबेस्टियन एक धूर्त है और माइकल एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक धूर्त है  \n(2) सेबेस्टियन एक शूरवीर है  \n(3) बेंजामिन एक शूरवीर है  \n(4) इसाबेला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: नूह, याकूब, आरिया, और ईथन। \"ईथन एक शूरवीर है या ईथन एक धूर्त है,\" नूह ने घोषणा की। याकूब ने टिप्पणी की, \"यदि आरिया एक शूरवीर है तो ईथन एक धूर्त है।\" आरिया ने टिप्पणी की, \"यदि ईथन एक धूर्त है तो नूह एक धूर्त है।\" \"नूह एक शूरवीर नहीं है,\" ईथन ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक शूरवीर है  \n(2) याकूब एक शूरवीर है  \n(3) आरिया एक धूर्त है  \n(4) ईथन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: लोगन, स्कारलेट, ईथन, और ग्रेस। लोगन ने आपको बताया कि अगर ग्रेस एक धूर्त है तो स्कारलेट एक धूर्त है। स्कारलेट ने कहा, \"अगर लोगन एक धूर्त है तो ग्रेस एक धूर्त है।\" ईथन ने टिप्पणी की, \"लोगन एक धूर्त है।\" ग्रेस ने कहा कि स्कारलेट एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक शूरवीर है  \n(2) स्कारलेट एक शूरवीर है  \n(3) ईथन एक धूर्त है  \n(4) ग्रेस एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एम्मा, अमेलिया, ईथन, और इसाबेला। एम्मा ने कहा, \"इसाबेला शूरवीर नहीं है।\" अमेलिया को यह कहते हुए सुना गया, \"इसाबेला धूर्त है।\" \"इसाबेला धूर्त नहीं है,\" ईथन ने दावा किया। \"एम्मा शूरवीर है यदि और केवल यदि ईथन शूरवीर है,\" इसाबेला ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एम्मा एक शूरवीर है  \n(2) अमेलिया एक शूरवीर है  \n(3) ईथन एक धूर्त है  \n(4) इसाबेला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: पेनलोप, ओवेन, बेंजामिन, और जैक्सन। पेनलोप ने टिप्पणी की, \"ओवेन एक धूर्त है या जैक्सन एक धूर्त है\"। ओवेन के अनुसार, \"पेनलोप एक शूरवीर है या पेनलोप एक धूर्त है\"। \"अगर बेंजामिन एक शूरवीर है तो ओवेन एक शूरवीर है,\" बेंजामिन ने घोषित किया। जैक्सन ने कहा, \"ओवेन एक शूरवीर है या बेंजामिन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक धूर्त है  \n(2) ओवेन एक शूरवीर है  \n(3) बेंजामिन एक शूरवीर है  \n(4) जैक्सन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एलिज़ाबेथ, ज़ोई, स्कारलेट, और बेंजामिन। एलिज़ाबेथ ने कहा, \"स्कारलेट एक धूर्त है या स्कारलेट एक शूरवीर है।\" \"बेंजामिन एक शूरवीर नहीं है\" - ज़ोई। स्कारलेट ने कहा, \"ज़ोई एक धूर्त है यदि और केवल यदि एलिज़ाबेथ एक शूरवीर है।\" बेंजामिन ने कहा, \"एलिज़ाबेथ एक शूरवीर है या एलिज़ाबेथ एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक शूरवीर है  \n(2) ज़ोई एक धूर्त है  \n(3) स्कारलेट एक शूरवीर है  \n(4) बेंजामिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: शार्लट, ग्रेस, आरिया, और सोफिया। \"ग्रेस एक शूरवीर है यदि और केवल यदि ग्रेस एक धूर्त है,\" शार्लट ने घोषणा की। \"आरिया एक शूरवीर है और शार्लट एक धूर्त है,\" ग्रेस ने कहा। \"यदि आरिया एक शूरवीर है तो ग्रेस एक शूरवीर है,\" आरिया ने दावा किया। \"शार्लट एक शूरवीर नहीं है\" - सोफिया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक धूर्त है  \n(2) ग्रेस एक शूरवीर है  \n(3) आरिया एक शूरवीर है  \n(4) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: अमेलिया, ऐडन, जैक, और मिया। अमेलिया ने कहा कि जैक एक धूर्त है और ऐडन एक शूरवीर है। \"अमेलिया एक शूरवीर है\" - ऐडन। जैक ने आपको बताया कि अगर अमेलिया एक धूर्त है तो ऐडन एक धूर्त है। जैसा कि मिया ने कहा, \"अमेलिया एक शूरवीर है यदि और केवल यदि अमेलिया एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक धूर्त है  \n(2) ऐडन एक धूर्त है  \n(3) जैक एक शूरवीर है  \n(4) मिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: मैथ्यू, लियम, लोगन, और एला। \"लोगन एक धूर्त है यदि और केवल यदि लियम एक शूरवीर है,\" मैथ्यू ने घोषणा की। लियम को यह कहते हुए सुना गया, \"मैथ्यू एक धूर्त है या एला एक शूरवीर है\"। लोगन ने asserted किया: \"यदि मैथ्यू एक धूर्त है तो लियम एक शूरवीर है\"। \"लियम एक धूर्त है,\" एला ने उल्लेख किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक धूर्त है  \n(2) लियम एक शूरवीर है  \n(3) लोगन एक शूरवीर है  \n(4) एला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: सोफिया, लिली, डैनियल, और विक्टोरिया। सोफिया के अनुसार, \"लिली एक शूरवीर है यदि और केवल यदि विक्टोरिया एक धूर्त है\"। \"सोफिया एक धूर्त है या डैनियल एक धूर्त है,\" लिली ने घोषणा की। डैनियल ने कहा, \"यदि डैनियल एक शूरवीर है तो सोफिया एक शूरवीर है\"। विक्टोरिया ने कहा, \"सोफिया एक शूरवीर है या डैनियल एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) लिली एक धूर्त है  \n(3) डैनियल एक शूरवीर है  \n(4) विक्टोरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: पेनलोप, जेम्स, याकूब, और सोफिया। जैसे कि पेनलोप ने कहा, \"सोफिया एक धूर्त है\"। जेम्स को यह कहते हुए सुना गया, \"याकूब एक धूर्त है यदि और केवल यदि सोफिया एक शूरवीर है\"। याकूब के अनुसार, \"यदि जेम्स एक धूर्त है तो जेम्स एक शूरवीर है\"। सोफिया के एक बयान में: \"याकूब एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक शूरवीर है  \n(2) जेम्स एक धूर्त है  \n(3) याकूब एक धूर्त है  \n(4) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एवा, डैनियल, जैक, और विलियम। \"अगर एवा एक शूरवीर है तो डैनियल एक शूरवीर है\" - एवा। डैनियल ने कहा कि अगर जैक एक शूरवीर है तो एवा एक शूरवीर है। जैक ने कहा कि अगर डैनियल एक धूर्त है तो डैनियल एक शूरवीर है। विलियम ने कहा कि जैक एक धूर्त नहीं है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक शूरवीर है  \n(2) डैनियल एक शूरवीर है  \n(3) जैक एक शूरवीर है  \n(4) विलियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ल्यूक, ओवेन, अलेक्जेंडर, और सेबेस्टियन। ल्यूक ने कहा कि अगर ओवेन एक धूर्त है तो अलेक्जेंडर एक शूरवीर है। \"ल्यूक एक धूर्त है और अलेक्जेंडर एक शूरवीर है\" - ओवेन। \"अगर सेबेस्टियन एक धूर्त है तो ल्यूक एक शूरवीर है,\" अलेक्जेंडर ने घोषित किया। \"ओवेन एक धूर्त है यदि और केवल यदि ल्यूक एक धूर्त है,\" सेबेस्टियन ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) ओवेन एक धूर्त है  \n(3) अलेक्जेंडर एक शूरवीर है  \n(4) सेबेस्टियन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एवलिन, जैक्सन, एवरी, और अलेक्जेंडर। एवलिन के एक बयान में: \"अलेक्जेंडर एक शूरवीर है यदि और केवल यदि जैक्सन एक शूरवीर है\"। जैक्सन ने कहा, \"एवरी एक धूर्त है यदि और केवल यदि एवलिन एक धूर्त है\"। एवरी को यह कहते हुए सुना गया, \"जैक्सन एक शूरवीर है\"। अलेक्जेंडर ने कहा कि जैक्सन एक शूरवीर है और एवरी एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक शूरवीर है  \n(2) जैक्सन एक धूर्त है  \n(3) एवरी एक धूर्त है  \n(4) अलेक्जेंडर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ऐडन, अमेलिया, सोफिया, और राइली। \"अमेलिया एक शूरवीर है या राइली एक धूर्त है,\" ऐडन ने घोषणा की। \"ऐडन एक धूर्त है या ऐडन एक शूरवीर है\" - अमेलिया। सोफिया ने आपको बताया कि राइली एक धूर्त है और राइली एक शूरवीर है। राइली ने नोट किया, \"ऐडन एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक शूरवीर है  \n(2) अमेलिया एक शूरवीर है  \n(3) सोफिया एक धूर्त है  \n(4) राइली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ओलिविया, एवलिन, डैनियल, और इसाबेला। ओलिविया ने कहा: \"एवलिन एक शूरवीर है या इसाबेला एक शूरवीर है\"। \"डैनियल एक धूर्त है,\" एवलिन ने दावा किया। डैनियल के अनुसार, \"एवलिन एक धूर्त है यदि और केवल यदि एवलिन एक शूरवीर है\"। इसाबेला ने कहा कि ओलिविया एक शूरवीर है या एवलिन एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक शूरवीर है  \n(2) एवलिन एक शूरवीर है  \n(3) डैनियल एक धूर्त है  \n(4) इसाबेला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: मेसन, राइली, डैनियल, और हेनरी। मेसन के शब्दों में: \"मेसन एक शूरवीर है और डैनियल एक शूरवीर है\"। राइली ने टिप्पणी की, \"हेनरी एक धूर्त है या डैनियल एक शूरवीर है\"। डैनियल ने कहा कि हेनरी एक धूर्त है यदि और केवल यदि मेसन एक धूर्त है। हेनरी के एक बयान में: \"डैनियल एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक शूरवीर है  \n(2) राइली एक शूरवीर है  \n(3) डैनियल एक शूरवीर है  \n(4) हेनरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: राइली, एवा, ओलिविया, और पेनलोप। \"ओलिविया एक शूरवीर है यदि और केवल यदि पेनलोप एक धूर्त है\" - राइली। एवा ने कहा कि राइली एक शूरवीर है यदि और केवल यदि पेनलोप एक धूर्त है। ओलिविया के अनुसार, \"पेनलोप एक शूरवीर है\"। पेनलोप ने आपको बताया कि राइली एक धूर्त है या एवा एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक धूर्त है  \n(2) एवा एक शूरवीर है  \n(3) ओलिविया एक शूरवीर है  \n(4) पेनलोप एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: माइकल, औरोरा, मेसन, और पेनलोप। माइकल ने कहा, \"मेसन एक धूर्त है यदि और केवल यदि मेसन एक शूरवीर है\"। औरोरा ने आपको बताया कि पेनलोप एक धूर्त है और माइकल एक शूरवीर है। मेसन ने कहा, \"पेनलोप एक धूर्त है\"। पेनलोप ने टिप्पणी की, \"माइकल एक धूर्त है और औरोरा एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक धूर्त है  \n(2) औरोरा एक धूर्त है  \n(3) मेसन एक शूरवीर है  \n(4) पेनलोप एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: सेबेस्टियन, ईथन, पेनलोप, और एवरी। सेबेस्टियन ने आपको बताया कि एवरी एक धूर्त नहीं है। \"सेबेस्टियन एक धूर्त है या पेनलोप एक धूर्त है,\" ईथन ने दावा किया। जैसे पेनलोप ने कहा, \"सेबेस्टियन एक धूर्त है और ईथन एक शूरवीर है\"। एवरी ने व्यक्त किया कि पेनलोप एक शूरवीर है और एवरी एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सेबेस्टियन एक धूर्त है  \n(2) ईथन एक शूरवीर है  \n(3) पेनलोप एक शूरवीर है  \n(4) एवरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एमिली, ल्यूक, स्कारलेट, और मिया। \"स्कारलेट शूरवीर नहीं है,\" एमिली ने कहा। ल्यूक ने टिप्पणी की, \"अगर एमिली धूर्त है तो मिया शूरवीर है।\" स्कारलेट ने कहा, \"एमिली धूर्त है और मिया शूरवीर है।\" मिया ने कहा: \"एमिली शूरवीर है और ल्यूक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक शूरवीर है  \n(2) ल्यूक एक शूरवीर है  \n(3) स्कारलेट एक धूर्त है  \n(4) मिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: याकूब, क्लोई, एवरी, और स्कारलेट। याकूब ने कहा, \"अगर स्कारलेट एक शूरवीर है तो क्लोई एक धूर्त है।\" \"अगर याकूब एक शूरवीर है तो एवरी एक शूरवीर है,\" क्लोई ने घोषित किया। एवरी ने टिप्पणी की, \"याकूब एक शूरवीर नहीं है।\" स्कारलेट ने remarked किया, \"याकूब एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) याकूब एक शूरवीर है  \n(2) क्लोई एक धूर्त है  \n(3) एवरी एक धूर्त है  \n(4) स्कारलेट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: लोगन, औरोरा, हार्पर, और जैक्सन। \"औरोरा एक धूर्त है और जैक्सन एक धूर्त है,\" लोगन ने कहा। \"जैक्सन एक धूर्त नहीं है,\" औरोरा ने घोषणा की। हार्पर ने कहा, \"हार्पर एक शूरवीर है।\" \"अगर लोगन एक धूर्त है तो हार्पर एक धूर्त है,\" जैक्सन ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक धूर्त है  \n(2) औरोरा एक शूरवीर है  \n(3) हार्पर एक धूर्त है  \n(4) जैक्सन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: हार्पर, बेंजामिन, डेविड, और एवा। \"बेंजामिन एक धूर्त है,\" हार्पर ने घोषणा की। बेंजामिन ने कहा कि डेविड एक शूरवीर है। \"हार्पर एक धूर्त है और एवा एक शूरवीर है,\" डेविड ने उल्लेख किया। एवा के एक बयान में: \"बेंजामिन एक धूर्त है या डेविड एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक शूरवीर है  \n(2) बेंजामिन एक धूर्त है  \n(3) डेविड एक धूर्त है  \n(4) एवा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: अलेक्जेंडर, जैक्सन, मैथ्यू, और एवरी। अलेक्जेंडर ने कहा: \"अगर एवरी एक शूरवीर है तो जैक्सन एक धूर्त है\"। जैक्सन ने कहा कि अलेक्जेंडर एक धूर्त है और अलेक्जेंडर एक शूरवीर है। जैसे मैथ्यू ने कहा, \"अलेक्जेंडर एक धूर्त है या एवरी एक धूर्त है\"। जैसे एवरी ने कहा, \"मैथ्यू एक शूरवीर है और मैथ्यू एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अलेक्जेंडर एक शूरवीर है  \n(2) जैक्सन एक धूर्त है  \n(3) मैथ्यू एक शूरवीर है  \n(4) एवरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एम्मा, स्कारलेट, हार्पर, और विलियम। \"हार्पर एक धूर्त है और एम्मा एक शूरवीर है\" - एम्मा। जैसा कि स्कारलेट ने कहा, \"विलियम एक धूर्त है या स्कारलेट एक शूरवीर है\"। \"विलियम एक शूरवीर है,\" हार्पर ने दावा किया। \"अगर स्कारलेट एक धूर्त है तो स्कारलेट एक शूरवीर है,\" विलियम ने उल्लेख किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एम्मा एक धूर्त है  \n(2) स्कारलेट एक शूरवीर है  \n(3) हार्पर एक शूरवीर है  \n(4) विलियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: विलियम, एवा, जैक, और अमेलिया। विलियम ने कहा, \"अमेलिया एक धूर्त है और जैक एक धूर्त है\"। एवा के अनुसार, \"अगर विलियम एक शूरवीर है तो विलियम एक धूर्त है\"। जैक ने कहा, \"अमेलिया एक धूर्त नहीं है।\" \"अगर अमेलिया एक शूरवीर है तो विलियम एक धूर्त है,\" अमेलिया ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक धूर्त है  \n(2) एवा एक शूरवीर है  \n(3) जैक एक शूरवीर है  \n(4) अमेलिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: डेविड, राइली, सेबेस्टियन, और एलिज़ाबेथ। जैसा कि डेविड ने कहा, \"सेबेस्टियन एक शूरवीर है\"। राइली ने कहा, \"एलिज़ाबेथ एक धूर्त नहीं है\"। \"डेविड एक शूरवीर है यदि और केवल यदि डेविड एक धूर्त है,\" सेबेस्टियन ने घोषणा की। \"डेविड एक शूरवीर है,\" एलिज़ाबेथ ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक धूर्त है  \n(2) राइली एक धूर्त है  \n(3) सेबेस्टियन एक धूर्त है  \n(4) एलिज़ाबेथ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: मेसन, सोफिया, विलियम, और एवा। जैसे मेसन ने कहा, \"अगर एवा एक शूरवीर है तो सोफिया एक धूर्त है।\" \"एवा एक धूर्त है,\" सोफिया ने कहा। विलियम ने कहा, \"अगर एवा एक शूरवीर है तो विलियम एक शूरवीर है।\" एवा के अनुसार, \"सोफिया एक शूरवीर है यदि और केवल यदि विलियम एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक शूरवीर है  \n(2) सोफिया एक धूर्त है  \n(3) विलियम एक धूर्त है  \n(4) एवा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एला, लिली, अमेलिया, और राइली। एला ने कहा, \"राइली एक शूरवीर है और राइली एक धूर्त है\"। लिली ने टिप्पणी की, \"अमेलिया एक धूर्त है और एला एक धूर्त है\"। अमेलिया के शब्दों में: \"एला एक धूर्त है\"। राइली के अनुसार, \"एला एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक धूर्त है  \n(2) लिली एक धूर्त है  \n(3) अमेलिया एक शूरवीर है  \n(4) राइली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एवलिन, विलियम, डेविड, और सेबेस्टियन। एवलिन ने कहा, \"डेविड एक धूर्त है।\" विलियम ने कहा, \"एवलिन एक शूरवीर नहीं है।\" \"विलियम एक धूर्त है यदि और केवल यदि सेबेस्टियन एक शूरवीर है,\" डेविड ने दावा किया। सेबेस्टियन के एक बयान में: \"सेबेस्टियन एक शूरवीर है यदि और केवल यदि विलियम एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक शूरवीर है  \n(2) विलियम एक धूर्त है  \n(3) डेविड एक धूर्त है  \n(4) सेबेस्टियन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: हेनरी, याकूब, शार्लट, और एला। हेनरी ने कहा, \"हेनरी एक शूरवीर है\"। याकूब ने टिप्पणी की, \"शार्लट एक धूर्त नहीं है\"। शार्लट ने कहा कि अगर एला एक शूरवीर है तो हेनरी एक धूर्त है। एला के शब्दों में: \"शार्लट एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हेनरी एक धूर्त है  \n(2) याकूब एक शूरवीर है  \n(3) शार्लट एक शूरवीर है  \n(4) एला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एम्मा, लिली, एवरी, और एलिज़ाबेथ। \"एलिज़ाबेथ एक धूर्त नहीं है\" - एम्मा। जैसा कि लिली ने कहा, \"एम्मा एक शूरवीर है यदि और केवल यदि एलिज़ाबेथ एक शूरवीर है\"। एवरी ने नोट किया, \"एम्मा एक धूर्त है यदि और केवल यदि एलिज़ाबेथ एक धूर्त है\"। \"यदि एलिज़ाबेथ एक शूरवीर है तो लिली एक शूरवीर है,\" एलिज़ाबेथ ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एम्मा एक शूरवीर है  \n(2) लिली एक शूरवीर है  \n(3) एवरी एक शूरवीर है  \n(4) एलिज़ाबेथ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: माइकल, सोफिया, याकूब, और सैमुएल। माइकल ने कहा, \"याकूब एक धूर्त है या सैमुएल एक शूरवीर है\"। सोफिया ने कहा कि माइकल एक शूरवीर है यदि और केवल यदि याकूब एक धूर्त है। याकूब के एक बयान में: \"माइकल एक शूरवीर नहीं है\"। जैसा कि सैमुएल ने कहा, \"याकूब एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक शूरवीर है  \n(2) सोफिया एक शूरवीर है  \n(3) याकूब एक धूर्त है  \n(4) सैमुएल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: सेबेस्टियन, जेम्स, याकूब, और जैक। सेबेस्टियन ने आपको बताया कि याकूब एक धूर्त नहीं है। जेम्स को यह कहते हुए सुना गया, \"जैक एक धूर्त नहीं है\"। याकूब ने asserted किया: \"सेबेस्टियन एक धूर्त है यदि और केवल यदि जेम्स एक धूर्त है\"। \"याकूब एक शूरवीर नहीं है,\" जैक ने उल्लेख किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सेबेस्टियन एक धूर्त है  \n(2) जेम्स एक शूरवीर है  \n(3) याकूब एक धूर्त है  \n(4) जैक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: मिया, जैक्सन, लुकास, और हार्पर। मिया ने कहा, \"अगर मिया एक शूरवीर है तो हार्पर एक धूर्त है।\" जैक्सन ने टिप्पणी की, \"जैक्सन एक शूरवीर है।\" लुकास ने remarked किया, \"जैक्सन एक शूरवीर है यदि और केवल यदि हार्पर एक शूरवीर है।\" हार्पर को यह कहते हुए सुना गया, \"लुकास एक धूर्त है यदि और केवल यदि हार्पर एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक शूरवीर है  \n(2) जैक्सन एक शूरवीर है  \n(3) लुकास एक धूर्त है  \n(4) हार्पर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: अबिगेल, एम्मा, हेनरी, और इसाबेला। अबिगेल ने कहा, \"हेनरी एक शूरवीर है यदि और केवल यदि एम्मा एक शूरवीर है।\" \"इसाबेला एक धूर्त है\" - एम्मा। हेनरी ने कहा कि इसाबेला एक शूरवीर है और अबिगेल एक शूरवीर है। इसाबेला ने कहा, \"यदि अबिगेल एक धूर्त है तो अबिगेल एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अबिगेल एक धूर्त है  \n(2) एम्मा एक शूरवीर है  \n(3) हेनरी एक धूर्त है  \n(4) इसाबेला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ईथन, अमेलिया, ओलिविया, और ऐडन। ईथन ने कहा, \"अगर ओलिविया एक शूरवीर है तो अमेलिया एक धूर्त है।\" अमेलिया के अनुसार, \"ऐडन एक शूरवीर है या ओलिविया एक धूर्त है।\" \"अगर ईथन एक शूरवीर है तो ईथन एक धूर्त है,\" ओलिविया ने घोषणा की। ऐडन ने कहा कि अमेलिया एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक शूरवीर है  \n(2) अमेलिया एक शूरवीर है  \n(3) ओलिविया एक धूर्त है  \n(4) ऐडन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: डैनियल, अबिगेल, एवा, और हार्पर। जैसा कि डैनियल ने कहा, \"अबिगेल एक धूर्त है यदि और केवल यदि एवा एक धूर्त है\"। \"एवा एक धूर्त नहीं है,\" अबिगेल ने कहा। एवा को यह कहते हुए सुना गया, \"डैनियल एक शूरवीर है या डैनियल एक धूर्त है\"। जैसा कि हार्पर ने कहा, \"एवा एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक शूरवीर है  \n(2) अबिगेल एक शूरवीर है  \n(3) एवा एक शूरवीर है  \n(4) हार्पर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: स्कारलेट, ग्रेस, याकूब, और एमिली। स्कारलेट ने आपको बताया कि ग्रेस एक धूर्त है यदि और केवल यदि एमिली एक धूर्त है। ग्रेस ने कहा: \"स्कारलेट एक धूर्त है\"। याकूब के शब्दों में: \"यदि एमिली एक शूरवीर है तो एमिली एक धूर्त है\"। जैसा कि एमिली ने कहा, \"स्कारलेट एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) स्कारलेट एक धूर्त है  \n(2) ग्रेस एक शूरवीर है  \n(3) याकूब एक शूरवीर है  \n(4) एमिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: माइकल, ईथन, लोगन, और सोफिया। माइकल के एक बयान में: \"ईथन एक धूर्त है या माइकल एक शूरवीर है\"। ईथन ने कहा, \"अगर माइकल एक शूरवीर है तो ईथन एक शूरवीर है\"। लोगन ने कहा, \"अगर सोफिया एक धूर्त है तो ईथन एक धूर्त है\"। सोफिया ने कहा, \"लोगन एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक शूरवीर है  \n(2) ईथन एक धूर्त है  \n(3) लोगन एक शूरवीर है  \n(4) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: ल्यूक, जैक्सन, ग्रेस, और सोफिया। ल्यूक के एक बयान में: \"ग्रेस एक शूरवीर है और जैक्सन एक धूर्त है\"। जैक्सन ने कहा कि सोफिया एक धूर्त है और ल्यूक एक शूरवीर है। ग्रेस ने आपको बताया कि सोफिया एक शूरवीर है। सोफिया ने कहा: \"जैक्सन एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) जैक्सन एक धूर्त है  \n(3) ग्रेस एक शूरवीर है  \n(4) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: अमेलिया, जैक्सन, डेविड, और सोफिया। अमेलिया ने कहा कि अगर जैक्सन एक शूरवीर है तो सोफिया एक शूरवीर है। \"डेविड एक धूर्त है या जैक्सन एक शूरवीर है\" - जैक्सन। डेविड ने आपको बताया कि सोफिया एक शूरवीर है। सोफिया ने कहा कि डेविड एक शूरवीर है और अमेलिया एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक धूर्त है  \n(2) जैक्सन एक शूरवीर है  \n(3) डेविड एक धूर्त है  \n(4) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: एवा, एला, मैथ्यू, और नूह। एवा ने कहा: \"मैथ्यू एक धूर्त है यदि और केवल यदि मैथ्यू एक शूरवीर है\"। एला ने कहा, \"यदि मैथ्यू एक धूर्त है तो नूह एक शूरवीर है\"। \"यदि एला एक शूरवीर है तो एला एक धूर्त है\" - मैथ्यू। नूह को यह कहते हुए सुना गया, \"यदि एवा एक धूर्त है तो मैथ्यू एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक धूर्त है  \n(2) एला एक शूरवीर है  \n(3) मैथ्यू एक धूर्त है  \n(4) नूह एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: मैथ्यू, एम्मा, मेसन, और याकूब। \"एम्मा एक धूर्त है,\" मैथ्यू ने घोषित किया। एम्मा के शब्दों में: \"मेसन एक शूरवीर है\"। मेसन ने नोट किया, \"एम्मा एक धूर्त है और मैथ्यू एक धूर्त है\"। जैसा कि याकूब ने कहा, \"मेसन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक शूरवीर है  \n(2) एम्मा एक धूर्त है  \n(3) मेसन एक धूर्त है  \n(4) याकूब एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: विक्टोरिया, डेविड, ईथन, और स्कारलेट। विक्टोरिया ने कहा कि विक्टोरिया एक शूरवीर है यदि और केवल यदि ईथन एक शूरवीर है। \"विक्टोरिया एक धूर्त है और स्कारलेट एक धूर्त है\" - डेविड। ईथन ने कहा, \"डेविड एक धूर्त है यदि और केवल यदि स्कारलेट एक शूरवीर है\"। स्कारलेट ने कहा, \"डेविड एक धूर्त है यदि और केवल यदि विक्टोरिया एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विक्टोरिया एक शूरवीर है  \n(2) डेविड एक धूर्त है  \n(3) ईथन एक शूरवीर है  \n(4) स्कारलेट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: हेनरी, डैनियल, सेबेस्टियन, और जेम्स। हेनरी ने कहा, \"डैनियल एक धूर्त है या जेम्स एक शूरवीर है\"। डैनियल ने कहा, \"सेबेस्टियन एक शूरवीर है या सेबेस्टियन एक धूर्त है\"। \"अगर जेम्स एक धूर्त है तो डैनियल एक धूर्त है,\" सेबेस्टियन ने कहा। जेम्स ने टिप्पणी की, \"अगर सेबेस्टियन एक शूरवीर है तो हेनरी एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हेनरी एक शूरवीर है  \n(2) डैनियल एक शूरवीर है  \n(3) सेबेस्टियन एक शूरवीर है  \n(4) जेम्स एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: अमेलिया, जैक, एम्मा, और डेविड। अमेलिया ने कहा: \"डेविड धूर्त नहीं है\"। जैक ने कहा, \"डेविड धूर्त है\"। एम्मा ने कहा, \"अगर एम्मा शूरवीर है तो अमेलिया धूर्त है।\" डेविड ने कहा, \"डेविड शूरवीर है और जैक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक धूर्त है  \n(2) जैक एक शूरवीर है  \n(3) एम्मा एक शूरवीर है  \n(4) डेविड एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: हेनरी, विक्टोरिया, एवरी, और एम्मा। हेनरी के शब्दों में: \"विक्टोरिया एक धूर्त है\"। विक्टोरिया ने कहा: \"अगर हेनरी एक शूरवीर है तो एवरी एक शूरवीर है\"। एवरी ने कहा, \"विक्टोरिया एक शूरवीर नहीं है\"। \"एवरी एक धूर्त है और हेनरी एक धूर्त है,\" एम्मा ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हेनरी एक धूर्त है  \n(2) विक्टोरिया एक शूरवीर है  \n(3) एवरी एक धूर्त है  \n(4) एम्मा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: लियम, ओवेन, मेसन, और ओलिवर। लियम ने कहा कि मेसन एक धूर्त है और ओलिवर एक धूर्त है। \"लियम एक शूरवीर है यदि और केवल यदि लियम एक धूर्त है,\" ओवेन ने उल्लेख किया। जैसा कि मेसन ने कहा, \"ओलिवर एक शूरवीर है यदि और केवल यदि लियम एक शूरवीर है\"। ओलिवर के अनुसार, \"मेसन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक शूरवीर है  \n(2) ओवेन एक धूर्त है  \n(3) मेसन एक धूर्त है  \n(4) ओलिवर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 4 निवासियों से मिलते हैं: स्कारलेट, ओलिविया, मेसन, और एलिज़ाबेथ। स्कारलेट ने टिप्पणी की, \"मेसन धूर्त नहीं है\"। ओलिविया के शब्दों में: \"मेसन शूरवीर है या एलिज़ाबेथ शूरवीर है\"। मेसन ने कहा कि एलिज़ाबेथ शूरवीर नहीं है। एलिज़ाबेथ के एक बयान में: \"एलिज़ाबेथ शूरवीर है यदि और केवल यदि मेसन शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) स्कारलेट एक शूरवीर है  \n(2) ओलिविया एक शूरवीर है  \n(3) मेसन एक शूरवीर है  \n(4) एलिज़ाबेथ एक धूर्त है"
    }
]