[
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：奥利弗和伊森。奥利弗告诉你，奥利弗是骑士或者伊森是无赖。在伊森的陈述中：“奥利弗是骑士”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利弗是一名骑士  \n(2) 伊森是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：迈克尔和雅各布。迈克尔说：“雅各布是一个无赖。”雅各布宣称：“当且仅当迈克尔是骑士时，迈克尔才是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 迈克尔是一名骑士  \n(2) 雅各布是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：阿梅莉亚和哈珀。阿梅莉亚被听到说：“哈珀是骑士或者哈珀是无赖。”哈珀声称：“阿梅莉亚是骑士并且阿梅莉亚是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是一名骑士  \n(2) 哈珀是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：洛根和莉莉。洛根说：“莉莉不是无赖。”莉莉则表示洛根是无赖，而莉莉是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是无赖  \n(2) 莉莉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：杰克和伊芙琳。杰克说：“伊芙琳是骑士或者伊芙琳是无赖。”伊芙琳则声称：“如果杰克是无赖，那么伊芙琳就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克是一名骑士  \n(2) 伊芙琳是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：塞缪尔和阿丽亚。塞缪尔说：“阿丽亚是骑士当且仅当阿丽亚是无赖。”阿丽亚评论道：“塞缪尔是无赖或者塞缪尔是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是一个无赖  \n(2) 阿丽亚是一个骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：丹尼尔和利亚姆。丹尼尔的陈述是：“如果且仅如果丹尼尔是骑士，利亚姆就是无赖。”利亚姆说：“丹尼尔是骑士或者利亚姆是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是无赖  \n(2) 利亚姆是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾娃和亨利。艾娃告诉你亨利是骑士或者亨利是无赖。亨利声称：“艾娃是骑士当且仅当艾娃是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是一名骑士  \n(2) 亨利是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：佩内洛普和亚历山大。佩内洛普声称：“如果佩内洛普是骑士，那么亚历山大就是骑士。”根据亚历山大的说法，“佩内洛普是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是一名骑士  \n(2) 亚历山大是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：赖利和索菲娅。赖利说：“索菲娅是骑士当且仅当索菲娅是无赖。”索菲娅则说道：“赖利是无赖或者索菲娅是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是一个无赖  \n(2) 索菲娅是一个骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：利亚姆和本杰明。利亚姆说，如果本杰明是无赖，那么利亚姆就是骑士。“利亚姆是骑士或者利亚姆是无赖，”本杰明宣称。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是一名骑士  \n(2) 本杰明是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：斯嘉丽和阿丽亚。斯嘉丽提到：“阿丽亚是无赖，阿丽亚是骑士。”阿丽亚说：“斯嘉丽是骑士当且仅当斯嘉丽是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 斯嘉丽是无赖  \n(2) 阿丽亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：哈珀和卢克。哈珀被听到说：“卢克是骑士。”卢克宣称：“哈珀是骑士当且仅当卢克是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是一名骑士  \n(2) 卢克是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾娃和夏洛特。艾娃表示夏洛特是一个无赖。夏洛特声称：“艾娃是骑士当且仅当夏洛特是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是一名骑士  \n(2) 夏洛特是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：约瑟夫和塞缪尔。约瑟夫说：“塞缪尔是骑士，而塞缪尔是无赖。”塞缪尔表示，只有当约瑟夫是无赖时，约瑟夫才是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是无赖  \n(2) 塞缪尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：塞巴斯蒂安和本杰明。塞巴斯蒂安声称：“如果塞巴斯蒂安是骑士，那么本杰明就是无赖。”本杰明说：“塞巴斯蒂安是骑士，而塞巴斯蒂安是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞巴斯蒂安是一名骑士  \n(2) 本杰明是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：阿梅莉亚和雅各布。阿梅莉亚说雅各布是骑士，而雅各布是无赖。雅各布评论道：“如果阿梅莉亚是无赖，那么阿梅莉亚就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是无赖  \n(2) 雅各布是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：阿比盖尔和哈珀。阿比盖尔声称：“如果阿比盖尔是骑士，那么哈珀就是骑士。”根据哈珀的说法，“阿比盖尔是骑士或者哈珀是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是一名骑士  \n(2) 哈珀是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：斯嘉丽和约瑟夫。斯嘉丽声称：“如果且仅如果约瑟夫是无赖，斯嘉丽就是骑士。”约瑟夫被听到说：“如果斯嘉丽是无赖，那么约瑟夫就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 斯嘉丽是无赖  \n(2) 约瑟夫是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：丹尼尔和赖利。根据丹尼尔的说法，“赖利不是骑士”。赖利宣称：“丹尼尔是骑士当且仅当赖利是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是一名骑士  \n(2) 赖利是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：伊丽莎白和奥利弗。伊丽莎白提到：“奥利弗不是无赖。”奥利弗则说：“奥利弗是骑士或者伊丽莎白是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是一名骑士  \n(2) 奥利弗是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：丹尼尔和阿比盖尔。根据丹尼尔的说法，“阿比盖尔是无赖，阿比盖尔是骑士”。阿比盖尔则指出，“丹尼尔是骑士或者丹尼尔是无赖”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是无赖  \n(2) 阿比盖尔是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：索菲娅和洛根。索菲娅宣称：“洛根是骑士或者洛根是无赖。”洛根声称：“索菲娅是骑士或者索菲娅是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 洛根是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：夏洛特和亚历山大。夏洛特说：“如果亚历山大是骑士，那么亚历山大就是无赖。”亚历山大宣称：“夏洛特是骑士或者亚历山大是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是无赖  \n(2) 亚历山大是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：夏洛特和艾登。夏洛特告诉你艾登是一个无赖。艾登说：“夏洛特是一个无赖或者夏洛特是一个骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是无赖  \n(2) 艾登是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：夏洛特和斯嘉丽。夏洛特说：“斯嘉丽是骑士，斯嘉丽是无赖。”斯嘉丽则说：“斯嘉丽是骑士，夏洛特是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是无赖  \n(2) 斯嘉丽是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：奥利维亚和亨利。奥利维亚声称：“亨利是骑士或者亨利是无赖。”在亨利的话中：“奥利维亚是无赖并且奥利维亚是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是一名骑士  \n(2) 亨利是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：丹尼尔和莉莉。丹尼尔被听到说：“如果莉莉是骑士，那么莉莉就是无赖。”莉莉被听到说：“莉莉是骑士或者丹尼尔是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是无赖  \n(2) 莉莉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：杰克和本杰明。杰克告诉你，本杰明是骑士或者杰克是骑士。本杰明则说：“如果杰克是骑士，那么杰克就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克是骑士  \n(2) 本杰明是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：丹尼尔和塞缪尔。丹尼尔说：“塞缪尔是无赖或者塞缪尔是骑士。”塞缪尔说塞缪尔是骑士或者丹尼尔是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是一名骑士  \n(2) 塞缪尔是一名骑士"
    },
    {
        "quiz": "一个非常特别的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：利亚姆和阿丽亚。“阿丽亚不是无赖”——利亚姆。阿丽亚声称：“阿丽亚是骑士当且仅当利亚姆是骑士”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是一名骑士  \n(2) 阿丽亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：威廉和诺亚。威廉表示诺亚是无赖或者诺亚是骑士。在诺亚的陈述中：“威廉是骑士当且仅当威廉是无赖”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 诺亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：米娅和阿丽亚。米娅宣称：“米娅是骑士或者阿丽亚是骑士。”阿丽亚说：“如果米娅是骑士，那么米娅就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是骑士  \n(2) 阿丽亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：奥萝拉和夏洛特。奥萝拉说：“夏洛特是骑士当且仅当奥萝拉是骑士。”夏洛特则说：“如果夏洛特是骑士，那么奥萝拉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥萝拉是一名骑士  \n(2) 夏洛特是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：克洛伊和雅各布。克洛伊说：“雅各布是骑士，雅各布是无赖。”雅各布则声称：“克洛伊是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 克洛伊是无赖  \n(2) 雅各布是骑士"
    },
    {
        "quiz": "一个非常特别的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：利亚姆和洛根。利亚姆被听到说：“利亚姆是骑士当且仅当洛根是无赖。”洛根说：“利亚姆不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是无赖  \n(2) 洛根是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：塞缪尔和伊莎贝拉。“伊莎贝拉是骑士”——塞缪尔。伊莎贝拉说塞缪尔是无赖，而她自己是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是无赖  \n(2) 伊莎贝拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：本杰明和莉莉。在本杰明的话中：“如果莉莉是无赖，那么莉莉就是骑士。”莉莉宣称：“本杰明是无赖，本杰明是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是无赖  \n(2) 莉莉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：梅森和佐伊。梅森说：“佐伊是骑士，而佐伊是无赖。”佐伊则声称：“梅森是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是无赖  \n(2) 佐伊是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：索菲娅和夏洛特。索菲娅评论道：“如果索菲娅是骑士，那么夏洛特就是无赖。”夏洛特说：“索菲娅是无赖，而索菲娅是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 夏洛特是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：威廉和大卫。威廉说：“大卫是无赖，而大卫是骑士。”大卫则说：“如果威廉是骑士，那么大卫就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是无赖  \n(2) 大卫是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：索菲娅和诺亚。“如果索菲娅是骑士，那么诺亚就是无赖。”——索菲娅。诺亚则说：“如果索菲娅是骑士，那么诺亚就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 诺亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：夏洛特和伊芙琳。夏洛特说：“如果夏洛特是骑士，那么伊芙琳就是骑士。”伊芙琳说：“当且仅当夏洛特是骑士时，伊芙琳才是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是一名骑士  \n(2) 伊芙琳是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：丹尼尔和杰克。丹尼尔表示，如果丹尼尔是骑士，那么杰克就是骑士。“杰克是骑士，”杰克提到。那谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是一名骑士  \n(2) 杰克是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：伊芙琳和哈珀。“哈珀不是骑士，”伊芙琳提到。根据哈珀的话：“伊芙琳是无赖当且仅当伊芙琳是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是一名骑士  \n(2) 哈珀是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：艾弗里和迈克尔。艾弗里提到：“艾弗里是骑士当且仅当迈克尔是无赖。”迈克尔宣称：“艾弗里不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是骑士  \n(2) 迈克尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：伊丽莎白和奥萝拉。根据伊丽莎白的说法，“伊丽莎白是骑士当且仅当奥萝拉是骑士”。奥萝拉则说：“伊丽莎白是骑士”。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是一名骑士  \n(2) 奥萝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：赖利和本杰明。赖利说：“赖利是骑士或者本杰明是无赖。”本杰明则断言：“当且仅当本杰明是骑士时，赖利才是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是无赖  \n(2) 本杰明是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：佩内洛普和奥利弗。佩内洛普说，如果且仅如果佩内洛普是骑士，那么奥利弗就是无赖。奥利弗表示，如果佩内洛普是无赖，那么佩内洛普就是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是无赖  \n(2) 奥利弗是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：克洛伊和詹姆斯。正如克洛伊所说：“詹姆斯是一个无赖。”根据詹姆斯的说法：“如果且仅如果詹姆斯是骑士，克洛伊就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 克洛伊是无赖  \n(2) 詹姆斯是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：亨利和大卫。亨利提到：“大卫是无赖，而大卫是骑士。”在大卫的陈述中：“亨利是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是无赖  \n(2) 大卫是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：伊芙琳和伊丽莎白。伊芙琳告诉你，只有当伊丽莎白是无赖时，伊芙琳才是骑士。“伊芙琳是骑士”——伊丽莎白。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是无赖  \n(2) 伊丽莎白是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：杰克逊和伊丽莎白。杰克逊说：“伊丽莎白是无赖，而杰克逊是骑士。”伊丽莎白宣称：“如果杰克逊是无赖，那么杰克逊就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是一个无赖  \n(2) 伊丽莎白是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾登和艾玛。艾登说：“艾登是骑士，艾玛是骑士。”艾玛说：“如果艾玛是骑士，那么艾登就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是一名骑士  \n(2) 艾玛是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：塞巴斯蒂安和艾娃。塞巴斯蒂安说：“艾娃是骑士。”艾娃宣称：“如果塞巴斯蒂安是骑士，那么艾娃就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞巴斯蒂安是一名骑士  \n(2) 艾娃是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：詹姆斯和奥利弗。詹姆斯声称：“如果奥利弗是无赖，那么奥利弗就是骑士。”奥利弗告诉你，詹姆斯是骑士或者詹姆斯是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是一名骑士  \n(2) 奥利弗是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：赖利和马修。赖利声称：“马修是无赖或者马修是骑士。”马修则说道：“如果赖利是无赖，那么马修就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是一名骑士  \n(2) 马修是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：杰克逊和迈克尔。杰克逊说：“如果杰克逊是骑士，那么迈克尔就是无赖。”迈克尔则说：“杰克逊不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是一名骑士  \n(2) 迈克尔是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：佩内洛普和亚历山大。佩内洛普说：“亚历山大是骑士。”亚历山大宣称：“当且仅当佩内洛普是骑士时，佩内洛普才是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是无赖  \n(2) 亚历山大是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：阿丽亚和诺亚。阿丽亚提到：“诺亚不是骑士。”诺亚宣称：“阿丽亚是无赖当且仅当诺亚是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿丽亚是无赖  \n(2) 诺亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：诺亚和杰克逊。诺亚说：“如果且仅如果诺亚是骑士，杰克逊就是无赖。”杰克逊告诉你：“如果诺亚是骑士，那么诺亚就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是一名骑士  \n(2) 杰克逊是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾娃和伊森。艾娃声称：“当且仅当伊森是无赖时，艾娃才是骑士。”伊森说：“伊森是骑士或者艾娃是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是一名骑士  \n(2) 伊森是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：阿比盖尔和维多利亚。阿比盖尔说：“如果维多利亚是无赖，那么维多利亚就是骑士。”维多利亚的陈述是：“维多利亚是骑士，阿比盖尔是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是无赖  \n(2) 维多利亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：约瑟夫和杰克逊。“如果杰克逊是骑士，那么约瑟夫就是骑士。”——约瑟夫说。“如果杰克逊是骑士，那么约瑟夫就是骑士，”杰克逊声称。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 约瑟夫是一名骑士  \n(2) 杰克逊是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：诺亚和夏洛特。诺亚告诉你，夏洛特是骑士，而诺亚也是骑士。夏洛特被听到说：“当且仅当诺亚是骑士时，夏洛特才是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是骑士  \n(2) 夏洛特是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾弗里和克洛伊。艾弗里说克洛伊是骑士，而克洛伊是无赖。“艾弗里不是骑士，”克洛伊提到。那谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是无赖  \n(2) 克洛伊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：伊芙琳和艾娃。伊芙琳声称：“如果伊芙琳是骑士，那么艾娃就是骑士。”艾娃告诉你，艾娃是骑士或者伊芙琳是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是一名骑士  \n(2) 艾娃是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：马修和维多利亚。马修说：“维多利亚不是骑士。”维多利亚说：“维多利亚是骑士，马修是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是一名骑士  \n(2) 维多利亚是一名无赖"
    },
    {
        "quiz": "一个非常特别的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：丹尼尔和威廉。丹尼尔宣称：“威廉是骑士，或者丹尼尔是骑士。”威廉表示丹尼尔是骑士，或者丹尼尔是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 丹尼尔是一名骑士  \n(2) 威廉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：卢克和亚历山大。卢克说：“如果卢克是骑士，那么亚历山大就是无赖。”亚历山大说：“亚历山大是骑士，卢克也是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 亚历山大是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：米娅和塞缪尔。米娅表示米娅是骑士，塞缪尔是骑士。塞缪尔表示米娅是骑士，而米娅是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 米娅是无赖  \n(2) 塞缪尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：利亚姆和亨利。利亚姆说：“利亚姆是骑士当且仅当亨利是骑士。”亨利说：“利亚姆不是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是一名骑士  \n(2) 亨利是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：奥利维亚和约瑟夫。“如果约瑟夫是骑士，那么奥利维亚就是骑士。”——奥利维亚。约瑟夫评论道：“如果且仅如果奥利维亚是骑士，那么奥利维亚就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是一名骑士  \n(2) 约瑟夫是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：杰克和杰克逊。杰克声称：“杰克是骑士，而杰克逊是无赖。”杰克逊告诉你，杰克不是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克是一个无赖  \n(2) 杰克逊是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：伊芙琳和伊森。伊芙琳的陈述是：“当且仅当伊森是无赖时，伊芙琳才是骑士。”而伊森则说：“当且仅当伊芙琳是无赖时，伊森才是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是无赖  \n(2) 伊森是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾弗里和奥萝拉。艾弗里评论道：“如果奥萝拉是骑士，那么艾弗里就是骑士。”而奥萝拉则说：“艾弗里是骑士，艾弗里是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是一名骑士  \n(2) 奥萝拉是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：伊莎贝拉和伊芙琳。伊莎贝拉说：“伊芙琳不是骑士。”伊芙琳则说：“伊莎贝拉是无赖或者伊莎贝拉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是无赖  \n(2) 伊芙琳是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：塞缪尔和斯嘉丽。塞缪尔宣称：“如果斯嘉丽是无赖，那么塞缪尔就是骑士。”斯嘉丽宣称：“塞缪尔不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞缪尔是一名骑士  \n(2) 斯嘉丽是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：詹姆斯和塞缪尔。詹姆斯表示塞缪尔是骑士，或者詹姆斯是骑士。塞缪尔声称：“詹姆斯是无赖，或者詹姆斯是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是一名骑士  \n(2) 塞缪尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：哈珀和佐伊。哈珀评论道：“佐伊是无赖当且仅当佐伊是骑士。”佐伊被听到说：“哈珀是无赖或者哈珀是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是无赖  \n(2) 佐伊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：赖利和伊丽莎白。赖利说：“如果伊丽莎白是无赖，那么伊丽莎白就是骑士。”伊丽莎白说：“赖利是无赖或者赖利是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是一名骑士  \n(2) 伊丽莎白是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：哈珀和伊丽莎白。哈珀说道：“伊丽莎白是骑士，而伊丽莎白是无赖。”根据伊丽莎白的说法，“伊丽莎白是骑士或者哈珀是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是无赖  \n(2) 伊丽莎白是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾弗里和利亚姆。在艾弗里的话中：“艾弗里是骑士或者利亚姆是骑士。”在利亚姆的陈述中：“利亚姆是骑士当且仅当艾弗里是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是无赖  \n(2) 利亚姆是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：索菲娅和艾米莉。索菲娅说：“如果艾米莉是骑士，那么艾米莉就是无赖。”艾米莉则说：“如果索菲娅是无赖，那么艾米莉就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 艾米莉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾拉和雅各布。“雅各布是一个无赖，”艾拉宣称。雅各布声称：“如果雅各布是骑士，那么艾拉就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是无赖  \n(2) 雅各布是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：杰克和阿丽亚。杰克宣称：“如果杰克是骑士，那么阿丽亚就是无赖。”阿丽亚告诉你杰克是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克是一名骑士  \n(2) 阿丽亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾娃和卢卡斯。艾娃告诉你卢卡斯是骑士。“卢卡斯是骑士，而艾娃是无赖，”卢卡斯提到。那谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是无赖  \n(2) 卢卡斯是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：梅森和奥利弗。梅森提到：“如果且仅如果奥利弗是骑士，那么奥利弗就是无赖。”奥利弗宣称：“如果且仅如果梅森是无赖，那么梅森就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是无赖  \n(2) 奥利弗是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：阿梅莉亚和奥萝拉。阿梅莉亚提到：“奥萝拉不是无赖。”奥萝拉说：“阿梅莉亚是无赖或者阿梅莉亚是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是一名骑士  \n(2) 奥萝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：阿梅莉亚和雅各布。“雅各布是骑士，雅各布是无赖，”阿梅莉亚宣称。雅各布的陈述是：“如果阿梅莉亚是骑士，那么雅各布就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是无赖  \n(2) 雅各布是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：斯嘉丽和威廉。在斯嘉丽的话中：“威廉是骑士当且仅当威廉是无赖。”威廉被听到说：“如果斯嘉丽是无赖，那么斯嘉丽就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 斯嘉丽是无赖  \n(2) 威廉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：梅森和哈珀。梅森的陈述是：“哈珀是无赖，而梅森是骑士。”哈珀则说：“梅森是骑士或者梅森是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是无赖  \n(2) 哈珀是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：卢克和格蕾丝。卢克告诉你，格蕾丝是无赖或者格蕾丝是骑士。格蕾丝声称：“如果格蕾丝是骑士，那么卢克就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一名骑士  \n(2) 格蕾丝是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾弗里和詹姆斯。艾弗里说：“詹姆斯是一个无赖。”詹姆斯则说：“詹姆斯是一个骑士，而艾弗里也是一个骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是骑士  \n(2) 詹姆斯是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：杰克逊和莉莉。杰克逊宣称：“莉莉是无赖或者杰克逊是骑士。”莉莉说：“杰克逊是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是骑士  \n(2) 莉莉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：欧文和斯嘉丽。欧文表示欧文是骑士，而斯嘉丽是无赖。斯嘉丽说，如果斯嘉丽是骑士，那么欧文就是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是无赖  \n(2) 斯嘉丽是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾玛和伊莎贝拉。根据艾玛的说法，“如果伊莎贝拉是骑士，那么艾玛就是骑士。”伊莎贝拉则表示，“如果艾玛是无赖，那么艾玛就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是一名骑士  \n(2) 伊莎贝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：诺亚和马修。“马修是骑士，”诺亚提到。马修评论道：“诺亚是骑士当且仅当诺亚是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是无赖  \n(2) 马修是无赖"
    },
    {
        "quiz": "一个非常特别的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：利亚姆和大卫。利亚姆说大卫是无赖或者利亚姆是骑士。大卫声称：“如果大卫是骑士，那么利亚姆就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是一名骑士  \n(2) 大卫是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：伊丽莎白和诺亚。伊丽莎白告诉你，只有当诺亚是无赖时，伊丽莎白才是骑士。“伊丽莎白是无赖，”诺亚声称。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是一名骑士  \n(2) 诺亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：奥利维亚和杰克。奥利维亚声称：“如果杰克是骑士，那么奥利维亚就是骑士。”杰克则说：“奥利维亚是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是一名骑士  \n(2) 杰克是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：伊森和伊丽莎白。伊森说：“伊丽莎白是无赖，而伊丽莎白是骑士。”伊丽莎白说：“伊森是骑士，而伊丽莎白是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是无赖  \n(2) 伊丽莎白是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：利亚姆和诺亚。利亚姆说道：“如果诺亚是无赖，那么利亚姆就是骑士。”诺亚表示：“如果诺亚是骑士，那么利亚姆就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是一名骑士  \n(2) 诺亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：伊莎贝拉和艾玛。伊莎贝拉声称：“艾玛是骑士或者艾玛是无赖。”艾玛告诉你，伊莎贝拉是骑士或者艾玛是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是一名骑士  \n(2) 艾玛是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：大卫和艾娃。大卫宣称：“艾娃是无赖当且仅当艾娃是骑士。”艾娃则声称：“大卫是骑士，艾娃是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 大卫是无赖  \n(2) 艾娃是无赖"
    },
    {
        "quiz": "一个非常特别的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：洛根和艾拉。洛根说：“如果洛根是骑士，那么艾拉就是无赖。”艾拉宣称：“艾拉是骑士，而洛根是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是一名骑士  \n(2) 艾拉是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：索菲娅和阿丽亚。在索菲娅的话中：“阿丽亚是无赖当且仅当阿丽亚是骑士。”在阿丽亚的话中：“索菲娅是无赖并且索菲娅是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 阿丽亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：塞巴斯蒂安和艾娃。正如塞巴斯蒂安所说：“艾娃是骑士当且仅当塞巴斯蒂安是骑士。”根据艾娃的说法，“艾娃是骑士当且仅当塞巴斯蒂安是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞巴斯蒂安是一名骑士  \n(2) 艾娃是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：卢卡斯和塞巴斯蒂安。卢卡斯说：“塞巴斯蒂安是无赖，而卢卡斯是骑士。”塞巴斯蒂安则说：“卢卡斯是骑士当且仅当塞巴斯蒂安是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是一名骑士  \n(2) 塞巴斯蒂安是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：马修和伊丽莎白。马修说：“当且仅当伊丽莎白是骑士时，马修才是骑士。”伊丽莎白说：“如果马修是骑士，那么马修就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 马修是无赖  \n(2) 伊丽莎白是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾拉和伊莎贝拉。艾拉告诉你伊莎贝拉是一个无赖。伊莎贝拉说艾拉是骑士当且仅当艾拉是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是一名骑士  \n(2) 伊莎贝拉是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：阿比盖尔和伊莎贝拉。阿比盖尔声称：“伊莎贝拉是骑士，或者阿比盖尔是骑士。”伊莎贝拉说：“阿比盖尔不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿比盖尔是一名骑士  \n(2) 伊莎贝拉是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾登和维多利亚。艾登说：“如果维多利亚是无赖，那么维多利亚就是骑士。”维多利亚则声称：“如果维多利亚是骑士，那么艾登就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾登是一名骑士  \n(2) 维多利亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：阿梅莉亚和奥利维亚。阿梅莉亚说：“如果阿梅莉亚是骑士，那么奥利维亚就是无赖。”奥利维亚说：“当且仅当阿梅莉亚是骑士时，奥利维亚才是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是一名骑士  \n(2) 奥利维亚是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：伊芙琳和奥利维亚。伊芙琳说：“奥利维亚是骑士。”在奥利维亚的陈述中：“伊芙琳是无赖或者奥利维亚是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是一名骑士  \n(2) 奥利维亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：伊森和卢卡斯。伊森的陈述是：“如果且仅如果伊森是骑士，卢卡斯就是无赖。”卢卡斯说：“伊森是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是无赖  \n(2) 卢卡斯是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：伊芙琳和利亚姆。伊芙琳说：“伊芙琳是骑士当且仅当利亚姆是无赖。”利亚姆的陈述是：“利亚姆是骑士或者伊芙琳是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊芙琳是无赖  \n(2) 利亚姆是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：维多利亚和阿比盖尔。维多利亚声称：“如果阿比盖尔是无赖，那么阿比盖尔就是骑士。”阿比盖尔宣称：“当且仅当维多利亚是骑士时，阿比盖尔才是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 维多利亚是一名骑士  \n(2) 阿比盖尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：威廉和夏洛特。威廉评论道：“如果威廉是骑士，那么夏洛特就是无赖。”在夏洛特的陈述中：“威廉是骑士，夏洛特是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 夏洛特是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾拉和斯嘉丽。艾拉被听到说：“斯嘉丽是无赖或者斯嘉丽是骑士。”斯嘉丽提到：“艾拉是骑士或者艾拉是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是一名骑士  \n(2) 斯嘉丽是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：索菲娅和克洛伊。索菲娅说：“如果索菲娅是骑士，那么克洛伊就是骑士。”克洛伊表示索菲娅是无赖或者索菲娅是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 克洛伊是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：奥利维亚和艾拉。奥利维亚被听到说：“如果奥利维亚是骑士，那么艾拉就是骑士。”艾拉告诉你，如果艾拉是骑士，那么奥利维亚就是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是一名骑士  \n(2) 艾拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：本杰明和佩内洛普。本杰明说：“佩内洛普是骑士当且仅当本杰明是骑士。”佩内洛普告诉你，佩内洛普是骑士，而本杰明是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是一名骑士  \n(2) 佩内洛普是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：亨利和本杰明。亨利表示，亨利当且仅当本杰明是骑士时才是骑士。在本杰明的话中：“亨利是无赖，而本杰明是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是无赖  \n(2) 本杰明是骑士"
    },
    {
        "quiz": "一个非常特别的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：大卫和诺亚。大卫告诉你，诺亚是骑士当且仅当诺亚是无赖。诺亚表示大卫是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 大卫是无赖  \n(2) 诺亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：本杰明和雅各布。本杰明说雅各布是无赖或者本杰明是骑士。雅各布则指出：“只有本杰明是无赖时，雅各布才是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是无赖  \n(2) 雅各布是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：维多利亚和伊丽莎白。维多利亚说：“伊丽莎白是骑士，而维多利亚是骑士。”伊丽莎白则指出：“维多利亚是骑士当且仅当伊丽莎白是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 维多利亚是一名骑士  \n(2) 伊丽莎白是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：索菲娅和佐伊。索菲娅说：“佐伊不是无赖。”佐伊则表示索菲娅是骑士，而索菲娅是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 佐伊是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：夏洛特和佐伊。夏洛特说道：“佐伊是骑士当且仅当佐伊是无赖。”在佐伊的陈述中：“夏洛特不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是无赖  \n(2) 佐伊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：威廉和佩内洛普。威廉的陈述是：“佩内洛普是无赖当且仅当佩内洛普是骑士。”佩内洛普的陈述是：“威廉是无赖当且仅当威廉是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是无赖  \n(2) 佩内洛普是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：哈珀和阿梅莉亚。哈珀说：“哈珀是骑士或者阿梅莉亚是无赖。”阿梅莉亚则说：“阿梅莉亚是骑士当且仅当哈珀是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是无赖  \n(2) 阿梅莉亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：洛根和詹姆斯。洛根评论道：“詹姆斯是无赖，詹姆斯是骑士。”詹姆斯则说：“洛根是无赖或者洛根是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是无赖  \n(2) 詹姆斯是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：伊莎贝拉和阿梅莉亚。伊莎贝拉被听到说：“阿梅莉亚是骑士当且仅当伊莎贝拉是骑士。”阿梅莉亚则声称：“伊莎贝拉是无赖当且仅当阿梅莉亚是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是无赖  \n(2) 阿梅莉亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：杰克逊和哈珀。杰克逊说：“杰克逊是骑士，哈珀是骑士。”哈珀则说，如果哈珀是骑士，那么杰克逊就是无赖。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是一个无赖  \n(2) 哈珀是一个骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：斯嘉丽和迈克尔。斯嘉丽被听到说：“迈克尔是骑士，迈克尔是无赖。”迈克尔宣称：“如果迈克尔是骑士，那么斯嘉丽就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 斯嘉丽是无赖  \n(2) 迈克尔是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：索菲娅和梅森。索菲娅声称：“梅森是一个无赖，而梅森是一个骑士。”梅森则说：“索菲娅是一个骑士，而索菲娅是一个无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 梅森是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：格蕾丝和阿梅莉亚。格蕾丝的陈述是：“阿梅莉亚是无赖当且仅当格蕾丝是骑士。”阿梅莉亚告诉你，如果格蕾丝是骑士，那么阿梅莉亚就是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是一名骑士  \n(2) 阿梅莉亚是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：格蕾丝和佩内洛普。格蕾丝说：“佩内洛普是一个无赖。”佩内洛普则说：“格蕾丝是一个骑士，或者佩内洛普是一个骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是无赖  \n(2) 佩内洛普是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：塞巴斯蒂安和奥萝拉。塞巴斯蒂安说：“塞巴斯蒂安是骑士，奥萝拉是无赖。”奥萝拉说：“塞巴斯蒂安是骑士或者塞巴斯蒂安是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 塞巴斯蒂安是无赖  \n(2) 奥萝拉是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：奥萝拉和雅各布。奥萝拉告诉你雅各布是骑士。根据雅各布的话，“如果雅各布是骑士，那么奥萝拉就是骑士”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥萝拉是一名骑士  \n(2) 雅各布是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾娃和佐伊。艾娃评论道：“艾娃是骑士当且仅当佐伊是骑士。”在佐伊的话中：“艾娃是无赖当且仅当佐伊是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是无赖  \n(2) 佐伊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：本杰明和雅各布。在本杰明的话中：“雅各布是骑士。”雅各布被听到说：“雅各布是骑士当且仅当本杰明是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是无赖  \n(2) 雅各布是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：卢克和艾弗里。卢克声称：“卢克是骑士或者艾弗里是无赖。”艾弗里宣称：“如果艾弗里是骑士，那么卢克就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是一个无赖  \n(2) 艾弗里是一个骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾拉和雅各布。艾拉说：“艾拉是骑士，雅各布是骑士。”雅各布表示，如果且仅如果艾拉是骑士，那么艾拉就是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是一个无赖  \n(2) 雅各布是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：亨利和艾登。亨利表示，如果且仅如果亨利是骑士，那么艾登就是无赖。“亨利不是骑士，”艾登宣称。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 亨利是一名骑士  \n(2) 艾登是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：欧文和卢克。“欧文是骑士或者卢克是无赖”——欧文说。卢克则表示：“如果卢克是骑士，那么欧文就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是一名骑士  \n(2) 卢克是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：卢卡斯和大卫。卢卡斯说：“大卫是无赖或者大卫是骑士。”大卫表示卢卡斯不是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是一名骑士  \n(2) 大卫是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：欧文和塞巴斯蒂安。欧文评论道：“塞巴斯蒂安是骑士或者塞巴斯蒂安是无赖。”塞巴斯蒂安表示欧文是无赖或者欧文是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是一名骑士  \n(2) 塞巴斯蒂安是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：佐伊和亨利。佐伊说：“只有亨利是无赖时，佐伊才是骑士。”亨利说，只有当佐伊是骑士时，亨利才是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佐伊是一名骑士  \n(2) 亨利是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾米莉和本杰明。艾米莉说：“本杰明不是骑士。”本杰明则说：“艾米莉是骑士当且仅当艾米莉是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是一名骑士  \n(2) 本杰明是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：莉莉和洛根。莉莉告诉你，洛根是骑士或者莉莉是骑士。“当且仅当洛根是骑士时，莉莉才是无赖，”洛根声称。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 莉莉是无赖  \n(2) 洛根是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾弗里和伊森。艾弗里声称：“如果伊森是无赖，那么伊森就是骑士。”伊森则指出：“艾弗里是无赖或者伊森是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是骑士  \n(2) 伊森是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：阿梅莉亚和伊莎贝拉。阿梅莉亚告诉你，阿梅莉亚是骑士当且仅当伊莎贝拉是骑士。伊莎贝拉则声明：“阿梅莉亚是骑士，伊莎贝拉也是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿梅莉亚是一名骑士  \n(2) 伊莎贝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：本杰明和维多利亚。本杰明提到：“维多利亚不是无赖。”维多利亚表示，如果维多利亚是骑士，那么本杰明就是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 本杰明是一名骑士  \n(2) 维多利亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：佩内洛普和阿梅莉亚。正如佩内洛普所说：“如果佩内洛普是骑士，那么阿梅莉亚就是骑士。”阿梅莉亚则说：“如果佩内洛普是无赖，那么阿梅莉亚就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佩内洛普是一名骑士  \n(2) 阿梅莉亚是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：夏洛特和索菲娅。夏洛特评论道：“索菲娅是无赖当且仅当夏洛特是骑士。”根据索菲娅的说法：“夏洛特是无赖当且仅当索菲娅是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 夏洛特是无赖  \n(2) 索菲娅是无赖"
    },
    {
        "quiz": "一个非常特别的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：卢卡斯和詹姆斯。卢卡斯声称：“卢卡斯是骑士当且仅当詹姆斯是骑士。”詹姆斯宣称：“如果詹姆斯是骑士，那么卢卡斯就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢卡斯是一名骑士  \n(2) 詹姆斯是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾弗里和利亚姆。艾弗里评论道：“利亚姆不是骑士。”利亚姆则说：“利亚姆是骑士或者艾弗里是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾弗里是无赖  \n(2) 利亚姆是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：卢克和塞缪尔。卢克表示，如果且仅如果卢克是骑士，那么塞缪尔就是无赖。塞缪尔告诉你，如果且仅如果卢克是骑士，那么塞缪尔就是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 卢克是骑士  \n(2) 塞缪尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：索菲娅和詹姆斯。索菲娅声称：“詹姆斯是骑士当且仅当索菲娅是骑士。”詹姆斯则断言：“索菲娅不是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 詹姆斯是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：格蕾丝和伊丽莎白。格蕾丝说：“伊丽莎白不是无赖。”而伊丽莎白声称：“格蕾丝是无赖，格蕾丝是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 格蕾丝是无赖  \n(2) 伊丽莎白是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：斯嘉丽和阿比盖尔。斯嘉丽说：“阿比盖尔是骑士。”根据阿比盖尔的说法，“斯嘉丽是无赖或者斯嘉丽是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 斯嘉丽是一名骑士  \n(2) 阿比盖尔是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾拉和伊芙琳。艾拉说：“伊芙琳是无赖或者伊芙琳是骑士。”伊芙琳则断言：“艾拉不是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是一名骑士  \n(2) 伊芙琳是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：欧文和阿丽亚。欧文表示，阿丽亚是无赖当且仅当阿丽亚是骑士。阿丽亚说：“欧文是骑士或者欧文是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 欧文是无赖  \n(2) 阿丽亚是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：奥利维亚和伊莎贝拉。奥利维亚说：“伊莎贝拉是无赖或者伊莎贝拉是骑士。”伊莎贝拉则说奥利维亚是骑士或者伊莎贝拉是骑士。那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利维亚是一名骑士  \n(2) 伊莎贝拉是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：阿丽亚和伊丽莎白。阿丽亚说道：“伊丽莎白不是无赖。”伊丽莎白评论道：“阿丽亚是无赖当且仅当伊丽莎白是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿丽亚是无赖  \n(2) 伊丽莎白是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：伊森和奥利维亚。伊森告诉你，奥利维亚是无赖当且仅当奥利维亚是骑士。奥利维亚声称：“伊森是无赖或者奥利维亚是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊森是无赖  \n(2) 奥利维亚是骑士"
    },
    {
        "quiz": "一个非常特别的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：伊莎贝拉和佐伊。伊莎贝拉声称：“如果佐伊是无赖，那么佐伊就是骑士。”佐伊则指出：“伊莎贝拉是无赖，而佐伊是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊莎贝拉是无赖  \n(2) 佐伊是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：索菲娅和斯嘉丽。索菲娅表示斯嘉丽是骑士或者斯嘉丽是无赖。“如果索菲娅是无赖，那么索菲娅就是骑士。”——斯嘉丽。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 斯嘉丽是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：大卫和米娅。正如大卫所说，“米娅是无赖或者大卫是骑士”。米娅告诉你大卫是骑士，而大卫是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 大卫是一名骑士  \n(2) 米娅是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：维多利亚和杰克逊。维多利亚表示，如果且仅如果杰克逊是无赖，那么杰克逊就是骑士。杰克逊表示维多利亚是骑士或者维多利亚是无赖。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 维多利亚是无赖  \n(2) 杰克逊是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：佐伊和艾拉。佐伊声称自己是骑士，艾拉也是骑士。根据艾拉的说法，“如果佐伊是骑士，那么佐伊就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 佐伊是一个无赖  \n(2) 艾拉是一个骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾娃和哈珀。艾娃说：“哈珀是骑士当且仅当艾娃是骑士。”根据哈珀的说法：“艾娃是骑士当且仅当哈珀是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾娃是一名骑士  \n(2) 哈珀是一名骑士"
    },
    {
        "quiz": "一个非常特别的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：艾拉和阿丽亚。艾拉说：“阿丽亚是骑士当且仅当阿丽亚是无赖。”阿丽亚则声称：“艾拉是骑士，且艾拉是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是无赖  \n(2) 阿丽亚是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：威廉和亨利。威廉说：“威廉是骑士当且仅当亨利是无赖。”亨利被听到说：“如果威廉是无赖，那么威廉就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是无赖  \n(2) 亨利是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：威廉和艾娃。威廉说：“艾娃是无赖或者艾娃是骑士。”艾娃说：“如果威廉是骑士，那么威廉就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 威廉是一名骑士  \n(2) 艾娃是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：奥利弗和雅各布。奥利弗评论道：“奥利弗是骑士，而雅各布是无赖。”雅各布则说道：“当且仅当雅各布是骑士时，奥利弗才是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利弗是一名骑士  \n(2) 雅各布是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：梅森和威廉。梅森告诉你威廉是一个无赖。在威廉的陈述中：“梅森是一个骑士，而威廉是一个骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是一名骑士  \n(2) 威廉是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是说谎。你遇到了两个居民：阿丽亚和奥萝拉。“奥萝拉是骑士，”阿丽亚说。“阿丽亚是无赖，阿丽亚是骑士，”奥萝拉宣称。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 阿丽亚是无赖  \n(2) 奥萝拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：奥利弗和伊芙琳。奥利弗说：“如果奥利弗是骑士，那么伊芙琳就是骑士。”伊芙琳说：“奥利弗是骑士，伊芙琳是骑士。”那么，谁是骑士，谁是无赖？",
        "solution_text_format": "(1) 奥利弗是一名骑士  \n(2) 伊芙琳是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：索菲娅和伊芙琳。索菲娅说：“伊芙琳是骑士或者伊芙琳是无赖。”在伊芙琳的陈述中：“伊芙琳是骑士而索菲娅是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是一名骑士  \n(2) 伊芙琳是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：杰克逊和艾玛。杰克逊的陈述是：“杰克逊是骑士当且仅当艾玛是骑士。”艾玛说：“艾玛是骑士当且仅当杰克逊是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 杰克逊是一名骑士  \n(2) 艾玛是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾米莉和梅森。艾米莉表示梅森是骑士，而艾米莉也是骑士。梅森声称：“如果艾米莉是骑士，那么艾米莉就是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾米莉是无赖  \n(2) 梅森是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：洛根和夏洛特。正如洛根所说：“夏洛特是无赖当且仅当夏洛特是骑士。”夏洛特则指出：“如果洛根是骑士，那么洛根就是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是无赖  \n(2) 夏洛特是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：哈珀和亨利。哈珀说：“如果亨利是无赖，那么哈珀就是骑士。”亨利说：“亨利是骑士当且仅当哈珀是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 哈珀是无赖  \n(2) 亨利是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾玛和伊芙琳。艾玛说：“如果且仅如果艾玛是骑士，那么伊芙琳就是骑士。”伊芙琳评论道：“如果艾玛是无赖，那么艾玛就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是骑士  \n(2) 伊芙琳是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：克洛伊和伊森。克洛伊说伊森是骑士或者伊森是无赖。在伊森的话中：“克洛伊是无赖，而伊森是骑士”。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 克洛伊是骑士  \n(2) 伊森是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：伊丽莎白和迈克尔。伊丽莎白告诉你迈克尔是无赖，而迈克尔是骑士。正如迈克尔所说：“伊丽莎白不是无赖。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 伊丽莎白是无赖  \n(2) 迈克尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：克洛伊和格蕾丝。克洛伊被听到说：“克洛伊是骑士，格蕾丝是无赖。”格蕾丝说：“克洛伊是无赖或者克洛伊是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 克洛伊是无赖  \n(2) 格蕾丝是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：洛根和艾米莉。洛根表示洛根是骑士或者艾米莉是无赖。艾米莉则说：“洛根是无赖当且仅当洛根是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 洛根是骑士  \n(2) 艾米莉是无赖"
    },
    {
        "quiz": "一个非常特别的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾拉和洛根。艾拉声称：“当且仅当洛根是骑士时，艾拉才是骑士。”而洛根则说：“洛根是骑士，艾拉是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾拉是无赖  \n(2) 洛根是骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：索菲娅和艾拉。索菲娅说：“艾拉是无赖当且仅当艾拉是骑士。”艾拉告诉你，如果索菲娅是无赖，那么索菲娅就是骑士。那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 索菲娅是无赖  \n(2) 艾拉是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：诺亚和艾娃。诺亚评论道：“艾娃不是骑士。”艾娃说：“诺亚是骑士或者诺亚是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 诺亚是一个无赖  \n(2) 艾娃是一个骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：梅森和艾玛。梅森被听到说：“梅森是骑士或者艾玛是无赖。”艾玛则说：“如果梅森是无赖，那么梅森就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 梅森是一名骑士  \n(2) 艾玛是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：赖利和伊森。赖利说：“如果且仅如果赖利是骑士，伊森就是无赖。”伊森提到：“如果且仅如果伊森是骑士，赖利就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 赖利是一名骑士  \n(2) 伊森是一个无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：詹姆斯和斯嘉丽。詹姆斯说：“斯嘉丽是无赖或者詹姆斯是骑士。”根据斯嘉丽的话，“如果詹姆斯是无赖，那么詹姆斯就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 詹姆斯是一名骑士  \n(2) 斯嘉丽是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：奥利弗和艾玛。正如奥利弗所说：“奥利弗是骑士或者艾玛是无赖。”艾玛宣称：“当且仅当奥利弗是无赖时，奥利弗才是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 奥利弗是一名骑士  \n(2) 艾玛是一名无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：艾玛和赖利。艾玛说道：“如果艾玛是骑士，那么赖利就是骑士。”赖利告诉你：“如果艾玛是无赖，那么艾玛就是骑士。”那么，谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 艾玛是一名骑士  \n(2) 赖利是一名骑士"
    },
    {
        "quiz": "一个非常特殊的岛屿上只居住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：利亚姆和塞缪尔。利亚姆说：“如果塞缪尔是无赖，那么塞缪尔就是骑士。”塞缪尔提到：“利亚姆是骑士当且仅当利亚姆是无赖。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 利亚姆是无赖  \n(2) 塞缪尔是无赖"
    },
    {
        "quiz": "一个非常特殊的岛屿上只住着骑士和无赖。骑士总是说真话，而无赖总是撒谎。你遇到了两个居民：雅各布和奥利维亚。雅各布说：“雅各布是骑士或者奥利维亚是骑士。”根据奥利维亚的话，“如果奥利维亚是骑士，那么雅各布就是骑士。”那么谁是骑士，谁是无赖呢？",
        "solution_text_format": "(1) 雅各布是一名骑士  \n(2) 奥利维亚是一名骑士"
    }
]