[
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ノア、ビクトリア、エイヴァ、リリー、ダニエル、アレクサンダー、そしてマシュー。ノアは「マシューは騎士で、ビクトリアも騎士だ」と言いました。ビクトリアは「リリーはならず者であるのは、マシューが騎士である場合に限る」と述べました。エイヴァの発言では「マシューは騎士か、ビクトリアは騎士です」と言いました。リリーは「ビクトリアがならず者なら、マシューもならず者だ」と言っているのが聞かれました。ダニエルは「アレクサンダーは騎士ではない」とコメントしました。アレクサンダーは「ノアは騎士か、エイヴァはならず者だ」と述べました。「エイヴァはならず者だ」とマシューが言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアはならず者です  \n(2) ビクトリアは騎士です  \n(3) エイヴァは騎士です  \n(4) リリーは騎士です  \n(5) ダニエルは騎士です  \n(6) アレクサンダーはならず者です  \n(7) マシューはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ダニエル、サミュエル、マイケル、ソフィア、メイソン、アリア、そしてアレクサンダーです。ダニエルはこう言いました。「マイケルはならず者であるのは、アレクサンダーが騎士である場合に限る」。サミュエルは、マイケルは騎士であり、アレクサンダーはならず者であると言いました。マイケルは「アリアはならず者ではない」と主張しました。ソフィアは、アレクサンダーは騎士であり、メイソンはならず者であると表現しました。メイソンは「アレクサンダーは騎士ではない」と指摘しました。アリアによれば、「もしマイケルが騎士なら、アレクサンダーはならず者である」。アレクサンダーは、アリアはならず者であり、ダニエルはならず者であると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルは騎士です  \n(2) サミュエルは騎士です  \n(3) マイケルは騎士です  \n(4) ソフィアはならず者です  \n(5) メイソンは騎士です  \n(6) アリアは騎士です  \n(7) アレクサンダーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会いました：アメリア、ローガン、ベンジャミン、ジョセフ、マイケル、ルーカス、そしてゾーイ。アメリアは「ゾーイはならず者であるのは、マイケルがならず者である場合に限る」と言いました。「ローガンはアメリアがならず者である場合に限り騎士である」とローガンが言いました。「もしローガンがならず者なら、ベンジャミンは騎士である」とベンジャミンが主張しました。ジョセフは「もしベンジャミンがならず者なら、ルーカスは騎士である」と言っているのが聞かれました。マイケルは「アメリアは騎士である」と述べました。「ジョセフはマイケルが騎士である場合に限りならず者である」とルーカスが主張しました。ゾーイは「ルーカスは騎士ではない」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアはならず者です  \n(2) ローガンはならず者です  \n(3) ベンジャミンはならず者です  \n(4) ジョセフはならず者です  \n(5) マイケルはならず者です  \n(6) ルーカスはならず者です  \n(7) ゾーイは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：イザベラ、グレース、エリザベス、オーロラ、ソフィア、ライリー、そしてアレクサンダー。イザベラは「アレクサンダーは騎士か、グレースは騎士です」と述べました。グレースは「エリザベスはならず者ではありません」と言いました。エリザベスは「エリザベスは騎士で、ライリーは騎士です」と言いました。オーロラによれば「ソフィアは騎士ではありません」。ソフィアは「オーロラは騎士で、アレクサンダーはならず者です」と言っているのが聞かれました。「アレクサンダーはならず者です」とライリーが言いました。アレクサンダーは「もしグレースが騎士なら、イザベラはならず者です」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イザベラは騎士です  \n(2) グレースはならず者です  \n(3) エリザベスはならず者です  \n(4) オーロラは騎士です  \n(5) ソフィアはならず者です  \n(6) ライリーはならず者です  \n(7) アレクサンダーは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：オリバー、ハーパー、アレクサンダー、グレース、ルーカス、イヴリン、そしてエラ。オリバーはこう主張しました：「ハーパーはエラがならず者である場合に限り、ならず者です」。ハーパーの言葉では：「エラは騎士で、ルーカスはならず者です」。アレクサンダーは「オリバーは騎士で、ルーカスはならず者です」と言いました。グレースは「ルーカスはならず者である場合に限り、ルーカスは騎士です」と言っているのが聞かれました。ルーカスは「オリバーはならず者か、グレースはならず者です」と言いました。イヴリンは「ルーカスは騎士ではありません」と述べました。「グレースは騎士です」とエラは主張しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリバーは騎士です  \n(2) ハーパーはならず者です  \n(3) アレクサンダーはならず者です  \n(4) グレースはならず者です  \n(5) ルーカスは騎士です  \n(6) イヴリンはならず者です  \n(7) エラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ライリー、デイビッド、ビクトリア、オーロラ、ベンジャミン、エリザベス、そしてエイデンです。ライリーは「エリザベスが騎士なら、ビクトリアはならず者だ」と言いました。デイビッドは「エイデンがならず者であるのは、ベンジャミンがならず者である場合に限る」と表現しました。ビクトリアは「ライリーは騎士ではない」と言いました。オーロラは「ビクトリアはならず者か、エリザベスはならず者だ」とコメントしました。「ライリーは騎士であるのは、ライリーがならず者である場合に限る」とベンジャミンは宣言しました。エリザベスは「エイデンはならず者ではない」と表現しました。エイデンは「オーロラはならず者ではない」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ライリーは騎士です  \n(2) デイビッドはならず者です  \n(3) ビクトリアはならず者です  \n(4) オーロラは騎士です  \n(5) ベンジャミンはならず者です  \n(6) エリザベスは騎士です  \n(7) エイデンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ライリー、ベンジャミン、マイケル、エミリー、ノア、メイソン、そしてリアム。「エミリーは騎士であるのは、メイソンが騎士である場合に限る」 - ライリー。「もしノアがならず者なら、ライリーはならず者だ」とベンジャミンが宣言しました。「エミリーは騎士であるか、メイソンは騎士である」とマイケルが言いました。エミリーはノアがならず者であるか、エミリーが騎士であると言いました。ノアは「ライリーはならず者であるのは、ベンジャミンが騎士である場合に限る」と言いました。「ベンジャミンはならず者で、メイソンは騎士だ」とメイソンが主張しました。リアムは「マイケルは騎士であるのは、マイケルがならず者である場合に限る」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ライリーはならず者です  \n(2) ベンジャミンは騎士です  \n(3) マイケルは騎士です  \n(4) エミリーは騎士です  \n(5) ノアは騎士です  \n(6) メイソンはならず者です  \n(7) リアムはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：スカーレット、イーサン、ゾーイ、エイヴァ、ルーカス、ビクトリア、そしてアレクサンダー。スカーレットは「エイヴァは騎士か、イーサンは騎士です」と言いました。イーサンは「もしイーサンが騎士なら、アレクサンダーはならず者です」と述べました。「もしスカーレットがならず者なら、エイヴァは騎士です」とゾーイが言いました。エイヴァの言葉では、「ゾーイはならず者ではありません」。ルーカスは「アレクサンダーは騎士で、スカーレットはならず者です」と言っているのが聞かれました。「もしルーカスがならず者なら、ゾーイはならず者です」とビクトリアが主張しました。アレクサンダーは「イーサンは騎士で、スカーレットはならず者です」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) スカーレットは騎士です  \n(2) イーサンは騎士です  \n(3) ゾーイは騎士です  \n(4) エイヴァは騎士です  \n(5) ルーカスはならず者です  \n(6) ビクトリアはならず者です  \n(7) アレクサンダーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジャック、ヘンリー、ルーク、エイブリー、ジェームズ、メイソン、そしてサミュエル。ジャックは「ジャックは騎士であるのは、サミュエルがならず者である場合に限る」とコメントしました。ヘンリーの発言では「エイブリーはならず者であり、エイブリーは騎士である」と言いました。ルークは「ジェームズはならず者であり、エイブリーはならず者である」とコメントしました。エイブリーは「サミュエルは騎士であるか、ジャックはならず者である」と言いました。ジェームズは「メイソンはならず者であるのは、エイブリーが騎士である場合に限る」とあなたに伝えました。メイソンは「ヘンリーは騎士であり、メイソンは騎士である」とあなたに言いました。「ルークは騎士であり、メイソンはならず者である」とサミュエルが言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャックはならず者です  \n(2) ヘンリーはならず者です  \n(3) ルークはならず者です  \n(4) エイブリーは騎士です  \n(5) ジェームズは騎士です  \n(6) メイソンはならず者です  \n(7) サミュエルはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：マシュー、アリア、イーサン、ミア、エイブリー、クロエ、そしてハーパーです。「エイブリーはならず者で、ハーパーは騎士だ」とマシューが言いました。アリアは「ミアはならず者であるのは、マシューが騎士である場合に限る」とコメントしました。イーサンの発言では「アリアはならず者か、ミアはならず者だ」と言いました。ミアは「エイブリーが騎士なら、エイブリーはならず者だ」と言っているのが聞かれました。エイブリーは「ミアは騎士か、ミアはならず者だ」と言っているのが聞かれました。クロエは「ミアはならず者であるのは、アリアがならず者である場合に限る」とコメントしました。ハーパーは「イーサンはならず者ではない」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マシューはならず者です  \n(2) アリアはならず者です  \n(3) イーサンは騎士です  \n(4) ミアはならず者です  \n(5) エイブリーは騎士です  \n(6) クロエは騎士です  \n(7) ハーパーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：アビゲイル、アリア、ジェイコブ、リアム、ジェームズ、アメリア、そしてデイビッド。アビゲイルの言葉では、「デイビッドは騎士である場合に限り、リアムは騎士です」。アリアは、「アビゲイルが騎士であれば、リアムは騎士です」と指摘しました。「アビゲイルはならず者です」とジェイコブが言いました。リアムは、「アメリアが騎士であれば、アビゲイルは騎士です」と述べました。「ジェイコブは騎士か、アメリアはならず者です」とジェームズが主張しました。「デイビッドは騎士ではありません」とアメリアが言いました。デイビッドは、ジェイコブがならず者であり、デイビッドが騎士であると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アビゲイルは騎士です  \n(2) アリアは騎士です  \n(3) ジェイコブはならず者です  \n(4) リアムは騎士です  \n(5) ジェームズは騎士です  \n(6) アメリアはならず者です  \n(7) デイビッドは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ビクトリア、ジャクソン、ジャック、ジェイコブ、クロエ、ダニエル、そしてローガン。ビクトリアは「もしローガンが騎士なら、ダニエルも騎士です」と表現しました。ジャクソンは「ローガンがならず者か、ジャックがならず者です」と表現しました。ジャックの言葉では、「もしジャクソンが騎士なら、ビクトリアも騎士です」と言いました。ジェイコブは「もしダニエルが騎士なら、ビクトリアも騎士です」とあなたに言いました。「ビクトリアはならず者ではありません」とクロエが宣言しました。ダニエルは「ジェイコブは騎士か、ジャクソンはならず者です」と言っているのが聞かれました。ローガンの発言では、「ダニエルは騎士ではありません」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ビクトリアは騎士です  \n(2) ジャクソンは騎士です  \n(3) ジャックは騎士です  \n(4) ジェイコブは騎士です  \n(5) クロエは騎士です  \n(6) ダニエルは騎士です  \n(7) ローガンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジェームズ、アビゲイル、ダニエル、ルーカス、オリバー、ライリー、そしてマシュー。ジェームズは「ダニエルはならず者だ」と主張しました。アビゲイルは「もしライリーが騎士なら、ルーカスは騎士だ」と言いました。ダニエルは「もしライリーが騎士なら、ルーカスは騎士だ」と言いました。ルーカスによれば「もしダニエルがならず者なら、オリバーはならず者だ」とのことです。オリバーは「ダニエルは騎士で、アビゲイルはならず者だ」と主張しました。ライリーはアビゲイルが騎士ではないと表現しました。マシューは「オリバーはならず者だ」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズはならず者です  \n(2) アビゲイルは騎士です  \n(3) ダニエルは騎士です  \n(4) ルーカスは騎士です  \n(5) オリバーはならず者です  \n(6) ライリーはならず者です  \n(7) マシューは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ノア、オーロラ、ジャック、オリバー、ミア、イヴリン、そしてソフィア。ノアは「ミアは騎士であるのはソフィアが騎士である場合に限る」と宣言しました。オーロラは「ソフィアは騎士であり、ミアも騎士である」と述べました。「イヴリンはならず者ではない」 - ジャック。「イヴリンはならず者ではない」とオリバーも言いました。「もしイヴリンが騎士なら、ソフィアはならず者だ」とミアが宣言しました。イヴリンは「ジャックは騎士か、ミアは騎士だ」と言いました。ソフィアは「ノアは騎士であり、オーロラは騎士だ」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアはならず者です  \n(2) オーロラはならず者です  \n(3) ジャックは騎士です  \n(4) オリバーは騎士です  \n(5) ミアは騎士です  \n(6) イヴリンは騎士です  \n(7) ソフィアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：サミュエル、リリー、ローガン、ジェイコブ、ウィリアム、エイデン、そしてヘンリー。サミュエルの言葉では、「ローガンはならず者で、エイデンは騎士です」。リリーの言葉では、「ジェイコブはウィリアムが騎士である場合に限り騎士です」。ローガンは、「リリーがならず者なら、サミュエルは騎士です」と述べました。ジェイコブは、「ヘンリーがならず者なら、サミュエルはならず者です」と述べました。「エイデンは騎士で、ヘンリーはならず者です」とウィリアムが言いました。エイデンは、「リリーが騎士なら、ヘンリーはならず者です」と言っているのが聞かれました。ヘンリーは、「ウィリアムはならず者か、エイデンはならず者です」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルはならず者です  \n(2) リリーは騎士です  \n(3) ローガンは騎士です  \n(4) ジェイコブは騎士です  \n(5) ウィリアムは騎士です  \n(6) エイデンは騎士です  \n(7) ヘンリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ルーク、オリバー、ジェームズ、エイブリー、ジャクソン、ローガン、そしてオーウェン。ルークによれば、「エイブリーはならず者です」。オリバーは、「ローガンが騎士である場合に限り、ローガンはならず者です」と述べました。ジェームズは、「エイブリーはならず者で、ルークは騎士です」と述べました。エイブリーは、「ジェームズは騎士であるか、ローガンはならず者です」と言いました。ジャクソンは、「もしジェームズがならず者なら、ローガンはならず者です」と言いました。ローガンは、「エイブリーはならず者です」と述べました。オーウェンは、「もしオリバーが騎士なら、ジャクソンは騎士です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークはならず者です  \n(2) オリバーはならず者です  \n(3) ジェームズはならず者です  \n(4) エイブリーは騎士です  \n(5) ジャクソンは騎士です  \n(6) ローガンはならず者です  \n(7) オーウェンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：リアム、シャーロット、グレース、サミュエル、ダニエル、ソフィア、そしてオリバー。リアムによれば、「リアムは騎士です」。シャーロットは「リアムは騎士です」と述べました。グレースは、リアムがならず者であるのはダニエルが騎士である場合に限ると言いました。サミュエルは「ソフィアはならず者であるのはダニエルがならず者である場合に限る」と述べました。ダニエルはあなたにサミュエルは騎士ではないと言いました。「オリバーは騎士であるか、リアムは騎士である」 - ソフィア。オリバーは「ダニエルは騎士です」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムはならず者です  \n(2) シャーロットはならず者です  \n(3) グレースはならず者です  \n(4) サミュエルは騎士です  \n(5) ダニエルはならず者です  \n(6) ソフィアはならず者です  \n(7) オリバーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：シャーロット、イヴリン、ノア、アメリア、マイケル、ジャクソン、そしてグレース。シャーロットは「イヴリンがならず者なら、アメリアもならず者だ」と表現しました。イヴリンは「グレースがならず者か、シャーロットがならず者だ」と言いました。「シャーロットは騎士である場合、マイケルはならず者である」とノアが言いました。アメリアは「グレースはならず者だ」とあなたに伝えました。マイケルは「ジャクソンはならず者で、ノアは騎士だ」と表現しました。「アメリアは騎士である場合、シャーロットは騎士である」とジャクソンが言いました。「シャーロットはならず者か、イヴリンはならず者だ」とグレースが言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットは騎士です  \n(2) イヴリンは騎士です  \n(3) ノアは騎士です  \n(4) アメリアは騎士です  \n(5) マイケルはならず者です  \n(6) ジャクソンは騎士です  \n(7) グレースはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エミリー、シャーロット、ジャクソン、オリバー、ソフィア、サミュエル、そしてデイビッド。エミリーによれば、「ジャクソンはサミュエルがならず者である場合に限り、ならず者です」。シャーロットは、サミュエルはならず者ではないと言いました。ジャクソンは、「デイビッドはならず者で、ソフィアは騎士です」と述べました。オリバーは、「エミリーは騎士ではありません」と言いました。ソフィアは、エミリーはならず者であるか、デイビッドはならず者であると表現しました。「シャーロットはならず者で、サミュエルは騎士です」とサミュエルは宣言しました。デイビッドは、「デイビッドは騎士で、オリバーは騎士です」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーはならず者です  \n(2) シャーロットはならず者です  \n(3) ジャクソンは騎士です  \n(4) オリバーは騎士です  \n(5) ソフィアは騎士です  \n(6) サミュエルはならず者です  \n(7) デイビッドはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エイヴァ、ミア、ノア、イーサン、マイケル、クロエ、そしてアビゲイル。エイヴァによれば、「イーサンはマイケルが騎士である場合に限り、ならず者です」。ミアは「エイヴァは騎士であるか、マイケルはならず者です」と言いました。ノアは、イーサンが騎士であり、マイケルも騎士であると表現しました。イーサンは「ミアは騎士です」とコメントしました。マイケルは、イーサンがならず者であるか、アビゲイルが騎士であると言いました。クロエは、ミアが騎士であり、イーサンがならず者であると表現しました。アビゲイルは「マイケルは騎士であるか、イーサンはならず者です」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァは騎士です  \n(2) ミアは騎士です  \n(3) ノアはならず者です  \n(4) イーサンは騎士です  \n(5) マイケルはならず者です  \n(6) クロエはならず者です  \n(7) アビゲイルはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：オーウェン、エミリー、リリー、ヘンリー、ハーパー、オーロラ、そしてソフィア。オーウェンは「オーウェンは騎士だ」と言いました。エミリーは「リリーはならず者ではない」と言いました。リリーは「もしソフィアが騎士なら、オーウェンは騎士だ」と述べました。ヘンリーは「エミリーは騎士か、エミリーはならず者だ」と言いました。ハーパーは「ハーパーは騎士で、オーロラはならず者だ」と指摘しました。オーロラは「ヘンリーは騎士か、リリーは騎士だ」と言っているのが聞かれました。ソフィアはリリーが騎士だと表現しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンは騎士です  \n(2) エミリーは騎士です  \n(3) リリーは騎士です  \n(4) ヘンリーは騎士です  \n(5) ハーパーはならず者です  \n(6) オーロラは騎士です  \n(7) ソフィアは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：アビゲイル、ライリー、ペネロペ、ルーカス、イヴリン、リリー、そしてミア。アビゲイルは「イヴリンはならず者で、リリーは騎士です」と言いました。ライリーは「もしミアが騎士なら、アビゲイルはならず者です」と言いました。ペネロペは「イヴリンは騎士で、ルーカスはならず者です」と主張しました。ルーカスの発言は「ミアは騎士で、イヴリンは騎士です」となっています。イヴリンは「リリーは騎士か、ライリーは騎士です」とコメントしました。「ミアはならず者か、イヴリンはならず者です」とリリーが言いました。ミアは「ペネロペは騎士で、ルーカスは騎士です」とコメントしました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アビゲイルはならず者です  \n(2) ライリーは騎士です  \n(3) ペネロペは騎士です  \n(4) ルーカスはならず者です  \n(5) イヴリンは騎士です  \n(6) リリーは騎士です  \n(7) ミアはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：オリビア、アビゲイル、アメリア、エリザベス、ハーパー、オーロラ、そしてソフィア。オリビアによれば、「アメリアはならず者ではない」。アビゲイルは「ソフィアは騎士ではない」と主張しました。「もしソフィアが騎士なら、ハーパーは騎士です」とアメリアが言いました。「ハーパーはならず者ではない」とエリザベスが宣言しました。「アビゲイルはならず者です」とハーパーが言いました。オーロラは「エリザベスは騎士か、アメリアはならず者です」と述べました。「もしエリザベスがならず者なら、オリビアは騎士です」とソフィアが主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアは騎士です  \n(2) アビゲイルはならず者です  \n(3) アメリアは騎士です  \n(4) エリザベスは騎士です  \n(5) ハーパーは騎士です  \n(6) オーロラは騎士です  \n(7) ソフィアは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジェームズ、イーサン、ペネロペ、ヘンリー、オリバー、マイケル、そしてウィリアムです。ジェームズは「ウィリアムは騎士か、ペネロペは騎士だ」と言いました。イーサンは「ペネロペはならず者で、マイケルは騎士だ」と言いました。「マイケルは騎士であるのは、イーサンがならず者である場合に限る」とペネロペは宣言しました。ヘンリーは「ジェームズはならず者だ」と言いました。オリバーによれば「ウィリアムはならず者だ」とのことです。マイケルの言葉では「もしジェームズが騎士なら、ウィリアムはならず者だ」と言いました。ウィリアムは「ペネロペは騎士だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズはならず者です  \n(2) イーサンは騎士です  \n(3) ペネロペはならず者です  \n(4) ヘンリーは騎士です  \n(5) オリバーは騎士です  \n(6) マイケルは騎士です  \n(7) ウィリアムはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ノア、スカーレット、オーロラ、オリバー、ジェームズ、ハーパー、そしてミア。「ミアは騎士か、ミアはならず者だ」とノアが言いました。スカーレットは「ミアは騎士だ」と述べました。「オリバーは騎士ではない」とオーロラが宣言しました。オリバーの発言では「オーロラはならず者か、オーロラは騎士だ」と言いました。ジェームズは「スカーレットは騎士で、オーロラは騎士だ」と述べました。ハーパーによれば「ノアがならず者なら、スカーレットはならず者だ」とのことです。ミアはスカーレットがならず者で、ミアが騎士だと言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアは騎士です  \n(2) スカーレットはならず者です  \n(3) オーロラはならず者です  \n(4) オリバーは騎士です  \n(5) ジェームズはならず者です  \n(6) ハーパーは騎士です  \n(7) ミアはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：イザベラ、ウィリアム、エミリー、ジェームズ、ジャクソン、ローガン、そしてアリア。イザベラによれば、「ローガンが騎士ならエミリーも騎士です」。ウィリアムの発言では、「イザベラは騎士ではありません」。エミリーの言葉では、「ウィリアムはジェームズが騎士である場合に限り騎士です」。ジェームズは「ジャクソンは騎士ではありません」と言いました。「もしローガンがならず者なら、ジェームズは騎士です」とジャクソンが言及しました。ローガンは「エミリーは騎士であり、イザベラは騎士です」と言っているのが聞かれました。アリアは「もしイザベラが騎士なら、ウィリアムは騎士です」とコメントしました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イザベラは騎士です  \n(2) ウィリアムはならず者です  \n(3) エミリーは騎士です  \n(4) ジェームズはならず者です  \n(5) ジャクソンは騎士です  \n(6) ローガンは騎士です  \n(7) アリアはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ルーカス、アメリア、イーサン、リアム、ジェームズ、スカーレット、そしてメイソン。ルーカスの言葉によれば、「メイソンは騎士ではない」。アメリアは「リアムは騎士である場合に限り、リアムはならず者である」と宣言しました。イーサンは「ジェームズは騎士であり、リアムも騎士である」と言っているのが聞かれました。リアムは「スカーレットは騎士であり、ジェームズはならず者である」と言いました。ジェームズは「スカーレットは騎士ではない」と言いました。スカーレットは「もしアメリアが騎士ならば、リアムは騎士である」と言いました。メイソンによれば、「イーサンはならず者ではない」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスは騎士です  \n(2) アメリアはならず者です  \n(3) イーサンはならず者です  \n(4) リアムは騎士です  \n(5) ジェームズはならず者です  \n(6) スカーレットは騎士です  \n(7) メイソンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エミリー、ライリー、ヘンリー、ゾーイ、ノア、ジャクソン、そしてアビゲイル。エミリーは「もしアビゲイルがならず者なら、ヘンリーはならず者です」と述べました。ライリーはジャクソンが騎士であり、ノアも騎士であると表現しました。ヘンリーは「アビゲイルは騎士であり、エミリーはならず者です」と主張しました。ゾーイの発言では「ジャクソンはならず者ではありません」と言いました。ノアは「ヘンリーは騎士です」とコメントしました。ジャクソンはライリーが騎士ではないと表現しました。アビゲイルは「もしノアが騎士なら、エミリーは騎士です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーは騎士です  \n(2) ライリーはならず者です  \n(3) ヘンリーはならず者です  \n(4) ゾーイは騎士です  \n(5) ノアはならず者です  \n(6) ジャクソンは騎士です  \n(7) アビゲイルは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ハーパー、エイブリー、エリザベス、ノア、シャーロット、エラ、そしてエイヴァです。「シャーロットは騎士だ」とハーパーは主張しました。エイブリーの発言では、「もしエイヴァが騎士なら、ハーパーはならず者だ」と言いました。エリザベスは、「ハーパーはならず者だ」と指摘しました。ノアは、「エリザベスは騎士か、ハーパーはならず者だ」と主張しました。シャーロットの発言では、「エイブリーは騎士で、エイヴァは騎士だ」と言いました。エラは、「シャーロットはならず者だ」と言いました。エイヴァは、「ハーパーは騎士だ」と言いました。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーはならず者です  \n(2) エイブリーは騎士です  \n(3) エリザベスは騎士です  \n(4) ノアは騎士です  \n(5) シャーロットはならず者です  \n(6) エラは騎士です  \n(7) エイヴァはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：イザベラ、ソフィア、リアム、セバスチャン、マイケル、アレクサンダー、そしてエイデン。イザベラは「リアムは騎士です」と主張しました。ソフィアは「セバスチャンは騎士です」と言いました。リアムの発言では「アレクサンダーが騎士なら、イザベラも騎士です」と言いました。セバスチャンは「アレクサンダーはならず者です」と述べました。マイケルは「セバスチャンは騎士である場合に限り、ソフィアはならず者です」とコメントしました。アレクサンダーは「リアムはならず者ではありません」と言いました。エイデンは「イザベラがならず者なら、セバスチャンは騎士です」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イザベラは騎士です  \n(2) ソフィアはならず者です  \n(3) リアムは騎士です  \n(4) セバスチャンはならず者です  \n(5) マイケルはならず者です  \n(6) アレクサンダーは騎士です  \n(7) エイデンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ハーパー、ジャクソン、ヘンリー、グレース、オーウェン、リアム、そしてアリア。ハーパーは「グレースはならず者だ」と主張しました。ジャクソンは「ヘンリーはならず者か、アリアはならず者だ」と言いました。「リアムはオーウェンがならず者である場合に限り、ならず者だ」とヘンリーは主張しました。グレースはジャクソンがならず者で、ハーパーが騎士だと言いました。オーウェンは「ヘンリーがならず者なら、ジャクソンは騎士だ」と指摘しました。リアムは「アリアは騎士で、ヘンリーは騎士だ」と主張しました。「ヘンリーは騎士で、グレースはならず者だ」とアリアが言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーは騎士です  \n(2) ジャクソンは騎士です  \n(3) ヘンリーはならず者です  \n(4) グレースはならず者です  \n(5) オーウェンは騎士です  \n(6) リアムはならず者です  \n(7) アリアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：アレクサンダー、マシュー、オリビア、イヴリン、ジェイコブ、シャーロット、そしてイザベラ。アレクサンダーは「イヴリンは騎士である場合に限り、イヴリンはならず者である」と言いました。マシューは「イザベラは騎士だ」と主張しました。オリビアは「オリビアは騎士であるか、ジェイコブは騎士である」と言いました。イヴリンは「アレクサンダーは騎士だ」と主張しました。ジェイコブは「シャーロットは騎士であり、アレクサンダーはならず者だ」と述べました。シャーロットの言葉では「アレクサンダーは騎士ではない」と言いました。イザベラの言葉では「イヴリンはならず者ではない」と言いました。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アレクサンダーはならず者です  \n(2) マシューはならず者です  \n(3) オリビアは騎士です  \n(4) イヴリンはならず者です  \n(5) ジェイコブは騎士です  \n(6) シャーロットは騎士です  \n(7) イザベラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ウィリアム、アビゲイル、エイデン、イヴリン、ソフィア、ビクトリア、そしてオーウェン。ウィリアムはソフィアが騎士であると表現しました。アビゲイルは「ウィリアムは騎士ではない」と言いました。エイデンは「イヴリンは騎士であるか、エイデンは騎士である」と述べました。イヴリンは「アビゲイルは騎士であるか、アビゲイルはならず者である」と言いました。ソフィアは「イヴリンはならず者ではない」と言っているのが聞かれました。ビクトリアは「ウィリアムは騎士であるか、アビゲイルは騎士である」と言いました。オーウェンによれば「ビクトリアは騎士であり、アビゲイルは騎士である」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムは騎士です  \n(2) アビゲイルはならず者です  \n(3) エイデンは騎士です  \n(4) イヴリンは騎士です  \n(5) ソフィアは騎士です  \n(6) ビクトリアは騎士です  \n(7) オーウェンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジョセフ、ジェームズ、エラ、セバスチャン、アリア、ベンジャミン、そしてリリー。ジョセフは「セバスチャンは騎士か、ジェームズは騎士だ」とコメントしました。ジェームズは「エラは騎士で、ジョセフは騎士だ」と述べました。エラは「ベンジャミンは騎士ではない」と言いました。「ベンジャミンは騎士ではない」とセバスチャンが宣言しました。アリアは、ジョセフが騎士であるのはベンジャミンが騎士である場合に限るとあなたに伝えました。ベンジャミンは、リリーがならず者であるのはアリアが騎士である場合に限ると言いました。「ベンジャミンは騎士か、アリアはならず者だ」とリリーは主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフはならず者です  \n(2) ジェームズはならず者です  \n(3) エラはならず者です  \n(4) セバスチャンはならず者です  \n(5) アリアはならず者です  \n(6) ベンジャミンは騎士です  \n(7) リリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ゾーイ、エラ、ジャック、ダニエル、ジャクソン、イヴリン、そしてウィリアム。ゾーイは「ゾーイは騎士か、ウィリアムは騎士です」と述べました。「もしイヴリンがならず者なら、イヴリンは騎士です」とエラは主張しました。「ゾーイは騎士です」とジャックは言いました。ダニエルは「ジャクソンはならず者か、ジャックは騎士です」と述べました。ジャクソンは「もしイヴリンが騎士なら、ウィリアムはならず者です」と言いました。イヴリンによれば「ゾーイはならず者で、ジャクソンは騎士です」とのことです。ウィリアムの発言では「ゾーイはならず者で、イヴリンは騎士です」と言っています。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ゾーイは騎士です  \n(2) エラはならず者です  \n(3) ジャックは騎士です  \n(4) ダニエルは騎士です  \n(5) ジャクソンは騎士です  \n(6) イヴリンはならず者です  \n(7) ウィリアムはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：サミュエル、マイケル、ダニエル、リアム、メイソン、エリザベス、そしてアリア。サミュエルは「マイケルは騎士ではない」と述べました。マイケルの言葉では「メイソンはならず者です」と言いました。ダニエルはアリアがならず者であると表現しました。「リアムは騎士であるか、サミュエルが騎士である」とリアムは主張しました。「ダニエルは騎士であるのは、リアムがならず者である場合に限る」とメイソンは言いました。「アリアは騎士であるか、アリアはならず者である」とエリザベスは述べました。アリアは「リアムがならず者であるのは、アリアが騎士である場合に限る」と表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルはならず者です  \n(2) マイケルは騎士です  \n(3) ダニエルはならず者です  \n(4) リアムはならず者です  \n(5) メイソンはならず者です  \n(6) エリザベスは騎士です  \n(7) アリアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：リアム、エイデン、アビゲイル、エイブリー、ソフィア、ヘンリー、そしてイザベラです。リアムの言葉によれば、「ソフィアはアビゲイルがならず者である場合に限り騎士です」。エイデンは「エイデンは騎士であり、イザベラは騎士です」と言いました。アビゲイルの言葉では、「エイブリーはならず者であり、リアムは騎士です」。エイブリーは「アビゲイルがならず者であれば、エイデンは騎士です」と言いました。ソフィアによると、「エイブリーは騎士であるか、ソフィアは騎士です」。ヘンリーはアビゲイルが騎士であると表現しました。イザベラは「エイブリーはならず者であり、ソフィアは騎士です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムはならず者です  \n(2) エイデンはならず者です  \n(3) アビゲイルはならず者です  \n(4) エイブリーはならず者です  \n(5) ソフィアはならず者です  \n(6) ヘンリーはならず者です  \n(7) イザベラはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：オリビア、アメリア、サミュエル、エイヴァ、マイケル、シャーロット、そしてアレクサンダー。オリビアが言ったように、「アレクサンダーは騎士か、アレクサンダーはならず者です」。アメリアの発言では、「オリビアはならず者ではありません」。サミュエルは「マイケルはならず者で、エイヴァはならず者です」と述べました。エイヴァは「オリビアは騎士か、アメリアはならず者です」と主張しました。マイケルの言葉では、「アレクサンダーはならず者で、オリビアはならず者です」。シャーロットは、サミュエルはならず者ではないと言いました。「サミュエルはならず者で、オリビアはならず者です」とアレクサンダーが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアは騎士です  \n(2) アメリアは騎士です  \n(3) サミュエルはならず者です  \n(4) エイヴァは騎士です  \n(5) マイケルはならず者です  \n(6) シャーロットはならず者です  \n(7) アレクサンダーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ウィリアム、アメリア、ソフィア、オーウェン、ジャック、ジョセフ、そしてデイビッド。ウィリアムの言葉では、「もしウィリアムが騎士なら、デイビッドはならず者だ」と言っています。アメリアは、「ジョセフはならず者か、ウィリアムはならず者だ」と述べました。ソフィアは、「ウィリアムはならず者ではない」とコメントしました。オーウェンは、「アメリアはジョセフが騎士である場合に限り騎士だ」と主張しました。ジャックは、「もしウィリアムがならず者なら、アメリアは騎士だ」と言っているのが聞かれました。ジョセフは、「アメリアはならず者で、オーウェンは騎士だ」と指摘しました。「ウィリアムは騎士で、ジョセフは騎士だ」とデイビッドは主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムは騎士です  \n(2) アメリアは騎士です  \n(3) ソフィアは騎士です  \n(4) オーウェンはならず者です  \n(5) ジャックは騎士です  \n(6) ジョセフはならず者です  \n(7) デイビッドはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ヘンリー、ソフィア、ミア、ジャクソン、オリバー、サミュエル、そしてオーロラ。ヘンリーは「オリバーは騎士で、ソフィアはならず者だ」と主張しました。「ソフィアは騎士です」とソフィア。ミアは「ジャクソンは騎士であるのはヘンリーが騎士である場合に限る」と言いました。ジャクソンは「ソフィアは騎士です」と述べました。オリバーは「ジャクソンは騎士であるか、ミアは騎士である」と言いました。サミュエルは、ミアはジャクソンがならず者である場合に限り騎士であるとあなたに伝えました。オーロラはサミュエルがならず者だと言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ヘンリーはならず者です  \n(2) ソフィアは騎士です  \n(3) ミアはならず者です  \n(4) ジャクソンは騎士です  \n(5) オリバーは騎士です  \n(6) サミュエルは騎士です  \n(7) オーロラはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ウィリアム、アリア、セバスチャン、イザベラ、イヴリン、ペネロペ、そしてグレース。「イザベラはならず者であるのは、グレースがならず者である場合に限る」とウィリアムは主張しました。アリアの発言では、「グレースはならず者であるか、グレースは騎士である」と言いました。セバスチャンは「イヴリンはならず者だ」と指摘しました。「イザベラは騎士であるか、グレースは騎士である」とイザベラが言いました。「ペネロペはならず者であり、ペネロペは騎士である」とイヴリンが言及しました。ペネロペは「アリアは騎士だ」とコメントしました。グレースは「もしペネロペが騎士なら、アリアは騎士だ」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムは騎士です  \n(2) アリアは騎士です  \n(3) セバスチャンは騎士です  \n(4) イザベラは騎士です  \n(5) イヴリンはならず者です  \n(6) ペネロペは騎士です  \n(7) グレースは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：リリー、ジョセフ、ダニエル、ソフィア、エイブリー、ソフィア、そしてノア。リリーは「もしソフィアがならず者なら、エイブリーはならず者だ」と言いました。ジョセフは「エイブリーは騎士ではない」と指摘しました。ダニエルの言葉では「ノアはならず者だ」と言いました。ソフィアは「もしエイブリーが騎士なら、リリーは騎士だ」と言いました。エイブリーは「ソフィアは騎士だ」と言いました。ソフィアは「エイブリーはならず者ではない」とあなたに言いました。「ジョセフはならず者か、エイブリーはならず者だ」とノアは言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーは騎士です  \n(2) ジョセフはならず者です  \n(3) ダニエルはならず者です  \n(4) ソフィアは騎士です  \n(5) エイブリーは騎士です  \n(6) ソフィアは騎士です  \n(7) ノアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ハーパー、ジョセフ、リリー、オーウェン、クロエ、ジェームズ、そしてイヴリン。ハーパーは「イヴリンはならず者か、ジョセフはならず者だ」と言いました。ジョセフは「ジェームズはならず者か、イヴリンは騎士だ」と述べました。「ハーパーはならず者か、ジョセフは騎士だ」とリリーが言いました。オーウェンは「もしジェームズが騎士なら、ジェームズはならず者だ」と表現しました。「ジェームズは騎士か、ジョセフはならず者だ」とクロエが主張しました。ジェームズは「ハーパーはならず者であるのは、ジョセフが騎士である場合に限る」とコメントしました。イヴリンの発言では「オーウェンは騎士だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーは騎士です  \n(2) ジョセフはならず者です  \n(3) リリーはならず者です  \n(4) オーウェンはならず者です  \n(5) クロエは騎士です  \n(6) ジェームズは騎士です  \n(7) イヴリンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ヘンリー、クロエ、ジェイコブ、エラ、リアム、メイソン、そしてマイケル。ヘンリーによれば、「もしメイソンがならず者なら、ジェイコブはならず者です」。クロエはこう主張しました：「もしマイケルがならず者なら、ジェイコブはならず者です」。ジェイコブは「リアムはならず者で、ヘンリーは騎士です」と言いました。エラは、メイソンがならず者であるときに限り、クロエがならず者であると言いました。リアムは「マイケルはならず者です」と述べました。メイソンは「マイケルは騎士です」と主張しました。マイケルはあなたにヘンリーが騎士だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ヘンリーは騎士です  \n(2) クロエは騎士です  \n(3) ジェイコブは騎士です  \n(4) エラは騎士です  \n(5) リアムはならず者です  \n(6) メイソンは騎士です  \n(7) マイケルは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ハーパー、オリビア、ペネロペ、アメリア、クロエ、ベンジャミン、そしてエラ。「もしベンジャミンがならず者なら、ベンジャミンは騎士です」とハーパーが言いました。オリビアは「ハーパーはならず者か、ペネロペは騎士です」とあなたに言いました。ペネロペは「ハーパーは騎士か、ベンジャミンは騎士です」と述べました。アメリアは「ハーパーはならず者である場合、オリビアもならず者です」と主張しました。クロエの言葉では「エラはならず者である場合、ペネロペもならず者です」と言いました。ベンジャミンの言葉では「エラは騎士ではありません」と言いました。エラの発言では「クロエは騎士です」と言いました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーは騎士です  \n(2) オリビアは騎士です  \n(3) ペネロペは騎士です  \n(4) アメリアは騎士です  \n(5) クロエはならず者です  \n(6) ベンジャミンは騎士です  \n(7) エラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エイデン、アレクサンダー、ジェイコブ、オーロラ、マイケル、イザベラ、そしてヘンリー。エイデンは「エイデンは騎士であり、オーロラは騎士です」とコメントしました。アレクサンダーは「エイデンは騎士であるのは、オーロラがならず者である場合に限る」と主張しました。ジェイコブは「エイデンは騎士です」と言いました。オーロラの発言では「マイケルは騎士であるのは、ジェイコブがならず者である場合に限る」と述べました。マイケルは「イザベラは騎士ではありません」と主張しました。イザベラは「オーロラは騎士であるか、アレクサンダーは騎士である」とコメントしました。ヘンリーは「オーロラがならず者であれば、エイデンはならず者である」とあなたに伝えました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンは騎士です  \n(2) アレクサンダーはならず者です  \n(3) ジェイコブは騎士です  \n(4) オーロラは騎士です  \n(5) マイケルはならず者です  \n(6) イザベラは騎士です  \n(7) ヘンリーは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：イヴリン、ベンジャミン、リリー、エミリー、エイデン、アレクサンダー、そしてマシュー。「エイデンはならず者ではない」 - イヴリン。ベンジャミンによれば、「アレクサンダーはならず者です」。リリーは、マシューは騎士であり、イヴリンも騎士であると言いました。エミリーは、「リリーはならず者であり、イヴリンもならず者です」と言いました。エイデンは、「マシューはならず者か、アレクサンダーはならず者です」と言っているのが聞かれました。アレクサンダーは、「エイデンはならず者ではない」と言いました。マシューは、ベンジャミンは騎士か、マシューは騎士であると表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンは騎士です  \n(2) ベンジャミンはならず者です  \n(3) リリーはならず者です  \n(4) エミリーはならず者です  \n(5) エイデンは騎士です  \n(6) アレクサンダーは騎士です  \n(7) マシューはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：イザベラ、マシュー、エイデン、クロエ、ジャクソン、シャーロット、そしてイーサン。イザベラは「シャーロットは騎士ではない」と言いました。マシューの言葉では「エイデンはならず者で、クロエは騎士です」。エイデンの発言では「もしイザベラがならず者なら、シャーロットは騎士です」。クロエは「マシューはならず者で、イーサンは騎士です」と言いました。ジャクソンは、マシューは騎士で、シャーロットも騎士だと言いました。「ジャクソンは騎士ではない」とシャーロットは宣言しました。イーサンは「イザベラはならず者であるのは、マシューがならず者である場合に限る」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イザベラはならず者です  \n(2) マシューはならず者です  \n(3) エイデンは騎士です  \n(4) クロエは騎士です  \n(5) ジャクソンはならず者です  \n(6) シャーロットは騎士です  \n(7) イーサンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：オリバー、リアム、ウィリアム、ソフィア、ゾーイ、ルーク、そしてリリー。オリバーは言いました、「もしルークが騎士なら、リリーも騎士です」。リアムは主張しました：「ウィリアムは騎士で、リリーはならず者です」。ウィリアムはコメントしました、「リリーはならず者で、ソフィアはならず者です」。ソフィアの発言では、「ゾーイは騎士である場合に限り、ゾーイはならず者です」。ゾーイは、リリーはならず者であるか、ソフィアは騎士であると言いました。「ウィリアムはならず者ではない」とルークは主張しました。リリーは「ソフィアはならず者ではない」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリバーはならず者です  \n(2) リアムは騎士です  \n(3) ウィリアムは騎士です  \n(4) ソフィアはならず者です  \n(5) ゾーイは騎士です  \n(6) ルークは騎士です  \n(7) リリーはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ミア、スカーレット、エラ、グレース、アビゲイル、ノア、そしてジェームズ。ミアは「アビゲイルはならず者で、ノアはならず者です」と言いました。スカーレットは「アビゲイルは騎士か、ミアはならず者です」と言いました。エラは「ミアは騎士か、ジェームズは騎士です」とコメントしました。グレースによれば「ミアはならず者です」。アビゲイルは「グレースは騎士か、アビゲイルは騎士です」と言っているのが聞かれました。ノアの言葉では「エラはならず者ではありません」。ジェームズは「もしスカーレットがならず者なら、グレースはならず者です」とコメントしました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアはならず者です  \n(2) スカーレットは騎士です  \n(3) エラは騎士です  \n(4) グレースは騎士です  \n(5) アビゲイルは騎士です  \n(6) ノアは騎士です  \n(7) ジェームズは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：マシュー、オーロラ、ルーカス、グレース、シャーロット、アリア、そしてミア。マシューは「グレースはならず者ではない」と言いました。「ミアはならず者であるのは、シャーロットがならず者である場合に限る」とオーロラが言いました。ルーカスは「ミアはならず者か、アリアは騎士だ」と言っているのが聞かれました。グレースは「ルーカスはならず者だ」と述べました。シャーロットは「アリアはならず者で、マシューは騎士だ」と言っているのが聞かれました。「ミアはならず者か、グレースはならず者だ」とアリアが宣言しました。「マシューは騎士で、オーロラはならず者だ」とミアが主張しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マシューはならず者です  \n(2) オーロラは騎士です  \n(3) ルーカスは騎士です  \n(4) グレースはならず者です  \n(5) シャーロットはならず者です  \n(6) アリアは騎士です  \n(7) ミアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：マイケル、リリー、ルーカス、ジャクソン、エイヴァ、マシュー、そしてハーパー。マイケルは「マシューはならず者か、エイヴァは騎士だ」と主張しました。「リリーは騎士か、ルーカスは騎士だ」とリリーは言いました。ルーカスは「ハーパーがならず者なら、ハーパーは騎士だ」と述べました。ジャクソンは「マイケルは騎士である場合に限り、マイケルはならず者だ」と言っているのが聞かれました。エイヴァの言葉では、「マシューは騎士である場合に限り、ハーパーは騎士だ」と言いました。マシューは「ジャクソンは騎士だ」とコメントしました。「もしリリーがならず者なら、マシューはならず者だ」とハーパーが言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルは騎士です  \n(2) リリーは騎士です  \n(3) ルーカスは騎士です  \n(4) ジャクソンはならず者です  \n(5) エイヴァはならず者です  \n(6) マシューはならず者です  \n(7) ハーパーは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ペネロペ、アビゲイル、ジャクソン、リリー、マイケル、オーロラ、そしてソフィア。ペネロペは「ジャクソンは騎士か、ソフィアはならず者だ」と主張しました。アビゲイルの言葉では、「ジャクソンは騎士です」。ジャクソンは「リリーは騎士か、ペネロペはならず者です」と言いました。リリーは「ペネロペはならず者で、マイケルは騎士です」と言いました。「もしアビゲイルが騎士なら、オーロラはならず者です」とマイケルは宣言しました。オーロラは「リリーはならず者か、ソフィアはならず者です」と述べました。ソフィアは「ジャクソンはならず者であるのは、マイケルがならず者である場合に限ります」と指摘しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペは騎士です  \n(2) アビゲイルはならず者です  \n(3) ジャクソンはならず者です  \n(4) リリーはならず者です  \n(5) マイケルは騎士です  \n(6) オーロラは騎士です  \n(7) ソフィアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：スカーレット、エイブリー、ライリー、オリバー、イーサン、ウィリアム、そしてエマ。スカーレットは「エイブリーは騎士で、ウィリアムは騎士です」と言いました。「イーサンはならず者であるのは、スカーレットが騎士である場合に限ります」とエイブリーは主張しました。ライリーの言葉では、「もしエマがならず者なら、エイブリーはならず者です」と言いました。オリバーは「ライリーは騎士ではありません」と言いました。「オリバーは騎士です」とイーサンは宣言しました。「ライリーは騎士ではありません」とウィリアムは宣言しました。エマは「ウィリアムは騎士ではありません」と言っているのが聞かれました。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) スカーレットはならず者です  \n(2) エイブリーはならず者です  \n(3) ライリーは騎士です  \n(4) オリバーはならず者です  \n(5) イーサンはならず者です  \n(6) ウィリアムはならず者です  \n(7) エマは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ライリー、アレクサンダー、ノア、スカーレット、ジャクソン、オーロラ、そしてエイブリー。「エイブリーは騎士ではない」とライリーが宣言しました。「アレクサンダーはエイブリーが騎士である場合に限り騎士です」とアレクサンダーが言いました。ノアは「ライリーはならず者で、アレクサンダーもならず者です」と述べました。「エイブリーは騎士です」とスカーレットが主張しました。「ライリーはならず者かノアはならず者です」とジャクソンが言いました。オーロラはライリーが騎士であり、オーロラも騎士であると言いました。エイブリーは「アレクサンダーは騎士です」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ライリーはならず者です  \n(2) アレクサンダーは騎士です  \n(3) ノアはならず者です  \n(4) スカーレットは騎士です  \n(5) ジャクソンは騎士です  \n(6) オーロラはならず者です  \n(7) エイブリーは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ノア、リリー、オリバー、サミュエル、グレース、ミア、そしてスカーレットです。ノアの言葉では、「スカーレットは騎士ではない」と言っています。リリーは、「ノアは騎士であるか、オリバーは騎士である」と述べました。オリバーは、「ミアはならず者であるか、ミアは騎士である」と言いました。サミュエルは、リリーはならず者ではないと表現しました。グレースは、「リリーは騎士であるか、サミュエルは騎士である」と言っているのが聞かれました。ミアは、「スカーレットはならず者ではない」と言っているのが聞かれました。スカーレットは、「もしリリーがならず者なら、グレースは騎士である」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアはならず者です  \n(2) リリーは騎士です  \n(3) オリバーは騎士です  \n(4) サミュエルは騎士です  \n(5) グレースは騎士です  \n(6) ミアは騎士です  \n(7) スカーレットは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：オーウェン、エラ、デイビッド、メイソン、ハーパー、オーロラ、そしてクロエ。オーウェンは「デイビッドはならず者か、オーウェンは騎士だ」と言いました。エラは「オーウェンはならず者で、クロエはならず者だ」と指摘しました。デイビッドは「クロエは騎士ではない」と言いました。メイソンは「オーロラはエラがならず者である場合に限り騎士だ」と言っているのが聞かれました。ハーパーは「エラは騎士ではない」と述べました。「クロエは騎士だ」とオーロラが宣言しました。クロエの発言では「デイビッドはクロエが騎士である場合に限りならず者だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンは騎士です  \n(2) エラはならず者です  \n(3) デイビッドはならず者です  \n(4) メイソンは騎士です  \n(5) ハーパーは騎士です  \n(6) オーロラは騎士です  \n(7) クロエは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ソフィア、アレクサンダー、メイソン、クロエ、イヴリン、ペネロペ、そしてルーク。ソフィアは、アレクサンダーが騎士であるのはソフィアが騎士である場合に限るとあなたに言いました。「ソフィアは騎士であるか、クロエはならず者である」とアレクサンダーは主張しました。「クロエがならず者であるのは、クロエが騎士である場合に限る」とメイソンは言及しました。クロエは、「もしクロエが騎士であれば、メイソンはならず者である」と主張しました。イヴリンは、メイソンがならず者であるか、クロエがならず者であると表現しました。ペネロペは、「ソフィアはならず者であるか、アレクサンダーはならず者である」と主張しました。ルークは、「イヴリンはならず者ではない」とコメントしました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) アレクサンダーは騎士です  \n(3) メイソンはならず者です  \n(4) クロエは騎士です  \n(5) イヴリンは騎士です  \n(6) ペネロペはならず者です  \n(7) ルークは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：マシュー、ソフィア、イヴリン、イーサン、ヘンリー、ジェームズ、そしてアビゲイルです。マシューは「ジェームズはならず者ではない」と言っているのが聞かれました。「アビゲイルがならず者なら、ジェームズは騎士だ」とソフィアが言いました。イヴリンは、ジェームズがならず者であるのは、マシューがならず者である場合に限るとあなたに伝えました。イーサンは「イヴリンはならず者ではない」と主張しました。「マシューは騎士であるのは、ソフィアがならず者である場合に限る」とヘンリーが主張しました。ジェームズは「イヴリンはならず者ではない」と言っているのが聞かれました。アビゲイルの発言では「ジェームズは騎士ではない」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マシューは騎士です  \n(2) ソフィアは騎士です  \n(3) イヴリンは騎士です  \n(4) イーサンは騎士です  \n(5) ヘンリーはならず者です  \n(6) ジェームズは騎士です  \n(7) アビゲイルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：サミュエル、エイデン、ビクトリア、アレクサンダー、オリビア、ジェームズ、そしてノア。サミュエルは「アレクサンダーは騎士である場合に限り、アレクサンダーはならず者である」と言いました。エイデンは「ノアは騎士であり、オリビアはならず者だ」と述べました。ビクトリアは「ノアは騎士であり、ジェームズは騎士だ」と言いました。「ビクトリアは騎士ではない」とアレクサンダーは宣言しました。オリビアは「ジェームズはならず者であり、エイデンはならず者だ」と言っているのが聞かれました。「ビクトリアはならず者だ」とジェームズが言いました。ノアは「ビクトリアは騎士である場合に限り、サミュエルはならず者だ」と指摘しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルはならず者です  \n(2) エイデンはならず者です  \n(3) ビクトリアはならず者です  \n(4) アレクサンダーは騎士です  \n(5) オリビアはならず者です  \n(6) ジェームズは騎士です  \n(7) ノアはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ソフィア、ビクトリア、ゾーイ、エラ、アリア、ミア、そしてオリビア。ソフィアは「エラは騎士か、ビクトリアはならず者だ」と言いました。「アリアはならず者だ」とビクトリアが主張しました。ゾーイは「ソフィアは騎士である場合、ビクトリアはならず者である」とあなたに言いました。エラの言葉では、「オリビアは騎士であり、オリビアはならず者だ」と言いました。「エラはならず者だ」とアリアが宣言しました。「ビクトリアは騎士であり、オリビアはならず者だ」とミアが言いました。「もしソフィアが騎士なら、アリアは騎士だ」とオリビアが言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) ビクトリアはならず者です  \n(3) ゾーイは騎士です  \n(4) エラはならず者です  \n(5) アリアは騎士です  \n(6) ミアはならず者です  \n(7) オリビアは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エイヴァ、ルーク、スカーレット、ローガン、アメリア、オーロラ、そしてイーサン。エイヴァは「ローガンはならず者で、アメリアはならず者だ」と言っているのが聞かれました。ルークは「オーロラは騎士ではない」と述べました。「ルークは騎士だ」とスカーレットは主張しました。ローガンは「ルークは騎士だ」と言いました。アメリアは「もしルークが騎士なら、ローガンは騎士だ」とあなたに言いました。「ローガンはならず者で、アメリアはならず者だ」とオーロラは言及しました。「アメリアは騎士だ」とイーサンは宣言しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァはならず者です  \n(2) ルークは騎士です  \n(3) スカーレットは騎士です  \n(4) ローガンは騎士です  \n(5) アメリアは騎士です  \n(6) オーロラはならず者です  \n(7) イーサンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：イヴリン、エミリー、リリー、ジョセフ、オーウェン、エマ、そしてグレース。イヴリンは、ジョセフがならず者であるか、リリーが騎士であると表現しました。「ジョセフは騎士です」 - エミリー。「もしオーウェンが騎士なら、ジョセフはならず者です」 - リリー。「リリーは騎士ではない」とジョセフは主張しました。オーウェンは、エミリーがならず者であると表現しました。エマは、リリーが騎士であり、グレースがならず者であると言いました。グレースの発言では、「ジョセフは騎士であり、オーウェンは騎士です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンは騎士です  \n(2) エミリーはならず者です  \n(3) リリーは騎士です  \n(4) ジョセフはならず者です  \n(5) オーウェンは騎士です  \n(6) エマは騎士です  \n(7) グレースはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エイブリー、サミュエル、エマ、ダニエル、ローガン、デイビッド、そしてオリバー。エイブリーは「サミュエルは騎士で、エイブリーは騎士です」と言いました。サミュエルは「エマはならず者で、エイブリーは騎士です」と言いました。「デイビッドはならず者で、オリバーはならず者です」とエマは宣言しました。ダニエルの発言では「ダニエルは騎士で、エイブリーは騎士です」と言いました。ローガンはあなたにエイブリーはならず者ではないと言いました。「もしオリバーがならず者なら、エマは騎士です」とデイビッドが言いました。オリバーの発言では「ローガンはエマがならず者である場合に限りならず者です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーはならず者です  \n(2) サミュエルはならず者です  \n(3) エマはならず者です  \n(4) ダニエルはならず者です  \n(5) ローガンはならず者です  \n(6) デイビッドは騎士です  \n(7) オリバーは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ノア、マイケル、エイヴァ、ハーパー、ジェームズ、オーウェン、そしてソフィア。ノアによれば、「ソフィアは騎士です」。マイケルによると、「ハーパーはノアがならず者である場合に限り、ならず者です」。エイヴァの言葉では、「エイヴァは騎士であり、ジェームズは騎士です」。ハーパーは「マイケルは騎士であるか、ジェームズは騎士です」と言いました。ジェームズは「オーウェンは騎士であるか、ソフィアはならず者です」と述べました。「マイケルはならず者であり、ソフィアは騎士です」とオーウェンが言いました。ソフィアは「ハーパーはならず者ではありません」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアは騎士です  \n(2) マイケルは騎士です  \n(3) エイヴァはならず者です  \n(4) ハーパーは騎士です  \n(5) ジェームズはならず者です  \n(6) オーウェンはならず者です  \n(7) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジェイコブ、ジェームズ、オリビア、スカーレット、エマ、シャーロット、そしてビクトリア。ジェイコブの発言：「スカーレットはならず者か、ビクトリアはならず者です」。ジェームズの発言：「ビクトリアはならず者か、オリビアは騎士です」。オリビアは「ジェイコブは騎士ではありません」と述べました。スカーレットは「シャーロットはならず者ではありません」と表現しました。エマは「もしビクトリアが騎士なら、オリビアはならず者です」とコメントしました。シャーロットは「エマはならず者です」とコメントしました。ビクトリアの言葉では、「ジェームズは騎士です」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブはならず者です  \n(2) ジェームズは騎士です  \n(3) オリビアは騎士です  \n(4) スカーレットは騎士です  \n(5) エマはならず者です  \n(6) シャーロットは騎士です  \n(7) ビクトリアは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エマ、ハーパー、イザベラ、イーサン、エイヴァ、デイビッド、そしてサミュエル。エマによれば、「サミュエルはならず者ではない」とのことです。「デイビッドは騎士です」とハーパーが宣言しました。イザベラは「イザベラは騎士で、エイヴァも騎士です」と述べました。イーサンは「サミュエルは騎士で、デイビッドはならず者です」と言いました。「ハーパーはならず者ではない」とエイヴァが言いました。デイビッドは「エマはならず者ではない」と指摘しました。サミュエルは「イーサンは騎士で、エマは騎士です」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エマはならず者です  \n(2) ハーパーはならず者です  \n(3) イザベラはならず者です  \n(4) イーサンはならず者です  \n(5) エイヴァはならず者です  \n(6) デイビッドはならず者です  \n(7) サミュエルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ペネロペ、オーウェン、グレース、アメリア、エイデン、ルーカス、そしてミア。ペネロペは「もしミアが騎士なら、エイデンはならず者です」と言いました。オーウェンは、グレースが騎士であるか、ペネロペが騎士であると言いました。グレースの発言では、「ペネロペは騎士であるか、アメリアはならず者です」と述べています。アメリアは「オーウェンはならず者ではありません」と指摘しました。エイデンの発言では、「ペネロペは騎士である場合に限り、オーウェンはならず者です」と言いました。ルーカスによれば、「エイデンは騎士である場合に限り、オーウェンはならず者です」とのことです。ミアは「オーウェンはならず者ではありません」と述べました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペは騎士です  \n(2) オーウェンは騎士です  \n(3) グレースは騎士です  \n(4) アメリアは騎士です  \n(5) エイデンはならず者です  \n(6) ルーカスは騎士です  \n(7) ミアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：アレクサンダー、ソフィア、サミュエル、デイビッド、イザベラ、ウィリアム、そしてアビゲイル。アレクサンダーの発言によれば、「アビゲイルはならず者です」。ソフィアはイザベラがならず者ではないと言いました。サミュエルによると、「ウィリアムはならず者ではありません」。デイビッドは「イザベラは騎士ではありません」とコメントしました。イザベラは「ソフィアは騎士であるか、ウィリアムは騎士です」と言いました。ウィリアムは「アレクサンダーは騎士であるか、アビゲイルはならず者です」と述べました。アビゲイルは「ウィリアムはイザベラがならず者である場合に限り、ならず者です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アレクサンダーはならず者です  \n(2) ソフィアはならず者です  \n(3) サミュエルはならず者です  \n(4) デイビッドは騎士です  \n(5) イザベラはならず者です  \n(6) ウィリアムはならず者です  \n(7) アビゲイルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ライリー、ヘンリー、エリザベス、イザベラ、ジェームズ、ベンジャミン、そしてソフィア。ライリーは「ライリーは騎士であるのは、ジェームズがならず者である場合に限る」と述べました。「ヘンリーは騎士であるのは、ベンジャミンがならず者である場合に限る」とヘンリーは宣言しました。エリザベスは、もしベンジャミンがならず者であれば、ライリーもならず者であると言いました。イザベラは「ベンジャミンはならず者だ」と言いました。ジェームズは「ライリーは騎士であり、ソフィアも騎士だ」と指摘しました。ベンジャミンの言葉では「エリザベスは騎士だ」と言いました。ソフィアの発言では「ヘンリーはならず者であるのは、エリザベスが騎士である場合に限る」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ライリーは騎士です  \n(2) ヘンリーはならず者です  \n(3) エリザベスはならず者です  \n(4) イザベラは騎士です  \n(5) ジェームズはならず者です  \n(6) ベンジャミンはならず者です  \n(7) ソフィアはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ゾーイ、エイヴァ、ジェイコブ、ウィリアム、ヘンリー、イザベラ、そしてエイデン。ゾーイは「エイデンは騎士であるのは、ジェイコブが騎士である場合に限る」と言いました。エイヴァは「エイデンは騎士であるか、ゾーイはならず者である」と主張しました。ジェイコブによれば「エイヴァは騎士であるのは、エイデンが騎士である場合に限る」とのことです。ウィリアムは「ウィリアムは騎士であり、ヘンリーも騎士である」とあなたに言いました。「ジェイコブはならず者であるか、イザベラは騎士である」とヘンリーは主張しました。イザベラは「エイヴァは騎士であるのは、エイデンがならず者である場合に限る」と言いました。「イザベラはならず者であるか、ジェイコブはならず者である」とエイデンは宣言しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ゾーイは騎士です  \n(2) エイヴァは騎士です  \n(3) ジェイコブは騎士です  \n(4) ウィリアムはならず者です  \n(5) ヘンリーはならず者です  \n(6) イザベラはならず者です  \n(7) エイデンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ペネロペ、オリバー、ジェイコブ、メイソン、ジェームズ、エマ、そしてルーカスです。ペネロペは、メイソンがならず者だと言いました。オリバーは「ルーカスはならず者か、オリバーは騎士だ」と言っているのが聞かれました。ジェイコブによれば、「もしペネロペが騎士なら、エマはならず者です」。メイソンは、オリバーがならず者ではないと表現しました。「メイソンはならず者であるのは、オリバーが騎士である場合に限る」とジェームズが言いました。エマの発言では、「ジェームズは騎士であるのは、メイソンがならず者である場合に限る」と述べました。ルーカスは「エマは騎士か、ジェームズは騎士だ」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペはならず者です  \n(2) オリバーは騎士です  \n(3) ジェイコブは騎士です  \n(4) メイソンは騎士です  \n(5) ジェームズはならず者です  \n(6) エマは騎士です  \n(7) ルーカスは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エイブリー、エイヴァ、ミア、ペネロペ、ライリー、サミュエル、そしてオリビア。エイブリーによると、「エイヴァは騎士で、ペネロペは騎士です」。エイヴァはミアが騎士で、ペネロペが騎士だと言いました。ミアの発言では、「ペネロペはならず者で、エイブリーは騎士です」。ペネロペは「ライリーは騎士です」と述べました。「もしミアがならず者なら、エイブリーは騎士です」とライリーが言いました。「ペネロペはならず者か、エイヴァはならず者です」とサミュエルが主張しました。「サミュエルはエイブリーが騎士である場合に限り騎士です」とオリビアが主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーはならず者です  \n(2) エイヴァはならず者です  \n(3) ミアはならず者です  \n(4) ペネロペはならず者です  \n(5) ライリーはならず者です  \n(6) サミュエルは騎士です  \n(7) オリビアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ペネロペ、ソフィア、リリー、オーロラ、ノア、ジャクソン、そしてルーク。ペネロペはソフィアがならず者であると表現しました。ソフィアはルークがならず者であると表現しました。「ジャクソンはならず者で、オーロラは騎士だ」とリリーは主張しました。オーロラは「リリーはならず者ではない」と断言しました。ノアは「ジャクソンはならず者ではない」と言っているのが聞かれました。ジャクソンの言葉では「ルークはならず者ではない」と言いました。ルークは「オーロラはノアがならず者である場合に限り、ならず者である」とコメントしました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペはならず者です  \n(2) ソフィアは騎士です  \n(3) リリーは騎士です  \n(4) オーロラは騎士です  \n(5) ノアはならず者です  \n(6) ジャクソンはならず者です  \n(7) ルークはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：マシュー、エラ、ハーパー、アレクサンダー、ペネロペ、ベンジャミン、そしてエイヴァです。「ハーパーは騎士だ」とマシューが宣言しました。エラは「エイヴァはならず者か、マシューはならず者だ」と言っているのが聞かれました。ハーパーは「エイヴァは騎士ではない」と言いました。アレクサンダーは「エラは騎士である場合、エイヴァはならず者である」と言いました。ペネロペによれば、「エイヴァが騎士であれば、アレクサンダーはならず者だ」とのことです。「エイヴァはハーパーが騎士である場合に限り騎士だ」とベンジャミンが宣言しました。エイヴァは「マシューがならず者であれば、ハーパーはならず者だ」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マシューはならず者です  \n(2) エラは騎士です  \n(3) ハーパーはならず者です  \n(4) アレクサンダーはならず者です  \n(5) ペネロペは騎士です  \n(6) ベンジャミンはならず者です  \n(7) エイヴァは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：マシュー、ベンジャミン、イーサン、メイソン、ビクトリア、ジェイコブ、そしてルーカス。マシューによれば、「ビクトリアはならず者ではない」とのことです。ベンジャミンは、「もしメイソンが騎士なら、マシューはならず者だ」とコメントしました。イーサンは、「マシューは騎士である場合に限り、ルーカスは騎士である」と言っているのが聞かれました。メイソンは、「メイソンは騎士である場合に限り、ビクトリアは騎士である」と言っているのが聞かれました。ビクトリアは、「もしジェイコブがならず者なら、ベンジャミンはならず者だ」と言っているのが聞かれました。「マシューはならず者だ」とジェイコブが言いました。ルーカスは、「ベンジャミンはならず者である場合に限り、ジェイコブはならず者だ」と指摘しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マシューは騎士です  \n(2) ベンジャミンはならず者です  \n(3) イーサンは騎士です  \n(4) メイソンは騎士です  \n(5) ビクトリアは騎士です  \n(6) ジェイコブはならず者です  \n(7) ルーカスは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ウィリアム、ハーパー、メイソン、ジェームズ、サミュエル、アメリア、そしてマシュー。ウィリアムは、「もしメイソンが騎士なら、サミュエルはならず者だ」と述べました。ハーパーは、「メイソンは騎士か、ジェームズは騎士だ」と言いました。メイソンは、サミュエルはならず者であり、サミュエルは騎士だと述べました。ジェームズは、アメリアはならず者ではないと言いました。サミュエルは、「ウィリアムはならず者ではない」と言っているのが聞かれました。アメリアの発言では、「ジェームズがならず者である場合に限り、マシューはならず者である」と述べました。マシューによれば、「ハーパーが騎士なら、アメリアはならず者だ」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムは騎士です  \n(2) ハーパーはならず者です  \n(3) メイソンはならず者です  \n(4) ジェームズはならず者です  \n(5) サミュエルは騎士です  \n(6) アメリアはならず者です  \n(7) マシューは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：デイビッド、エイデン、アビゲイル、アレクサンダー、エマ、ジャクソン、そしてエイヴァ。デイビッドは、エイデンが騎士であるのはジャクソンがならず者である場合に限るとあなたに言いました。エイデンは、「エイヴァはならず者であるか、アレクサンダーは騎士である」と言いました。アビゲイルは、「アレクサンダーはならず者であるか、エイヴァは騎士である」と述べました。アレクサンダーによれば、「ジャクソンは騎士ではない」とのことです。エマは、もしデイビッドが騎士であればアビゲイルも騎士であると言いました。ジャクソンは、デイビッドが騎士でありエマがならず者であると言いました。エイヴァは、「もしエマが騎士であればアレクサンダーも騎士である」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドは騎士です  \n(2) エイデンは騎士です  \n(3) アビゲイルは騎士です  \n(4) アレクサンダーは騎士です  \n(5) エマは騎士です  \n(6) ジャクソンはならず者です  \n(7) エイヴァは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エリザベス、ジェームズ、エイデン、ミア、オリビア、ゾーイ、そしてオーロラ。エリザベスは「もしミアがならず者なら、ゾーイはならず者です」と述べました。ジェームズは「エイデンは騎士です」と言いました。「ゾーイはならず者か、エリザベスはならず者です」とエイデンが宣言しました。ミアは「もしジェームズがならず者なら、ミアは騎士です」と言っているのが聞かれました。オリビアは「もしジェームズがならず者なら、オーロラはならず者です」とコメントしました。「ミアは騎士か、オーロラは騎士です」とゾーイが宣言しました。オーロラは「ミアは騎士ではありません」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスは騎士です  \n(2) ジェームズはならず者です  \n(3) エイデンはならず者です  \n(4) ミアは騎士です  \n(5) オリビアは騎士です  \n(6) ゾーイは騎士です  \n(7) オーロラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：グレース、スカーレット、アメリア、リリー、セバスチャン、ダニエル、そしてビクトリア。グレースは「ダニエルは騎士である場合に限り、ダニエルはならず者である」と言っているのが聞かれました。スカーレットは「セバスチャンはならず者であり、ビクトリアはならず者である」と述べました。アメリアの発言では「スカーレットはならず者である場合に限り、ビクトリアは騎士である」と言いました。「ダニエルは騎士ではない」とリリーが言いました。「もしアメリアがならず者なら、アメリアは騎士である」とセバスチャンが言いました。ダニエルによれば「もしセバスチャンが騎士なら、リリーはならず者である」とのことです。ビクトリアは「ダニエルはならず者である場合に限り、グレースはならず者である」と表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) グレースはならず者です  \n(2) スカーレットはならず者です  \n(3) アメリアは騎士です  \n(4) リリーは騎士です  \n(5) セバスチャンは騎士です  \n(6) ダニエルはならず者です  \n(7) ビクトリアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ベンジャミン、クロエ、エミリー、ライリー、ミア、イザベラ、そしてペネロペ。ベンジャミンは「エミリーは騎士で、イザベラはならず者だ」と主張しました。クロエによれば、「ペネロペは騎士です」。エミリーは「エミリーは騎士か、ベンジャミンはならず者です」と言いました。ライリーは「ミアはならず者で、エミリーはならず者だ」と言っているのが聞かれました。ミアによれば、「イザベラはエミリーがならず者である場合に限り騎士です」。イザベラは「ライリーは騎士ではない」と述べました。「エミリーは騎士で、イザベラは騎士です」とペネロペは言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンはならず者です  \n(2) クロエは騎士です  \n(3) エミリーは騎士です  \n(4) ライリーはならず者です  \n(5) ミアはならず者です  \n(6) イザベラは騎士です  \n(7) ペネロペは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：デイビッド、ベンジャミン、マイケル、イヴリン、シャーロット、アメリア、そしてジェームズ。デイビッドの言葉では、「マイケルはならず者です」。ベンジャミンは「シャーロットはならず者ではありません」と述べました。マイケルの言葉では、「シャーロットはデイビッドが騎士である場合に限り騎士です」。イヴリンの言葉では、「ジェームズは騎士であるか、ベンジャミンはならず者です」。シャーロットは「もしイヴリンが騎士なら、マイケルはならず者です」と宣言しました。アメリアは、ジェームズはならず者ではないとあなたに言いました。ジェームズの言葉では、「デイビッドは騎士です」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドはならず者です  \n(2) ベンジャミンはならず者です  \n(3) マイケルは騎士です  \n(4) イヴリンは騎士です  \n(5) シャーロットはならず者です  \n(6) アメリアはならず者です  \n(7) ジェームズはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ベンジャミン、ソフィア、メイソン、エイヴァ、アリア、アビゲイル、そしてリアム。ベンジャミンは、リアムがならず者であり、リアムが騎士であると表現しました。ソフィアは、「エイヴァは騎士であり、リアムは騎士です」と述べました。メイソンによれば、「エイヴァは騎士か、アビゲイルはならず者です」。エイヴァは、「リアムは騎士か、アビゲイルはならず者です」と主張しました。アリアは、「メイソンは騎士であり、アビゲイルはならず者です」と主張しました。アビゲイルの言葉では、「エイヴァはならず者であり、ベンジャミンは騎士です」。リアムは、「エイヴァはならず者であり、ソフィアはならず者です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンはならず者です  \n(2) ソフィアはならず者です  \n(3) メイソンは騎士です  \n(4) エイヴァは騎士です  \n(5) アリアは騎士です  \n(6) アビゲイルはならず者です  \n(7) リアムはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：イザベラ、ルーカス、アビゲイル、イーサン、オリバー、ゾーイ、そしてウィリアムです。イザベラは「オリバーが騎士ならウィリアムも騎士です」と主張しました。ルーカスはイザベラが騎士だと言いました。「オリバーはならず者でアビゲイルは騎士です」とアビゲイルが言いました。イーサンはあなたにゾーイがならず者だと言いました。オリバーは「イーサンはアビゲイルがならず者である場合に限り騎士です」と述べました。ゾーイによれば「ルーカスが騎士ならイザベラは騎士です」。ウィリアムは「ゾーイはならず者でイーサンは騎士です」と主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イザベラは騎士です  \n(2) ルーカスは騎士です  \n(3) アビゲイルはならず者です  \n(4) イーサンはならず者です  \n(5) オリバーはならず者です  \n(6) ゾーイは騎士です  \n(7) ウィリアムはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ローガン、エマ、グレース、アレクサンダー、エミリー、ダニエル、そしてオリバーです。「ダニエルは騎士だ」とローガンが言いました。エマは「ローガンは騎士ではない」と述べました。グレースは「ダニエルは騎士か、ダニエルはならず者だ」と言っているのが聞こえました。アレクサンダーの言葉では、「もしダニエルがならず者なら、エミリーは騎士だ」と言いました。エミリーは「オリバーは騎士だ」とコメントしました。ダニエルは「グレースはならず者ではない」と述べました。オリバーは「ローガンはならず者か、グレースは騎士だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンは騎士です  \n(2) エマはならず者です  \n(3) グレースは騎士です  \n(4) アレクサンダーは騎士です  \n(5) エミリーは騎士です  \n(6) ダニエルは騎士です  \n(7) オリバーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エラ、ビクトリア、オーロラ、ノア、リリー、ヘンリー、そしてアレクサンダー。エラは「アレクサンダーは騎士か、オーロラは騎士です」と述べました。「リリーは騎士であり、リリーはならず者です」とビクトリアが言いました。「もしノアが騎士なら、ビクトリアはならず者です」とオーロラが言いました。「アレクサンダーはならず者か、ヘンリーはならず者です」とノアが主張しました。リリーはビクトリアがならず者であると表現しました。ヘンリーは「オーロラは騎士ではありません」と言いました。アレクサンダーの発言では、「もしオーロラがならず者なら、アレクサンダーは騎士です」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラは騎士です  \n(2) ビクトリアはならず者です  \n(3) オーロラは騎士です  \n(4) ノアは騎士です  \n(5) リリーは騎士です  \n(6) ヘンリーはならず者です  \n(7) アレクサンダーは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：オリビア、デイビッド、エイヴァ、ベンジャミン、クロエ、アメリア、そしてダニエルです。オリビアの言葉によれば、「ベンジャミンはデイビッドがならず者である場合に限り騎士です」。デイビッドは「アメリアはならず者であるか、ベンジャミンは騎士です」と述べました。エイヴァによれば、「クロエは騎士であるか、ダニエルは騎士です」。ベンジャミンによると、「デイビッドはならず者である場合に限り、ベンジャミンは騎士です」。クロエは「デイビッドが騎士であれば、ダニエルも騎士です」とあなたに言いました。アメリアは「アメリアは騎士です」と言いました。「エイヴァはならず者です」とダニエルが宣言しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアはならず者です  \n(2) デイビッドはならず者です  \n(3) エイヴァは騎士です  \n(4) ベンジャミンはならず者です  \n(5) クロエは騎士です  \n(6) アメリアは騎士です  \n(7) ダニエルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：リリー、ジェームズ、アレクサンダー、オーウェン、スカーレット、ソフィア、そしてデイビッド。リリーはソフィアが騎士であると表現しました。「スカーレットはならず者だ」とジェームズは主張しました。「リリーが騎士である場合に限り、ジェームズは騎士だ」とアレクサンダーは言いました。「オーウェンは騎士であるか、スカーレットは騎士である」とオーウェンが言いました。スカーレットの発言では、「もしジェームズがならず者なら、デイビッドは騎士だ」と言いました。ソフィアの言葉では、「デイビッドは騎士であるか、スカーレットは騎士である」と言いました。デイビッドの発言では、「ソフィアはならず者であるか、デイビッドは騎士である」と言いました。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーは騎士です  \n(2) ジェームズはならず者です  \n(3) アレクサンダーはならず者です  \n(4) オーウェンは騎士です  \n(5) スカーレットは騎士です  \n(6) ソフィアは騎士です  \n(7) デイビッドは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ゾーイ、イヴリン、ソフィア、マシュー、ジャクソン、オーウェン、そしてベンジャミン。ゾーイは「ゾーイは騎士か、ソフィアはならず者だ」と述べました。イヴリンの発言では「ゾーイは騎士です」と言いました。ソフィアは「ジャクソンはならず者か、ゾーイは騎士です」と主張しました。マシューは「もしベンジャミンがならず者なら、ゾーイはならず者です」と表現しました。ジャクソンの発言では「ソフィアは騎士です」と言いました。オーウェンは「マシューは騎士ではありません」と述べました。「ゾーイは騎士です」とベンジャミンは主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ゾーイは騎士です  \n(2) イヴリンは騎士です  \n(3) ソフィアは騎士です  \n(4) マシューは騎士です  \n(5) ジャクソンは騎士です  \n(6) オーウェンはならず者です  \n(7) ベンジャミンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ダニエル、アレクサンダー、エイヴァ、ジェイコブ、ベンジャミン、マシュー、そしてアビゲイルです。ダニエルはこう言いました。「もしマシューがならず者なら、アビゲイルは騎士です」。アレクサンダーは「マシューはならず者で、ダニエルは騎士です」と言いました。エイヴァは「ジェイコブはならず者です」とコメントしました。ジェイコブは「ダニエルは騎士か、アレクサンダーは騎士です」と述べました。ベンジャミンはアレクサンダーが騎士で、アレクサンダーがならず者であると表現しました。マシューの言葉では、「ベンジャミンは騎士で、エイヴァはならず者です」と言いました。アビゲイルはあなたに、ベンジャミンは騎士ではないと言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルは騎士です  \n(2) アレクサンダーは騎士です  \n(3) エイヴァはならず者です  \n(4) ジェイコブは騎士です  \n(5) ベンジャミンはならず者です  \n(6) マシューはならず者です  \n(7) アビゲイルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ベンジャミン、ペネロペ、ビクトリア、エイデン、マイケル、イザベラ、そしてジャクソンです。「ビクトリアが騎士なら、マイケルも騎士だ」とベンジャミンが宣言しました。ペネロペは、ビクトリアが騎士であるか、エイデンがならず者であると言いました。ビクトリアは「エイデンは騎士だ」とコメントしました。エイデンは「ペネロペは騎士か、ビクトリアはならず者だ」と主張しました。マイケルは「ベンジャミンはならず者か、マイケルは騎士だ」と述べました。「エイデンはならず者ではない」とイザベラが言いました。ジャクソンは「ベンジャミンはならず者だ」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンは騎士です  \n(2) ペネロペは騎士です  \n(3) ビクトリアは騎士です  \n(4) エイデンは騎士です  \n(5) マイケルは騎士です  \n(6) イザベラは騎士です  \n(7) ジャクソンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：イザベラ、ソフィア、マシュー、エリザベス、ルーカス、ベンジャミン、そしてオーウェン。イザベラは「オーウェンはならず者で、ソフィアはならず者です」とコメントしました。ソフィアは「イザベラが騎士であるのは、ルーカスが騎士である場合に限る」と言いました。マシューの言葉では、「マシューは騎士であるのは、ルーカスがならず者である場合に限る」とのことです。「マシューはならず者で、ソフィアはならず者です」とエリザベスが言いました。ルーカスによれば、「マシューは騎士であるのは、イザベラが騎士である場合に限る」とのことです。ベンジャミンは「ソフィアはならず者ではありません」と指摘しました。オーウェンによれば、「イザベラが騎士であれば、ソフィアはならず者です」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イザベラはならず者です  \n(2) ソフィアは騎士です  \n(3) マシューは騎士です  \n(4) エリザベスはならず者です  \n(5) ルーカスはならず者です  \n(6) ベンジャミンは騎士です  \n(7) オーウェンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ベンジャミン、エラ、エイヴァ、アビゲイル、マシュー、シャーロット、そしてジャック。「ジャックはならず者であるのは、マシューが騎士である場合に限る」 - ベンジャミン。エラによれば、「ジャックはならず者であるか、エイヴァはならず者である」。エイヴァは「マシューは騎士ではない」と言っているのが聞かれました。アビゲイルは「マシューはならず者であるのは、エイヴァが騎士である場合に限る」と述べました。「ジャックは騎士であり、ベンジャミンはならず者である」 - マシュー。「エラは騎士であるか、マシューは騎士である」 - シャーロット。「エラはならず者ではない」とジャックは主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ベンジャミンはならず者です  \n(2) エラは騎士です  \n(3) エイヴァはならず者です  \n(4) アビゲイルは騎士です  \n(5) マシューは騎士です  \n(6) シャーロットは騎士です  \n(7) ジャックは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジェイコブ、アメリア、デイビッド、イヴリン、ミア、セバスチャン、そしてグレース。ジェイコブはイヴリンが騎士ではないと言いました。アメリアは「もしグレースがならず者なら、イヴリンは騎士です」と言いました。デイビッドは「ジェイコブが騎士であるのは、デイビッドが騎士である場合に限る」と述べました。イヴリンは「ジェイコブがならず者か、デイビッドがならず者です」と言いました。ミアは「イヴリンがならず者であるのは、グレースが騎士である場合に限る」と指摘しました。セバスチャンは「ミアは騎士です」と述べました。グレースは「ジェイコブはならず者で、グレースは騎士です」とコメントしました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブは騎士です  \n(2) アメリアはならず者です  \n(3) デイビッドは騎士です  \n(4) イヴリンはならず者です  \n(5) ミアはならず者です  \n(6) セバスチャンはならず者です  \n(7) グレースはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ソフィア、アビゲイル、エイヴァ、イーサン、サミュエル、マイケル、そしてライリー。ソフィアは「エイヴァが騎士である場合に限り、エイヴァはならず者である」と言いました。アビゲイルは「もしソフィアが騎士なら、ライリーはならず者だ」と指摘しました。エイヴァは「アビゲイルはならず者ではない」と主張しました。イーサンは「もしサミュエルが騎士なら、マイケルはならず者だ」と表現しました。「ライリーは騎士で、エイヴァはならず者だ」とサミュエルは主張しました。「ライリーは騎士で、エイヴァは騎士だ」とマイケルは言いました。ライリーはあなたに「イーサンはならず者か、ソフィアは騎士だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアはならず者です  \n(2) アビゲイルは騎士です  \n(3) エイヴァは騎士です  \n(4) イーサンは騎士です  \n(5) サミュエルはならず者です  \n(6) マイケルはならず者です  \n(7) ライリーはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジェームズ、ジャクソン、エミリー、リアム、ジェイコブ、オリバー、そしてジャック。ジェームズは「ジャックはならず者であるのは、ジェームズが騎士である場合に限る」とコメントしました。「ジェイコブは騎士ではない」とジャクソンが言いました。エミリーの発言では「リアムはならず者です」と述べました。リアムの発言では「ジェームズは騎士であるか、ジャクソンは騎士である」と言いました。ジェイコブは「ジェームズはならず者ではない」と述べました。オリバーによれば「リアムはならず者ではない」と言いました。ジャックは「ジェイコブは騎士ではない」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズは騎士です  \n(2) ジャクソンはならず者です  \n(3) エミリーはならず者です  \n(4) リアムは騎士です  \n(5) ジェイコブは騎士です  \n(6) オリバーは騎士です  \n(7) ジャックはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ウィリアム、エラ、ヘンリー、メイソン、ジェームズ、エマ、そしてハーパーです。ウィリアムは「もしウィリアムが騎士なら、メイソンはならず者だ」と主張しました。エラは「メイソンはならず者だ」と述べました。ヘンリーは「ヘンリーが騎士であるのは、ジェームズが騎士である場合に限る」とコメントしました。メイソンによれば「ヘンリーはならず者だ」とのことです。「ヘンリーはならず者か、ヘンリーは騎士だ」とジェームズは主張しました。「ヘンリーはならず者ではない」とエマが言いました。ハーパーは「ウィリアムは騎士か、エラはならず者だ」と表現しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムは騎士です  \n(2) エラは騎士です  \n(3) ヘンリーは騎士です  \n(4) メイソンはならず者です  \n(5) ジェームズは騎士です  \n(6) エマは騎士です  \n(7) ハーパーは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：オーウェン、アリア、ビクトリア、ペネロペ、クロエ、ジェイコブ、そしてオリビア。オーウェンは「オリビアはアリアが騎士である場合に限り騎士である」と言いました。アリアは「ペネロペは騎士であるか、オリビアはならず者である」と主張しました。ビクトリアは「ペネロペは騎士である場合に限りジェイコブはならず者である」と言いました。ペネロペは「ジェイコブはならず者であり、ジェイコブは騎士である」と主張しました。クロエは「オリビアはならず者ではない」と述べました。ジェイコブは「ビクトリアはならず者であり、ペネロペは騎士である」と述べました。「もしビクトリアが騎士であれば、ビクトリアはならず者である」とオリビアは言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンはならず者です  \n(2) アリアはならず者です  \n(3) ビクトリアはならず者です  \n(4) ペネロペはならず者です  \n(5) クロエは騎士です  \n(6) ジェイコブはならず者です  \n(7) オリビアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ローガン、エマ、オーロラ、リアム、ジャクソン、アリア、そしてエイデン。「エマが騎士なら、オーロラはならず者だ」とローガンは主張しました。エマは「リアムはならず者ではない」とコメントしました。オーロラは「ジャクソンは騎士ではない」と言いました。リアムは「アリアは騎士だ」と述べました。「ローガンは騎士だ」とジャクソンは言及しました。アリアによれば、「エイデンはならず者で、ジャクソンは騎士だ」とのことです。エイデンの言葉では、「ジャクソンが騎士なら、ローガンはならず者だ」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンは騎士です  \n(2) エマは騎士です  \n(3) オーロラはならず者です  \n(4) リアムは騎士です  \n(5) ジャクソンは騎士です  \n(6) アリアは騎士です  \n(7) エイデンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：オリビア、エイデン、オーロラ、マイケル、リリー、アメリア、そしてノア。オリビアは「アメリアは騎士で、リリーはならず者です」と述べました。エイデンは「リリーはならず者です」と指摘しました。オーロラは「アメリアは騎士ではありません」と述べました。マイケルは「ノアは騎士で、オーロラは騎士です」と言いました。リリーは「エイデンはアメリアがならず者である場合に限り騎士です」と述べました。アメリアは「もしマイケルがならず者なら、リリーはならず者です」と表現しました。ノアは「リリーは騎士で、アメリアはならず者です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアは騎士です  \n(2) エイデンは騎士です  \n(3) オーロラはならず者です  \n(4) マイケルはならず者です  \n(5) リリーはならず者です  \n(6) アメリアは騎士です  \n(7) ノアはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：メイソン、マイケル、ベンジャミン、ジャクソン、イザベラ、デイビッド、そしてオリビア。メイソンは「ベンジャミンはならず者ではない」と言いました。マイケルの発言では「マイケルは騎士であり、デイビッドは騎士です」と述べています。ベンジャミンによれば「イザベラは騎士です」。ジャクソンの言葉では「マイケルは騎士であるか、オリビアはならず者です」と言っています。イザベラは「メイソンはならず者であり、デイビッドは騎士です」と言いました。デイビッドは「メイソンは騎士であるのはイザベラがならず者である場合に限る」と述べました。オリビアは「ベンジャミンはならず者であり、マイケルはならず者です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) メイソンはならず者です  \n(2) マイケルはならず者です  \n(3) ベンジャミンはならず者です  \n(4) ジャクソンはならず者です  \n(5) イザベラはならず者です  \n(6) デイビッドはならず者です  \n(7) オリビアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ルーク、マイケル、グレース、エラ、エイブリー、ソフィア、そしてエイヴァ。ルークは「もしソフィアがならず者なら、エラは騎士だ」と言っているのが聞かれました。マイケルの発言では「ルークは騎士か、ソフィアは騎士だ」と言っています。グレースは「マイケルは騎士で、エラは騎士だ」と言っているのが聞かれました。エラは「エイブリーは騎士ではない」と言っているのが聞かれました。エイブリーの発言では「エイヴァは騎士だ」と言っています。ソフィアはエイブリーがならず者だと言いました。エイヴァの言葉では「エイブリーは騎士であるのは、ソフィアが騎士である場合に限る」と言っています。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) マイケルは騎士です  \n(3) グレースは騎士です  \n(4) エラは騎士です  \n(5) エイブリーはならず者です  \n(6) ソフィアは騎士です  \n(7) エイヴァはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：アレクサンダー、ウィリアム、リアム、ヘンリー、オリビア、ライリー、そしてソフィア。「ヘンリーはならず者か、リアムは騎士です」とアレクサンダーが言いました。ウィリアムは「ライリーは騎士です」と述べました。リアムはオリビアがならず者で、ソフィアが騎士だと言いました。「もしオリビアがならず者なら、オリビアは騎士です」とヘンリーが宣言しました。「ソフィアは騎士です」とオリビアが宣言しました。「もしウィリアムが騎士なら、オリビアは騎士です」とライリーが主張しました。ソフィアの言葉では、「もしアレクサンダーが騎士なら、オリビアは騎士です」。さて、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アレクサンダーはならず者です  \n(2) ウィリアムは騎士です  \n(3) リアムはならず者です  \n(4) ヘンリーは騎士です  \n(5) オリビアは騎士です  \n(6) ライリーは騎士です  \n(7) ソフィアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エイヴァ、アリア、ソフィア、エマ、オーロラ、メイソン、そしてベンジャミン。「エマはならず者ではない」とエイヴァが言いました。アリアによれば、「オーロラはベンジャミンがならず者であるときに限り騎士です」。ソフィアは「アリアは騎士です」と主張しました。エマは「メイソンは騎士ではない」と述べました。オーロラは「ベンジャミンは騎士であり、ベンジャミンはならず者です」と言いました。メイソンは「ベンジャミンは騎士であるか、エマはならず者です」と言っているのが聞かれました。ベンジャミンは「エイヴァはならず者ではありません」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァはならず者です  \n(2) アリアはならず者です  \n(3) ソフィアはならず者です  \n(4) エマはならず者です  \n(5) オーロラはならず者です  \n(6) メイソンは騎士です  \n(7) ベンジャミンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ミア、ジョセフ、サミュエル、グレース、イザベラ、ノア、そしてイヴリン。「サミュエルは騎士か、イザベラはならず者だ」とミアが言いました。ジョセフは「イザベラはならず者か、サミュエルは騎士だ」と述べました。「ジョセフは騎士か、サミュエルは騎士だ」とサミュエルが宣言しました。グレースは「イヴリンは騎士だ」と主張しました。「グレースはならず者であり、グレースは騎士だ」とイザベラが言いました。「もしミアがならず者なら、グレースは騎士だ」とノアが主張しました。イヴリンの言葉では「ノアはならず者ではない」とのことです。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアは騎士です  \n(2) ジョセフは騎士です  \n(3) サミュエルは騎士です  \n(4) グレースは騎士です  \n(5) イザベラはならず者です  \n(6) ノアは騎士です  \n(7) イヴリンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：リリー、エリザベス、クロエ、マイケル、ローガン、ウィリアム、そしてジョセフ。リリーは「クロエはならず者か、ローガンはならず者です」と言いました。エリザベスの言葉では、「ジョセフは騎士ではありません」。クロエは「エリザベスは騎士です」と述べました。マイケルは「リリーはならず者である場合、エリザベスもならず者です」と指摘しました。「ウィリアムはならず者です」とローガンは宣言しました。「もしエリザベスがならず者なら、マイケルはならず者です」とウィリアムは宣言しました。ジョセフは「もしリリーがならず者なら、マイケルはならず者です」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーは騎士です  \n(2) エリザベスはならず者です  \n(3) クロエはならず者です  \n(4) マイケルはならず者です  \n(5) ローガンはならず者です  \n(6) ウィリアムは騎士です  \n(7) ジョセフは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ビクトリア、イザベラ、ノア、イーサン、ジャクソン、アメリア、そしてゾーイ。「イーサンはならず者か、ゾーイは騎士です」とビクトリアが言いました。イザベラは「ノアは騎士で、ビクトリアは騎士です」と述べました。ノアの発言では「もしゾーイが騎士なら、イーサンはならず者です」と言いました。イーサンは「アメリアはならず者か、ゾーイは騎士です」と言いました。ジャクソンは「イーサンは騎士です」と指摘しました。アメリアの言葉では「ノアは騎士です」と言いました。ゾーイは「アメリアは騎士か、アメリアはならず者です」とあなたに言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ビクトリアは騎士です  \n(2) イザベラはならず者です  \n(3) ノアはならず者です  \n(4) イーサンは騎士です  \n(5) ジャクソンは騎士です  \n(6) アメリアはならず者です  \n(7) ゾーイは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジェームズ、エイブリー、ノア、ジェイコブ、クロエ、アメリア、そしてジャクソンです。ジェームズは「ジャクソンはならず者で、クロエはならず者だ」と言いました。エイブリーによれば、「ジェームズはならず者か、アメリアはならず者です」。ノアはジャクソンが騎士か、ジェームズが騎士であると表現しました。ジェイコブは「アメリアはならず者である場合、エイブリーは騎士である」と表現しました。クロエは「クロエは騎士である場合、ジェイコブは騎士である」と述べました。アメリアは「クロエがならず者であれば、ジェイコブはならず者です」と表現しました。ジャクソンは「ジェイコブはならず者である場合、ノアはならず者です」と指摘しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズはならず者です  \n(2) エイブリーは騎士です  \n(3) ノアは騎士です  \n(4) ジェイコブは騎士です  \n(5) クロエはならず者です  \n(6) アメリアはならず者です  \n(7) ジャクソンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エラ、エマ、サミュエル、イザベラ、ダニエル、アメリア、そしてエイブリー。エラの言葉によれば、「ダニエルは騎士か、エイブリーはならず者です」。エマによると、「もしダニエルがならず者なら、エイブリーもならず者です」。サミュエルは、「もしアメリアが騎士なら、サミュエルも騎士です」と述べました。イザベラは、「ダニエルはならず者か、アメリアはならず者です」と言いました。ダニエルは、エイブリーはならず者であり、ダニエルは騎士であると表現しました。アメリアは、ダニエルは騎士だと言いました。エイブリーは、「ダニエルはならず者か、イザベラはならず者です」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エラはならず者です  \n(2) エマはならず者です  \n(3) サミュエルは騎士です  \n(4) イザベラは騎士です  \n(5) ダニエルはならず者です  \n(6) アメリアはならず者です  \n(7) エイブリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：イザベラ、オーウェン、マイケル、ソフィア、サミュエル、アビゲイル、そしてベンジャミン。イザベラによれば、「ソフィアはベンジャミンがならず者である場合に限り、ならず者です」。オーウェンは「アビゲイルは騎士ではない」と主張しました。マイケルは「ベンジャミンはならず者で、アビゲイルは騎士です」と述べました。ソフィアは「ベンジャミンは騎士です」と言いました。サミュエルは「イザベラはベンジャミンがならず者である場合に限り、騎士です」と言いました。アビゲイルは「オーウェンは騎士であるか、マイケルはならず者です」と言いました。「アビゲイルは騎士であるか、イザベラは騎士です」とベンジャミンが言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イザベラは騎士です  \n(2) オーウェンはならず者です  \n(3) マイケルはならず者です  \n(4) ソフィアは騎士です  \n(5) サミュエルはならず者です  \n(6) アビゲイルは騎士です  \n(7) ベンジャミンは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エイデン、イザベラ、セバスチャン、オリビア、ローガン、ウィリアム、そしてゾーイ。エイデンの言葉によれば、「セバスチャンは騎士で、イザベラはならず者です」。イザベラはウィリアムがならず者ではないと言いました。セバスチャンは「オリビアはならず者ではない」と主張しました。オリビアの言葉では、「エイデンはならず者か、セバスチャンは騎士です」。ローガンによると、「エイデンはならず者か、ウィリアムはならず者です」。ウィリアムは「もしエイデンがならず者なら、イザベラは騎士です」と言いました。ゾーイの発言では、「もしエイデンが騎士なら、ローガンはならず者です」。さて、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンはならず者です  \n(2) イザベラは騎士です  \n(3) セバスチャンは騎士です  \n(4) オリビアは騎士です  \n(5) ローガンは騎士です  \n(6) ウィリアムは騎士です  \n(7) ゾーイは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ソフィア、イザベラ、ビクトリア、デイビッド、アビゲイル、ペネロペ、そしてイヴリン。ソフィアの発言では、「ペネロペはならず者で、イザベラはならず者です」と言いました。イザベラは、アビゲイルがならず者だと言いました。「ペネロペは騎士ではありません」とビクトリアが宣言しました。デイビッドは、「ビクトリアは騎士です」と主張しました。アビゲイルの発言では、「ペネロペは騎士ではありません」と言いました。ペネロペの発言では、「デイビッドはならず者か、デイビッドは騎士です」と言いました。「デイビッドは騎士ではありません」とイヴリンが主張しました。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアはならず者です  \n(2) イザベラは騎士です  \n(3) ビクトリアはならず者です  \n(4) デイビッドはならず者です  \n(5) アビゲイルはならず者です  \n(6) ペネロペは騎士です  \n(7) イヴリンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジョセフ、リアム、グレース、ソフィア、セバスチャン、オーロラ、そしてジャック。ジョセフはこう言いました。「グレースは騎士で、ジャックは騎士です」。リアムはあなたに、ジャックは騎士ではないと言いました。「オーロラはならず者であるのは、ジャックが騎士である場合に限る」とグレースは主張しました。ソフィアは「グレースがならず者であれば、リアムはならず者です」と断言しました。セバスチャンはグレースが騎士であると言いました。オーロラは「ソフィアがならず者であれば、ジャックはならず者です」と述べました。ジャックは「ソフィアは騎士で、オーロラはならず者です」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフはならず者です  \n(2) リアムは騎士です  \n(3) グレースは騎士です  \n(4) ソフィアは騎士です  \n(5) セバスチャンは騎士です  \n(6) オーロラは騎士です  \n(7) ジャックはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：オリバー、オリビア、ライリー、ジェームズ、シャーロット、メイソン、そしてエラ。「オリビアはならず者で、ライリーはならず者だ」とオリバーが言いました。オリビアによれば、「もしオリビアが騎士なら、シャーロットは騎士だ」。ライリーは「メイソンはならず者ではない」と主張しました。ジェームズは「もしメイソンが騎士なら、オリビアはならず者だ」と述べました。シャーロットは「オリビアは騎士だ」と主張しました。メイソンによれば、「シャーロットはならず者で、オリビアはならず者だ」。エラは「もしメイソンがならず者なら、ライリーはならず者だ」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリバーはならず者です  \n(2) オリビアは騎士です  \n(3) ライリーはならず者です  \n(4) ジェームズは騎士です  \n(5) シャーロットは騎士です  \n(6) メイソンはならず者です  \n(7) エラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ハーパー、ジョセフ、イヴリン、ベンジャミン、マシュー、オリビア、そしてエイブリー。ハーパーは「もしベンジャミンがならず者なら、ベンジャミンは騎士だ」と述べました。ジョセフは「イヴリンはならず者であるのは、ハーパーが騎士である場合に限る」と言いました。イヴリンは「イヴリンは騎士であるのは、マシューがならず者である場合に限る」と言いました。ベンジャミンは「イヴリンは騎士であるか、ジョセフはならず者である」と述べました。「エイブリーはならず者ではない」とマシューが言いました。オリビアは「ハーパーは騎士だ」と言いました。エイブリーは「オリビアはならず者で、エイブリーは騎士だ」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ハーパーは騎士です  \n(2) ジョセフはならず者です  \n(3) イヴリンは騎士です  \n(4) ベンジャミンは騎士です  \n(5) マシューはならず者です  \n(6) オリビアは騎士です  \n(7) エイブリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：アメリア、イザベラ、ウィリアム、メイソン、マシュー、イーサン、そしてルーク。アメリアの言葉では、「メイソンは騎士で、イーサンはならず者です」。イザベラは「メイソンはならず者です」と言いました。ウィリアムは「イザベラはならず者です」と言いました。メイソンは、もしルークが騎士ならウィリアムも騎士だと言いました。マシューはメイソンがならず者だと表現しました。イーサンは「メイソンは騎士であるのは、ルークが騎士である場合に限る」と述べました。ルークは「もしメイソンが騎士なら、アメリアも騎士です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アメリアはならず者です  \n(2) イザベラは騎士です  \n(3) ウィリアムはならず者です  \n(4) メイソンはならず者です  \n(5) マシューは騎士です  \n(6) イーサンはならず者です  \n(7) ルークは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：リアム、アリア、メイソン、イザベラ、シャーロット、ヘンリー、そしてデイビッド。リアムはこう言いました。「デイビッドはならず者ではない」。アリアは言及しました。「ヘンリーはならず者で、デイビッドは騎士です」。メイソンはコメントしました。「アリアは騎士か、デイビッドは騎士です」。イザベラは言いました。「ヘンリーはならず者であるのは、リアムが騎士である場合に限ります」。シャーロットは、アリアがならず者だと言いました。ヘンリーは言いました。「もしリアムがならず者なら、ヘンリーは騎士です」。デイビッドは言いました。「シャーロットは騎士か、リアムはならず者です」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムは騎士です  \n(2) アリアはならず者です  \n(3) メイソンは騎士です  \n(4) イザベラはならず者です  \n(5) シャーロットは騎士です  \n(6) ヘンリーは騎士です  \n(7) デイビッドは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ノア、オリバー、イヴリン、アビゲイル、グレース、エマ、そしてデイビッド。ノアによれば、「オリバーは騎士ではない」とのことです。「エマはならず者であるか、オリバーは騎士である」とオリバーが言いました。イヴリンはアビゲイルがならず者ではないと表現しました。アビゲイルは「もしグレースが騎士なら、イヴリンは騎士だ」と言っているのが聞かれました。グレースは「デイビッドは騎士であり、デイビッドはならず者だ」と述べました。エマは「もしオリバーがならず者なら、グレースは騎士だ」と主張しました。デイビッドの言葉では、「アビゲイルはならず者ではない」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアはならず者です  \n(2) オリバーは騎士です  \n(3) イヴリンは騎士です  \n(4) アビゲイルは騎士です  \n(5) グレースはならず者です  \n(6) エマは騎士です  \n(7) デイビッドは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジェームズ、ライリー、イザベラ、ジョセフ、ペネロペ、ビクトリア、そしてアメリア。ジェームズは、ライリーがならず者であるか、イザベラが騎士であると言いました。ライリーは、ジョセフがならず者であるとあなたに言いました。イザベラは、「ペネロペはならず者であり、ペネロペは騎士です」とコメントしました。ジョセフは、アメリアが騎士であると表現しました。ペネロペは、ビクトリアがならず者であるとあなたに言いました。ビクトリアは、ペネロペが騎士であるか、ジェームズが騎士であると言いました。アメリアの言葉では、「もしビクトリアがならず者であれば、イザベラは騎士です」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズは騎士です  \n(2) ライリーはならず者です  \n(3) イザベラはならず者です  \n(4) ジョセフは騎士です  \n(5) ペネロペはならず者です  \n(6) ビクトリアは騎士です  \n(7) アメリアは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ローガン、クロエ、ジャクソン、サミュエル、ペネロペ、マシュー、そしてエミリー。ローガンの発言によれば、「サミュエルは騎士ではない」とのことです。クロエによると、「ローガンはならず者です」。ジャクソンは、ペネロペがならず者であるか、クロエがならず者であると表現しました。サミュエルは、ペネロペは騎士だと言いました。ペネロペの発言では、「クロエはマシューがならず者である場合に限り、ならず者です」とのことです。マシューは、「クロエはならず者ではない」と述べました。エミリーは、「クロエは騎士ではない」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンはならず者です  \n(2) クロエは騎士です  \n(3) ジャクソンはならず者です  \n(4) サミュエルは騎士です  \n(5) ペネロペは騎士です  \n(6) マシューは騎士です  \n(7) エミリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ルーク、デイビッド、ヘンリー、イーサン、ジャック、ベンジャミン、そしてジェイコブです。「ヘンリーは騎士で、ジェイコブも騎士だ」とルークは宣言しました。デイビッドは「ベンジャミンは騎士であるのは、ジェイコブがならず者である場合に限る」と言っているのが聞かれました。「デイビッドはならず者か、ジャックはならず者だ」とヘンリーが言いました。イーサンは、ジェイコブが騎士であるのは、ジャックが騎士である場合に限ると表現しました。「もしルークが騎士なら、デイビッドは騎士だ」とジャックが言いました。ベンジャミンは「ルークはならず者ではない」と主張しました。「ベンジャミンは騎士ではない」とジェイコブが言いました。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークはならず者です  \n(2) デイビッドは騎士です  \n(3) ヘンリーはならず者です  \n(4) イーサンは騎士です  \n(5) ジャックは騎士です  \n(6) ベンジャミンはならず者です  \n(7) ジェイコブは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ミア、リアム、オリビア、アビゲイル、アメリア、ローガン、そしてダニエル。「リアムはならず者で、ダニエルは騎士です」とミアは主張しました。「ローガンはならず者で、ミアはならず者です」とリアムが言いました。オリビアは「リアムはならず者ではありません」と言いました。アビゲイルは「もしオリビアが騎士なら、アビゲイルも騎士です」と主張しました。「リアムはならず者ではありません」とアメリアが言いました。ローガンによれば、「もしリアムがならず者なら、アビゲイルはならず者です」。ダニエルは「アビゲイルはならず者であるのは、ローガンが騎士である場合に限ります」とコメントしました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアは騎士です  \n(2) リアムはならず者です  \n(3) オリビアはならず者です  \n(4) アビゲイルは騎士です  \n(5) アメリアはならず者です  \n(6) ローガンはならず者です  \n(7) ダニエルは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：リリー、ジェームズ、エラ、イザベラ、シャーロット、グレース、そしてノア。「イザベラがならず者なら、シャーロットはならず者だ」とリリーは主張しました。ジェームズはノアが騎士だと表現しました。「ジェームズは騎士ではない」とエラは宣言しました。「イザベラが騎士なら、シャーロットは騎士だ」とイザベラが言いました。シャーロットは、シャーロットが騎士だと言いました。グレースはこう言いました。「ノアが騎士なら、シャーロットは騎士だ」。 「ジェームズはならず者で、イザベラはならず者だ」とノアが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーは騎士です  \n(2) ジェームズはならず者です  \n(3) エラは騎士です  \n(4) イザベラは騎士です  \n(5) シャーロットは騎士です  \n(6) グレースは騎士です  \n(7) ノアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジェームズ、ウィリアム、ジェイコブ、リアム、アメリア、ルーカス、そしてダニエル。ジェームズはアメリアがならず者であると述べました。「アメリアは騎士だ」とウィリアムが言いました。ジェイコブの発言では、「もしダニエルがならず者なら、アメリアはならず者です」。リアムはアメリアが騎士だと述べました。アメリアは「ジェームズは騎士で、ダニエルはならず者です」と言いました。ルーカスは「ジェームズは騎士である場合、ウィリアムも騎士です」と主張しました。ダニエルは「アメリアは騎士である場合、ジェイコブはならず者です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズは騎士です  \n(2) ウィリアムはならず者です  \n(3) ジェイコブは騎士です  \n(4) リアムはならず者です  \n(5) アメリアはならず者です  \n(6) ルーカスはならず者です  \n(7) ダニエルは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：リリー、アリア、ノア、ソフィア、エラ、デイビッド、そしてシャーロット。リリーは「もしデイビッドがならず者なら、デイビッドは騎士だ」と言いました。アリアは「デイビッドは騎士である場合に限り、リリーは騎士だ」と言いました。ノアは「リリーが騎士である場合に限り、シャーロットは騎士だ」と言いました。ソフィアの言葉では、「デイビッドはならず者である場合に限り、デイビッドは騎士だ」と言っています。エラの言葉では、「アリアはならず者であり、アリアは騎士だ」と言っています。デイビッドは「ノアはならず者ではない」と述べました。シャーロットは「もしデイビッドが騎士なら、アリアはならず者だ」と言いました。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーはならず者です  \n(2) アリアは騎士です  \n(3) ノアはならず者です  \n(4) ソフィアはならず者です  \n(5) エラはならず者です  \n(6) デイビッドはならず者です  \n(7) シャーロットは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：シャーロット、ジョセフ、ノア、グレース、ダニエル、エマ、そしてジャックです。「エマは騎士ではない」とシャーロットが言いました。「ジョセフは騎士だ」とジョセフが宣言しました。ノアはジャックが騎士ではないと言いました。グレースは「ジョセフは騎士か、シャーロットはならず者だ」と言いました。ダニエルは「もしエマがならず者なら、シャーロットはならず者だ」と言いました。「もしノアが騎士なら、ダニエルはならず者だ」とエマが宣言しました。ジャックは「ノアは騎士である場合に限り、ジョセフは騎士だ」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) シャーロットはならず者です  \n(2) ジョセフはならず者です  \n(3) ノアはならず者です  \n(4) グレースは騎士です  \n(5) ダニエルは騎士です  \n(6) エマは騎士です  \n(7) ジャックは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エイデン、グレース、オーロラ、シャーロット、マイケル、ローガン、そしてクロエ。エイデンは「もしエイデンが騎士なら、グレースはならず者だ」と主張しました。グレースは「シャーロットは騎士だ」と言いました。オーロラは「マイケルは騎士で、グレースは騎士だ」と述べました。シャーロットは「エイデンは騎士である場合に限り、マイケルは騎士だ」と言いました。マイケルは「マイケルは騎士である場合に限り、グレースはならず者だ」と指摘しました。ローガンは「オーロラはならず者である場合に限り、グレースはならず者だ」と言いました。クロエは「もしエイデンがならず者なら、エイデンは騎士だ」と述べました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンは騎士です  \n(2) グレースはならず者です  \n(3) オーロラはならず者です  \n(4) シャーロットはならず者です  \n(5) マイケルはならず者です  \n(6) ローガンは騎士です  \n(7) クロエは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジョセフ、ジェームズ、イザベラ、イーサン、ソフィア、ジャック、そしてオーロラ。ジョセフは「イザベラはならず者だ」と述べました。「イーサンはイザベラがならず者である場合に限り、ならず者だ」とジェームズは宣言しました。イザベラによれば、「ソフィアは騎士であり、ジェームズはならず者だ」とのことです。「ジェームズは騎士だ」とイーサンが言いました。ソフィアは、ジャックは騎士であるか、ジャックはならず者であると表現しました。ジャックによれば、「イーサンは騎士であり、ジェームズはならず者だ」とのことです。オーロラは「イザベラは騎士であるか、ソフィアは騎士である」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフはならず者です  \n(2) ジェームズはならず者です  \n(3) イザベラは騎士です  \n(4) イーサンはならず者です  \n(5) ソフィアは騎士です  \n(6) ジャックはならず者です  \n(7) オーロラは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジェームズ、イーサン、シャーロット、ヘンリー、ジョセフ、ジェイコブ、そしてアリア。ジェームズは「ジェイコブはならず者で、シャーロットはならず者だ」と言っているのが聞かれました。イーサンは「もしジェイコブが騎士なら、ヘンリーはならず者だ」と言いました。シャーロットは「ジェイコブがならず者であるのは、アリアがならず者である場合に限る」と述べました。ヘンリーは「ジェームズがならず者であるのは、ヘンリーが騎士である場合に限る」と言いました。ジョセフの発言では「もしアリアが騎士なら、イーサンはならず者だ」と言っています。ジェイコブは「ジェイコブは騎士で、イーサンは騎士だ」とコメントしました。アリアはイーサンが騎士だと言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズはならず者です  \n(2) イーサンは騎士です  \n(3) シャーロットは騎士です  \n(4) ヘンリーはならず者です  \n(5) ジョセフはならず者です  \n(6) ジェイコブは騎士です  \n(7) アリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ビクトリア、ジェームズ、アリア、ルーク、ライリー、ジョセフ、そしてイザベラ。ビクトリアはアリアが騎士ではないと言いました。ジェームズの発言では、「ルークはならず者ではない」と言いました。「ジョセフは騎士であるのは、ジョセフがならず者である場合に限る」とアリアは宣言しました。「もしアリアが騎士なら、ライリーは騎士だ」とルークは宣言しました。「もしビクトリアがならず者なら、ルークはならず者だ」とライリーは宣言しました。ジョセフはアリアがならず者ではないと表現しました。イザベラによれば、「ルークはビクトリアがならず者である場合に限り、ならず者である」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ビクトリアは騎士です  \n(2) ジェームズは騎士です  \n(3) アリアはならず者です  \n(4) ルークは騎士です  \n(5) ライリーは騎士です  \n(6) ジョセフはならず者です  \n(7) イザベラは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ルーク、ベンジャミン、ヘンリー、ジャクソン、エリザベス、メイソン、そしてアメリア。ルークはベンジャミンが騎士であると言いました。ベンジャミンは「アメリアはならず者で、メイソンはならず者だ」と言いました。ヘンリーは「ベンジャミンはならず者ではない」と主張しました。「メイソンはならず者で、ルークはならず者だ」とジャクソンが言いました。エリザベスは「ベンジャミンは騎士だ」と主張しました。メイソンは「ジャクソンは騎士である場合に限り、ジャクソンはならず者だ」と述べました。アメリアはあなたにメイソンがならず者であり、メイソンが騎士であると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) ベンジャミンは騎士です  \n(3) ヘンリーは騎士です  \n(4) ジャクソンはならず者です  \n(5) エリザベスは騎士です  \n(6) メイソンはならず者です  \n(7) アメリアはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ミア、ジェイコブ、オリバー、アメリア、ヘンリー、オーウェン、そしてルーカス。ミアは「ミアは騎士で、ルーカスはならず者です」と述べました。「オリバーはならず者ではありません」 - ジェイコブ。「もしルーカスがならず者なら、アメリアは騎士です」 - オリバー。「ルーカスはならず者か、ヘンリーはならず者です」とアメリアは主張しました。ヘンリーの発言では「オーウェンはならず者です」と言いました。オーウェンの発言では「もしオリバーがならず者なら、オーウェンは騎士です」と言いました。ルーカスは「もしオリバーがならず者なら、ヘンリーは騎士です」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアはならず者です  \n(2) ジェイコブは騎士です  \n(3) オリバーは騎士です  \n(4) アメリアは騎士です  \n(5) ヘンリーはならず者です  \n(6) オーウェンは騎士です  \n(7) ルーカスは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ルーク、エミリー、メイソン、ベンジャミン、ノア、リリー、そしてグレース。ルークは「リリーは騎士ではない」と言いました。「ノアは騎士です」とエミリーは主張しました。メイソンは「ルークがならず者である場合、ベンジャミンはならず者です」と述べました。ベンジャミンの言葉では「ノアはならず者です」。ノアの発言では「エミリーは騎士で、リリーはならず者です」。リリーは「もしベンジャミンが騎士なら、エミリーは騎士です」と述べました。グレースは「もしベンジャミンがならず者なら、ベンジャミンは騎士です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) エミリーはならず者です  \n(3) メイソンは騎士です  \n(4) ベンジャミンは騎士です  \n(5) ノアはならず者です  \n(6) リリーはならず者です  \n(7) グレースは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジョセフ、ソフィア、ジェームズ、セバスチャン、エマ、アメリア、そしてジャック。ジョセフが言ったように、「ジャックは騎士であり、ジャックはならず者です」。ソフィアは「エマは騎士です」と言いました。ジェームズは「もしジョセフが騎士なら、アメリアは騎士です」と言いました。セバスチャンは「ジョセフは騎士です」と言いました。エマは「ジェームズはならず者ではありません」と主張しました。アメリアが言ったように、「ジャックはソフィアがならず者であるときに限り、騎士です」。ジャックはあなたにエマはならず者ではないと言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフはならず者です  \n(2) ソフィアは騎士です  \n(3) ジェームズは騎士です  \n(4) セバスチャンはならず者です  \n(5) エマは騎士です  \n(6) アメリアはならず者です  \n(7) ジャックは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：セバスチャン、ダニエル、ジャクソン、ルーカス、アビゲイル、アレクサンダー、そしてスカーレット。セバスチャンの言葉によれば、「ジャクソンは騎士か、アレクサンダーは騎士です」。ダニエルによると、「スカーレットはならず者である場合、ジャクソンは騎士です」。ジャクソンの発言では、「ダニエルは騎士である場合、ダニエルはならず者です」。ルーカスは、アレクサンダーがならず者であれば、セバスチャンは騎士であると表現しました。「スカーレットは騎士です」とアビゲイルが言いました。アレクサンダーの発言では、「アビゲイルはならず者です」。スカーレットは「ジャクソンはならず者です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) セバスチャンはならず者です  \n(2) ダニエルは騎士です  \n(3) ジャクソンはならず者です  \n(4) ルーカスはならず者です  \n(5) アビゲイルは騎士です  \n(6) アレクサンダーはならず者です  \n(7) スカーレットは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：イーサン、オーロラ、ソフィア、ノア、エイヴァ、ウィリアム、そしてエイデン。イーサンは「ノアは騎士だ」と言っているのが聞かれました。オーロラは「ソフィアはならず者だ」と主張しました。「イーサンは騎士だ」とソフィアは宣言しました。ノアは「エイデンはならず者で、ノアは騎士だ」と言いました。エイヴァの発言では「ウィリアムは騎士だ」と言いました。ウィリアムは「ノアは騎士か、イーサンは騎士だ」とあなたに言いました。「オーロラはならず者か、ソフィアはならず者だ」とエイデンは主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イーサンはならず者です  \n(2) オーロラは騎士です  \n(3) ソフィアはならず者です  \n(4) ノアはならず者です  \n(5) エイヴァはならず者です  \n(6) ウィリアムはならず者です  \n(7) エイデンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：オリビア、マシュー、オリバー、セバスチャン、ペネロペ、エイヴァ、そしてシャーロット。オリビアは「ペネロペは騎士ではない」と言っているのが聞かれました。マシューは「マシューは騎士であるか、オリバーはならず者である」とあなたに言いました。「マシューは騎士であるか、シャーロットはならず者である」とオリバーは主張しました。セバスチャンは「ペネロペは騎士であり、オリバーはならず者である」と表現しました。ペネロペは「オリバーはならず者である」と言いました。エイヴァの発言では「もしシャーロットが騎士であれば、オリバーはならず者である」と言いました。シャーロットは「もしペネロペが騎士であれば、シャーロットは騎士である」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアは騎士です  \n(2) マシューは騎士です  \n(3) オリバーは騎士です  \n(4) セバスチャンはならず者です  \n(5) ペネロペはならず者です  \n(6) エイヴァはならず者です  \n(7) シャーロットは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ルーク、ゾーイ、ソフィア、ジョセフ、グレース、オリビア、そしてセバスチャン。ルークは「グレースはならず者だ」と言いました。「ソフィアが騎士である場合に限り、セバスチャンは騎士です」とゾーイが言いました。「オリビアはならず者ではない」とソフィアが言いました。ジョセフは「オリビアはならず者だ」と言いました。「グレースはジョセフが騎士である場合に限り、騎士です」とグレースが主張しました。オリビアによれば、「ゾーイは騎士ではない」とのことです。セバスチャンは「グレースはならず者であるか、セバスチャンは騎士です」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークはならず者です  \n(2) ゾーイは騎士です  \n(3) ソフィアはならず者です  \n(4) ジョセフは騎士です  \n(5) グレースは騎士です  \n(6) オリビアはならず者です  \n(7) セバスチャンはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：マシュー、イヴリン、ソフィア、ベンジャミン、エイブリー、エマ、そしてグレース。マシューは「マシューが騎士であるのは、ベンジャミンが騎士である場合に限る」と言いました。イヴリンは「もしエマが騎士なら、マシューはならず者だ」とコメントしました。ソフィアの発言では「マシューはならず者で、グレースはならず者だ」と言いました。ベンジャミンは「マシューはならず者だ」と表現しました。「ベンジャミンは騎士か、マシューはならず者だ」とエイブリーが言いました。エマは「マシューが騎士である場合に限り、エイブリーはならず者だ」とあなたに伝えました。グレースは「マシューは騎士だ」と指摘しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マシューはならず者です  \n(2) イヴリンは騎士です  \n(3) ソフィアは騎士です  \n(4) ベンジャミンは騎士です  \n(5) エイブリーは騎士です  \n(6) エマは騎士です  \n(7) グレースはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ペネロペ、エミリー、マシュー、アレクサンダー、ベンジャミン、クロエ、そしてイーサン。ペネロペの言葉では、「クロエはならず者である場合に限り、アレクサンダーはならず者です」。エミリーは「ペネロペはならず者で、アレクサンダーは騎士です」と述べました。「エミリーはならず者です」とマシューが言いました。アレクサンダーの言葉では、「クロエが騎士であれば、ベンジャミンはならず者です」。ベンジャミンは「マシューはならず者であるか、イーサンはならず者です」と主張しました。クロエはイーサンが騎士であるか、ベンジャミンが騎士であると表現しました。イーサンは「クロエは騎士です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペは騎士です  \n(2) エミリーはならず者です  \n(3) マシューは騎士です  \n(4) アレクサンダーは騎士です  \n(5) ベンジャミンはならず者です  \n(6) クロエは騎士です  \n(7) イーサンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：サミュエル、ジョセフ、アメリア、ベンジャミン、エイヴァ、オリビア、ウィリアム。サミュエルは「ウィリアムはならず者か、アメリアはならず者だ」と主張しました。ジョセフは「オリビアが騎士なら、ベンジャミンはならず者だ」と述べました。アメリアは「オリビアはならず者だ」と言いました。ベンジャミンはジョセフがならず者で、エイヴァが騎士だと言いました。「アメリアは騎士で、ベンジャミンはならず者だ」とエイヴァが言いました。オリビアは「ベンジャミンはならず者ではない」と言いました。ウィリアムは「アメリアが騎士であるならば、オリビアはならず者だ」と言いました。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) サミュエルはならず者です  \n(2) ジョセフは騎士です  \n(3) アメリアは騎士です  \n(4) ベンジャミンはならず者です  \n(5) エイヴァは騎士です  \n(6) オリビアはならず者です  \n(7) ウィリアムは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジョセフ、ルーカス、ゾーイ、エイデン、ダニエル、シャーロット、そしてウィリアム。ジョセフは「シャーロットはならず者ではない」と言いました。ルーカスは「シャーロットはならず者だ」と言いました。「ウィリアムはならず者か、エイデンはならず者だ」とゾーイは宣言しました。「ルーカスは騎士ではない」とエイデンは宣言しました。ダニエルは「もしジョセフがならず者なら、シャーロットはならず者だ」と述べました。「ゾーイは騎士で、ダニエルは騎士だ」とシャーロットは言いました。ウィリアムは「ウィリアムは騎士だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフは騎士です  \n(2) ルーカスはならず者です  \n(3) ゾーイは騎士です  \n(4) エイデンは騎士です  \n(5) ダニエルは騎士です  \n(6) シャーロットは騎士です  \n(7) ウィリアムはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会いました：リアム、マシュー、オーロラ、ジェイコブ、マイケル、オリバー、そしてグレース。リアムは「もしジェイコブが騎士なら、マシューも騎士だ」と言いました。マシューは「オーロラは騎士ではない」と指摘しました。オーロラは「ジェイコブは騎士で、オリバーも騎士だ」と言いました。ジェイコブによれば、「マイケルはオリバーがならず者であるときに限り騎士だ」とのことです。マイケルは「オリバーは騎士だ」と言いました。オリバーは「グレースは騎士で、リアムも騎士だ」と表現しました。グレースは「マシューはならず者ではない」と述べました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リアムは騎士です  \n(2) マシューは騎士です  \n(3) オーロラはならず者です  \n(4) ジェイコブはならず者です  \n(5) マイケルは騎士です  \n(6) オリバーは騎士です  \n(7) グレースは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：メイソン、ジェイコブ、デイビッド、ダニエル、ヘンリー、ミア、そしてローガンです。メイソンによると、「ヘンリーは騎士ではない」とのことです。ジェイコブは「ミアはならず者で、ヘンリーもならず者だ」と言いました。「もしローガンがならず者なら、ミアはならず者だ」とデイビッドが宣言しました。「ダニエルは騎士か、ミアはならず者だ」とダニエルが言及しました。ヘンリーは「デイビッドはミアがならず者である限りならず者だ」と述べました。ミアの発言では、「メイソンはならず者だ」と言いました。ローガンは「デイビッドはならず者で、ローガンは騎士だ」と指摘しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) メイソンは騎士です  \n(2) ジェイコブは騎士です  \n(3) デイビッドは騎士です  \n(4) ダニエルは騎士です  \n(5) ヘンリーはならず者です  \n(6) ミアはならず者です  \n(7) ローガンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：スカーレット、リリー、アレクサンダー、デイビッド、オリバー、ハーパー、そしてジェイコブです。スカーレットは、ジェイコブが騎士だと言いました。「デイビッドはならず者で、ハーパーは騎士です」とリリーが言いました。「もしリリーが騎士なら、デイビッドは騎士です」とアレクサンダーが宣言しました。デイビッドによれば、「もしアレクサンダーが騎士なら、デイビッドは騎士です」。オリバーは、デイビッドがならず者で、ジェイコブがならず者だと言いました。「アレクサンダーはならず者ではありません」とハーパーが主張しました。ジェイコブによれば、「ハーパーはならず者で、アレクサンダーはならず者です」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) スカーレットはならず者です  \n(2) リリーはならず者です  \n(3) アレクサンダーは騎士です  \n(4) デイビッドは騎士です  \n(5) オリバーはならず者です  \n(6) ハーパーは騎士です  \n(7) ジェイコブはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジャック、イザベラ、ミア、シャーロット、ライリー、ベンジャミン、そしてローガン。ジャックは「シャーロットは騎士だ」と言いました。イザベラは「ローガンは騎士であり、ローガンはならず者だ」と述べました。ミアは「イザベラは騎士だ」と主張しました。シャーロットは「イザベラは騎士ではない」と言いました。「ミアは騎士であり、ローガンは騎士だ」とライリーは言及しました。ベンジャミンの言葉では「もしシャーロットが騎士なら、ジャックはならず者だ」と言いました。ローガンは「ミアはならず者だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャックは騎士です  \n(2) イザベラはならず者です  \n(3) ミアはならず者です  \n(4) シャーロットは騎士です  \n(5) ライリーはならず者です  \n(6) ベンジャミンはならず者です  \n(7) ローガンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジェイコブ、ベンジャミン、アリア、ハーパー、ゾーイ、マシュー、そしてウィリアム。ジェイコブはこう言いました。「ハーパーはゾーイが騎士である場合に限り、ならず者です」。ベンジャミンは、ゾーイがならず者であればウィリアムもならず者であると表現しました。アリアは、ハーパーがならず者であるかゾーイがならず者であると言いました。ハーパーは「ベンジャミンはならず者で、ゾーイは騎士です」と主張しました。ゾーイは「マシューは騎士です」と言っているのが聞かれました。マシューの言葉では、「ウィリアムが騎士であれば、ハーパーも騎士です」。ウィリアムは「アリアはならず者で、ゾーイはならず者です」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブは騎士です  \n(2) ベンジャミンは騎士です  \n(3) アリアは騎士です  \n(4) ハーパーはならず者です  \n(5) ゾーイは騎士です  \n(6) マシューは騎士です  \n(7) ウィリアムはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジェイコブ、エイブリー、デイビッド、ローガン、ビクトリア、ペネロペ、そしてジャック。ジェイコブは、ペネロペは騎士であり、ビクトリアはならず者だと言いました。エイブリーは「ジェイコブは騎士ではない」と述べました。デイビッドは「ビクトリアは騎士であるのは、ジェイコブがならず者である場合に限る」と言いました。ローガンはジャックは騎士ではないと表現しました。ビクトリアはローガンはならず者であり、ビクトリアは騎士であると述べました。「もしエイブリーがならず者なら、ジャックはならず者だ」とペネロペは主張しました。ジャックはジェイコブは騎士であり、デイビッドはならず者だと言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブは騎士です  \n(2) エイブリーはならず者です  \n(3) デイビッドは騎士です  \n(4) ローガンは騎士です  \n(5) ビクトリアはならず者です  \n(6) ペネロペは騎士です  \n(7) ジャックはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エマ、ルーカス、デイビッド、イーサン、オーウェン、ジョセフ、そしてオーロラ。エマは「オーウェンは騎士であるか、ルーカスはならず者である」と言いました。ルーカスの言葉では、「ジョセフはならず者ではない」と言っています。デイビッドは「エマはならず者だ」と述べました。イーサンは「エマはならず者であるのは、デイビッドが騎士である場合に限る」と言っているのが聞かれました。オーウェンによれば、「ルーカスがならず者なら、イーサンもならず者だ」とのことです。「デイビッドは騎士ではない」とジョセフが言いました。オーロラの言葉では、「ルーカスはならず者か、イーサンはならず者だ」と言っています。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エマは騎士です  \n(2) ルーカスは騎士です  \n(3) デイビッドはならず者です  \n(4) イーサンは騎士です  \n(5) オーウェンは騎士です  \n(6) ジョセフは騎士です  \n(7) オーロラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ヘンリー、エラ、ルーク、アビゲイル、イザベラ、ジャクソン、シャーロット。ヘンリーは「ルークはならず者ではない」と言いました。エラの言葉では「ルークは騎士ではない」と言いました。ルークの発言では「ヘンリーはならず者であるのは、アビゲイルが騎士である場合に限る」と言いました。アビゲイルは、ヘンリーが騎士であるか、イザベラがならず者であると言いました。イザベラは「アビゲイルが騎士であれば、ルークは騎士である」と言いました。ジャクソンによれば「アビゲイルがならず者であれば、ヘンリーは騎士である」と言いました。シャーロットは「エラがならず者であれば、ルークは騎士である」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ヘンリーはならず者です  \n(2) エラは騎士です  \n(3) ルークはならず者です  \n(4) アビゲイルはならず者です  \n(5) イザベラは騎士です  \n(6) ジャクソンはならず者です  \n(7) シャーロットは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ノア、エリザベス、ライリー、ペネロペ、ソフィア、ゾーイ、そしてエイヴァ。ノアの言葉では、「エイヴァは騎士で、エリザベスは騎士です」。エリザベスの発言では、「ノアは騎士か、エイヴァはならず者です」。ライリーは、「エリザベスは騎士ではありません」と述べました。「エイヴァは騎士である場合、エイヴァはならず者である」とペネロペが言いました。ソフィアは、エイヴァは騎士である場合、ライリーはならず者であると言いました。ゾーイは、「ノアはならず者である場合、ライリーは騎士です」と指摘しました。エイヴァは、ライリーはならず者か、ゾーイはならず者だと言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアは騎士です  \n(2) エリザベスは騎士です  \n(3) ライリーはならず者です  \n(4) ペネロペはならず者です  \n(5) ソフィアは騎士です  \n(6) ゾーイは騎士です  \n(7) エイヴァは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：リリー、スカーレット、エラ、オリバー、エイヴァ、グレース、そしてジェイコブ。リリーは「エイヴァはならず者だ」と言いました。スカーレットは「オリバーは騎士ではない」と指摘しました。エラは「ジェイコブは騎士ではない」と言いました。「エラは騎士だ」とオリバーは主張しました。エイヴァは「グレースはならず者で、オリバーは騎士だ」と言っているのが聞かれました。「エイヴァはならず者で、スカーレットはならず者だ」とグレースは主張しました。ジェイコブは、グレースはならず者ではないと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーはならず者です  \n(2) スカーレットはならず者です  \n(3) エラは騎士です  \n(4) オリバーは騎士です  \n(5) エイヴァは騎士です  \n(6) グレースはならず者です  \n(7) ジェイコブはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ミア、イーサン、イザベラ、ペネロペ、ウィリアム、エマ、そしてベンジャミン。ミアは「ベンジャミンはならず者か、イーサンはならず者です」と主張しました。イーサンは「エマは騎士か、ベンジャミンはならず者です」とコメントしました。イザベラは「もしミアが騎士なら、イーサンはならず者です」とコメントしました。ペネロペは、エマはならず者であり、ベンジャミンもならず者だとあなたに言いました。ウィリアムは、ベンジャミンはならず者か、イザベラはならず者だとあなたに言いました。エマは、イザベラは騎士か、ペネロペは騎士だと表現しました。ベンジャミンは「もしイザベラがならず者なら、ウィリアムは騎士です」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ミアはならず者です  \n(2) イーサンは騎士です  \n(3) イザベラは騎士です  \n(4) ペネロペはならず者です  \n(5) ウィリアムはならず者です  \n(6) エマは騎士です  \n(7) ベンジャミンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジェイコブ、ソフィア、デイビッド、シャーロット、ローガン、グレース、そしてオリビア。「シャーロットは騎士か、デイビッドは騎士だ」とジェイコブが言いました。ソフィアは「ジェイコブはならず者ではない」と述べました。デイビッドは「もしジェイコブが騎士なら、オリビアはならず者だ」と言いました。シャーロットによれば、「グレースはならず者ではない」とのことです。「デイビッドはならず者であるのは、グレースがならず者である場合に限る」とローガンが宣言しました。「ソフィアは騎士で、シャーロットは騎士だ」とグレースが言いました。オリビアは「ジェイコブはならず者か、シャーロットはならず者だ」と主張しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェイコブは騎士です  \n(2) ソフィアは騎士です  \n(3) デイビッドは騎士です  \n(4) シャーロットは騎士です  \n(5) ローガンは騎士です  \n(6) グレースは騎士です  \n(7) オリビアはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジェームズ、ダニエル、ルーク、シャーロット、ミア、エラ、そしてライリー。ジェームズは「ルークは騎士である限り、ルークはならず者である」と述べました。ダニエルは「シャーロットは騎士である限り、シャーロットはならず者である」と言いました。ルークは「ミアはならず者であり、ミアは騎士である」と述べました。シャーロットは「ダニエルはならず者である限り、ミアはならず者である」と言っているのが聞かれました。ミアは「もしミアが騎士であれば、ダニエルはならず者である」と言いました。「ルークは騎士ではない」とエラは主張しました。「ジェームズは騎士であるか、ジェームズはならず者である」とライリーは宣言しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズはならず者です  \n(2) ダニエルはならず者です  \n(3) ルークはならず者です  \n(4) シャーロットはならず者です  \n(5) ミアは騎士です  \n(6) エラは騎士です  \n(7) ライリーは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ペネロペ、ソフィア、ジェームズ、スカーレット、エイブリー、ベンジャミン、そしてサミュエル。ペネロペの発言では、「ジェームズはならず者で、ペネロペは騎士です」と言っています。ソフィアは、サミュエルがならず者であれば、ジェームズもならず者であると表現しました。ジェームズは、スカーレットがならず者であれば、ソフィアもならず者であると述べました。スカーレットは、「ベンジャミンは騎士か、エイブリーは騎士です」と指摘しました。エイブリーは、ベンジャミンはならず者ではないと表現しました。「ペネロペは騎士です」とベンジャミンは宣言しました。「ペネロペは騎士か、ジェームズは騎士です」とサミュエルは言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペはならず者です  \n(2) ソフィアは騎士です  \n(3) ジェームズはならず者です  \n(4) スカーレットはならず者です  \n(5) エイブリーはならず者です  \n(6) ベンジャミンはならず者です  \n(7) サミュエルはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ルーク、ミア、アビゲイル、セバスチャン、ベンジャミン、ゾーイ、そしてジャック。ルークは「ベンジャミンはならず者だ」と述べました。ミアは「もしゾーイが騎士なら、アビゲイルは騎士だ」と主張しました。アビゲイルは「ゾーイは騎士である場合、セバスチャンも騎士である」と指摘しました。「ルークは騎士だ」とセバスチャンが言いました。ベンジャミンは「アビゲイルは騎士で、セバスチャンも騎士だ」と述べました。「ゾーイは騎士だ」とゾーイが宣言しました。ジャックの発言では「ルークはならず者ではない」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルークは騎士です  \n(2) ミアは騎士です  \n(3) アビゲイルはならず者です  \n(4) セバスチャンは騎士です  \n(5) ベンジャミンはならず者です  \n(6) ゾーイはならず者です  \n(7) ジャックは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ルーカス、ジェイコブ、リアム、スカーレット、サミュエル、ビクトリア、そしてエイブリー。ルーカスは「もしサミュエルが騎士なら、リアムはならず者だ」と言いました。ジェイコブは「サミュエルはならず者ではない」と言っているのが聞かれました。リアムは「ジェイコブは騎士である場合に限り、スカーレットは騎士だ」と述べました。スカーレットによれば、「サミュエルはならず者ではない」とのことです。サミュエルは「スカーレットは騎士であり、スカーレットはならず者だ」と述べました。ビクトリアによれば、「リアムはならず者であるか、ジェイコブは騎士である」とのことです。エイブリーは「ルーカスはならず者であり、サミュエルは騎士だ」と言いました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスは騎士です  \n(2) ジェイコブはならず者です  \n(3) リアムは騎士です  \n(4) スカーレットはならず者です  \n(5) サミュエルはならず者です  \n(6) ビクトリアはならず者です  \n(7) エイブリーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：デイビッド、エリザベス、オリバー、エイデン、エイヴァ、エミリー、そしてマシュー。デイビッドは「マシューは騎士か、エイデンはならず者だ」と言っているのが聞かれました。エリザベスは「オリバーは騎士だ」と述べました。オリバーは「デイビッドはならず者ではない」と言いました。エイデンは「デイビッドは騎士か、エイデンは騎士だ」と言いました。「エミリーはオリバーが騎士である場合に限りならず者だ」とエイヴァは宣言しました。エミリーはあなたに、エイデンはデイビッドが騎士である場合に限り騎士だと言いました。マシューは「デイビッドはならず者か、エイデンは騎士だ」とコメントしました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) デイビッドは騎士です  \n(2) エリザベスは騎士です  \n(3) オリバーは騎士です  \n(4) エイデンは騎士です  \n(5) エイヴァはならず者です  \n(6) エミリーは騎士です  \n(7) マシューは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：アリア、ダニエル、メイソン、デイビッド、ミア、エリザベス、そしてスカーレット。アリアは「エリザベスは騎士で、ダニエルも騎士です」と主張しました。ダニエルの発言では、「もしエリザベスが騎士なら、ミアは騎士です」と言いました。メイソンは「デイビッドは騎士か、デイビッドはならず者です」と言っているのが聞かれました。デイビッドは「ダニエルはならず者で、スカーレットはならず者です」と主張しました。ミアはあなたに、エリザベスはならず者で、ダニエルは騎士だと言いました。エリザベスは「もしメイソンがならず者なら、デイビッドは騎士です」と言いました。「ミアはアリアが騎士である場合に限りならず者です」とスカーレットは言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) アリアはならず者です  \n(2) ダニエルはならず者です  \n(3) メイソンは騎士です  \n(4) デイビッドは騎士です  \n(5) ミアはならず者です  \n(6) エリザベスは騎士です  \n(7) スカーレットはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：マイケル、セバスチャン、ジャクソン、ペネロペ、ノア、イザベラ、そしてゾーイ。マイケルは「イザベラはならず者ではない」と言いました。セバスチャンは「ノアはならず者か、イザベラはならず者だ」と言いました。ジャクソンは「ノアはならず者で、セバスチャンは騎士だ」と言いました。「ゾーイはならず者だ」とペネロペが言いました。「セバスチャンがならず者なら、ノアは騎士だ」とノアが言いました。「マイケルはならず者であるのは、セバスチャンが騎士である場合に限る」とイザベラが言いました。ゾーイは「セバスチャンはならず者か、マイケルは騎士だ」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルは騎士です  \n(2) セバスチャンはならず者です  \n(3) ジャクソンはならず者です  \n(4) ペネロペはならず者です  \n(5) ノアは騎士です  \n(6) イザベラは騎士です  \n(7) ゾーイは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ペネロペ、イヴリン、シャーロット、エラ、エイデン、アリア、そしてジャクソン。ペネロペは「ペネロペは騎士です」とコメントしました。イヴリンは「ペネロペはならず者ではありません」と述べました。シャーロットの言葉では「ペネロペは騎士であるか、エイデンは騎士である」と言いました。エラは「シャーロットは騎士であるか、シャーロットはならず者である」と言いました。「ジャクソンはならず者です」とエイデンは主張しました。「エイデンはならず者で、ジャクソンはならず者です」とアリアは主張しました。ジャクソンはシャーロットが騎士であり、エラが騎士であると言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペは騎士です  \n(2) イヴリンは騎士です  \n(3) シャーロットは騎士です  \n(4) エラは騎士です  \n(5) エイデンはならず者です  \n(6) アリアはならず者です  \n(7) ジャクソンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ローガン、エイデン、デイビッド、ハーパー、イヴリン、ダニエル、そしてビクトリア。ローガンは「エイデンは騎士で、ダニエルはならず者だ」と主張しました。エイデンは「ダニエルはデイビッドが騎士である場合に限り騎士だ」と言っているのが聞かれました。「ビクトリアは騎士か、エイデンはならず者だ」とデイビッドが言いました。ハーパーの言葉では「イヴリンはならず者だ」と言っています。イヴリンによれば、「もしローガンが騎士なら、エイデンは騎士だ」とのことです。「デイビッドは騎士ではない」とダニエルが宣言しました。ビクトリアはイヴリンがならず者ではないと言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンはならず者です  \n(2) エイデンはならず者です  \n(3) デイビッドは騎士です  \n(4) ハーパーはならず者です  \n(5) イヴリンは騎士です  \n(6) ダニエルはならず者です  \n(7) ビクトリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジャック、ウィリアム、ヘンリー、メイソン、オーウェン、エリザベス、そしてベンジャミン。ジャックは「エリザベスはならず者ではない」と言いました。ウィリアムは「もしウィリアムが騎士なら、エリザベスも騎士だ」と述べました。ヘンリーは「ヘンリーは騎士で、ジャックはならず者だ」と表現しました。メイソンは「ジャックは騎士だ」と言いました。オーウェンの発言では「オーウェンは騎士で、ウィリアムはならず者だ」と述べました。エリザベスは「もしジャックがならず者なら、メイソンもならず者だ」と主張しました。ベンジャミンは「ウィリアムはならず者だ」と指摘しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャックは騎士です  \n(2) ウィリアムは騎士です  \n(3) ヘンリーはならず者です  \n(4) メイソンは騎士です  \n(5) オーウェンはならず者です  \n(6) エリザベスは騎士です  \n(7) ベンジャミンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：イザベラ、ヘンリー、メイソン、マイケル、オリビア、ビクトリア、そしてリアム。イザベラは「メイソンは騎士で、リアムはならず者です」と主張しました。ヘンリーは「もしマイケルが騎士なら、ビクトリアも騎士です」と言いました。メイソンの言葉では、「マイケルは騎士である場合に限り、ビクトリアはならず者です」。マイケルは「ビクトリアは騎士です」と言いました。オリビアは「ヘンリーはならず者ではありません」と主張しました。ビクトリアは、ヘンリーはならず者で、オリビアは騎士だと言いました。リアムは「マイケルは騎士か、オリビアはならず者です」と指摘しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イザベラはならず者です  \n(2) ヘンリーは騎士です  \n(3) メイソンはならず者です  \n(4) マイケルはならず者です  \n(5) オリビアは騎士です  \n(6) ビクトリアはならず者です  \n(7) リアムはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：オーウェン、シャーロット、セバスチャン、ハーパー、マイケル、ビクトリア、そしてメイソン。「シャーロットは騎士ではない」とオーウェンが言いました。シャーロットは、ビクトリアが騎士である場合に限り、メイソンが騎士であると言いました。セバスチャンは「ビクトリアはならず者だ」とコメントしました。「オーウェンはならず者で、シャーロットは騎士だ」とハーパーが宣言しました。マイケルによれば、「ビクトリアは騎士だ」とのことです。ビクトリアは「マイケルはならず者で、シャーロットは騎士だ」と言いました。メイソンは「マイケルはならず者か、シャーロットはならず者だ」と述べました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オーウェンは騎士です  \n(2) シャーロットはならず者です  \n(3) セバスチャンは騎士です  \n(4) ハーパーはならず者です  \n(5) マイケルはならず者です  \n(6) ビクトリアはならず者です  \n(7) メイソンは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エミリー、ミア、オーウェン、エイヴァ、オリビア、デイビッド、そしてゾーイ。エミリーは「エミリーは騎士で、エイヴァはならず者です」と主張しました。ミアは「オーウェンはエイヴァがならず者である場合に限り騎士です」と言いました。オーウェンによれば、「ミアはならず者で、デイビッドは騎士です」とのことです。エイヴァは「エイヴァはミアが騎士である場合に限り騎士です」と述べました。オリビアは「オーウェンは騎士です」と主張しました。デイビッドは「デイビッドは騎士であるか、オーウェンはならず者です」とコメントしました。ゾーイは「エミリーはならず者です」とコメントしました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーはならず者です  \n(2) ミアは騎士です  \n(3) オーウェンはならず者です  \n(4) エイヴァは騎士です  \n(5) オリビアはならず者です  \n(6) デイビッドは騎士です  \n(7) ゾーイは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：メイソン、アレクサンダー、リリー、デイビッド、イヴリン、ジョセフ、そしてペネロペです。「ジョセフは騎士か、イヴリンはならず者だ」とメイソンは主張しました。「アレクサンダーは騎士である場合に限り、ジョセフはならず者だ」とアレクサンダーは宣言しました。リリーは「ペネロペはならず者で、アレクサンダーもならず者だ」とコメントしました。「もしペネロペがならず者なら、アレクサンダーは騎士だ」とデイビッドは言及しました。イヴリンは「もしリリーが騎士なら、デイビッドはならず者だ」と表現しました。ジョセフは「デイビッドは騎士である場合に限り、ペネロペはならず者だ」と述べました。ペネロペは「イヴリンはならず者だ」と指摘しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) メイソンはならず者です  \n(2) アレクサンダーはならず者です  \n(3) リリーは騎士です  \n(4) デイビッドはならず者です  \n(5) イヴリンは騎士です  \n(6) ジョセフはならず者です  \n(7) ペネロペはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジャクソン、ジェームズ、ローガン、ソフィア、デイビッド、ジョセフ、そしてイーサン。ジャクソンは「デイビッドはならず者か、デイビッドは騎士です」と言いました。ジェームズは「ジェームズは騎士か、ソフィアはならず者です」と言いました。ローガンは「デイビッドはならず者で、ソフィアは騎士です」とコメントしました。「ローガンはならず者で、イーサンはならず者です」とソフィアが言いました。デイビッドはジョセフがならず者だと言いました。ジョセフはあなたに「ジェームズはならず者か、ソフィアはならず者です」と言いました。イーサンは「ローガンはならず者ではありません」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンは騎士です  \n(2) ジェームズは騎士です  \n(3) ローガンはならず者です  \n(4) ソフィアは騎士です  \n(5) デイビッドは騎士です  \n(6) ジョセフはならず者です  \n(7) イーサンはならず者です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ウィリアム、エラ、アリア、マイケル、グレース、エイヴァ、そしてジェームズ。ウィリアムの発言：「エイヴァは騎士です」。エラは「ジェームズはならず者ではありません」と述べました。「ジェームズはグレースがならず者である場合に限りならず者です」とアリアが宣言しました。マイケルは「ウィリアムが騎士ならエイヴァはならず者です」と述べました。グレースは「マイケルはならず者かエイヴァはならず者です」と言いました。エイヴァは「アリアは騎士でマイケルは騎士です」と述べました。ジェームズは「ウィリアムは騎士です」と言っているのが聞かれました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ウィリアムはならず者です  \n(2) エラはならず者です  \n(3) アリアはならず者です  \n(4) マイケルは騎士です  \n(5) グレースは騎士です  \n(6) エイヴァはならず者です  \n(7) ジェームズはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エリザベス、グレース、ダニエル、ソフィア、ローガン、エラ、そしてアレクサンダー。エリザベスはこう言いました。「ダニエルは騎士であり、ダニエルはならず者です。」グレースの発言では、「ソフィアはならず者です。」ダニエルはアレクサンダーが騎士だと言いました。ソフィアの言葉では、「エリザベスは騎士ではありません。」ローガンは、「ソフィアは騎士です。」と言いました。エラは、エリザベスが騎士である場合に限り、グレースはならず者だと言いました。アレクサンダーは、「エラは騎士です。」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスはならず者です  \n(2) グレースはならず者です  \n(3) ダニエルはならず者です  \n(4) ソフィアは騎士です  \n(5) ローガンは騎士です  \n(6) エラはならず者です  \n(7) アレクサンダーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジョセフ、ローガン、リリー、ソフィア、ジェームズ、ルーカス、そしてオーウェンです。「ソフィアはならず者だ」とジョセフが言いました。ローガンは「ローガンは騎士か、ソフィアは騎士だ」とコメントしました。リリーは「ジョセフは騎士である場合に限り、ジェームズは騎士だ」と主張しました。ソフィアは「オーウェンがならず者なら、ジョセフは騎士だ」と述べました。「ルーカスは騎士である場合に限り、ローガンはならず者だ」とジェームズが言いました。ルーカスの発言では「ソフィアはならず者で、ジョセフはならず者だ」と言いました。オーウェンはルーカスがならず者だと言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフはならず者です  \n(2) ローガンは騎士です  \n(3) リリーはならず者です  \n(4) ソフィアは騎士です  \n(5) ジェームズは騎士です  \n(6) ルーカスはならず者です  \n(7) オーウェンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ペネロペ、ノア、ルーカス、ベンジャミン、ジャクソン、リリー、そしてシャーロット。ペネロペは「リリーは騎士か、ペネロペは騎士だ」と言っているのが聞かれました。ノアによれば、「シャーロットはならず者で、ジャクソンはならず者だ」とのことです。ルーカスはペネロペが騎士だと言いました。ベンジャミンの発言では、「もしシャーロットがならず者なら、ペネロペは騎士だ」と言っています。ジャクソンの発言では、「ペネロペは騎士か、ルーカスはならず者だ」と言っています。リリーは「ジャクソンはならず者であるのは、ベンジャミンがならず者である場合に限る」と述べました。シャーロットは「ジャクソンは騎士か、ルーカスは騎士だ」と言いました。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ペネロペは騎士です  \n(2) ノアはならず者です  \n(3) ルーカスは騎士です  \n(4) ベンジャミンは騎士です  \n(5) ジャクソンは騎士です  \n(6) リリーは騎士です  \n(7) シャーロットは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ノア、ビクトリア、ローガン、ソフィア、ジャック、イヴリン、そしてグレース。ノアは「ローガンは騎士だ」と言いました。ビクトリアは「ノアはならず者で、グレースは騎士だ」と言いました。ローガンの発言では「ビクトリアは騎士か、ビクトリアはならず者だ」と述べました。ソフィアは、ノアがならず者であるのはグレースがならず者である場合に限ると表現しました。「ビクトリアは騎士で、ノアはならず者だ」とジャックが宣言しました。イヴリンは「ジャックはならず者か、ローガンは騎士だ」と述べました。「ノアは騎士か、ローガンは騎士だ」とグレースが言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアは騎士です  \n(2) ビクトリアはならず者です  \n(3) ローガンは騎士です  \n(4) ソフィアは騎士です  \n(5) ジャックはならず者です  \n(6) イヴリンは騎士です  \n(7) グレースは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：オリビア、ルーカス、イザベラ、エマ、ダニエル、オーロラ、そしてエラ。オリビアは「ダニエルは騎士です」と言いました。ルーカスは「イザベラはならず者ではありません」と言いました。イザベラは「エラはならず者です」と述べました。エマは「オリビアは騎士であるか、ルーカスはならず者です」とコメントしました。ダニエルは「オーロラは騎士であり、ダニエルは騎士です」と言いました。オーロラは「オーロラは騎士であり、ルーカスは騎士です」と指摘しました。エラによれば「オーロラは騎士であるか、オリビアは騎士です」とのことです。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) オリビアはならず者です  \n(2) ルーカスは騎士です  \n(3) イザベラは騎士です  \n(4) エマはならず者です  \n(5) ダニエルはならず者です  \n(6) オーロラはならず者です  \n(7) エラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ローガン、セバスチャン、ベンジャミン、グレース、エイヴァ、マイケル、そしてイザベラ。ローガンの発言：「エイヴァはならず者ではない」。セバスチャンは、「グレースは騎士か、ベンジャミンは騎士である」と述べました。ベンジャミンは、「ローガンはならず者か、マイケルは騎士である」と言いました。グレースはイザベラがならず者であると表現しました。エイヴァは、「もしエイヴァが騎士なら、マイケルは騎士である」と言いました。マイケルはベンジャミンがならず者ではないと言いました。イザベラは、「もしイザベラが騎士なら、グレースはならず者である」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンは騎士です  \n(2) セバスチャンは騎士です  \n(3) ベンジャミンは騎士です  \n(4) グレースはならず者です  \n(5) エイヴァは騎士です  \n(6) マイケルは騎士です  \n(7) イザベラは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：リリー、ジャクソン、ビクトリア、ゾーイ、エイデン、ダニエル、そしてヘンリー。リリーは「エイデンはならず者か、ダニエルは騎士です」と言いました。ジャクソンは「ビクトリアはダニエルが騎士である場合に限り騎士です」と宣言しました。「ゾーイは騎士か、ヘンリーは騎士です」とビクトリアが言及しました。ゾーイは「ゾーイは騎士で、ヘンリーは騎士です」と言っているのが聞かれました。エイデンは「リリーはならず者ではありません」と言っているのが聞かれました。ダニエルの言葉では、「リリーはダニエルが騎士である場合に限り騎士です」と言いました。ヘンリーは「リリーは騎士ではありません」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーは騎士です  \n(2) ジャクソンはならず者です  \n(3) ビクトリアはならず者です  \n(4) ゾーイはならず者です  \n(5) エイデンは騎士です  \n(6) ダニエルは騎士です  \n(7) ヘンリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エイヴァ、ソフィア、エリザベス、エイブリー、イザベラ、クロエ、そしてジョセフです。「エイブリーは騎士であるのは、ジョセフがならず者である場合に限る」とエイヴァは主張しました。ソフィアは「エリザベスはならず者ではない」と述べました。エリザベスによれば、「エイブリーはならず者ではない」とのことです。エイブリーの言葉では、「ジョセフが騎士であれば、ソフィアは騎士です」。イザベラは「クロエはならず者であるか、エイヴァは騎士である」と宣言しました。クロエは「ソフィアが騎士であれば、エイブリーはならず者です」と言っているのが聞かれました。ジョセフは「クロエはならず者であるのは、エリザベスがならず者である場合に限る」と指摘しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイヴァは騎士です  \n(2) ソフィアは騎士です  \n(3) エリザベスは騎士です  \n(4) エイブリーは騎士です  \n(5) イザベラは騎士です  \n(6) クロエはならず者です  \n(7) ジョセフはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エイブリー、アリア、ベンジャミン、ジョセフ、ビクトリア、アレクサンダー、そしてエミリー。エイブリーは、ジョセフがならず者だと言いました。アリアの発言では、「エミリーがならず者なら、ビクトリアは騎士です」と言っています。ベンジャミンの言葉では、「アリアは騎士ではありません」と言っています。ジョセフは、「エミリーはならず者か、エイブリーは騎士です」と述べました。「アレクサンダーが騎士なら、エイブリーは騎士です」とビクトリアが宣言しました。アレクサンダーは、「ビクトリアはエイブリーが騎士であるときに限り騎士です」と言いました。エミリーは、「ベンジャミンはならず者です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーはならず者です  \n(2) アリアはならず者です  \n(3) ベンジャミンは騎士です  \n(4) ジョセフは騎士です  \n(5) ビクトリアはならず者です  \n(6) アレクサンダーは騎士です  \n(7) エミリーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ソフィア、ジャクソン、ペネロペ、イザベラ、エイブリー、リリー、そしてハーパー。ソフィアは「イザベラは騎士であるのはリリーが騎士である場合に限る」とコメントしました。ジャクソンは「ソフィアはならず者であるか、ハーパーはならず者である」と主張しました。ペネロペは「ジャクソンはならず者であり、ハーパーはならず者である」と主張しました。イザベラは「ソフィアはならず者であるのはジャクソンがならず者である場合に限る」と言いました。エイブリーはソフィアが騎士であると表現しました。リリーは「イザベラがならず者であれば、イザベラは騎士である」と主張しました。ハーパーは「ジャクソンが騎士であれば、リリーは騎士である」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ソフィアは騎士です  \n(2) ジャクソンはならず者です  \n(3) ペネロペはならず者です  \n(4) イザベラはならず者です  \n(5) エイブリーは騎士です  \n(6) リリーはならず者です  \n(7) ハーパーは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エイブリー、ルーク、ハーパー、エリザベス、シャーロット、アリア、そしてローガン。エイブリーは「アリアがならず者なら、エリザベスもならず者だ」と言いました。ルークは「ハーパーはならず者で、アリアはならず者だ」と主張しました。「ルークが騎士なら、エリザベスはならず者だ」とハーパーは宣言しました。エリザベスは「ローガンはならず者ではない」と言いました。シャーロットは「ルークがならず者なら、エイブリーは騎士だ」と述べました。アリアは「エリザベスは騎士だ」と言いました。「シャーロットはならず者ではない」とローガンは主張しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーは騎士です  \n(2) ルークはならず者です  \n(3) ハーパーは騎士です  \n(4) エリザベスは騎士です  \n(5) シャーロットは騎士です  \n(6) アリアは騎士です  \n(7) ローガンは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エミリー、エマ、ソフィア、ハーパー、リリー、アリア、そしてジャクソンです。エミリーによれば、「リリーはならず者か、エミリーは騎士です」。エマの発言では、「エミリーは騎士ではありません」。ソフィアは、「エミリーはならず者で、エマは騎士です」と述べました。ハーパーは、「ジャクソンは騎士か、アリアは騎士です」とコメントしました。リリーは、「エマはならず者ではありません」と主張しました。アリアは、「ハーパーは騎士である場合に限り、ハーパーはならず者です」と言いました。ジャクソンの言葉では、「もしエミリーがならず者なら、ハーパーはならず者です」と述べました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エミリーは騎士です  \n(2) エマはならず者です  \n(3) ソフィアはならず者です  \n(4) ハーパーは騎士です  \n(5) リリーはならず者です  \n(6) アリアはならず者です  \n(7) ジャクソンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エリザベス、リリー、ソフィア、オーウェン、ジャック、アレクサンダー、そしてオーロラ。エリザベスの言葉によれば、「リリーはならず者ではない」。リリーは「オーロラは騎士だ」と言いました。ソフィアは「ジャックは騎士で、オーロラは騎士だ」と言いました。オーウェンは、オーロラが騎士であるのはアレクサンダーが騎士である場合に限るとあなたに伝えました。ジャックの言葉では、「ソフィアは騎士で、アレクサンダーは騎士だ」と言いました。アレクサンダーは、オーウェンが騎士であればエリザベスはならず者だと言いました。オーロラの言葉によれば、「ジャックがならず者であればオーウェンは騎士だ」。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスはならず者です  \n(2) リリーはならず者です  \n(3) ソフィアはならず者です  \n(4) オーウェンはならず者です  \n(5) ジャックはならず者です  \n(6) アレクサンダーは騎士です  \n(7) オーロラはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：リリー、ジェームズ、ペネロペ、イザベラ、セバスチャン、ジャクソン、そしてエリザベス。リリーは言いました。「もしジェームズがならず者なら、イザベラは騎士です」。ジェームズは主張しました。「イザベラはジャクソンが騎士である場合に限り、ならず者です」。ペネロペによれば、「イザベラはジェームズがならず者である場合に限り、騎士です」。イザベラの言葉では、「ジャクソンは騎士ではありません」。セバスチャンはこう言いました。「エリザベスはならず者ではありません」。ジャクソンの言葉では、「もしペネロペが騎士なら、セバスチャンはならず者です」。エリザベスは、イザベラがならず者である場合に限り、エリザベスが騎士であると表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーは騎士です  \n(2) ジェームズは騎士です  \n(3) ペネロペは騎士です  \n(4) イザベラはならず者です  \n(5) セバスチャンはならず者です  \n(6) ジャクソンは騎士です  \n(7) エリザベスはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ローガン、ルーカス、ウィリアム、アビゲイル、リアム、イーサン、そしてアメリア。ローガンの発言：「リアムはならず者ではない」。ルーカスの言葉：「ローガンが騎士である場合に限り、リアムは騎士である」。ウィリアムは、ウィリアムが騎士であるか、ルーカスが騎士であると言いました。アビゲイルは、アメリアが騎士であり、イーサンが騎士であるとあなたに伝えました。リアムは、「イーサンは騎士ではない」と述べました。イーサンは、「ローガンが騎士である場合に限り、イーサンは騎士である」と述べました。「リアムはならず者であるか、ローガンは騎士である」とアメリアは宣言しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ローガンは騎士です  \n(2) ルーカスは騎士です  \n(3) ウィリアムは騎士です  \n(4) アビゲイルはならず者です  \n(5) リアムは騎士です  \n(6) イーサンはならず者です  \n(7) アメリアは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エイブリー、エマ、イーサン、サミュエル、ハーパー、イザベラ、そしてアレクサンダー。エイブリーによれば、「アレクサンダーはイザベラがならず者である場合に限り、ならず者です」。エマは「エイブリーは騎士ではない」とコメントしました。イーサンの言葉では、「ハーパーはならず者であるか、エマは騎士です」。サミュエルは「アレクサンダーはならず者であるか、エイブリーは騎士です」とコメントしました。ハーパーは「アレクサンダーは騎士であるか、エマはならず者です」と主張しました。イザベラは「イーサンはならず者ではない」と言っているのが聞かれました。アレクサンダーは「イザベラは騎士です」と指摘しました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーは騎士です  \n(2) エマはならず者です  \n(3) イーサンはならず者です  \n(4) サミュエルは騎士です  \n(5) ハーパーは騎士です  \n(6) イザベラはならず者です  \n(7) アレクサンダーはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エイブリー、オリビア、アメリア、エイヴァ、アリア、スカーレット、そしてベンジャミン。エイブリーは「もしエイヴァがならず者なら、エイブリーは騎士だ」と言いました。オリビアは「アメリアは騎士ではない」と述べました。アメリアは「もしアリアが騎士なら、ベンジャミンはならず者だ」とあなたに言いました。エイヴァは「アリアは騎士ではない」とあなたに言いました。アリアによれば、「オリビアは騎士か、アメリアはならず者だ」とのことです。スカーレットは「アリアが騎士である場合に限り、ベンジャミンはならず者だ」と言いました。ベンジャミンは「オリビアはならず者で、エイブリーは騎士だ」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイブリーは騎士です  \n(2) オリビアはならず者です  \n(3) アメリアは騎士です  \n(4) エイヴァは騎士です  \n(5) アリアはならず者です  \n(6) スカーレットは騎士です  \n(7) ベンジャミンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：マイケル、アレクサンダー、エイヴァ、ルーク、ルーカス、ジェームズ、そしてエラ。マイケルはルーカスがならず者であり、ルーカスが騎士であると言いました。「エイヴァは騎士であり、ジェームズはならず者だ」とアレクサンダーが言いました。「ルークはエラがならず者である場合に限り騎士です」とエイヴァが主張しました。「ルーカスはならず者であり、マイケルは騎士です」とルークが言及しました。「マイケルは騎士です」とルーカスが言いました。ジェームズは「エラが騎士であれば、ジェームズは騎士です」と指摘しました。エラによれば、「ジェームズは騎士であるか、エイヴァはならず者です」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) マイケルはならず者です  \n(2) アレクサンダーはならず者です  \n(3) エイヴァは騎士です  \n(4) ルークはならず者です  \n(5) ルーカスはならず者です  \n(6) ジェームズは騎士です  \n(7) エラは騎士です"
    },
    {
        "quiz": "特別な島には騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ダニエル、ジャクソン、エイデン、アビゲイル、スカーレット、ローガン、そしてエラ。ダニエルは「エラはならず者で、ローガンはならず者だ」と言っているのが聞かれました。ジャクソンの言葉では「もしエイデンがならず者なら、エラはならず者だ」と言っています。エイデンは「エイデンは騎士であるのは、ローガンがならず者である場合に限る」と言っているのが聞かれました。アビゲイルは「ローガンはならず者ではない」と指摘しました。スカーレットはエラがならず者だと言いました。「ジャクソンは騎士か、ダニエルは騎士だ」とローガンは主張しました。「もしダニエルが騎士なら、ジャクソンは騎士だ」とエラは宣言しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ダニエルはならず者です  \n(2) ジャクソンはならず者です  \n(3) エイデンはならず者です  \n(4) アビゲイルはならず者です  \n(5) スカーレットはならず者です  \n(6) ローガンはならず者です  \n(7) エラは騎士です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：イヴリン、アレクサンダー、ソフィア、ヘンリー、ジェイコブ、イーサン、そしてアリア。イヴリンは「アリアがならず者であるのは、アレクサンダーがならず者である場合に限る」と言いました。アレクサンダーは「イーサンはならず者ではない」と述べました。ソフィアは「アリアがならず者であるか、ヘンリーが騎士である」と表現しました。ヘンリーの発言は「ソフィアは騎士ではない」です。ジェイコブの発言は「アリアは騎士であり、ソフィアは騎士である」です。イーサンは「ヘンリーは騎士であり、ジェイコブは騎士である」と述べました。アリアの言葉では「ジェイコブはならず者ではない」と言いました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イヴリンは騎士です  \n(2) アレクサンダーはならず者です  \n(3) ソフィアは騎士です  \n(4) ヘンリーはならず者です  \n(5) ジェイコブはならず者です  \n(6) イーサンはならず者です  \n(7) アリアはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エリザベス、スカーレット、アメリア、アリア、ジェイコブ、ローガン、そしてノア。エリザベスはスカーレットがならず者だと言いました。「ノアがならず者なら、アメリアは騎士です」とスカーレットが言いました。アメリアはアリアがならず者ではないと言いました。アリアは「エリザベスは騎士であり、アリアは騎士です」と言いました。ジェイコブは「エリザベスが騎士である場合、エリザベスはならず者です」と言いました。ローガンの発言では「ジェイコブは騎士ではありません」と言いました。ノアは「ローガンはならず者です」と言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エリザベスは騎士です  \n(2) スカーレットはならず者です  \n(3) アメリアはならず者です  \n(4) アリアはならず者です  \n(5) ジェイコブはならず者です  \n(6) ローガンは騎士です  \n(7) ノアはならず者です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：リリー、デイビッド、ローガン、ノア、ペネロペ、ベンジャミン、そしてソフィア。リリーの発言によると、「デイビッドは騎士です」。デイビッドは、「ローガンは騎士か、ソフィアはならず者です」とコメントしました。ローガンの言葉では、「ソフィアは騎士で、リリーはならず者です」。ノアは、「リリーは騎士で、ベンジャミンは騎士です」と言いました。ペネロペによれば、「ノアが騎士なら、ソフィアはならず者です」。ベンジャミンは、「ノアはならず者ではありません」と言いました。ソフィアは、「ペネロペが騎士なら、ベンジャミンは騎士です」とコメントしました。さて、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) リリーは騎士です  \n(2) デイビッドは騎士です  \n(3) ローガンはならず者です  \n(4) ノアはならず者です  \n(5) ペネロペは騎士です  \n(6) ベンジャミンはならず者です  \n(7) ソフィアはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ノア、サミュエル、イヴリン、ルーク、ルーカス、ジャクソン、そしてメイソン。ノアは「イヴリンは騎士だ」と主張しました。サミュエルの言葉では「ルーカスは騎士ではない」と言いました。イヴリンは「ジャクソンは騎士か、メイソンは騎士だ」と述べました。「もしジャクソンがならず者なら、サミュエルは騎士だ」とルークは主張しました。ルーカスは「ノアはならず者ではない」と指摘しました。ジャクソンは「イヴリンは騎士か、イヴリンはならず者だ」と言っているのが聞かれました。「サミュエルは騎士だ」とメイソンは宣言しました。それでは、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ノアは騎士です  \n(2) サミュエルはならず者です  \n(3) イヴリンは騎士です  \n(4) ルークは騎士です  \n(5) ルーカスは騎士です  \n(6) ジャクソンは騎士です  \n(7) メイソンはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：イザベラ、ダニエル、ソフィア、スカーレット、ジョセフ、エマ、そしてビクトリア。イザベラは「ダニエルは騎士ではない」とコメントしました。ダニエルは「イザベラはならず者で、ビクトリアは騎士だ」と述べました。ソフィアは「イザベラはならず者か、エマは騎士だ」とコメントしました。スカーレットは「エマは騎士か、ソフィアは騎士だ」と言いました。ジョセフは「ビクトリアがならず者なら、ソフィアは騎士だ」と言いました。エマは「ビクトリアはならず者か、スカーレットはならず者だ」と主張しました。ビクトリアは「ジョセフは、ソフィアが騎士である場合に限りならず者だ」とコメントしました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) イザベラは騎士です  \n(2) ダニエルはならず者です  \n(3) ソフィアは騎士です  \n(4) スカーレットは騎士です  \n(5) ジョセフは騎士です  \n(6) エマは騎士です  \n(7) ビクトリアはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ゾーイ、ジェイコブ、エラ、クロエ、イーサン、ルーク、そしてリリー。ゾーイは「クロエは騎士か、クロエはならず者だ」と主張しました。ジェイコブは「イーサンはならず者だ」と言いました。エラは、ジェイコブが騎士でリリーも騎士だと言いました。「リリーは騎士ではない」とクロエは主張しました。イーサンは「クロエは騎士ではない」とコメントしました。「エラは騎士ではない」とルークは主張しました。リリーは「ルークは騎士で、ゾーイはならず者だ」と述べました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ゾーイは騎士です  \n(2) ジェイコブは騎士です  \n(3) エラはならず者です  \n(4) クロエは騎士です  \n(5) イーサンはならず者です  \n(6) ルークは騎士です  \n(7) リリーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジャクソン、ミア、アビゲイル、ベンジャミン、ハーパー、オリバー、そしてエミリー。ジャクソンは「ハーパーは騎士である場合に限り、ジャクソンは騎士である」と言いました。ミアによれば、「ハーパーはならず者であるか、エミリーは騎士である」とのことです。「ジャクソンはならず者だ」とアビゲイルは主張しました。ベンジャミンはジャクソンが騎士であり、ジャクソンがならず者であると言いました。ハーパーの言葉では、「ジャクソンはならず者ではない」とのことです。「もしアビゲイルがならず者なら、ミアはならず者だ」とオリバーは言いました。エミリーはベンジャミンが騎士であると表現しました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジャクソンは騎士です  \n(2) ミアはならず者です  \n(3) アビゲイルはならず者です  \n(4) ベンジャミンはならず者です  \n(5) ハーパーは騎士です  \n(6) オリバーは騎士です  \n(7) エミリーはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ルーカス、セバスチャン、ベンジャミン、ジェイコブ、エマ、リリー、そしてマイケル。ルーカスの発言では、「リリーはならず者か、マイケルはならず者です」。セバスチャンは、「もしルーカスが騎士なら、リリーはならず者です」と言っているのが聞かれました。ベンジャミンは、ルーカスが騎士か、ベンジャミンが騎士だとあなたに言いました。ジェイコブは、「マイケルはならず者ではありません」と述べました。エマは、「ジェイコブはリリーが騎士である場合に限り騎士です」と言っているのが聞かれました。「エマは騎士ではありません」とリリーは宣言しました。マイケルは、エマはならず者ではないと表現しました。それでは、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ルーカスは騎士です  \n(2) セバスチャンはならず者です  \n(3) ベンジャミンは騎士です  \n(4) ジェイコブはならず者です  \n(5) エマはならず者です  \n(6) リリーは騎士です  \n(7) マイケルはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジョセフ、リリー、エマ、ハーパー、クロエ、イーサン、そしてローガン。ジョセフは「ハーパーは騎士であり、ハーパーはならず者だ」と主張しました。リリーの言葉では「ハーパーは騎士です」。エマは「ジョセフはならず者ではない」と宣言しました。ハーパーの言葉では「クロエは騎士です」。クロエは「もしリリーがならず者なら、エマはならず者です」と指摘しました。イーサンの発言では「ジョセフは騎士であり、ローガンはならず者です」。ローガンはイーサンがならず者だと言いました。では、誰が騎士で誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジョセフはならず者です  \n(2) リリーは騎士です  \n(3) エマはならず者です  \n(4) ハーパーは騎士です  \n(5) クロエは騎士です  \n(6) イーサンはならず者です  \n(7) ローガンは騎士です"
    },
    {
        "quiz": "非常に特別な島は、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：エイデン、ジョセフ、グレース、オーロラ、ソフィア、クロエ、そしてリアム。エイデンは「ジョセフがならず者であるならば、リアムはならず者である」と言いました。「グレースがならず者であるならば、リアムはならず者である」とジョセフは言いました。グレースによれば、「ソフィアはならず者です」。オーロラは「エイデンがならず者であるならば、グレースは騎士です」と言いました。ソフィアは「クロエはならず者であるならば、エイデンは騎士です」と主張しました。「グレースは騎士ではありません」とクロエは言いました。リアムによれば、「オーロラはならず者ではありません」。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) エイデンはならず者です  \n(2) ジョセフは騎士です  \n(3) グレースはならず者です  \n(4) オーロラはならず者です  \n(5) ソフィアは騎士です  \n(6) クロエは騎士です  \n(7) リアムはならず者です"
    },
    {
        "quiz": "非常に特別な島には、騎士たちとならず者たちだけが住んでいます。騎士たちは常に真実を語り、ならず者たちは常に嘘をつきます。あなたは7人の住人に出会います：ジェームズ、ジョセフ、エラ、メイソン、ダニエル、オリビア、そしてソフィア。ジェームズは「ソフィアは騎士ではない」と言いました。ジョセフはメイソンはならず者ではないと言いました。エラの発言では「ソフィアはならず者である場合、ジェームズは騎士である」と述べました。メイソンは「オリビアは騎士である」と主張しました。ダニエルは「メイソンはエラがならず者である場合に限り、ならず者である」と表現しました。オリビアは「ジョセフは騎士であるか、エラは騎士である」と言っているのが聞かれました。ソフィアは「メイソンは騎士である場合、メイソンはならず者である」と言っているのが聞かれました。では、誰が騎士で、誰がならず者なのでしょうか？",
        "solution_text_format": "(1) ジェームズは騎士です  \n(2) ジョセフは騎士です  \n(3) エラは騎士です  \n(4) メイソンは騎士です  \n(5) ダニエルは騎士です  \n(6) オリビアは騎士です  \n(7) ソフィアはならず者です"
    }
]