[
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: نوح، فيكتوريا، آفا، ليلي، دانيال، إسكندر، وماثيو. قال نوح إن ماثيو فارس وفيكتوريا فارس. ذكرت فيكتوريا: \"ليلي محتالة إذا وفقط إذا كان ماثيو فارسًا\". في بيان من آفا: \"ماثيو فارس أو فيكتوريا فارس\". سُمِعَت ليلي تقول: \"إذا كانت فيكتوريا محتالة، فإن ماثيو محتال\". علق دانيال: \"إسكندر ليس فارسًا\". صرح إسكندر: \"نوح فارس أو آفا محتالة\". \"آفا محتالة\" - ماثيو. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح محتال  \n(2) فيكتوريا فارس  \n(3) آفا فارس  \n(4) ليلي فارس  \n(5) دانيال فارس  \n(6) إسكندر محتال  \n(7) ماثيو محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: دانيال، صموئيل، مايكل، صوفيا، مايسون، آريا، وإسكندر. كما قال دانيال: \"مايكل محتال إذا وفقط إذا كان إسكندر فارسًا\". صموئيل قال إن مايكل فارس وإسكندر محتال. مايكل أكد: \"آريا ليست محتالة\". صوفيا عبرت عن أن إسكندر فارس ومايسون محتال. مايسون أشار، \"إسكندر ليس فارسًا\". وفقًا لآريا، \"إذا كان مايكل فارسًا فإن إسكندر محتال\". إسكندر أخبرك أن آريا محتالة ودانيال محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال فارس  \n(2) صموئيل فارس  \n(3) مايكل فارس  \n(4) صوفيا محتالة  \n(5) مايسون فارس  \n(6) آريا فارس  \n(7) إسكندر محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: أميليا، لوغان، بنيامين، يوسف، مايكل، لوكاس، وزوي. قالت أميليا لك إن زوي محتالة إذا وفقط إذا كان مايكل محتالًا. \"لوغان فارس إذا وفقط إذا كانت أميليا محتالة\" - لوغان. \"إذا كان لوغان محتالًا، فإن بنيامين فارس\" - ادعى بنيامين. سمع يوسف يقول، \"إذا كان بنيامين محتالًا، فإن لوكاس فارس\". علق مايكل، \"أميليا فارس\". \"يوسف محتال إذا وفقط إذا كان مايكل فارس\" - ادعى لوكاس. علق زوي، \"لوكاس ليس فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا محتالة  \n(2) لوغان محتال  \n(3) بنيامين محتال  \n(4) يوسف محتال  \n(5) مايكل محتال  \n(6) لوكاس محتال  \n(7) زوي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: إيزابيلا، غريس، إليزابيث، أورورا، صوفيا، رايلي، وإسكندر. قالت إيزابيلا: \"إسكندر فارس أو غريس فارس\". قالت غريس: \"إليزابيث ليست محتالة\". علقت إليزابيث: \"إليزابيث فارس ورايلي فارس\". وفقًا لأورورا، \"صوفيا ليست فارسًا\". سُمعت صوفيا تقول: \"أورورا فارس وإسكندر محتال\". \"إسكندر محتال\" - رايلي. أشار إسكندر: \"إذا كانت غريس فارسًا، فإن إيزابيلا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا فارس  \n(2) غريس محتالة  \n(3) إليزابيث محتالة  \n(4) أورورا فارس  \n(5) صوفيا محتالة  \n(6) رايلي محتالة  \n(7) إسكندر فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: أوليفر، هاربر، إسكندر، غريس، لوكاس، إيفلين، وإيلا. أكد أوليفر: \"هاربر محتال إذا وفقط إذا كانت إيلا محتالة\". في كلمات هاربر: \"إيلا فارس ولوكاس محتال\". \"أوليفر فارس ولوكاس محتال\" - إسكندر. سُمعت غريس تقول: \"لوكاس محتال إذا وفقط إذا كان لوكاس فارسًا\". قال لوكاس: \"أوليفر محتال أو غريس محتالة\". علقت إيفلين: \"لوكاس ليس فارسًا\". \"غريس فارس\" - ادعت إيلا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفر فارس  \n(2) هاربر محتالة  \n(3) إسكندر محتال  \n(4) غريس محتالة  \n(5) لوكاس فارس  \n(6) إيفلين محتالة  \n(7) إيلا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: رايلي، داوود، فيكتوريا، أورورا، بنيامين، إليزابيث، وأيدن. قالت رايلي: \"إذا كانت إليزابيث فارسًا، فإن فيكتوريا محتالة\". أعرب داوود عن أن أيدن محتال إذا وفقط إذا كان بنيامين محتالًا. قالت فيكتوريا: \"رايلي ليست فارسًا\". علقت أورورا: \"فيكتوريا محتالة أو إليزابيث محتالة\". أعلن بنيامين: \"رايلي فارس إذا وفقط إذا كانت رايلي محتالة\". أعربت إليزابيث عن أن أيدن ليس محتالًا. كما قال أيدن: \"أورورا ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) رايلي فارس  \n(2) داوود محتال  \n(3) فيكتوريا محتالة  \n(4) أورورا فارس  \n(5) بنيامين محتال  \n(6) إليزابيث فارسة  \n(7) أيدن فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: رايلي، بنيامين، مايكل، إميلي، نوح، مايسون، وليام. \"إميلي فارس إذا وفقط إذا كان مايسون فارسًا\" - رايلي. \"إذا كان نوح محتالًا، فإن رايلي محتال\" ، أعلن بنيامين. \"إميلي فارس أو مايسون فارس\" ، ذكر مايكل. قالت إميلي إن نوح محتال أو إميلي فارس. كما قال نوح: \"رايلي محتال إذا وفقط إذا كان بنيامين فارسًا\". \"بنيامين محتال ومايسون فارس\" ، ادعى مايسون. قال ليام إن مايكل فارس إذا وفقط إذا كان مايكل محتالًا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) رايلي محتال  \n(2) بنيامين فارس  \n(3) مايكل فارس  \n(4) إميلي فارس  \n(5) نوح فارس  \n(6) مايسون محتال  \n(7) ليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: سكارليت، إيثان، زوي، آفا، لوكاس، فيكتوريا، وإسكندر. أخبرتك سكارليت أن آفا فارس أو إيثان فارس. أشار إيثان، \"إذا كان إيثان فارسًا، فإن إسكندر محتال\". \"إذا كانت سكارليت محتالًا، فإن آفا فارس\"، ذكرت زوي. في كلمات آفا: \"زوي ليست محتالًا\". سمع لوكاس يقول، \"إسكندر فارس وسكارليت محتال\". \"إذا كان لوكاس محتالًا، فإن زوي محتال\"، ادعت فيكتوريا. أشار إسكندر، \"إيثان فارس وسكارليت محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سكارليت فارس  \n(2) إيثان فارس  \n(3) زوي فارس  \n(4) آفا فارس  \n(5) لوكاس محتال  \n(6) فيكتوريا محتالة  \n(7) إسكندر محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: جاك، هنري، لوك، أفري، جيمس، مايسون، وصموئيل. علق جاك، \"جاك فارس إذا وفقط إذا كان صموئيل محتالًا\". في بيان لهنري: \"أفري محتالة وأفري فارس\". علق لوك، \"جيمس محتال وأفري محتالة\". كما قال أفري، \"صموئيل فارس أو جاك محتال\". أخبرك جيمس أن مايسون محتال إذا وفقط إذا كانت أفري فارس. أخبرك مايسون أن هنري فارس ومايسون فارس. \"لوك فارس ومايسون محتال\" - صموئيل. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاك محتار  \n(2) هنري محتال  \n(3) لوك محتال  \n(4) أفري فارس  \n(5) جيمس فارس  \n(6) مايسون محتال  \n(7) صموئيل محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ماثيو، آريا، إيثان، ميا، أفري، كلوي، وهاربر. قال ماثيو: \"أفري محتالة وهاربر فارسة\". علقت آريا قائلة: \"ميا محتالة إذا وفقط إذا كان ماثيو فارسًا\". في تصريح لإيثان: \"آريا محتالة أو ميا محتالة\". سُمعت ميا تقول: \"إذا كانت أفري فارسة، فإن أفري محتالة\". سُمعت أفري تقول: \"ميا فارسة أو ميا محتالة\". علقت كلوي قائلة: \"ميا محتالة إذا وفقط إذا كانت آريا محتالة\". علق هاربر قائلاً: \"إيثان ليس محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ماثيو محتال  \n(2) آريا محتالة  \n(3) إيثان فارس  \n(4) ميا محتالة  \n(5) أفري فارس  \n(6) كلوي فارس  \n(7) هاربر فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: أبيجيل، آريا، يعقوب، ليام، جيمس، أميليا، وداوود. في كلمات أبيجيل: \"داوود فارس إذا وفقط إذا كان ليام فارسًا\". لاحظت آريا، \"إذا كانت أبيجيل فارسًا، فإن ليام فارس\". \"أبيجيل محتالة\" - يعقوب. كما قال ليام، \"إذا كانت أميليا فارسًا، فإن أبيجيل فارس\". \"يعقوب فارس أو أميليا محتالة\"، ادعى جيمس. \"داوود ليس فارسًا\" - أميليا. قال داوود إن يعقوب محتال وداوود فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أبيجيل فارس  \n(2) آريا فارس  \n(3) يعقوب محتال  \n(4) ليام فارس  \n(5) جيمس فارس  \n(6) أميليا محتالة  \n(7) داوود فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: فيكتوريا، جاكسون، جاك، يعقوب، كلوي، دانيال، ولوغان. عبرت فيكتوريا عن أنه إذا كان لوغان فارسًا، فإن دانيال فارس. قال جاكسون إن لوغان محتال أو جاك محتال. في كلمات جاك: \"إذا كان جاكسون فارسًا، فإن فيكتوريا فارس.\" أخبرك يعقوب أنه إذا كان دانيال فارسًا، فإن فيكتوريا فارس. \"فيكتوريا ليست محتالة\"، أعلنت كلوي. سمع دانيال يقول: \"يعقوب فارس أو جاكسون محتال\". في بيان من لوغان: \"دانيال ليس فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) فيكتوريا فارس  \n(2) جاكسون فارس  \n(3) جاك فارس  \n(4) يعقوب فارس  \n(5) كلوي فارس  \n(6) دانيال فارس  \n(7) لوغان محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: جيمس، أبيجيل، دانيال، لوكاس، أوليفر، رايلي، وماثيو. جيمس أكد: \"دانيال محتال\". أبيجيل أخبرتك أنه إذا كانت رايلي فارسًا، فإن لوكاس فارس. دانيال قال: \"إذا كانت رايلي فارسًا، فإن لوكاس فارس\". وفقًا للوكاس، \"إذا كان دانيال محتالًا، فإن أوليفر محتال\". أوليفر أكد: \"دانيال فارس وأبيجيل محتالة\". رايلي عبرت عن أن أبيجيل ليست فارسًا. ماثيو صرح: \"أوليفر محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس محتال  \n(2) أبيجيل فارس  \n(3) دانيال فارس  \n(4) لوكاس فارس  \n(5) أوليفر محتال  \n(6) رايلي محتالة  \n(7) ماثيو فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: نوح، أورورا، جاك، أوليفر، ميا، إيفلين، وصوفيا. \"ميا فارس إذا وفقط إذا كانت صوفيا فارسًا\"، أعلن نوح. قالت أورورا، \"صوفيا فارس وميا فارس\". \"إيفلين ليست محتالة\" - جاك. \"إيفلين ليست محتالة\"، ذكر أوليفر. \"إذا كانت إيفلين فارسًا، فإن صوفيا محتالة\"، أعلنت ميا. علقت إيفلين، \"جاك فارس أو ميا فارس\". سُمع صوفيا تقول، \"نوح فارس وأورورا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح محتال  \n(2) أورورا محتالة  \n(3) جاك فارس  \n(4) أوليفر فارس  \n(5) ميا فارس  \n(6) إيفلين فارس  \n(7) صوفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: صموئيل، ليلي، لوغان، يعقوب، ويليام، أيدن، وهنري. في كلمات صموئيل: \"لوغان محتار وأيدن فارس\". في كلمات ليلي: \"يعقوب فارس إذا وفقط إذا كان ويليام فارسًا\". لوغان أشار، \"إذا كانت ليلي محتالة، فإن صموئيل فارس\". يعقوب أشار، \"إذا كان هنري محتالًا، فإن صموئيل محتال\". \"أيدن فارس وهنري محتال\" - ويليام. سمع أيدن يقول، \"إذا كانت ليلي فارسًا، فإن هنري محتال\". هنري صرح، \"ويليام محتال أو أيدن محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صموئيل محتال  \n(2) ليلي فارس  \n(3) لوغان فارس  \n(4) يعقوب فارس  \n(5) ويليام فارس  \n(6) أيدن فارس  \n(7) هنري محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: لوك، أوليفر، جيمس، أفري، جاكسون، لوغان، وأوين. وفقًا للوك، \"أفري محتال\". لاحظ أوليفر، \"لوغان محتال إذا وفقط إذا كان لوغان فارسًا\". لاحظ جيمس، \"أفري محتال ولوك فارس\". كما قالت أفري، \"جيمس فارس أو لوغان محتال\". كما قال جاكسون، \"إذا كان جيمس محتالًا، فإن لوغان محتال\". صرح لوغان، \"أفري محتالة\". علق أوين، \"إذا كان أوليفر فارسًا، فإن جاكسون فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك محتال  \n(2) أوليفر محتال  \n(3) جيمس محتال  \n(4) أفري فارس  \n(5) جاكسون فارس  \n(6) لوغان محتال  \n(7) أوين فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: ليام، شارلوت، غريس، صموئيل، دانيال، صوفيا، وأوليفر. وفقاً ليام، \"ليام فارس\". لاحظت شارلوت، \"ليام فارس\". قالت غريس إن ليام محتال إذا وفقط إذا كان دانيال فارساً. صرح صموئيل، \"صوفيا محتالة إذا وفقط إذا كان دانيال محتالاً\". أخبرك دانيال أن صموئيل ليس فارساً. \"أوليفر فارس أو ليام فارس\" - صوفيا. صرح أوليفر، \"دانيال فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام محتال  \n(2) شارلوت محتالة  \n(3) غريس محتالة  \n(4) صموئيل فارس  \n(5) دانيال محتال  \n(6) صوفيا محتالة  \n(7) أوليفر محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: شارلوت، إيفلين، نوح، أميليا، مايكل، جاكسون، وغريس. شارلوت عبرت عن أنه إذا كانت إيفلين محتالة، فإن أميليا محتالة. إيفلين قالت إن غريس محتالة أو أن شارلوت محتالة. \"شارلوت فارس إذا وفقط إذا كان مايكل محتالًا\" - نوح. أميليا أخبرت أنك غريس محتالة. مايكل عبر عن أن جاكسون محتال وأن نوح فارس. \"أميليا فارس إذا وفقط إذا كانت شارلوت فارسًا\"، ذكر جاكسون. \"شارلوت محتالة أو إيفلين محتالة\" - غريس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت فارس  \n(2) إيفلين فارس  \n(3) نوح فارس  \n(4) أميليا فارس  \n(5) مايكل محتال  \n(6) جاكسون فارس  \n(7) غريس محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: إميلي، شارلوت، جاكسون، أوليفر، صوفيا، صموئيل، وداوود. وفقاً لإميلي، \"جاكسون محتال إذا وفقط إذا كان صموئيل محتالاً\". أخبرتك شارلوت أن صموئيل ليس محتالاً. صرح جاكسون، \"داوود محتال وصوفيا فارس\". قال أوليفر، \"إميلي ليست فارسة\". عبرت صوفيا عن أن إميلي محتالة أو داوود محتال. \"شارلوت محتالة وصموئيل فارس\"، أعلن صموئيل. صرح داوود، \"داوود فارس وأوليفر فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي محتالة  \n(2) شارلوت محتالة  \n(3) جاكسون فارس  \n(4) أوليفر فارس  \n(5) صوفيا فارس  \n(6) صموئيل محتال  \n(7) داوود محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: آفا، ميا، نوح، إيثان، مايكل، كلوي، وأبيجيل. وفقاً لآفا، \"إيثان محتال إذا وفقط إذا كان مايكل فارساً\". \"آفا فارس أو مايكل محتال\" - ميا. نوح عبر عن أن إيثان فارس ومايكل فارس. إيثان علق، \"ميا فارس\". مايكل قال إن إيثان محتال أو أبيجيل فارس. كلوي عبرت عن أن ميا فارس وإيثان محتال. أبيجيل صرحت، \"مايكل فارس أو إيثان محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا فارس  \n(2) ميا فارس  \n(3) نوح محتال  \n(4) إيثان فارس  \n(5) مايكل محتال  \n(6) كلوي محتالة  \n(7) أبيجيل محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: أوين، إميلي، ليلي، هنري، هاربر، أورورا، وصوفيا. كما قال أوين، \"أوين فارس\". كما قالت إميلي، \"ليلي ليست محتالة\". ليلي علقت، \"إذا كانت صوفيا فارسة، فإن أوين فارس\". هنري صرح، \"إميلي فارسة أو إميلي محتالة\". هاربر لاحظ، \"هاربر فارس وأورورا محتالة\". سُمعت أورورا تقول، \"هنري فارس أو ليلي فارسة\". صوفيا أعربت عن أن ليلي فارسة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين فارس  \n(2) إميلي فارس  \n(3) ليلي فارس  \n(4) هنري فارس  \n(5) هاربر محتالة  \n(6) أورورا فارس  \n(7) صوفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: أبيجيل، رايلي، بينيلوب، لوكاس، إيفلين، ليلي، وميا. قالت أبيجيل: \"إيفلين محتالة وليلي فارس.\" قالت رايلي إنه إذا كانت ميا فارسة، فإن أبيجيل محتالة. أكدت بينيلوب: \"إيفلين فارسة ولوكاس محتال.\" في تصريح من لوكاس: \"ميا فارسة وإيفلين فارسة.\" علقت إيفلين: \"ليلي فارسة أو رايلي فارس.\" ذكرت ليلي: \"ميا محتالة أو إيفلين محتالة.\" علقت ميا: \"بينيلوب فارسة ولوكاس فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أبيجيل محتالة  \n(2) رايلي فارس  \n(3) بينيلوب فارسة  \n(4) لوكاس محتال  \n(5) إيفلين فارسة  \n(6) ليلي فارسة  \n(7) ميا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: أوليفيا، أبيجيل، أميليا، إليزابيث، هاربر، أورورا، وصوفيا. وفقاً لأوليڤيا، \"أميليا ليست محتالة\". \"صوفيا ليست فارسة\"، ادعت أبيجيل. \"إذا كانت صوفيا فارسة، فإن هاربر فارسة\"، ذكرت أميليا. \"هاربر ليست محتالة\"، أعلنت إليزابيث. \"أبيجيل محتالة\"، ذكرت هاربر. قالت أورورا، \"إليزابيث فارسة أو أميليا محتالة\". \"إذا كانت إليزابيث محتالة، فإن أوليفيا فارسة\"، ادعت صوفيا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا فارس  \n(2) أبيجيل محتالة  \n(3) أميليا فارس  \n(4) إليزابيث فارس  \n(5) هاربر فارس  \n(6) أورورا فارس  \n(7) صوفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: جيمس، إيثان، بينيلوب، هنري، أوليفر، مايكل، وويليام. جيمس أعرب عن أن ويليام فارس أو بينيلوب فارس. إيثان قال: \"بينيلوب محتالة ومايكل فارس.\" \"مايكل فارس إذا وفقط إذا كان إيثان محتالاً\"، أعلنت بينيلوب. هنري علق: \"جيمس محتال\". وفقاً لأوليفر، \"ويليام محتال\". في كلمات مايكل: \"إذا كان جيمس فارساً، فإن ويليام محتال\". كما قال ويليام: \"بينيلوب فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس محتال  \n(2) إيثان فارس  \n(3) بينيلوب محتالة  \n(4) هنري فارس  \n(5) أوليفر فارس  \n(6) مايكل فارس  \n(7) ويليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: نوح، سكارليت، أورورا، أوليفر، جيمس، هاربر، وميا. قال نوح: \"ميا فارس أو ميا محتالة\". علقت سكارليت، \"ميا فارس\". أعلنت أورورا: \"أوليفر ليس فارسًا\". في تصريح من أوليفر: \"أورورا محتالة أو أورورا فارس\". صرح جيمس، \"سكارليت فارس وأورورا فارس\". وفقًا لهاربر، \"إذا كان نوح محتالًا، فإن سكارليت محتالة\". قالت ميا إن سكارليت محتالة وميا فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح فارس  \n(2) سكارليت محتالة  \n(3) أورورا محتالة  \n(4) أوليفر فارس  \n(5) جيمس محتال  \n(6) هاربر فارس  \n(7) ميا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: إيزابيلا، ويليام، إميلي، جيمس، جاكسون، لوغان، وآريا. وفقًا لإيزابيلا، \"إذا كان لوغان فارسًا، فإن إميلي فارس\". في تصريح ويليام: \"إيزابيلا ليست فارسة\". في كلمات إميلي: \"ويليام فارس إذا وفقط إذا كان جيمس فارسًا\". كما قال جيمس، \"جاكسون ليس فارسًا\". \"إذا كان لوغان محتالًا، فإن جيمس فارس\"، ذكر جاكسون. سمع لوغان يقول، \"إميلي فارسة وإيزابيلا فارسة\". علق آريا، \"إذا كانت إيزابيلا فارسة، فإن ويليام فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا فارس  \n(2) ويليام محتال  \n(3) إميلي فارس  \n(4) جيمس محتال  \n(5) جاكسون فارس  \n(6) لوغان فارس  \n(7) آريا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: لوكاس، أميليا، إيثان، ليام، جيمس، سكارليت، ومايسون. في كلمات لوكاس: \"مايسون ليس فارسًا\". \"ليام فارس إذا وفقط إذا كان ليام محتالًا\"، أعلنت أميليا. سمع إيثان يقول: \"جيمس فارس وليام فارس\". قال ليام: \"سكارليت فارس وجيمس محتال\". قال جيمس: \"سكارليت ليست فارسًا\". قالت سكارليت: \"إذا كانت أميليا فارسًا، فإن ليام فارس\". وفقًا لمايسون، \"إيثان ليس محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس فارس  \n(2) أميليا محتالة  \n(3) إيثان محتال  \n(4) ليام فارس  \n(5) جيمس محتال  \n(6) سكارليت فارسة  \n(7) مايسون محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: إميلي، رايلي، هنري، زوي، نوح، جاكسون، وأبيجيل. قالت إميلي: \"إذا كانت أبيجيل محتالة، فإن هنري محتال\". أعربت رايلي عن أن جاكسون فارس وأن نوح فارس. أكد هنري: \"أبيجيل فارسة وإميلي محتالة\". في تصريح من زوي: \"جاكسون ليس محتالاً\". علق نوح، \"هنري فارس\". أعرب جاكسون عن أن رايلي ليست فارسة. قالت أبيجيل: \"إذا كان نوح فارساً، فإن إميلي فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي فارس  \n(2) رايلي محتال  \n(3) هنري محتال  \n(4) زوي فارس  \n(5) نوح محتال  \n(6) جاكسون فارس  \n(7) أبيجيل فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: هاربر، أفري، إليزابيث، نوح، شارلوت، إيلا، وآفا. \"شارلوت فارس\"، ادعى هاربر. في تصريح من أفري: \"إذا كانت آفا فارسًا، فإن هاربر محتار\". إليزابيث لاحظت، \"هاربر محتال\". نوح أكد: \"إليزابيث فارس أو هاربر محتال\". في تصريح من شارلوت: \"أفري فارس وآفا فارس\". كما قالت إيلا، \"شارلوت محتالة\". كما قالت آفا، \"هاربر فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر محتالة  \n(2) أفري فارس  \n(3) إليزابيث فارس  \n(4) نوح فارس  \n(5) شارلوت محتالة  \n(6) إيلا فارس  \n(7) آفا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: إيزابيلا، صوفيا، ليام، سباستيان، مايكل، إسكندر، وأيدن. أكدت إيزابيلا: \"ليام فارس\". قالت صوفيا: \"سباستيان فارس\". في تصريح ليام: \"إذا كان إسكندر فارساً، فإن إيزابيلا فارس\". علق سباستيان: \"إسكندر محتار\". علق مايكل: \"سباستيان فارس إذا وفقط إذا كانت صوفيا محتالة\". صرح إسكندر: \"ليام ليس محتالاً\". أكد أيدن: \"إذا كانت إيزابيلا محتالة، فإن سباستيان فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا فارس  \n(2) صوفيا محتالة  \n(3) ليام فارس  \n(4) سباستيان محتال  \n(5) مايكل محتال  \n(6) إسكندر فارس  \n(7) أيدن فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: هاربر، جاكسون، هنري، غريس، أوين، ليام، وآريا. هاربر أكد: \"غريس محتالة\". جاكسون قال: \"هنري محتال أو آريا محتالة\". \"ليام محتال إذا وفقط إذا كان أوين محتالًا\"، ادعى هنري. غريس قالت إن جاكسون محتال وهاربر فارس. أوين أشار: \"إذا كان هنري محتالًا، فإن جاكسون فارس\". ليام أكد: \"آريا فارس وهنري فارس\". \"هنري فارس وغريس محتالة\" - آريا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر فارس  \n(2) جاكسون فارس  \n(3) هنري محتال  \n(4) غريس محتالة  \n(5) أوين فارس  \n(6) ليام محتال  \n(7) آريا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: إسكندر، ماثيو، أوليفيا، إيفلين، يعقوب، شارلوت، وإيزابيلا. قال إسكندر: \"إيفلين فارس إذا وفقط إذا كانت إيفلين محتالة\". أكد ماثيو: \"إيزابيلا فارس\". قالت أوليفيا إن أوليفيا فارس أو يعقوب فارس. أكدت إيفلين: \"إسكندر فارس\". علق يعقوب: \"شارلوت فارس وإسكندر محتال\". في كلمات شارلوت: \"إسكندر ليس فارسًا\". في كلمات إيزابيلا: \"إيفلين ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إسكندر محتال  \n(2) ماثيو محتال  \n(3) أوليفيا فارس  \n(4) إيفلين محتالة  \n(5) يعقوب فارس  \n(6) شارلوت فارس  \n(7) إيزابيلا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: ويليام، أبيجيل، أيدن، إيفلين، صوفيا، فيكتوريا، وأوين. أعرب ويليام عن أن صوفيا فارس. قالت أبيجيل: \"ويليام ليس فارساً.\" صرح أيدن: \"إيفلين فارس أو أيدن فارس\". علقت إيفلين: \"أبيجيل فارس أو أبيجيل محتالة\". سُمعت صوفيا تقول: \"إيفلين ليست محتالة\". قالت فيكتوريا: \"ويليام فارس أو أبيجيل فارس.\" وفقاً لأوين، \"فيكتوريا فارس وأبيجيل فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام فارس  \n(2) أبيجيل محتالة  \n(3) أيدن فارس  \n(4) إيفلين فارس  \n(5) صوفيا فارس  \n(6) فيكتوريا فارس  \n(7) أوين محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: يوسف، جيمس، إيلا، سباستيان، آريا، بنيامين، وليلي. علق يوسف، \"سباستيان فارس أو جيمس فارس\". أشار جيمس، \"إيلا فارس ويوسف فارس\". صرحت إيلا، \"بنيامين ليس فارسًا\". \"بنيامين ليس فارسًا\"، أعلن سباستيان. أخبرتك آريا أن يوسف فارس إذا وفقط إذا كان بنيامين فارسًا. قال بنيامين إن ليلي محتالة إذا وفقط إذا كانت آريا فارسًا. \"بنيامين فارس أو آريا محتالة\"، ادعت ليلي. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف محتال  \n(2) جيمس محتال  \n(3) إيلا محتالة  \n(4) سباستيان محتال  \n(5) آريا محتالة  \n(6) بنيامين فارس  \n(7) ليلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: زوي، إيلا، جاك، دانيال، جاكسون، إيفلين، وويليام. زوي لاحظت، \"زوي فارس أو ويليام فارس\". \"إذا كانت إيفلين محتالة، فإن إيفلين فارس\"، ادعت إيلا. \"زوي فارس\"، ذكر جاك. دانيال صرح، \"جاكسون محتال أو جاك فارس\". جاكسون لاحظ، \"إذا كانت إيفلين فارس، فإن ويليام محتال\". وفقاً لإيفلين، \"زوي محتالة وجاكسون فارس\". في بيان من ويليام: \"زوي محتالة وإيفلين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) زوي فارس  \n(2) إيلا محتالة  \n(3) جاك فارس  \n(4) دانيال فارس  \n(5) جاكسون فارس  \n(6) إيفلين محتالة  \n(7) ويليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: صموئيل، مايكل، دانيال، ليام، مايسون، إليزابيث، وآريا. صرح صموئيل، \"مايكل ليس فارسًا\". بكلمات مايكل: \"مايسون محتار\". أعرب دانيال عن أن آريا محتالة. \"ليام فارس أو صموئيل فارس\"، ادعى ليام. \"دانيال فارس إذا وفقط إذا كان ليام محتالًا\"، ذكر مايسون. \"آريا فارس أو آريا محتالة\"، ذكرت إليزابيث. أعربت آريا أن ليام محتال إذا وفقط إذا كانت آريا فارسًا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صموئيل محتال  \n(2) مايكل فارس  \n(3) دانيال محتال  \n(4) ليام محتال  \n(5) مايسون محتال  \n(6) إليزابيث فارس  \n(7) آريا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ليام، أيدن، أبيجيل، أفري، صوفيا، هنري، وإيزابيلا. كما قال ليام: \"صوفيا فارس إذا وفقط إذا كانت أبيجيل محتالة\". كما قال أيدن: \"أيدن فارس وإيزابيلا فارس\". بكلمات أبيجيل: \"أفري محتالة وليام فارس\". \"إذا كانت أبيجيل محتالة، فإن أيدن فارس\" - أفري. وفقًا لصوفيا، \"أفري فارس أو صوفيا فارس\". هنري عبر عن أن أبيجيل فارس. إيزابيلا قالت: \"أفري محتالة وصوفيا فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام محتار  \n(2) أيدن محتال  \n(3) أبيجيل محتالة  \n(4) أفري محتالة  \n(5) صوفيا محتالة  \n(6) هنري محتال  \n(7) إيزابيلا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: أوليفيا، أميليا، صموئيل، آفا، مايكل، شارلوت، وإسكندر. كما قالت أوليفيا: \"إسكندر فارس أو إسكندر محتال\". في تصريح لأميليا: \"أوليفيا ليست محتالة\". \"مايكل محتال وآفا محتالة\"، ذكر صموئيل. أكدت آفا: \"أوليفيا فارس أو أميليا محتالة\". في كلمات مايكل: \"إسكندر محتال وأوليفيا محتالة\". أخبرتك شارلوت أن صموئيل ليس محتالًا. \"صموئيل محتال وأوليفيا محتالة\" - إسكندر. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا فارس  \n(2) أميليا فارس  \n(3) صموئيل محتال  \n(4) آفا فارس  \n(5) مايكل محتال  \n(6) شارلوت محتالة  \n(7) إسكندر محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ويليام، أميليا، صوفيا، أوين، جاك، يوسف، وداوود. في كلمات ويليام: \"إذا كان ويليام فارسًا، فإن داوود محتال\". \"يوسف محتال أو ويليام محتال\"، ذكرت أميليا. صوفيا علقت: \"ويليام ليس محتالًا\". أوين أكد: \"أميليا فارس إذا وفقط إذا كان يوسف فارسًا\". سمع جاك يقول: \"إذا كان ويليام محتالًا، فإن أميليا فارس\". يوسف أشار: \"أميليا محتالة وأوين فارس\". \"ويليام فارس ويوسف فارس\"، ادعى داوود. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام فارس  \n(2) أميليا فارس  \n(3) صوفيا فارس  \n(4) أوين محتال  \n(5) جاك فارس  \n(6) يوسف محتال  \n(7) داوود محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: هنري، صوفيا، ميا، جاكسون، أوليفر، صموئيل، وأورورا. \"أوليفر فارس وصوفيا محتالة\"، ادعى هنري. \"صوفيا فارس\" - صوفيا. \"جاكسون فارس إذا وفقط إذا كان هنري فارساً\" - ميا. صرح جاكسون، \"صوفيا فارس\". علق أوليفر، \"جاكسون فارس أو ميا فارس\". أخبرك صموئيل أن ميا فارس إذا وفقط إذا كان جاكسون محتاله. قالت أورورا إن صموئيل محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هنري محتال  \n(2) صوفيا فارس  \n(3) ميا محتالة  \n(4) جاكسون فارس  \n(5) أوليفر فارس  \n(6) صموئيل فارس  \n(7) أورورا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ويليام، آريا، سباستيان، إيزابيلا، إيفلين، بينيلوب، وغريس. \"إيزابيلا محتالة إذا وفقط إذا كانت غريس محتالة\"، ادعى ويليام. في بيان من آريا: \"غريس محتالة أو غريس فارس\". لاحظ سباستيان، \"إيفلين محتالة\". \"إيزابيلا فارس أو غريس فارس\" - إيزابيلا. \"بينيلوب محتالة وبينيلوب فارس\"، ذكرت إيفلين. علق بينيلوب، \"آريا فارس\". لاحظت غريس، \"إذا كانت بينيلوب فارس، فإن آريا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام فارس  \n(2) آريا فارس  \n(3) سباستيان فارس  \n(4) إيزابيلا فارس  \n(5) إيفلين محتالة  \n(6) بينيلوب فارس  \n(7) غريس فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: ليلي، يوسف، دانيال، صوفيا، أفري، زوي، ونوح. قالت ليلي: \"إذا كانت زوي محتالة، فإن أفري محتالة\". أشار يوسف: \"أفري ليست فارسة\". في كلمات دانيال: \"نوح محتال\". كما قالت صوفيا: \"إذا كانت أفري فارسة، فإن ليلي فارسة\". كما قالت أفري: \"زوي فارسة\". أخبرتك زوي أن أفري ليست محتالة. ذكر نوح: \"يوسف محتال أو أفري محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي فارس  \n(2) يوسف محتال  \n(3) دانيال محتال  \n(4) صوفيا فارس  \n(5) أفري فارس  \n(6) صوفيا فارس  \n(7) نوح فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: هاربر، يوسف، ليلي، أوين، كلوي، جيمس، وإيفلين. قالت هاربر: \"إيفلين محتالة أو يوسف محتال\". صرح يوسف: \"جيمس محتال أو إيفلين فارسة\". \"هاربر محتالة أو يوسف فارس\" - ليلي. أعرب أوين عن أنه إذا كان جيمس فارسًا، فإن جيمس محتال. \"جيمس فارس أو يوسف محتال\"، ادعت كلوي. علق جيمس: \"هاربر محتالة إذا وفقط إذا كان يوسف فارسًا\". في بيان من إيفلين: \"أوين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر فارس  \n(2) يوسف محتال  \n(3) ليلي محتالة  \n(4) أوين محتال  \n(5) كلوي فارس  \n(6) جيمس فارس  \n(7) إيفلين محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: هنري، كلوي، يعقوب، إيلا، ليام، مايسون، ومايكل. وفقًا لهنري، \"إذا كان مايسون محتالًا، فإن يعقوب محتال\". أكدت كلوي: \"إذا كان مايكل محتالًا، فإن يعقوب محتال\". \"ليام محتال وهنري فارس\" - يعقوب. قالت إيلا إن كلوي محتالة إذا وفقط إذا كان مايسون محتالًا. صرح ليام، \"مايكل محتال\". أكد مايسون: \"مايكل فارس\". أخبرك مايكل أن هنري فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هنري فارس  \n(2) كلوي فارس  \n(3) يعقوب فارس  \n(4) إيلا فارس  \n(5) ليام محتال  \n(6) مايسون فارس  \n(7) مايكل فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: هاربر، أوليفيا، بينيلوب، أميليا، كلوي، بنيامين، وإيلا. \"إذا كان بنيامين محتالًا، فإن بنيامين فارس\"، ذكرت هاربر. أخبرتك أوليفيا أن هاربر محتال أو بينيلوب فارس. صرحت بينيلوب، \"هاربر فارس أو بنيامين فارس\". أكدت أميليا: \"هاربر محتال إذا وفقط إذا كانت أوليفيا محتالة\". في كلمات كلوي: \"إيلا محتالة إذا وفقط إذا كانت بينيلوب محتالة\". في كلمات بنيامين: \"إيلا ليست فارسًا\". في بيان من إيلا: \"كلوي فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر فارس  \n(2) أوليفيا فارس  \n(3) بينيلوب فارس  \n(4) أميليا فارس  \n(5) كلوي محتالة  \n(6) بنيامين فارس  \n(7) إيلا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: أيدن، إسكندر، يعقوب، أورورا، مايكل، إيزابيلا، وهنري. علق أيدن، \"أيدن فارس وأورورا فارس\". قال إسكندر: \"أيدن فارس إذا وفقط إذا كانت أورورا محتالة\". قال يعقوب، \"أيدن فارس\". في بيان من أورورا: \"مايكل فارس إذا وفقط إذا كان يعقوب محتالًا\". أكد مايكل: \"إيزابيلا ليست فارسًا\". علق إيزابيلا، \"أورورا فارس أو إسكندر فارس\". أخبرك هنري أنه إذا كانت أورورا محتالة، فإن أيدن محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن فارس  \n(2) إسكندر محتال  \n(3) يعقوب فارس  \n(4) أورورا فارس  \n(5) مايكل محتال  \n(6) إيزابيلا فارس  \n(7) هنري فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: إيفلين، بنيامين، ليلي، إميلي، أيدن، إسكندر، وماثيو. \"أيدن ليس محتالًا\" - إيفلين. وفقًا لبنيامين، \"إسكندر محتال\". قالت ليلي إن ماثيو فارس وإيفلين فارس. كما قالت إميلي، \"ليلي محتالة وإيفلين محتالة\". سمع أيدن يقول، \"ماثيو محتال أو إسكندر محتال\". كما قال إسكندر، \"أيدن ليس محتالًا\". عبر ماثيو عن أن بنيامين فارس أو ماثيو فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين فارس  \n(2) بنيامين محتال  \n(3) ليلي محتالة  \n(4) إميلي محتالة  \n(5) أيدن فارس  \n(6) إسكندر فارس  \n(7) ماثيو محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: إيزابيلا، ماثيو، أيدن، كلوي، جاكسون، شارلوت، وإيثان. قالت إيزابيلا: \"شارلوت ليست فارسًا\". وفي كلمات ماثيو: \"أيدن محتال وكلوي فارس\". وفي تصريح أيدن: \"إذا كانت إيزابيلا محتالة، فإن شارلوت فارس\". كما قالت كلوي: \"ماثيو محتال وإيثان فارس\". أخبرك جاكسون أن ماثيو فارس وشارلوت فارس. \"جاكسون ليس فارسًا\"، أعلنت شارلوت. وأكد إيثان: \"إيزابيلا محتالة إذا وفقط إذا كان ماثيو محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا محتالة  \n(2) ماثيو محتال  \n(3) أيدن فارس  \n(4) كلوي فارس  \n(5) جاكسون محتال  \n(6) شارلوت فارس  \n(7) إيثان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: أوليفر، ليام، ويليام، صوفيا، زوي، لوك، وليلي. قال أوليفر: \"إذا كان لوك فارساً، فإن ليلي فارساً\". أكد ليام: \"ويليام فارس وليلي محتالة\". علق ويليام: \"ليلي محتالة وصوفيا محتالة\". في تصريح لصوفيا: \"زوي فارس إذا وفقط إذا كانت زوي محتالة\". قالت زوي إن ليلي محتالة أو صوفيا فارس. \"ويليام ليس محتالاً\"، ادعى لوك. سُمعت ليلي تقول: \"صوفيا ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفر محتال  \n(2) ليام فارس  \n(3) ويليام فارس  \n(4) صوفيا محتالة  \n(5) زوي فارس  \n(6) لوك فارس  \n(7) ليلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ميا، سكارليت، إيلا، غريس، أبيجيل، نوح، وجيمس. قالت ميا: \"أبيجيل محتالة ونوح محتال\". قالت سكارليت إن أبيجيل فارس أو ميا محتالة. علقت إيلا: \"ميا فارس أو جيمس فارس\". وفقًا لغريس، \"ميا محتالة\". سمع أبيجيل تقول: \"غريس فارس أو أبيجيل فارس\". في كلمات نوح: \"إيلا ليست محتالة\". علق جيمس: \"إذا كانت سكارليت محتالة، فإن غريس محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا محتالة  \n(2) سكارليت فارسة  \n(3) إيلا فارسة  \n(4) غريس فارسة  \n(5) أبيجيل فارسة  \n(6) نوح فارس  \n(7) جيمس فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ماثيو، أورورا، لوكاس، غريس، شارلوت، آريا، وميا. ذكر ماثيو، \"غريس ليست محتالة\". \"ميا محتالة إذا وفقط إذا كانت شارلوت محتالة\" - أورورا. سمع لوكاس يقول، \"ميا محتالة أو آريا فارس\". صرحت غريس، \"لوكاس محتال\". سمع شارلوت يقول، \"آريا محتالة وماثيو فارس\". \"ميا محتالة أو غريس محتالة\"، أعلنت آريا. \"ماثيو فارس وأورورا محتالة\"، ادعت ميا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ماثيو محتال  \n(2) أورورا فارس  \n(3) لوكاس فارس  \n(4) غريس محتالة  \n(5) شارلوت محتالة  \n(6) آريا فارس  \n(7) ميا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: مايكل، ليلي، لوكاس، جاكسون، آفا، ماثيو، وهاربر. أكد مايكل: \"ماثيو محتال أو آفا فارس\". قالت ليلي: \"ليلي فارس أو لوكاس فارس\". كما قال لوكاس: \"إذا كان هاربر محتالًا، فإن هاربر فارس\". سمع جاكسون يقول: \"مايكل فارس إذا وفقط إذا كان مايكل محتالًا\". في كلمات آفا: \"ماثيو فارس إذا وفقط إذا كان هاربر فارس\". علق ماثيو: \"جاكسون فارس\". قالت هاربر: \"إذا كانت ليلي محتالة، فإن ماثيو محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل فارس  \n(2) ليلي فارس  \n(3) لوكاس فارس  \n(4) جاكسون محتال  \n(5) آفا محتالة  \n(6) ماثيو محتال  \n(7) هاربر فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: بينيلوب، أبيجيل، جاكسون، ليلي، مايكل، أورورا، وصوفيا. قالت بينيلوب: \"جاكسون فارس أو صوفيا محتالة\". وفي كلمات أبيجيل: \"جاكسون فارس\". كما قال جاكسون: \"ليلي فارس أو بينيلوب محتالة\". كما قالت ليلي: \"بينيلوب محتالة ومايكل فارس\". أعلن مايكل: \"إذا كانت أبيجيل فارسًا، فإن أورورا محتالة\". علقت أورورا: \"ليلي محتالة أو صوفيا محتالة\". وأشارت صوفيا: \"جاكسون محتال إذا وفقط إذا كان مايكل محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب فارس  \n(2) أبيجيل محتالة  \n(3) جاكسون محتال  \n(4) ليلي محتالة  \n(5) مايكل فارس  \n(6) أورورا فارس  \n(7) صوفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: سكارليت، أفري، رايلي، أوليفر، إيثان، ويليام، وإيما. قالت سكارليت: \"أفري فارس وويليام فارس.\" ادعى أفري: \"إيثان محتال إذا وفقط إذا كانت سكارليت فارساً.\" في كلمات رايلي: \"إذا كانت إيما محتالة، فإن أفري محتال.\" قال أوليفر: \"رايلي ليس فارساً.\" أعلن إيثان: \"أوليفر فارس.\" أعلن ويليام: \"رايلي ليس فارساً.\" سُمعت إيما تقول: \"ويليام ليس فارساً.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سكارليت محتالة  \n(2) أفري محتالة  \n(3) رايلي فارس  \n(4) أوليفر محتال  \n(5) إيثان محتال  \n(6) ويليام محتال  \n(7) إيما فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: رايلي، إسكندر، نوح، سكارليت، جاكسون، أورورا، وأفري. \"أفري ليست فارسًا\"، أعلن رايلي. \"إسكندر فارس إذا وفقط إذا كانت أفري فارسًا\" - إسكندر. علق نوح، \"رايلي محتال وإسكندر محتال\". \"أفري فارس\"، ادعت سكارليت. \"رايلي محتال أو نوح محتال\"، ذكر جاكسون. قالت أورورا إن رايلي فارس وأورورا فارس. علق أفري، \"إسكندر فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) رايلي محتالة  \n(2) إسكندر فارس  \n(3) نوح محتال  \n(4) سكارليت فارس  \n(5) جاكسون فارس  \n(6) أورورا محتالة  \n(7) أفري فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: نوح، ليلي، أوليفر، صموئيل، غريس، ميا، وسكارليت. في كلمات نوح: \"سكارليت ليست فارسًا\". قالت ليلي: \"نوح فارس أو أوليفر فارس\". أشار أوليفر: \"ميا محتالة أو ميا فارس\". عبر صموئيل عن أن ليلي ليست محتالة. سُمعت غريس تقول: \"ليلي فارس أو صموئيل فارس\". سُمعت ميا تقول: \"سكارليت ليست محتالة\". أكدت سكارليت: \"إذا كانت ليلي محتالة، فإن غريس فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح محتال  \n(2) ليلي فارس  \n(3) أوليفر فارس  \n(4) صموئيل فارس  \n(5) غريس فارس  \n(6) ميا فارس  \n(7) سكارليت فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: أوين، إيلا، داوود، مايسون، هاربر، أورورا، وكلوي. قال أوين: \"داوود محتال أو أوين فارس\". لاحظت إيلا: \"أوين محتال وكلوي محتالة\". كما قال داوود: \"كلوي ليست فارسة\". سمع مايسون يقول: \"أورورا فارسة إذا وفقط إذا كانت إيلا محتالة\". صرحت هاربر: \"إيلا ليست فارسة\". أعلنت أورورا: \"كلوي فارسة\". في بيان من كلوي: \"داوود محتال إذا وفقط إذا كانت كلوي فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين فارس  \n(2) إيلا محتالة  \n(3) داوود محتال  \n(4) مايسون فارس  \n(5) هاربر فارس  \n(6) أورورا فارس  \n(7) كلوي فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: صوفيا، إسكندر، مايسون، كلوي، إيفلين، بينيلوب، ولوك. أخبرتك صوفيا أن إسكندر هو فارس إذا وفقط إذا كانت صوفيا فارسًا. \"صوفيا فارس أو كلوي محتالة\"، ادعى إسكندر. \"كلوي محتالة إذا وفقط إذا كانت كلوي فارسًا\"، ذكر مايسون. أكدت كلوي: \"إذا كانت كلوي فارسًا، فإن مايسون محتال\". عبرت إيفلين عن أن مايسون محتال أو كلوي محتالة. أكدت بينيلوب: \"صوفيا محتالة أو إسكندر محتال\". علق لوك، \"إيفلين ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) إسكندر فارس  \n(3) مايسون محتار  \n(4) كلوي فارس  \n(5) إيفلين فارس  \n(6) بينيلوب محتالة  \n(7) لوك فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ماثيو، صوفيا، إيفلين، إيثان، هنري، جيمس، وأبيجيل. سمع ماثيو يقول: \"جيمس ليس محتالًا\". \"إذا كانت أبيجيل محتالة، فإن جيمس فارس\" - صوفيا. أخبرت إيفلين أنك إذا كان جيمس محتالًا، فإن ماثيو محتال أيضًا. أكد إيثان: \"إيفلين ليست محتالة\". \"ماثيو فارس إذا وفقط إذا كانت صوفيا محتالة\"، ادعى هنري. سمع جيمس يقول: \"إيفلين ليست محتالة\". في بيان من أبيجيل: \"جيمس ليس فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ماثيو فارس  \n(2) صوفيا فارس  \n(3) إيفلين فارس  \n(4) إيثان فارس  \n(5) هنري محتال  \n(6) جيمس فارس  \n(7) أبيجيل محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: صموئيل، أيدن، فيكتوريا، إسكندر، أوليفيا، جيمس، ونوح. قال صموئيل: \"إسكندر محتال إذا وفقط إذا كان إسكندر فارسًا.\" علق أيدن: \"نوح فارس وأوليفيا محتالة\". قالت فيكتوريا: \"نوح فارس وجيمس فارس.\" أعلن إسكندر: \"فيكتوريا ليست فارسًا.\" سُمعت أوليفيا تقول: \"جيمس محتال وأيدن محتال.\" \"فيكتوريا محتالة\" - جيمس. لاحظ نوح: \"فيكتوريا فارس إذا وفقط إذا كان صموئيل محتالًا.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صموئيل محتال  \n(2) أيدن محتال  \n(3) فيكتوريا محتالة  \n(4) إسكندر فارس  \n(5) أوليفيا محتالة  \n(6) جيمس فارس  \n(7) نوح محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: صوفيا، فيكتوريا، زوي، إيلا، آريا، ميا، وأوليفيا. صوفيا أعربت عن أن إيلا فارس أو فيكتوريا محتالة. \"آريا محتالة\"، ادعت فيكتوريا. زوي أخبرتكم أن صوفيا فارس إذا وفقط إذا كانت فيكتوريا محتالة. في كلمات إيلا: \"أوليفيا فارس وأوليفيا محتالة\". \"إيلا محتالة\"، أعلنت آريا. \"فيكتوريا فارس وأوليفيا محتالة\" - ميا. \"إذا كانت صوفيا فارس، فإن آريا فارس\"، ذكرت أوليفيا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) فيكتوريا محتالة  \n(3) زوي فارس  \n(4) إيلا محتالة  \n(5) آريا فارس  \n(6) ميا محتالة  \n(7) أوليفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: آفا، لوك، سكارليت، لوغان، أميليا، أورورا، وإيثان. سُمعت آفا تقول: \"لوغان محتار وأميليا محتالة\". صرح لوك: \"أورورا ليست فارسة\". ادعت سكارليت: \"لوك فارس\". أشار لوغان: \"لوك فارس\". أخبرت أميليا أنك إذا كان لوك فارسًا فإن لوغان فارس. ذكرت أورورا: \"لوغان محتال وأميليا محتالة\". أعلن إيثان: \"أميليا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا محتالة  \n(2) لوك فارس  \n(3) سكارليت فارسة  \n(4) لوغان فارس  \n(5) أميليا فارسة  \n(6) أورورا محتالة  \n(7) إيثان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: إيفلين، إميلي، ليلي، يوسف، أوين، إيما، وغريس. عبرت إيفلين عن أن يوسف محتال أو ليلي فارس. \"يوسف فارس\" - إميلي. \"إذا كان أوين فارساً، فإن يوسف محتال\" - ليلي. \"ليلي ليست فارساً\"، ادعى يوسف. عبر أوين عن أن إميلي محتالة. قالت إيما إن ليلي فارس وغريس محتالة. في بيان من غريس: \"يوسف فارس وأوين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين فارس  \n(2) إميلي محتالة  \n(3) ليلي فارس  \n(4) يوسف محتال  \n(5) أوين فارس  \n(6) إيما فارس  \n(7) غريس محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: أفري، صموئيل، إيما، دانيال، لوغان، داوود، وأوليفر. قالت أفري: \"صموئيل فارس وأفري فارس.\" قال صموئيل: \"إيما محتالة وأفري فارس.\" أعلنت إيما: \"داوود محتال وأوليفر محتال.\" في تصريح لدانيال: \"دانيال فارس وأفري فارس.\" أخبرك لوغان أن أفري ليست محتالة. \"إذا كان أوليفر محتالًا، فإن إيما فارس\" - داوود. في تصريح لأوليور: \"لوغان محتال إذا وفقط إذا كانت إيما محتالة.\" إذن، من هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري محتالة  \n(2) صموئيل محتال  \n(3) إيما محتالة  \n(4) دانيال محتال  \n(5) لوغان محتال  \n(6) داوود فارس  \n(7) أوليفر فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: نوح، مايكل، آفا، هاربر، جيمس، أوين، وصوفيا. وفقًا لنوح، \"صوفيا فارس\". وفقًا لمايكل، \"هاربر محتالة إذا وفقط إذا كان نوح محتالًا\". بكلمات آفا: \"آفا فارس وجيمس فارس\". \"مايكل فارس أو جيمس فارس\"، ذكرت هاربر. كما قال جيمس، \"أوين فارس أو صوفيا محتالة\". \"مايكل محتال وصوفيا فارس\" - أوين. سُمع أن صوفيا قالت، \"هاربر ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح فارس  \n(2) مايكل فارس  \n(3) آفا محتالة  \n(4) هاربر فارس  \n(5) جيمس محتال  \n(6) أوين محتال  \n(7) صوفيا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: يعقوب، جيمس، أوليفيا، سكارليت، إيما، شارلوت، وفيكتوريا. في تصريح ليعقوب: \"سكارليت محتالة أو فيكتوريا محتالة\". \"فيكتوريا محتالة أو أوليفيا فارسة\" - جيمس. أوليفيا علقت، \"يعقوب ليس فارسًا\". سكارليت عبرت عن أن شارلوت ليست محتالة. إيما علقت، \"إذا كانت فيكتوريا فارسة، فإن أوليفيا محتالة\". شارلوت علقت، \"إيما محتالة\". في كلمات فيكتوريا: \"جيمس فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب محتال  \n(2) جيمس فارس  \n(3) أوليفيا فارس  \n(4) سكارليت فارس  \n(5) إيما محتالة  \n(6) شارلوت فارس  \n(7) فيكتوريا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: إيما، هاربر، إيزابيلا، إيثان، آفا، داوود، وصموئيل. وفقاً لإيما، \"صموئيل ليس محتالاً\". \"داوود فارس\" - أعلنت هاربر. قالت إيزابيلا، \"إيزابيلا فارس وآفا فارس\". قال إيثان، \"صموئيل فارس وداوود محتال\". \"هاربر ليست محتالة\" - آفا. أشار داوود، \"إيما ليست محتالة\". علق صموئيل، \"إيثان فارس وإيما فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما محتالة  \n(2) هاربر محتالة  \n(3) إيزابيلا محتالة  \n(4) إيثان محتال  \n(5) آفا محتالة  \n(6) داوود محتال  \n(7) صموئيل محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: بينيلوب، أوين، غريس، أميليا، أيدن، لوكاس، وميا. قالت بينيلوب: \"إذا كانت ميا فارسة، فإن أيدن محتال\". قال أوين إن غريس فارسة أو بينيلوب فارسة. في تصريح لغريس: \"بينيلوب فارسة أو أميليا محتالة\". لاحظت أميليا: \"أوين ليس محتالًا\". في تصريح لأيدن: \"بينيلوب فارسة إذا وفقط إذا كان أوين محتالًا\". وفقًا للوكاس، \"أيدن فارس إذا وفقط إذا كان أوين محتالًا\". علقت ميا: \"أوين ليس محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب فارس  \n(2) أوين فارس  \n(3) غريس فارس  \n(4) أميليا فارس  \n(5) أيدن محتال  \n(6) لوكاس فارس  \n(7) ميا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: إسكندر، صوفيا، صموئيل، داوود، إيزابيلا، ويليام، وأبيجيل. في تصريح لإسكندر: \"أبيجيل محتالة\". قالت صوفيا إن إيزابيلا ليست محتالة. وفقاً لصموئيل، \"ويليام ليس محتالاً\". علق داوود، \"إيزابيلا ليست فارسة\". قالت إيزابيلا إن صوفيا فارسة أو ويليام فارس. أشار ويليام، \"إسكندر فارس أو أبيجيل محتالة\". قالت أبيجيل إن ويليام محتال إذا وفقط إذا كانت إيزابيلا محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إسكندر محتال  \n(2) صوفيا محتالة  \n(3) صموئيل محتال  \n(4) داوود فارس  \n(5) إيزابيلا محتالة  \n(6) ويليام محتال  \n(7) أبيجيل فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: رايلي، هنري، إليزابيث، إيزابيلا، جيمس، بنيامين، وصوفيا. صرح رايلي، \"رايلي فارس إذا وفقط إذا كان جيمس محتالًا\". أعلن هنري، \"هنري فارس إذا وفقط إذا كان بنيامين محتالًا\". أخبرتك إليزابيث أنه إذا كان بنيامين محتالًا، فإن رايلي محتال. قالت إيزابيلا، \"بنيامين محتال\". أشار جيمس، \"رايلي فارس وصوفيا فارس\". في كلمات بنيامين: \"إليزابيث فارس\". في تصريح لصوفيا: \"هنري محتال إذا وفقط إذا كانت إليزابيث فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) رايلي فارس  \n(2) هنري محتال  \n(3) إليزابيث محتالة  \n(4) إيزابيلا فارس  \n(5) جيمس محتال  \n(6) بنيامين محتال  \n(7) صوفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: زوي، آفا، يعقوب، ويليام، هنري، إيزابيلا، وأيدن. زوي علقت، \"أيدن فارس إذا وفقط إذا كان يعقوب فارسًا\". آفا أكدت: \"أيدن فارس أو زوي محتالة\". وفقًا ليعقوب، \"آفا فارس إذا وفقط إذا كان أيدن فارسًا\". ويليام أخبرك أن ويليام فارس وهنري فارس. \"يعقوب محتال أو إيزابيلا فارس\"، ادعى هنري. إيزابيلا أكدت: \"آفا فارس إذا وفقط إذا كان أيدن محتالًا\". \"إيزابيلا محتالة أو يعقوب محتال\"، أعلن أيدن. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) زوي فارس  \n(2) آفا فارس  \n(3) يعقوب فارس  \n(4) ويليام محتال  \n(5) هنري محتال  \n(6) إيزابيلا محتالة  \n(7) أيدن فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: بينيلوب، أوليفر، يعقوب، مايسون، جيمس، إيما، ولوكاس. أخبرتك بينيلوب أن مايسون محتال. سُمع أوليفر يقول: \"لوكاس محتال أو أوليفر فارس\". وفقًا ليعقوب، \"إذا كانت بينيلوب فارسًا، فإن إيما محتالة\". عبر مايسون عن أن أوليفر ليس محتالًا. ذكر جيمس: \"مايسون محتال إذا وفقط إذا كان أوليفر فارسًا\". في بيان من إيما: \"جيمس فارس إذا وفقط إذا كان مايسون محتالًا\". أكد لوكاس: \"إيما فارس أو جيمس فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب محتالة  \n(2) أوليفر فارس  \n(3) يعقوب فارس  \n(4) مايسون فارس  \n(5) جيمس محتال  \n(6) إيما فارس  \n(7) لوكاس فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: أفري، آفا، ميا، بينيلوب، رايلي، صموئيل، وأوليفيا. وفقاً لأفري، \"آفا فارس وبينيلوب فارس\". آفا قالت إن ميا فارس وبينيلوب فارس. في تصريح لميا: \"بينيلوب محتالة وأفري فارس\". بينيلوب لاحظت، \"رايلي فارس\". \"إذا كانت ميا محتالة، فإن أفري فارس\"، ذكر رايلي. \"صموئيل فارس إذا وفقط إذا كانت أفري فارس\"، ادعت أوليفيا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري محتالة  \n(2) آفا محتالة  \n(3) ميا محتالة  \n(4) بينيلوب محتالة  \n(5) رايلي محتالة  \n(6) صموئيل فارس  \n(7) أوليفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: بينيلوب، صوفيا، ليلي، أورورا، نوح، جاكسون، ولوك. عبرت بينيلوب عن أن صوفيا محتالة. صوفيا عبرت عن أن لوك محتال. \"جاكسون محتال وأورورا فارس\"، ادعت ليلي. أكدت أورورا: \"ليلي ليست محتالة\". سمع نوح يقول: \"جاكسون ليس محتالًا\". في كلمات جاكسون: \"لوك ليس محتالًا\". علق لوك، \"أورورا محتالة إذا وفقط إذا كان نوح محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب محتالة  \n(2) صوفيا فارسة  \n(3) ليلي فارسة  \n(4) أورورا فارسة  \n(5) نوح محتال  \n(6) جاكسون محتال  \n(7) لوك محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ماثيو، إيلا، هاربر، إسكندر، بينيلوب، بنيامين، وآفا. \"هاربر فارس\"، أعلن ماثيو. سُمعت إيلا تقول، \"آفا محتالة أو ماثيو محتال\". قال هاربر، \"آفا ليست فارسًا\". قال إسكندر، \"إيلا فارس إذا وفقط إذا كانت آفا محتالة\". وفقًا لبينيلوب، \"إذا كانت آفا فارسًا، فإن إسكندر محتال\". \"آفا فارس إذا وفقط إذا كان هاربر فارسًا\"، أعلن بنيامين. قالت آفا، \"إذا كان ماثيو محتالًا، فإن هاربر محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ماثيو محتال  \n(2) إيلا فارس  \n(3) هاربر محتالة  \n(4) إسكندر محتال  \n(5) بينيلوب فارس  \n(6) بنيامين محتال  \n(7) آفا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ماثيو، بنيامين، إيثان، مايسون، فيكتوريا، يعقوب، ولوكاس. وفقًا لماثيو، \"فيكتوريا ليست محتالة\". علق بنيامين، \"إذا كان مايسون فارسًا، فإن ماثيو محتال\". سمع إيثان يقول، \"ماثيو فارس إذا وفقط إذا كان لوكاس فارسًا\". سمع مايسون يقول، \"مايسون فارس إذا وفقط إذا كانت فيكتوريا فارسة\". سمع فيكتوريا تقول، \"إذا كان يعقوب محتالًا، فإن بنيامين محتال\". \"ماثيو محتال\" - يعقوب. لاحظ لوكاس، \"بنيامين محتال إذا وفقط إذا كان يعقوب محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ماثيو فارس  \n(2) بنيامين محتال  \n(3) إيثان فارس  \n(4) مايسون فارس  \n(5) فيكتوريا فارس  \n(6) يعقوب محتال  \n(7) لوكاس فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ويليام، هاربر، مايسون، جيمس، صموئيل، أميليا، وماثيو. أعرب ويليام عن أنه إذا كان مايسون فارسًا، فإن صموئيل محتال. صرحت هاربر، \"مايسون فارس أو جيمس فارس\". أعرب مايسون أن صموئيل محتال وصموئيل فارس. أخبرك جيمس أن أميليا ليست محتالة. سمع صموئيل يقول، \"ويليام ليس محتالًا\". في بيان من أميليا: \"ماثيو محتال إذا وفقط إذا كان جيمس محتالًا\". وفقًا لماثيو، \"إذا كانت هاربر فارسًا، فإن أميليا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام فارس  \n(2) هاربر محتالة  \n(3) مايسون محتال  \n(4) جيمس محتال  \n(5) صموئيل فارس  \n(6) أميليا محتالة  \n(7) ماثيو فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: داوود، أيدن، أبيجيل، إسكندر، إيما، جاكسون، وآفا. قال داوود لك إن أيدن فارس إذا وفقط إذا كان جاكسون محتالًا. كما قال أيدن، \"آفا محتالة أو إسكندر فارس\". صرحت أبيجيل، \"إسكندر محتال أو آفا فارسة\". وفقًا لإسكندر، \"جاكسون ليس فارسًا\". أخبرتك إيما أنه إذا كان داوود فارسًا فإن أبيجيل فارسة. قال جاكسون إن داوود فارس وإيما محتالة. قالت آفا، \"إذا كانت إيما فارسة فإن إسكندر فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود فارس  \n(2) أيدن فارس  \n(3) أبيجيل فارس  \n(4) إسكندر فارس  \n(5) إيما فارس  \n(6) جاكسون محتار  \n(7) آفا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: إليزابيث، جيمس، أيدن، ميا، أوليفيا، زوي، وأورورا. قالت إليزابيث: \"إذا كانت ميا محتالة، فإن زوي محتالة\". قال جيمس: \"أيدن فارس\". أعلن أيدن: \"زوي محتالة أو إليزابيث محتالة\". سُمعت ميا تقول: \"إذا كان جيمس محتالًا، فإن ميا فارس\". علقت أوليفيا: \"إذا كان جيمس محتالًا، فإن أورورا محتالة\". أعلن زوي: \"ميا فارس أو أورورا فارس\". قالت أورورا: \"ميا ليست فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث فارس  \n(2) جيمس محتال  \n(3) أيدن محتال  \n(4) ميا فارس  \n(5) أوليفيا فارس  \n(6) زوي فارس  \n(7) أورورا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: غريس، سكارليت، أميليا، ليلي، سباستيان، دانيال، وفيكتوريا. تم سماع غريس تقول: \"دانيال فارس إذا وفقط إذا كان دانيال محتالًا\". علق سكارليت: \"سباستيان محتال وفيكتوريا محتالة\". في بيان من أميليا: \"سكارليت محتالة إذا وفقط إذا كانت فيكتوريا فارسة\". \"دانيال ليس فارسًا\"، ذكرت ليلي. \"إذا كانت أميليا محتالة، فإن أميليا فارس\"، ذكر سباستيان. وفقًا لدانيال، \"إذا كان سباستيان فارسًا، فإن ليلي محتالة\". عبرت فيكتوريا أن دانيال محتال إذا وفقط إذا كانت غريس محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) غريس محتالة  \n(2) سكارليت محتالة  \n(3) أميليا فارسة  \n(4) ليلي فارسة  \n(5) سباستيان فارس  \n(6) دانيال محتال  \n(7) فيكتوريا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: بنيامين، كلوي، إميلي، رايلي، ميا، إيزابيلا، وبينيلوب. \"إميلي فارس وإيزابيلا محتالة\"، ادعى بنيامين. وفقًا لكلوي، \"بينيلوب فارسة\". قالت إميلي، \"إميلي فارس أو بنيامين محتال\". سمع رايلي يقول، \"ميا محتالة وإميلي محتالة\". وفقًا لميا، \"إيزابيلا فارسة إذا وفقط إذا كانت إميلي محتالة\". علقت إيزابيلا، \"رايلي ليس فارسًا\". \"إميلي فارسة وإيزابيلا فارسة\"، ذكرت بينيلوب. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين محتال  \n(2) كلوي فارس  \n(3) إميلي فارس  \n(4) رايلي محتالة  \n(5) ميا محتالة  \n(6) إيزابيلا فارس  \n(7) بينيلوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: داوود، بنيامين، مايكل، إيفلين، شارلوت، أميليا، وجيمس. في كلمات داوود: \"مايكل محتال\". بنيامين صرح، \"شارلوت ليست محتالة\". في كلمات مايكل: \"شارلوت فارس إذا وفقط إذا كان داوود فارساً\". في كلمات إيفلين: \"جيمس فارس أو بنيامين محتال\". \"إذا كانت إيفلين فارسة، فإن مايكل محتال\"، أعلنت شارلوت. أميليا أخبرتكم أن جيمس ليس محتالاً. في كلمات جيمس: \"داوود فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود محتال  \n(2) بنيامين محتال  \n(3) مايكل فارس  \n(4) إيفلين فارس  \n(5) شارلوت محتالة  \n(6) أميليا محتالة  \n(7) جيمس محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: بنيامين، صوفيا، مايسون، آفا، آريا، أبيجيل، وليام. عبر بنيامين عن أن وليام محتال ووليام فارس. صرحت صوفيا، \"آفا فارس ووليام فارس\". وفقًا لمايسون، \"آفا فارس أو أبيجيل محتالة\". \"وليام فارس أو أبيجيل محتالة\"، ادعت آفا. \"مايسون فارس وأبيجيل محتالة\"، ادعت آريا. في كلمات أبيجيل: \"آفا محتالة وبنيامين فارس\". \"آفا محتالة وصوفيا محتالة\" - وليام. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين محتال  \n(2) صوفيا محتالة  \n(3) مايسون فارس  \n(4) آفا فارسة  \n(5) آريا فارسة  \n(6) أبيجيل محتالة  \n(7) ليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: إيزابيلا، لوكاس، أبيجيل، إيثان، أوليفر، زوي، وويليام. أكدت إيزابيلا: \"إذا كان أوليفر فارسًا، فإن ويليام فارس\". قال لوكاس إن إيزابيلا فارس. \"أوليفر محتار وأبيجيل فارس\" - أبيجيل. أخبرك إيثان أن زوي محتالة. أشار أوليفر، \"إيثان فارس إذا وفقط إذا كانت أبيجيل محتالة\". وفقًا لزوي، \"إذا كان لوكاس فارسًا، فإن إيزابيلا فارس\". \"زوي محتالة وإيثان فارس\"، ادعى ويليام. إذن من هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا فارس  \n(2) لوكاس فارس  \n(3) أبيجيل محتالة  \n(4) إيثان محتال  \n(5) أوليفر محتال  \n(6) زوي فارس  \n(7) ويليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: لوغان، إيما، غريس، إسكندر، إميلي، دانيال، وأوليفر. قال لوغان: \"دانيال فارس\". وأشارت إيما، \"لوغان ليس فارساً\". سُمعت غريس تقول، \"دانيال فارس أو دانيال محتال\". وفي كلمات إسكندر: \"إذا كان دانيال محتالاً، فإن إميلي فارس\". علقت إميلي، \"أوليفر فارس\". قال دانيال، \"غريس ليست محتالة\". قال أوليفر إن لوغان محتال أو غريس فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان فارس  \n(2) إيما محتالة  \n(3) غريس فارس  \n(4) إسكندر فارس  \n(5) إميلي فارس  \n(6) دانيال فارس  \n(7) أوليفر فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: إيلا، فيكتوريا، أورورا، نوح، ليلي، هنري، وإسكندر. قالت إيلا: \"إسكندر فارس أو أورورا فارس\". ذكرت فيكتوريا: \"ليلي فارس وليلي محتالة\". قالت أورورا: \"إذا كان نوح فارسًا، فإن فيكتوريا محتالة\". ادعى نوح: \"إسكندر محتال أو هنري محتال\". أعربت ليلي عن أن فيكتوريا محتالة. كما قال هنري: \"أورورا ليست فارسًا\". في بيان من إسكندر: \"إذا كانت أورورا محتالة، فإن إسكندر فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا فارس  \n(2) فيكتوريا محتالة  \n(3) أورورا فارس  \n(4) نوح فارس  \n(5) ليلي فارس  \n(6) هنري محتال  \n(7) إسكندر فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: أوليفيا، داوود، آفا، بنيامين، كلوي، أميليا، ودانيال. في كلمات أوليفيا: \"بنيامين فارس إذا وفقط إذا كان داوود محتالًا\". صرح داوود، \"أميليا محتالة أو بنيامين فارس\". وفقًا لآفا، \"كلوي فارس أو دانيال فارس\". وفقًا لبنيامين، \"داوود محتال إذا وفقط إذا كان بنيامين فارس\". أخبرتك كلوي أنه إذا كان داوود فارسًا، فإن دانيال فارس. علقت أميليا، \"أميليا فارس\". \"آفا محتالة\"، أعلن دانيال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا محتالة  \n(2) داوود محتال  \n(3) آفا فارسة  \n(4) بنيامين محتال  \n(5) كلوي فارسة  \n(6) أميليا فارسة  \n(7) دانيال محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ليلي، جيمس، إسكندر، أوين، سكارليت، صوفيا، وداوود. ليلي أعربت عن أن صوفيا فارس. \"سكارليت محتالة\"، ادعى جيمس. \"جيمس فارس إذا وفقط إذا كانت ليلي فارسًا\"، ذكر إسكندر. \"أوين فارس أو سكارليت فارس\" - أوين. في تصريح من سكارليت: \"إذا كان جيمس محتالا، فإن داوود فارس\". في كلمات صوفيا: \"داوود فارس أو سكارليت فارس\". في تصريح من داوود: \"صوفيا محتالة أو داوود فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي فارس  \n(2) جيمس محتال  \n(3) إسكندر محتال  \n(4) أوين فارس  \n(5) سكارليت فارس  \n(6) صوفيا فارس  \n(7) داوود فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: زوي، إيفلين، صوفيا، ماثيو، جاكسون، أوين، وبنيامين. زوي لاحظت: \"زوي فارس أو صوفيا محتالة\". في بيان من إيفلين: \"زوي فارس\". صوفيا أكدت: \"جاكسون محتال أو زوي فارس\". ماثيو عبر عن أنه إذا كان بنيامين محتالًا، فإن زوي محتالة. في بيان من جاكسون: \"صوفيا فارس\". أوين لاحظ: \"ماثيو ليس فارسًا\". \"زوي فارس\"، ادعى بنيامين. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) زوي فارس  \n(2) إيفلين فارس  \n(3) صوفيا فارس  \n(4) ماثيو فارس  \n(5) جاكسون فارس  \n(6) أوين محتال  \n(7) بنيامين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: دانيال، إسكندر، آفا، يعقوب، بنيامين، ماثيو، وأبيجيل. كما قال دانيال: \"إذا كان ماثيو محتالًا، فإن أبيجيل فارس\". \"ماثيو محتال ودانيال فارس\" - إسكندر. علقت آفا، \"يعقوب محتال\". أشار يعقوب، \"دانيال فارس أو إسكندر فارس\". عبر بنيامين عن أن إسكندر فارس وإسكندر محتال. بكلمات ماثيو: \"بنيامين فارس وآفا محتالة\". أخبرتك أبيجيل أن بنيامين ليس فارسًا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال فارس  \n(2) إسكندر فارس  \n(3) آفا محتالة  \n(4) يعقوب فارس  \n(5) بنيامين محتال  \n(6) ماثيو محتال  \n(7) أبيجيل فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: بنيامين، بينيلوب، فيكتوريا، أيدن، مايكل، إيزابيلا، وجاكسون. \"إذا كانت فيكتوريا فارسة، فإن مايكل فارس\"، أعلن بنيامين. أخبرتك بينيلوب أن فيكتوريا فارسة أو أيدن محتار. علق فيكتوريا، \"أيدن فارس\". أكد أيدن: \"بينيلوب فارسة أو فيكتوريا محتالة\". صرح مايكل، \"بنيامين محتال أو مايكل فارس\". \"أيدن ليس محتالاً\" - إيزابيلا. أكد جاكسون: \"بنيامين محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين فارس  \n(2) بينيلوب فارس  \n(3) فيكتوريا فارس  \n(4) أيدن فارس  \n(5) مايكل فارس  \n(6) إيزابيلا فارس  \n(7) جاكسون محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: إيزابيلا، صوفيا، ماثيو، إليزابيث، لوكاس، بنيامين، وأوين. علقت إيزابيلا، \"أوين محتال وصوفيا محتالة\". قالت صوفيا إن إيزابيلا فارس إذا وفقط إذا كان لوكاس فارسًا. في كلمات ماثيو: \"ماثيو فارس إذا وفقط إذا كان لوكاس محتالًا\". \"ماثيو محتال وصوفيا محتالة\" - إليزابيث. وفقًا للوكاس، \"ماثيو فارس إذا وفقط إذا كانت إيزابيلا فارسًا\". أشار بنيامين، \"صوفيا ليست محتالة\". وفقًا لأوين، \"إذا كانت إيزابيلا فارسًا، فإن صوفيا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا محتالة  \n(2) صوفيا فارسة  \n(3) ماثيو فارس  \n(4) إليزابيث محتالة  \n(5) لوكاس محتال  \n(6) بنيامين فارس  \n(7) أوين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: بنيامين، إيلا، آفا، أبيجيل، ماثيو، شارلوت، وجاك. \"جاك محتال إذا وفقط إذا كان ماثيو فارسًا\" - بنيامين. وفقًا لإيلا، \"جاك محتال أو آفا محتالة\". سُمِعَت آفا تقول، \"ماثيو ليس فارسًا\". كما قالت أبيجيل، \"ماثيو محتال إذا وفقط إذا كانت آفا فارسة\". \"جاك فارس وبنيامين محتال\" - ماثيو. \"إيلا فارسة أو ماثيو فارس\" - شارلوت. \"إيلا ليست محتالة\"، ادعى جاك. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين محتال  \n(2) إيلا فارس  \n(3) آفا محتالة  \n(4) أبيجيل فارس  \n(5) ماثيو فارس  \n(6) شارلوت فارس  \n(7) جاك فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: يعقوب، أميليا، داوود، إيفلين، ميا، سباستيان، وغريس. قال يعقوب إن إيفلين ليست فارساً. قالت أميليا: \"إذا كانت غريس محتالة، فإن إيفلين فارس.\" علق داوود: \"يعقوب فارس إذا وفقط إذا كان داوود فارساً\". قالت إيفلين إن يعقوب محتال أو داوود محتال. لاحظت ميا: \"إيفلين محتالة إذا وفقط إذا كانت غريس فارساً\". لاحظ سباستيان: \"ميا فارس.\" علق غريس: \"يعقوب محتال وغريس فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب فارس  \n(2) أميليا محتالة  \n(3) داوود فارس  \n(4) إيفلين محتالة  \n(5) ميا محتالة  \n(6) سباستيان محتال  \n(7) غريس محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: صوفيا، أبيجيل، آفا، إيثان، صموئيل، مايكل، ورايلي. قالت صوفيا إن آفا محتالة إذا وفقط إذا كانت آفا فارسة. لاحظت أبيجيل، \"إذا كانت صوفيا فارسة، فإن رايلي محتالة\". أكدت آفا: \"أبيجيل ليست محتالة\". عبر إيثان عن أنه إذا كان صموئيل فارسًا، فإن مايكل محتال. ادعى صموئيل: \"رايلي فارس وآفا محتالة\". قال مايكل: \"رايلي فارس وآفا فارسة\". أخبرتك رايلي أن إيثان محتال أو صوفيا فارسة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا محتالة  \n(2) أبيجيل فارسة  \n(3) آفا فارسة  \n(4) إيثان فارس  \n(5) صموئيل محتال  \n(6) مايكل محتال  \n(7) رايلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: جيمس، جاكسون، إميلي، ليام، يعقوب، أوليفر، وجاك. علق جيمس، \"جاك محتال إذا وفقط إذا كان جيمس فارساً\". \"يعقوب ليس فارساً\"، ذكر جاكسون. في تصريح من إميلي: \"ليام محتال\". في تصريح من ليام: \"جيمس فارس أو جاكسون فارس\". صرح يعقوب، \"جيمس ليس محتالاً\". وفقاً لأوليفر، \"ليام ليس محتالاً\". علق جاك، \"يعقوب ليس فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس فارس  \n(2) جاكسون محتال  \n(3) إميلي محتالة  \n(4) ليام فارس  \n(5) يعقوب فارس  \n(6) أوليفر فارس  \n(7) جاك محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ويليام، إيلا، هنري، مايسون، جيمس، إيما، وهاربر. أكد ويليام: \"إذا كان ويليام فارسًا، فإن مايسون محتال\". صرحت إيلا، \"مايسون محتال\". علق هنري، \"هنري فارس إذا وفقط إذا كان جيمس فارسًا\". وفقًا لمايسون، \"هنري محتال\". \"هنري محتال أو هنري فارس\"، ادعى جيمس. \"هنري ليس محتالًا\" - إيما. عبرت هاربر عن أن ويليام فارس أو إيلا محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام فارس  \n(2) إيلا فارس  \n(3) هنري فارس  \n(4) مايسون محتال  \n(5) جيمس فارس  \n(6) إيما فارس  \n(7) هاربر فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: أوين، آريا، فيكتوريا، بينيلوب، كلوي، يعقوب، وأوليفيا. قال أوين: \"أوليفيا فارس إذا وفقط إذا كانت آريا فارساً.\" أكدت آريا: \"بينيلوب فارس أو أوليفيا محتالة\". كما قالت فيكتوريا: \"بينيلوب فارس إذا وفقط إذا كان يعقوب محتالاً\". أكدت بينيلوب: \"يعقوب محتال ويعقوب فارس\". صرحت كلوي: \"أوليفيا ليست محتالة\". قال يعقوب: \"فيكتوريا محتالة وبينيلوب فارس\". ذكرت أوليفيا: \"إذا كانت فيكتوريا فارساً، فإن فيكتوريا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين محتال  \n(2) آريا محتالة  \n(3) فيكتوريا محتالة  \n(4) بينيلوب محتالة  \n(5) كلوي فارس  \n(6) يعقوب محتال  \n(7) أوليفيا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: لوغان، إيما، أورورا، ليام، جاكسون، آريا، وأيدن. قال لوغان: \"إذا كانت إيما فارسًا، فإن أورورا محتالة\". علقت إيما: \"ليام ليس محتالًا\". قالت أورورا: \"جاكسون ليس فارسًا\". صرح ليام: \"آريا فارسًا\". ذكر جاكسون: \"لوغان فارس\". وفقًا لآريا، \"أيدن محتال وجاكسون فارس\". في كلمات أيدن: \"إذا كان جاكسون فارسًا، فإن لوغان محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان فارس  \n(2) إيما فارس  \n(3) أورورا محتالة  \n(4) ليام فارس  \n(5) جاكسون فارس  \n(6) آريا فارس  \n(7) أيدن محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: أوليفيا، أيدن، أورورا، مايكل، ليلي، أميليا، ونوح. قالت أوليفيا: \"أميليا فارس وليلي محتالة\". أشار أيدن: \"ليلي محتالة\". قالت أورورا: \"أميليا ليست فارسًا\". علق مايكل: \"نوح فارس وأورورا فارس\". علق ليلي: \"أيدن فارس إذا وفقط إذا كانت أميليا محتالة\". عبرت أميليا عن أنه إذا كان مايكل محتالًا، فإن ليلي محتالة. كما قال نوح: \"ليلي فارس وأميليا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا فارس  \n(2) أيدن فارس  \n(3) أورورا محتالة  \n(4) مايكل محتال  \n(5) ليلي محتالة  \n(6) أميليا فارس  \n(7) نوح محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: مايسون، مايكل، بنيامين، جاكسون، إيزابيلا، داوود، وأوليفيا. قال مايسون: \"بنيامين ليس محتالاً\". في تصريح لمايكل: \"مايكل فارس وداوود فارس\". وفقاً لبنيامين، \"إيزابيلا فارس\". في تصريح لجاكسون: \"مايكل فارس أو أوليفيا محتالة\". في كلمات إيزابيلا: \"مايسون محتالة وداوود فارس\". علق داوود، \"مايسون فارس إذا وفقط إذا كانت إيزابيلا محتالة\". علق أوليفيا، \"بنيامين محتال ومايكل محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايسون محتال  \n(2) مايكل محتال  \n(3) بنيامين محتال  \n(4) جاكسون محتال  \n(5) إيزابيلا محتالة  \n(6) داوود محتال  \n(7) أوليفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: لوك، مايكل، غريس، إيلا، أفري، صوفيا، وآفا. سمع لوك يقول: \"إذا كانت صوفيا محتالة، فإن إيلا فارس\". في تصريح لمايكل: \"لوك فارس أو صوفيا فارس\". سمع غريس يقول: \"مايكل فارس وإيلا فارس\". سمع إيلا يقول: \"أفري ليست فارسة\". في تصريح لأفري: \"آفا فارسة\". صوفيا قالت إن أفري محتالة. في كلمات آفا: \"أفري فارسة إذا وفقط إذا كانت صوفيا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) مايكل فارس  \n(3) غريس فارس  \n(4) إيلا فارس  \n(5) أفري محتالة  \n(6) صوفيا فارس  \n(7) آفا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: إسكندر، ويليام، ليام، هنري، أوليفيا، رايلي، وصوفيا. قال إسكندر: \"هنري محتال أو ليام فارس\". صرح ويليام: \"رايلي فارس\". قال ليام إن أوليفيا محتالة وصوفيا فارس. أعلن هنري: \"إذا كانت أوليفيا محتالة، فإن أوليفيا فارس\". أعلنت أوليفيا: \"صوفيا فارس\". ادعت رايلي: \"إذا كان ويليام فارس، فإن أوليفيا فارس\". وفي كلمات صوفيا: \"إذا كان إسكندر فارس، فإن أوليفيا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إسكندر محتال  \n(2) ويليام فارس  \n(3) ليام محتال  \n(4) هنري فارس  \n(5) أوليفيا فارس  \n(6) رايلي فارس  \n(7) صوفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: آفا، آريا، صوفيا، إيما، أورورا، مايسون، وبنيامين. \"إيما ليست محتالة\"، ذكرت آفا. وفقاً لآريا، \"أورورا فارس إذا وفقط إذا كان بنيامين محتالاً\". \"آريا فارس\"، ادعت صوفيا. قالت إيما، \"مايسون ليس فارساً\". كما قالت أورورا، \"بنيامين فارس وبنيامين محتال\". سمع مايسون يقول، \"بنيامين فارس أو إيما محتالة\". كما قال بنيامين، \"آفا ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا محتالة  \n(2) آريا محتالة  \n(3) صوفيا محتالة  \n(4) إيما محتالة  \n(5) أورورا محتالة  \n(6) مايسون فارس  \n(7) بنيامين محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: ميا، يوسف، صموئيل، غريس، إيزابيلا، نوح، وإيفلين. \"صموئيل فارس أو إيزابيلا محتالة\"، ذكرت ميا. كما قال يوسف: \"إيزابيلا محتالة أو صموئيل فارس\". \"يوسف فارس أو صموئيل فارس\"، أعلن صموئيل. غريس أكدت: \"إيفلين فارس\". \"غريس محتالة وغريس فارس\"، ادعت إيزابيلا. \"إذا كانت ميا محتالة، فإن غريس فارس\"، ادعى نوح. وفي كلمات إيفلين: \"نوح ليس محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا فارس  \n(2) يوسف فارس  \n(3) صموئيل فارس  \n(4) غريس فارس  \n(5) إيزابيلا محتالة  \n(6) نوح فارس  \n(7) إيفلين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ليلي، إليزابيث، كلوي، مايكل، لوغان، ويليام، ويوسف. قالت ليلي: \"كلوي محتالة أو لوغان محتال\". وبكلمات إليزابيث: \"يوسف ليس فارسًا\". علقت كلوي: \"إليزابيث فارس\". أشار مايكل: \"ليلي محتالة إذا وفقط إذا كانت إليزابيث محتالة\". أعلن لوغان: \"ويليام محتال\". قال ويليام: \"إذا كانت إليزابيث محتالة، فإن مايكل محتال\". سمع يوسف يقول: \"إذا كانت ليلي محتالة، فإن مايكل محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي فارس  \n(2) إليزابيث محتالة  \n(3) كلوي محتالة  \n(4) مايكل محتال  \n(5) لوغان محتال  \n(6) ويليام فارس  \n(7) يوسف فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: فيكتوريا، إيزابيلا، نوح، إيثان، جاكسون، أميليا، وزوي. قالت فيكتوريا: \"إيثان محتال أو زوي فارس\". صرحت إيزابيلا: \"نوح فارس وفيكتوريا فارس\". في تصريح من نوح: \"إذا كانت زوي فارسًا، فإن إيثان محتال\". كما قال إيثان: \"أميليا محتالة أو زوي فارس\". أشار جاكسون: \"إيثان فارس\". في كلمات أميليا: \"نوح فارس\". أخبرتك زوي أن أميليا فارس أو أميليا محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) فيكتوريا فارس  \n(2) إيزابيلا محتالة  \n(3) نوح محتال  \n(4) إيثان فارس  \n(5) جاكسون فارس  \n(6) أميليا محتالة  \n(7) زوي فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: جيمس، أفري، نوح، يعقوب، كلوي، أميليا، وجاكسون. قال جيمس: \"جاكسون محتال وكلوي محتالة.\" وفقًا لأفري، \"جيمس محتال أو أميليا محتالة\". أعرب نوح عن أن جاكسون فارس أو جيمس فارس. أعرب يعقوب عن أن أميليا محتالة إذا وفقط إذا كانت أفري فارسة. علقت كلوي، \"كلوي فارسة إذا وفقط إذا كان يعقوب فارسًا\". أعربت أميليا أنه إذا كانت كلوي محتالة، فإن يعقوب محتال. أشار جاكسون، \"يعقوب محتال إذا وفقط إذا كان نوح محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس محتال  \n(2) أفري فارس  \n(3) نوح فارس  \n(4) يعقوب فارس  \n(5) كلوي محتالة  \n(6) أميليا محتالة  \n(7) جاكسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: إيلا، إيما، صموئيل، إيزابيلا، دانيال، أميليا، وأفري. في كلمات إيلا: \"دانيال فارس أو أفري محتال\". وفقاً لإيما، \"إذا كان دانيال محتالاً فإن أفري محتال\". صموئيل صرح، \"إذا كانت أميليا فارسة فإن صموئيل فارس\". كما قالت إيزابيلا، \"دانيال محتال أو أميليا محتالة\". دانيال عبر عن أن أفري محتالة ودانيال فارس. أميليا قالت إن دانيال فارس. سمع أفري يقول، \"دانيال محتال أو إيزابيلا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا محتالة  \n(2) إيما محتالة  \n(3) صموئيل فارس  \n(4) إيزابيلا فارس  \n(5) دانيال محتال  \n(6) أميليا محتالة  \n(7) أفري فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: إيزابيلا، أوين، مايكل، صوفيا، صموئيل، أبيجيل، وبنيامين. وفقًا لإيزابيلا، \"صوفيا محتالة إذا وفقط إذا كان بنيامين محتالًا\". أوين أكد: \"أبيجيل ليست فارسة\". مايكل صرح، \"بنيامين محتال وأبيجيل فارسة\". صوفيا قالت، \"بنيامين فارس\". صموئيل قال إن إيزابيلا فارسة إذا وفقط إذا كان بنيامين محتالًا. أبيجيل قالت، \"أوين فارس أو مايكل محتال\". \"أبيجيل فارسة أو إيزابيلا فارسة\" - بنيامين. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا فارس  \n(2) أوين محتال  \n(3) مايكل محتال  \n(4) صوفيا فارس  \n(5) صموئيل محتال  \n(6) أبيجيل فارس  \n(7) بنيامين فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: أيدن، إيزابيلا، سباستيان، أوليفيا، لوغان، ويليام، وزوي. في كلمات أيدن: \"سباستيان فارس وإيزابيلا محتالة\". إيزابيلا أخبرتك أن ويليام ليس محتالاً. سباستيان أكد: \"أوليفيا ليست محتالة\". في كلمات أوليفيا: \"أيدن محتال أو سباستيان فارس\". وفقاً للوغان، \"أيدن محتال أو ويليام محتال\". كما قال ويليام: \"إذا كان أيدن محتالاً، فإن إيزابيلا فارس\". في تصريح من زوي: \"إذا كان أيدن فارساً، فإن لوغان محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن محتال  \n(2) إيزابيلا فارسة  \n(3) سباستيان فارس  \n(4) أوليفيا فارسة  \n(5) لوغان فارس  \n(6) ويليام فارس  \n(7) زوي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: صوفيا، إيزابيلا، فيكتوريا، داوود، أبيجيل، بينيلوب، وإيفلين. في تصريح لصوفيا: \"بينيلوب محتالة وإيزابيلا محتالة\". إيزابيلا أخبرتكم أن أبيجيل محتالة. \"بينيلوب ليست فارسة\"، أعلنت فيكتوريا. داوود أكد: \"فيكتوريا فارسة\". في تصريح لأبيجيل: \"بينيلوب ليست فارسة\". في تصريح لبينيلوب: \"داوود محتال أو داوود فارس\". \"داوود ليس فارساً\"، ادعت إيفلين. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا محتالة  \n(2) إيزابيلا فارسة  \n(3) فيكتوريا محتالة  \n(4) داوود محتال  \n(5) أبيجيل محتالة  \n(6) بينيلوب فارسة  \n(7) إيفلين فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: يوسف، ليام، غريس، صوفيا، سباستيان، أورورا، وجاك. كما قال يوسف: \"غريس فارس وجاك فارس\". ليام أخبرك أن جاك ليس فارسًا. \"أورورا محتالة إذا وفقط إذا كان جاك فارسًا\"، ادعت غريس. صوفيا أكدت: \"إذا كانت غريس محتالة، فإن ليام محتال\". سباستيان قال إن غريس فارس. أورورا صرحت: \"إذا كانت صوفيا محتالة، فإن جاك محتال\". جاك أكد: \"صوفيا فارس وأورورا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف محتال  \n(2) ليام فارس  \n(3) غريس فارس  \n(4) صوفيا فارس  \n(5) سباستيان فارس  \n(6) أورورا فارس  \n(7) جاك محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: أوليفر، أوليفيا، رايلي، جيمس، شارلوت، مايسون، وإيلا. قال أوليفر: \"أوليفيا محتالة ورايلي محتالة\". وفقاً لأوليفيا، \"إذا كانت أوليفيا فارسة، فإن شارلوت فارسة\". أكد رايلي: \"مايسون ليس محتالاً\". علق جيمس، \"إذا كان مايسون فارساً، فإن أوليفيا محتالة\". أكدت شارلوت: \"أوليفيا فارسة\". وفقاً لمايسون، \"شارلوت محتالة وأوليفيا محتالة\". قالت إيلا، \"إذا كان مايسون محتالاً، فإن رايلي محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفر محتال  \n(2) أوليفيا فارس  \n(3) رايلي محتالة  \n(4) جيمس فارس  \n(5) شارلوت فارس  \n(6) مايسون محتال  \n(7) إيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: هاربر، يوسف، إيفلين، بنيامين، ماثيو، أوليفيا، وأفري. لاحظت هاربر، \"إذا كان بنيامين محتالًا، فإن بنيامين فارس\". أخبرك يوسف أن إيفلين محتالة إذا وفقط إذا كانت هاربر فارسة. أخبرت إيفلين أنك إذا كانت إيفلين فارسة إذا وفقط إذا كان ماثيو محتالًا. صرح بنيامين، \"إيفلين فارسة أو يوسف محتال\". \"أفري ليست محتالة\" - ماثيو. أخبرت أوليفيا أنك هاربر فارس. علق أفري، \"أوليفيا محتالة وأفري فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر فارس  \n(2) يوسف محتال  \n(3) إيفلين فارس  \n(4) بنيامين فارس  \n(5) ماثيو محتال  \n(6) أوليفيا فارس  \n(7) أفري محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: أميليا، إيزابيلا، ويليام، مايسون، ماثيو، إيثان، ولوك. في كلمات أميليا: \"مايسون فارس وإيثان محتال\". \"مايسون محتال\" - إيزابيلا. \"إيزابيلا محتالة\" - ويليام. قال مايسون إنه إذا كان لوك فارساً، فإن ويليام فارس. عبر ماثيو عن أن مايسون محتال. علق إيثان، \"مايسون فارس إذا وفقط إذا كان لوك فارساً\". علق لوك، \"إذا كان مايسون فارساً، فإن أميليا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا محتالة  \n(2) إيزابيلا فارسة  \n(3) ويليام محتال  \n(4) مايسون محتال  \n(5) ماثيو فارس  \n(6) إيثان محتال  \n(7) لوك فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: ليام، آريا، مايسون، إيزابيلا، شارلوت، هنري، وداوود. كما قال ليام: \"داوود ليس محتالاً\". ذكرت آريا: \"هنري محتال وداوود فارس\". علق مايسون: \"آريا فارس أو داوود فارس\". قالت إيزابيلا: \"هنري محتال إذا وفقط إذا كان ليام فارساً\". أخبرتك شارلوت أن آريا محتالة. قال هنري: \"إذا كان ليام محتالاً، فإن هنري فارس\". علق داوود: \"شارلوت فارس أو ليام محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام فارس  \n(2) آريا محتالة  \n(3) مايسون فارس  \n(4) إيزابيلا محتالة  \n(5) شارلوت فارس  \n(6) هنري فارس  \n(7) داوود فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: نوح، أوليفر، إيفلين، أبيجيل، غريس، إيما، وداوود. وفقًا لنوح، \"أوليفر ليس فارسًا\". \"إيما محتالة أو أوليفر فارس\"، ذكر أوليفر. عبرت إيفلين عن أن أبيجيل ليست محتالة. سُمعت أبيجيل تقول، \"إذا كانت غريس فارسًا، فإن إيفلين فارسًا\". قالت غريس، \"داوود فارس وداوود محتال\". أكدت إيما: \"إذا كان أوليفر محتالًا، فإن غريس فارسًا\". على لسان داوود: \"أبيجيل ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح محتال  \n(2) أوليفر فارس  \n(3) إيفلين فارس  \n(4) أبيجيل فارس  \n(5) غريس محتالة  \n(6) إيما فارس  \n(7) داوود فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: جيمس، رايلي، إيزابيلا، يوسف، بينيلوب، فيكتوريا، وأميليا. قال جيمس إن رايلي محتال أو إيزابيلا فارس. أخبرتك رايلي أن يوسف محتال. علقَت إيزابيلا، \"بينيلوب محتالة وبينيلوب فارس\". عبر يوسف عن أن أميليا فارس. أخبرتك بينيلوب أن فيكتوريا محتالة. قالت فيكتوريا إن بينيلوب فارس أو جيمس فارس. في كلمات أميليا: \"إذا كانت فيكتوريا محتالة، فإن إيزابيلا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس فارس  \n(2) رايلي محتالة  \n(3) إيزابيلا محتالة  \n(4) يوسف فارس  \n(5) بينيلوب محتالة  \n(6) فيكتوريا فارس  \n(7) أميليا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: لوغان، كلوي، جاكسون، صموئيل، بينيلوب، ماثيو، وإميلي. في تصريح من لوغان: \"صموئيل ليس فارساً\". وفقاً لكلوي، \"لوغان محتـال\". جاكسون عبر عن أن بينيلوب محتالة أو كلوي محتالة. صموئيل قال إن بينيلوب فارسـة. في تصريح من بينيلوب: \"كلوي محتالة إذا وفقط إذا كان ماثيو محتـالاً\". ماثيو أشار، \"كلوي ليست محتالة\". إميلي صرحت، \"كلوي ليست فارسـة\". فمن هو الفارس ومن هو المحتـال؟",
        "solution_text_format": "(1) لوغان محتال  \n(2) كلوي فارس  \n(3) جاكسون محتال  \n(4) صموئيل فارس  \n(5) بينيلوب فارس  \n(6) ماثيو فارس  \n(7) إميلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: لوك، داوود، هنري، إيثان، جاك، بنيامين، ويعقوب. \"هنري فارس ويعقوب فارس\"، أعلن لوك. سمع داوود يقول: \"بنيامين فارس إذا وفقط إذا كان يعقوب محتالًا\". \"داوود محتال أو جاك محتال\" - هنري. عبر إيثان عن أن يعقوب فارس إذا وفقط إذا كان جاك فارسًا. \"إذا كان لوك فارسًا، فإن داوود فارس\" - ذكر جاك. أكد بنيامين: \"لوك ليس محتالًا\". \"بنيامين ليس فارسًا\" - يعقوب. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك محتال  \n(2) داوود فارس  \n(3) هنري محتال  \n(4) إيثان فارس  \n(5) جاك فارس  \n(6) بنيامين محتال  \n(7) يعقوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: ميا، ليام، أوليفيا، أبيجيل، أميليا، لوغان، ودانيال. \"ليام محتال ودانيال فارس\"، ادعت ميا. \"لوغان محتال وميا محتالة\" - ليام. قالت أوليفيا، \"ليام ليس محتالاً.\" أكدت أبيجيل: \"إذا كانت أوليفيا فارساً، فإن أبيجيل فارس.\" \"ليام ليس محتالاً\"، ذكرت أميليا. وفقاً لوغان، \"إذا كان ليام محتالاً، فإن أبيجيل محتالة.\" علق دانيال، \"أبيجيل محتالة إذا وفقط إذا كان لوغان فارساً.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا فارس  \n(2) ليام محتار  \n(3) أوليفيا محتالة  \n(4) أبيجيل فارس  \n(5) أميليا محتالة  \n(6) لوغان محتال  \n(7) دانيال فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ليلي، جيمس، إيلا، إيزابيلا، شارلوت، غريس، ونوح. \"إذا كانت إيزابيلا محتالة، فإن شارلوت محتالة\"، ادعت ليلي. أعرب جيمس عن أن نوح فارس. \"جيمس ليس فارسًا\"، أعلنت إيلا. \"إذا كانت إيزابيلا فارسة، فإن شارلوت فارسة\" - إيزابيلا. أخبرتك شارلوت أن شارلوت فارس. كما قالت غريس، \"إذا كان نوح فارسًا، فإن شارلوت فارسة\". \"جيمس محتال وإيزابيلا محتالة\" - نوح. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي فارس  \n(2) جيمس محتال  \n(3) إيلا فارس  \n(4) إيزابيلا فارس  \n(5) شارلوت فارس  \n(6) غريس فارس  \n(7) نوح محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: جيمس، ويليام، يعقوب، ليام، أميليا، لوكاس، ودانيال. جيمس أعرب عن أن أميليا محتالة. \"أميليا فارس\" - ويليام. في تصريح ليعقوب: \"إذا كان دانيال محتالًا، فإن أميليا محتالة\". ليام أعرب عن أن أميليا فارس. أميليا صرحت، \"جيمس فارس ودانيال محتال\". لوكاس أكد: \"جيمس فارس إذا وفقط إذا كان ويليام فارس\". دانيال قال، \"أميليا فارس إذا وفقط إذا كان يعقوب محتالًا.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس فارس  \n(2) ويليام محتال  \n(3) يعقوب فارس  \n(4) ليام محتال  \n(5) أميليا محتالة  \n(6) لوكاس محتال  \n(7) دانيال فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ليلي، آريا، نوح، صوفيا، إيلا، داوود، وشارلوت. قالت ليلي إنه إذا كان داوود محتالًا، فإن داوود فارس. أخبرتك آريا أن داوود فارس إذا وفقط إذا كانت ليلي فارسًا. قال نوح إن ليلي فارس إذا وفقط إذا كانت شارلوت فارسًا. في كلمات صوفيا: \"داوود محتال إذا وفقط إذا كان داوود فارسًا\". في كلمات إيلا: \"آريا محتالة وآريا فارس\". صرح داوود، \"نوح ليس محتالًا\". قالت شارلوت إنه إذا كان داوود فارسًا، فإن آريا محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي محتالة  \n(2) آريا فارسة  \n(3) نوح محتال  \n(4) صوفيا محتالة  \n(5) إيلا محتالة  \n(6) داوود محتال  \n(7) شارلوت فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: شارلوت، يوسف، نوح، غريس، دانيال، إيما، وجاك. \"إيما ليست فارسًا\"، ذكرت شارلوت. \"يوسف فارس\"، أعلن يوسف. قال نوح إن جاك ليس فارسًا. قالت غريس، \"يوسف فارس أو شارلوت محتالة.\" قال دانيال إنه إذا كانت إيما محتالة، فإن شارلوت محتالة. \"إذا كان نوح فارسًا، فإن دانيال محتال\"، أعلنت إيما. قال جاك، \"نوح فارس إذا وفقط إذا كان يوسف فارسًا.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت محتالة  \n(2) يوسف محتال  \n(3) نوح محتال  \n(4) غريس فارس  \n(5) دانيال فارس  \n(6) إيما فارس  \n(7) جاك فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: أيدن، غريس، أورورا، شارلوت، مايكل، لوغان، وكلوي. قال أيدن: \"إذا كان أيدن فارسًا، فإن غريس محتالة\". ذكرت غريس: \"شارلوت فارس\". كما قالت أورورا: \"مايكل فارس وغريس فارس\". صرحت شارلوت: \"أيدن فارس إذا وفقط إذا كان مايكل فارسًا\". أشار مايكل: \"مايكل فارس إذا وفقط إذا كانت غريس محتالة\". في كلمات لوغان: \"أورورا محتالة إذا وفقط إذا كانت غريس محتالة\". علقت كلوي: \"إذا كان أيدن محتالًا، فإن أيدن فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن فارس  \n(2) غريس محتالة  \n(3) أورورا محتالة  \n(4) شارلوت محتالة  \n(5) مايكل محتال  \n(6) لوغان فارس  \n(7) كلوي فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: يوسف، جيمس، إيزابيلا، إيثان، صوفيا، جاك، وأورورا. لاحظ يوسف، \"إيزابيلا محتالة\". \"إيثان محتال إذا وفقط إذا كانت إيزابيلا محتالة\"، أعلن جيمس. وفقاً لإيزابيلا، \"صوفيا فارس وجيمس محتال\". \"جيمس فارس\" - إيثان. عبرت صوفيا عن أن جاك فارس أو جاك محتال. وفقاً لجاك، \"إيثان فارس وجيمس محتال\". صرحت أورورا، \"إيزابيلا فارس أو صوفيا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف محتال  \n(2) جيمس محتال  \n(3) إيزابيلا فارس  \n(4) إيثان محتال  \n(5) صوفيا فارس  \n(6) جاك محتال  \n(7) أورورا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: جيمس، إيثان، شارلوت، هنري، يوسف، يعقوب، وآريا. سمع جيمس يقول: \"يعقوب محتال وشارلوت محتالة\". كما قال إيثان: \"إذا كان يعقوب فارساً، فإن هنري محتال\". صرحت شارلوت: \"يعقوب محتال إذا وفقط إذا كانت آريا محتالة\". صرح هنري: \"جيمس محتال إذا وفقط إذا كان هنري فارساً\". في بيان ليوسف: \"إذا كانت آريا فارسة، فإن إيثان محتال\". علق يعقوب: \"يعقوب فارس وإيثان فارس\". قالت آريا إن إيثان فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس محتال  \n(2) إيثان فارس  \n(3) شارلوت فارس  \n(4) هنري محتال  \n(5) يوسف محتال  \n(6) يعقوب فارس  \n(7) آريا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: فيكتوريا، جيمس، آريا، لوك، رايلي، يوسف، وإيزابيلا. قالت فيكتوريا إن آريا ليست فارساً. في تصريح لجيمس: \"لوك ليس محتالاً\". \"يوسف فارس إذا وفقط إذا كان يوسف محتالاً\"، أعلنت آريا. \"إذا كانت آريا فارساً، فإن رايلي فارس\"، أعلن لوك. \"إذا كانت فيكتوريا محتالاً، فإن لوك محتال\"، أعلنت رايلي. عبر يوسف عن أن آريا ليست محتالاً. وفقاً لإيزابيلا، \"لوك محتال إذا وفقط إذا كانت فيكتوريا محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) فيكتوريا فارس  \n(2) جيمس فارس  \n(3) آريا محتالة  \n(4) لوك فارس  \n(5) رايلي فارس  \n(6) يوسف محتال  \n(7) إيزابيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: لوك، بنيامين، هنري، جاكسون، إليزابيث، مايسون، وأميليا. قال لوك إن بنيامين فارس. كما قال بنيامين: \"أميليا محتالة ومايسون محتال\". أكد هنري: \"بنيامين ليس محتالًا\". ذكر جاكسون: \"مايسون محتال ولوك محتال\". أكدت إليزابيث: \"بنيامين فارس\". أشار مايسون: \"جاكسون محتال إذا وفقط إذا كان جاكسون فارسًا\". أخبرت أميليا أنك مايسون محتال ومايسون فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) بنيامين فارس  \n(3) هنري فارس  \n(4) جاكسون محتال  \n(5) إليزابيث فارس  \n(6) مايسون محتال  \n(7) أميليا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ميا، يعقوب، أوليفر، أميليا، هنري، أوين، ولوكاس. قالت ميا: \"ميا فارس ولوكاس محتال\". \"أوليفر ليس محتالًا\" - يعقوب. \"إذا كان لوكاس محتالًا، فإن أميليا فارس\" - أوليفر. \"لوكاس محتال أو هنري محتال\" - ادعت أميليا. في تصريح لهنري: \"أوين محتال\". في تصريح لأوين: \"إذا كان أوليفر محتالًا، فإن أوين فارس\". قال لوكاس: \"إذا كان أوليفر محتالًا، فإن هنري فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا محتالة  \n(2) يعقوب فارس  \n(3) أوليفر فارس  \n(4) أميليا فارس  \n(5) هنري محتال  \n(6) أوين فارس  \n(7) لوكاس فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: لوك، إميلي، مايسون، بنيامين، نوح، ليلي، وغريس. لوك لاحظ، \"ليلي ليست فارسًا\". \"نوح فارس\"، ادعت إميلي. كما قال مايسون، \"بنيامين محتال إذا وفقط إذا كان لوك محتالًا\". في كلمات بنيامين: \"نوح محتال\". في بيان من نوح: \"إميلي فارس وليلي محتالة\". ليلي صرحت، \"إذا كان بنيامين فارسًا فإن إميلي فارس\". غريس علقت، \"إذا كان بنيامين محتالًا فإن بنيامين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) إميلي محتالة  \n(3) مايسون فارس  \n(4) بنيامين فارس  \n(5) نوح محتال  \n(6) ليلي محتالة  \n(7) غريس فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: يوسف، صوفيا، جيمس، سباستيان، إيما، أميليا، وجاك. كما قال يوسف: \"جاك فارس وجاك محتال\". \"إيما فارس\" - صوفيا. قال جيمس: \"إذا كان يوسف فارسًا، فإن أميليا فارس\". قال سباستيان: \"يوسف فارس\". أكدت إيما: \"جيمس ليس محتالًا\". كما قالت أميليا: \"جاك فارس إذا وفقط إذا كانت صوفيا محتالة\". أخبرك جاك أن إيما ليست محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف محتال  \n(2) صوفيا فارس  \n(3) جيمس فارس  \n(4) سباستيان محتال  \n(5) إيما فارس  \n(6) أميليا محتالة  \n(7) جاك فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: سباستيان، دانيال، جاكسون، لوكاس، أبيجيل، إسكندر، وسكارليت. في كلمات سباستيان: \"جاكسون فارس أو إسكندر فارس\". وفقاً لدانيال، \"سكارليت محتالة إذا وفقط إذا كان جاكسون فارساً\". في تصريح لجاكسون: \"دانيال فارس إذا وفقط إذا كان دانيال محتالاً\". لوكاس عبر عن أنه إذا كان إسكندر محتالاً فإن سباستيان فارس. \"سكارليت فارس\" - أبيجيل. في تصريح لإسكندر: \"أبيجيل محتالة\". سكارليت قالت، \"جاكسون محتال.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سباستيان محتال  \n(2) دانيال فارس  \n(3) جاكسون محتال  \n(4) لوكاس محتال  \n(5) أبيجيل فارس  \n(6) إسكندر محتال  \n(7) سكارليت فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: إيثان، أورورا، صوفيا، نوح، آفا، ويليام، وأيدن. سمع إيثان يقول: \"نوح فارس\". أكدت أورورا: \"صوفيا محتالة\". أعلنت صوفيا: \"إيثان فارس\". قال نوح: \"أيدن محتال ونوح فارس\". في بيان من آفا: \"ويليام فارس\". أخبرك ويليام أن نوح فارس أو إيثان فارس. ادعى أيدن: \"أورورا محتالة أو صوفيا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان محتال  \n(2) أورورا فارس  \n(3) صوفيا محتالة  \n(4) نوح محتال  \n(5) آفا محتالة  \n(6) ويليام محتال  \n(7) أيدن فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: أوليفيا، ماثيو، أوليفر، سباستيان، بينيلوب، آفا، وشارلوت. سُمعت أوليفيا تقول: \"بينيلوب ليست فارسًا\". أخبرك ماثيو أن ماثيو فارس أو أوليفر محتال. ادعى أوليفر: \"ماثيو فارس أو شارلوت محتالة\". عبر سباستيان عن أن بينيلوب فارس وأوليفر محتال. قالت بينيلوب إن أوليفر محتال. في بيان من آفا: \"إذا كانت شارلوت فارسًا، فإن أوليفر محتال\". صرحت شارلوت: \"إذا كانت بينيلوب فارسًا، فإن شارلوت فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا فارس  \n(2) ماثيو فارس  \n(3) أوليفر فارس  \n(4) سباستيان محتال  \n(5) بينيلوب محتالة  \n(6) آفا محتالة  \n(7) شارلوت فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: لوك، زوي، صوفيا، يوسف، غريس، أوليفيا، وسباستيان. لوك قال: \"غريس محتالة\". \"سباستيان فارس إذا وفقط إذا كانت صوفيا فارسة\" - زوي. \"أوليفيا ليست محتالة\"، ذكرت صوفيا. يوسف قال: \"أوليفيا محتالة\". \"غريس فارسة إذا وفقط إذا كان يوسف فارسًا\"، ادعت غريس. وفقًا لأوليفيا، \"زوي ليست فارسة\". سباستيان صرح: \"غريس محتالة أو سباستيان فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك محتال  \n(2) زوي فارس  \n(3) صوفيا محتالة  \n(4) يوسف فارس  \n(5) غريس فارس  \n(6) أوليفيا محتالة  \n(7) سباستيان محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ماثيو، إيفلين، صوفيا، بنيامين، أفري، إيما، وغريس. قال ماثيو إن ماثيو فارس إذا وفقط إذا كان بنيامين فارسًا. علق إيفلين، \"إذا كانت إيما فارسًا، فإن ماثيو محتال\". في بيان من صوفيا: \"ماثيو محتال وغريس محتالة\". عبر بنيامين عن أن ماثيو محتال. \"بنيامين فارس أو ماثيو محتال\" - أفري. أخبرتك إيما أن أفري محتالة إذا وفقط إذا كان ماثيو فارسًا. لاحظت غريس، \"ماثيو فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ماثيو محتال  \n(2) إيفلين فارس  \n(3) صوفيا فارس  \n(4) بنيامين فارس  \n(5) أفري فارس  \n(6) إيما فارس  \n(7) غريس محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: بينيلوب، إميلي، ماثيو، إسكندر، بنيامين، كلوي، وإيثان. في كلمات بينيلوب: \"كلوي محتالة إذا وفقط إذا كان إسكندر محتالًا\". قالت إميلي: \"بينيلوب محتالة وإسكندر فارس\". \"إميلي محتالة\"، ذكر ماثيو. في كلمات إسكندر: \"إذا كانت كلوي فارسة، فإن بنيامين محتال\". أكد بنيامين: \"ماثيو محتال أو إيثان محتال\". عبرت كلوي عن أن إيثان فارس أو بنيامين فارس. قال إيثان: \"كلوي فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب فارس  \n(2) إميلي محتالة  \n(3) ماثيو فارس  \n(4) إسكندر فارس  \n(5) بنيامين محتال  \n(6) كلوي فارس  \n(7) إيثان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: صموئيل، يوسف، أميليا، بنيامين، آفا، أوليفيا، وويليام. صرح صموئيل: \"ويليام محتال أو أميليا محتالة\". علق يوسف، \"إذا كانت أوليفيا فارسة، فإن بنيامين محتال\". قالت أميليا، \"أوليفيا محتالة\". قال بنيامين إن يوسف محتال وآفا فارسة. \"أميليا فارسة وبنيامين محتال\" - آفا. قالت أوليفيا، \"بنيامين ليس محتالًا\". قال ويليام إن أوليفيا محتالة إذا وفقط إذا كانت أميليا فارسة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صموئيل محتال  \n(2) يوسف فارس  \n(3) أميليا فارس  \n(4) بنيامين محتال  \n(5) آفا فارس  \n(6) أوليفيا محتالة  \n(7) ويليام فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: يوسف، لوكاس، زوي، أيدن، دانيال، شارلوت، وويليام. قال يوسف: \"شارلوت ليست محتالة.\" كما قال لوكاس: \"شارلوت محتالة\". أعلنت زوي: \"ويليام محتال أو أيدن محتال.\" أعلن أيدن: \"لوكاس ليس فارسًا.\" صرح دانيال: \"إذا كان يوسف محتالًا، فإن شارلوت محتالة.\" ذكرت شارلوت: \"زوي فارس ودانيال فارس.\" قال ويليام: \"ويليام فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف فارس  \n(2) لوكاس محتال  \n(3) زوي فارس  \n(4) أيدن فارس  \n(5) دانيال فارس  \n(6) شارلوت فارس  \n(7) ويليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ليام، ماثيو، أورورا، يعقوب، مايكل، أوليفر، وغريس. ليام أخبرك أنه إذا كان يعقوب فارسًا، فإن ماثيو فارس. ماثيو أشار، \"أورورا ليست فارسًا\". أورورا قالت، \"يعقوب فارس وأوليفر فارس\". وفقًا ليعقوب، \"مايكل فارس إذا وفقط إذا كان أوليفر محتالًا\". مايكل أخبرك أن أوليفر فارس. أوليفر عبر عن أن غريس فارس وليام فارس. غريس صرحت، \"ماثيو ليس محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام فارس  \n(2) ماثيو فارس  \n(3) أورورا محتالة  \n(4) يعقوب محتال  \n(5) مايكل فارس  \n(6) أوليفر فارس  \n(7) غريس فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: مايسون، يعقوب، داوود، دانيال، هنري، ميا، ولوغان. وفقًا لمايسون، \"هنري ليس فارسًا\". وفقًا ليعقوب، \"ميا محتالة وهنري محتال\". \"إذا كان لوغان محتالًا، فإن ميا محتالة\"، أعلن داوود. \"دانيال فارس أو ميا محتالة\"، ذكر دانيال. هنري علق، \"داوود محتال إذا وفقط إذا كانت ميا محتالة\". في تصريح من ميا: \"مايسون محتال\". لوغان أشار، \"داوود محتال ولوغان فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايسون فارس  \n(2) يعقوب فارس  \n(3) داوود فارس  \n(4) دانيال فارس  \n(5) هنري محتال  \n(6) ميا محتالة  \n(7) لوغان محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: سكارليت، ليلي، إسكندر، داوود، أوليفر، هاربر، ويعقوب. أخبرتك سكارليت أن يعقوب فارس. \"داوود محتال وهاربر فارس\" - ليلي. \"إذا كانت ليلي فارساً، فإن داوود فارس\" - أعلن إسكندر. وفقاً لداوود، \"إذا كان إسكندر فارساً، فإن داوود فارس\". قال أوليفر إن داوود محتال ويعقوب محتال. \"إسكندر ليس محتالاً\" - ادعت هاربر. وفقاً ليعقوب، \"هاربر محتالة وإسكندر محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سكارليت محتالة  \n(2) ليلي محتالة  \n(3) إسكندر فارس  \n(4) داوود فارس  \n(5) أوليفر محتال  \n(6) هاربر فارس  \n(7) يعقوب محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: جاك، إيزابيلا، ميا، شارلوت، رايلي، بنيامين، ولوغان. قال جاك: \"شارلوت فارس.\" صرحت إيزابيلا: \"لوغان فارس ومحتال.\" أكدت ميا: \"إيزابيلا فارس.\" علقّت شارلوت: \"إيزابيلا ليست فارساً.\" ذكر رايلي: \"ميا فارس ولوغان فارس.\" في كلمات بنيامين: \"إذا كانت شارلوت فارساً، فإن جاك محتار.\" قال لوغان: \"ميا محتالة.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاك فارس  \n(2) إيزابيلا محتالة  \n(3) ميا محتالة  \n(4) شارلوت فارس  \n(5) رايلي محتالة  \n(6) بنيامين محتال  \n(7) لوغان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: يعقوب، بنيامين، آريا، هاربر، زوي، ماثيو، وويليام. كما قال يعقوب: \"هاربر محتالة إذا وفقط إذا كانت زوي فارسة\". عبر بنيامين عن أنه إذا كانت زوي محتالة فإن ويليام محتال. أخبرتك آريا أن هاربر محتالة أو زوي محتالة. أكد هاربر: \"بنيامين محتال وزوي فارسة\". سمع زوي يقول: \"ماثيو فارس\". بكلمات ماثيو: \"إذا كان ويليام فارساً فإن هاربر فارس\". كما قال ويليام: \"آريا محتالة وزوي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب فارس  \n(2) بنيامين فارس  \n(3) آريا فارس  \n(4) هاربر محتالة  \n(5) زوي فارس  \n(6) ماثيو فارس  \n(7) ويليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: يعقوب، أفري، داوود، لوغان، فيكتوريا، بينيلوب، وجاك. قال يعقوب لك إن بينيلوب فارس وفيكتوريا محتالة. أفري صرحت، \"يعقوب ليس فارسًا\". كما قال داوود، \"فيكتوريا فارس إذا وفقط إذا كان يعقوب محتالًا\". لوغان عبر عن أن جاك ليس فارسًا. فيكتوريا عبرت أن لوغان محتال وفيكتوريا فارس. \"إذا كانت أفري محتالة، فإن جاك محتال\"، ادعت بينيلوب. جاك عبر أن يعقوب فارس وداوود محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب فارس  \n(2) أفري محتالة  \n(3) داوود فارس  \n(4) لوغان فارس  \n(5) فيكتوريا محتالة  \n(6) بينيلوب فارس  \n(7) جاك محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: إيما، لوكاس، داوود، إيثان، أوين، يوسف، وأورورا. قالت إيما إن أوين فارس أو لوكاس محتال. بكلمات لوكاس: \"يوسف ليس محتالًا\". صرح داوود، \"إيما محتالة\". سمع إيثان يقول، \"إيما محتالة إذا وفقط إذا كان داوود فارسًا\". وفقًا لأوين، \"إذا كان لوكاس محتالًا فإن إيثان محتال\". \"داوود ليس فارسًا\"، ذكر يوسف. بكلمات أورورا: \"لوكاس محتال أو إيثان محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما فارس  \n(2) لوكاس فارس  \n(3) داوود محتال  \n(4) إيثان فارس  \n(5) أوين فارس  \n(6) يوسف فارس  \n(7) أورورا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: هنري، إيلا، لوك، أبيجيل، إيزابيلا، جاكسون، وشارلوت. قال هنري: \"لوك ليس محتالًا\". وفي كلمات إيلا: \"لوك ليس فارسًا\". وفي تصريح لوك: \"هنري محتال إذا وفقط إذا كانت أبيجيل فارسًا\". أخبرتك أبيجيل أن هنري فارس أو إيزابيلا محتالة. قالت إيزابيلا: \"إذا كانت أبيجيل فارسًا، فإن لوك فارس\". وفقًا لجكسون، \"إذا كانت أبيجيل محتالة، فإن هنري فارس\". قالت شارلوت إنه إذا كانت إيلا محتالة، فإن لوك فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هنري محتال  \n(2) إيلا فارس  \n(3) لوك محتال  \n(4) أبيجيل محتالة  \n(5) إيزابيلا فارس  \n(6) جاكسون محتال  \n(7) شارلوت فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: نوح، إليزابيث، رايلي، بينيلوب، صوفيا، زوي، وآفا. في كلمات نوح: \"آفا فارس وإليزابيث فارس\". في تصريح إليزابيث: \"نوح فارس أو آفا محتالة\". رايلي علق، \"إليزابيث ليست فارسًا\". \"آفا فارس إذا وفقط إذا كانت آفا محتالة\"، ذكرت بينيلوب. صوفيا قالت إن آفا فارس إذا وفقط إذا كانت رايلي محتالة. زوي لاحظت، \"نوح محتال إذا وفقط إذا كانت رايلي فارسًا\". آفا أخبرتكم أن رايلي محتالة أو زوي محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح فارس  \n(2) إليزابيث فارس  \n(3) رايلي محتالة  \n(4) بينيلوب محتالة  \n(5) صوفيا فارس  \n(6) زوي فارس  \n(7) آفا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: ليلي، سكارليت، إيلا، أوليفر، آفا، غريس، ويعقوب. قالت ليلي: \"آفا محتالة\". لاحظت سكارليت: \"أوليفر ليس فارساً\". كما قالت إيلا: \"يعقوب ليس فارساً\". ادعى أوليفر: \"إيلا فارسة\". سُمعت آفا تقول: \"غريس محتالة وأوليفر فارس\". ادعت غريس: \"آفا محتالة وسكارليت محتالة\". أخبرك يعقوب أن غريس ليست محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي محتالة  \n(2) سكارليت محتالة  \n(3) إيلا فارسة  \n(4) أوليفر فارس  \n(5) آفا فارسة  \n(6) غريس محتالة  \n(7) يعقوب محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ميا، إيثان، إيزابيلا، بينيلوب، ويليام، إيما، وبنيامين. \"بنيامين محتال أو إيثان محتال\"، ادعت ميا. علق إيثان، \"إيما فارس أو بنيامين محتال\". علق إيزابيلا، \"إذا كانت ميا فارسًا، فإن إيثان محتال\". أخبرتك بينيلوب أن إيما محتالة وبنيامين محتال. أخبرك ويليام أن بنيامين محتال أو إيزابيلا محتالة. عبرت إيما عن أن إيزابيلا فارس أو بينيلوب فارس. قال بنيامين إنه إذا كانت إيزابيلا محتالة، فإن ويليام فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا محتالة  \n(2) إيثان فارس  \n(3) إيزابيلا فارسة  \n(4) بينيلوب محتالة  \n(5) ويليام محتال  \n(6) إيما فارسة  \n(7) بنيامين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: يعقوب، صوفيا، داوود، شارلوت، لوغان، غريس، وأوليفيا. قال يعقوب: \"شارلوت فارس أو داوود فارس\". علق صوفيا: \"يعقوب ليس محتالًا\". كما قال داوود: \"إذا كان يعقوب فارسًا، فإن أوليفيا محتالة\". وفقًا لشارلوت، \"غريس ليست محتالة\". أعلن لوغان: \"داوود محتال إذا وفقط إذا كانت غريس محتالة\". قالت غريس: \"صوفيا فارس وشارلوت فارس\". أكدت أوليفيا: \"يعقوب محتال أو شارلوت محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب فارس  \n(2) صوفيا فارس  \n(3) داوود فارس  \n(4) شارلوت فارس  \n(5) لوغان فارس  \n(6) غريس فارس  \n(7) أوليفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: جيمس، دانيال، لوك، شارلوت، ميا، إيلا، ورايلي. قال جيمس: \"لوك محتال إذا وفقط إذا كان لوك فارساً\". علق دانيال: \"شارلوت محتالة إذا وفقط إذا كان دانيال فارساً\". قال لوك: \"ميا محتالة وميا فارس\". سُمعت شارلوت تقول: \"دانيال محتال إذا وفقط إذا كانت ميا محتالة\". قالت ميا: \"إذا كانت ميا فارسة، فإن دانيال محتال\". ادعت إيلا: \"لوك ليس فارساً\". أعلن رايلي: \"جيمس فارس أو جيمس محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس محتال  \n(2) دانيال محتال  \n(3) لوك محتال  \n(4) شارلوت محتالة  \n(5) ميا فارس  \n(6) إيلا فارسة  \n(7) رايلي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: بينيلوب، صوفيا، جيمس، سكارليت، أفري، بنيامين، وصموئيل. في تصريح لبينيلوب: \"جيمس محتال وبينيلوب فارس\". صوفيا عبرت أنه إذا كان صموئيل محتالاً فإن جيمس محتال. جيمس عبر أنه إذا كانت سكارليت محتالة فإن صوفيا محتالة. سكارليت لاحظت، \"بنيامين فارس أو أفري فارس\". أفري عبرت أن بنيامين ليس محتالاً. \"بينيلوب فارس\"، أعلن بنيامين. \"بينيلوب فارس أو جيمس فارس\"، ذكر صموئيل. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب محتالة  \n(2) صوفيا فارسة  \n(3) جيمس محتال  \n(4) سكارليت محتالة  \n(5) أفري محتالة  \n(6) بنيامين محتال  \n(7) صموئيل محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: لوك، ميا، أبيجيل، سباستيان، بنيامين، زوي، وجاك. قال لوك: \"بنيامين محتال\". ادعت ميا: \"إذا كانت زوي فارسة، فإن أبيجيل فارسة\". لاحظت أبيجيل: \"زوي فارسة إذا وفقط إذا كان سباستيان فارسًا\". قال سباستيان: \"لوك فارس\". علق بنيامين: \"أبيجيل فارسة وسباستيان فارس\". أعلنت زوي: \"زوي فارسة\". في بيان من جاك: \"لوك ليس محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) ميا فارس  \n(3) أبيجيل محتالة  \n(4) سباستيان فارس  \n(5) بنيامين محتال  \n(6) زوي محتالة  \n(7) جاك فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: لوكاس، يعقوب، ليام، سكارليت، صموئيل، فيكتوريا، وأفري. قال لوكاس إنه إذا كان صموئيل فارسًا، فإن ليام محتال. سمع يعقوب يقول: \"صموئيل ليس محتالًا\". صرح ليام: \"يعقوب فارس إذا وفقط إذا كانت سكارليت فارسة\". وفقًا لسكارليت، \"صموئيل ليس محتالًا\". صرح صموئيل: \"سكارليت فارسة وسكارليت محتالة\". وفقًا لفيكتوريا، \"ليام محتال أو يعقوب فارس\". كما قالت أفري: \"لوكاس محتال وصموئيل فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس فارس  \n(2) يعقوب محتال  \n(3) ليام فارس  \n(4) سكارليت محتالة  \n(5) صموئيل محتال  \n(6) فيكتوريا محتالة  \n(7) أفري محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: داوود، إليزابيث، أوليفر، أيدن، آفا، إميلي، وماثيو. سمع داوود يقول: \"ماثيو فارس أو أيدن محتال\". إليزابيث صرحت: \"أوليفر فارس\". كما قال أوليفر: \"داوود ليس محتالًا\". أيدن علق: \"داوود فارس أو أيدن فارس\". \"إميلي محتالة إذا وفقط إذا كان أوليفر فارسًا\"، أعلنت آفا. إميلي أخبرتكم أن أيدن فارس إذا وفقط إذا كان داوود فارسًا. ماثيو علق: \"داوود محتال أو أيدن فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود فارس  \n(2) إليزابيث فارسة  \n(3) أوليفر فارس  \n(4) أيدن فارس  \n(5) آفا محتالة  \n(6) إميلي فارسة  \n(7) ماثيو فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: آريا، دانيال، مايسون، داوود، ميا، إليزابيث، وسكارليت. قالت آريا: \"إليزابيث فارس ودانيال فارس\". في تصريح لدانيال: \"إذا كانت إليزابيث فارسًا، فإن ميا فارس\". سمع مايسون يقول: \"داوود فارس أو داوود محتار\". أكد داوود: \"دانيال محتال وسكارليت محتالة\". أخبرتك ميا أن إليزابيث محتالة ودانيال فارس. قالت إليزابيث إنه إذا كان مايسون محتالًا، فإن داوود فارس. ذكرت سكارليت: \"ميا محتالة إذا وفقط إذا كانت آريا فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آريا محتالة  \n(2) دانيال محتال  \n(3) مايسون فارس  \n(4) داوود فارس  \n(5) ميا محتالة  \n(6) إليزابيث فارسة  \n(7) سكارليت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: مايكل، سباستيان، جاكسون، بينيلوب، نوح، إيزابيلا، وزوي. قال مايكل: \"إيزابيلا ليست محتالة\". قال سباستيان: \"نوح محتال أو إيزابيلا محتالة\". كما قال جاكسون: \"نوح محتال وسباستيان فارس\". \"زوي محتالة\" - بينيلوب. \"إذا كان سباستيان محتالاً، فإن نوح فارس\" - نوح. \"مايكل محتال إذا وفقط إذا كان سباستيان فارساً\" - إيزابيلا. قالت زوي: \"سباستيان محتال أو مايكل فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل فارس  \n(2) سباستيان محتال  \n(3) جاكسون محتال  \n(4) بينيلوب محتالة  \n(5) نوح فارس  \n(6) إيزابيلا فارسة  \n(7) زوي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: بينيلوب، إيفلين، شارلوت، إيلا، أيدن، آريا، وجاكسون. علقت بينيلوب، \"بينيلوب فارس\". لاحظت إيفلين، \"بينيلوب ليست محتالة\". بكلمات شارلوت: \"بينيلوب فارس أو أيدن فارس\". كما قالت إيلا، \"شارلوت فارس أو شارلوت محتالة\". \"جاكسون محتال\"، ادعى أيدن. \"أيدن محتال وجاكسون محتال\"، ادعت آريا. قال جاكسون إن شارلوت فارس وإيلا فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب فارس  \n(2) إيفلين فارس  \n(3) شارلوت فارس  \n(4) إيلا فارس  \n(5) أيدن محتال  \n(6) آريا محتالة  \n(7) جاكسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: لوغان، أيدن، داوود، هاربر، إيفلين، دانيال، وفيكتوريا. \"أيدن فارس ودانيال محتال\"، ادعى لوغان. سمع أيدن يقول، \"دانيال فارس إذا وفقط إذا كان داوود فارس\". \"فيكتوريا فارس أو أيدن محتال\" - داوود. في كلمات هاربر: \"إيفلين محتالة\". وفقاً لإيفلين، \"إذا كان لوغان فارساً فإن أيدن فارس\". \"داوود ليس فارساً\"، أعلن دانيال. قالت فيكتوريا إن إيفلين ليست محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان محتال  \n(2) أيدن محتال  \n(3) داوود فارس  \n(4) هاربر محتالة  \n(5) إيفلين فارسة  \n(6) دانيال محتال  \n(7) فيكتوريا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: جاك، ويليام، هنري، مايسون، أوين، إليزابيث، وبنيامين. \"إليزابيث ليست محتالة\" - جاك. علق ويليام، \"إذا كان ويليام فارسًا، فإن إليزابيث فارس\". أعرب هنري عن أن هنري فارس وجاك محتال. \"جاك فارس\"، ذكر مايسون. في بيان من أوين: \"أوين فارس وويليام محتال\". أكدت إليزابيث: \"إذا كان جاك محتالًا، فإن مايسون محتال\". أشار بنيامين، \"ويليام محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاك فارس  \n(2) ويليام فارس  \n(3) هنري محتال  \n(4) مايسون فارس  \n(5) أوين محتال  \n(6) إليزابيث فارس  \n(7) بنيامين محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: إيزابيلا، هنري، مايسون، مايكل، أوليفيا، فيكتوريا، وليام. قالت إيزابيلا: \"مايسون فارس وليام محتال\". قال هنري: \"إذا كان مايكل فارسًا، فإن فيكتوريا فارس\". في كلمات مايسون: \"مايكل فارس إذا وفقط إذا كانت فيكتوريا محتالة\". \"فيكتوريا فارس\" - مايكل. قالت أوليفيا: \"هنري ليس محتالًا\". أخبرتك فيكتوريا أن هنري محتال وأوليفيا فارس. لاحظ وليام: \"مايكل فارس أو أوليفيا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا محتالة  \n(2) هنري فارس  \n(3) مايسون محتال  \n(4) مايكل محتال  \n(5) أوليفيا فارس  \n(6) فيكتوريا محتالة  \n(7) ليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: أوين، شارلوت، سباستيان، هاربر، مايكل، فيكتوريا، ومايسون. \"شارلوت ليست فارسًا\" - أوين. قالت شارلوت إن مايسون فارس إذا وفقط إذا كانت فيكتوريا فارسًا. علق سباستيان، \"فيكتوريا محتالة\". \"أوين محتال وشارلوت فارس\"، أعلنت هاربر. وفقًا لمايكل، \"فيكتوريا فارس\". كما قالت فيكتوريا، \"مايكل محتال وشارلوت فارس\". علق مايسون، \"مايكل محتال أو شارلوت محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين فارس  \n(2) شارلوت محتالة  \n(3) سباستيان فارس  \n(4) هاربر محتالة  \n(5) مايكل محتال  \n(6) فيكتوريا محتالة  \n(7) مايسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: إميلي، ميا، أوين، آفا، أوليفيا، داوود، وزوي. أكدت إميلي: \"إميلي فارس وآفا محتالة\". أخبرتك ميا أن أوين فارس إذا وفقط إذا كانت آفا محتالة. وفقًا لأوين، \"ميا محتالة وداوود فارس\". كما قالت آفا، \"آفا فارس إذا وفقط إذا كانت ميا فارس\". أكدت أوليفيا: \"أوين فارس\". علق داوود، \"داوود فارس أو أوين محتال\". علق زوي، \"إميلي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي محتالة  \n(2) ميا فارسة  \n(3) أوين محتال  \n(4) آفا فارسة  \n(5) أوليفيا محتالة  \n(6) داوود فارس  \n(7) زوي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: مايسون، إسكندر، ليلي، داوود، إيفلين، يوسف، وبينيلوب. قال مايسون: \"يوسف فارس أو إيفلين محتالة\". أعلن إسكندر: \"إسكندر فارس إذا وفقط إذا كان يوسف محتالًا\". علقت ليلي، \"بينيلوب محتالة وإسكندر محتال\". ذكر داوود، \"إذا كانت بينيلوب محتالة، فإن إسكندر فارس\". عبرت إيفلين عن أنه إذا كانت ليلي فارسًا، فإن داوود محتال. أشار يوسف، \"داوود فارس إذا وفقط إذا كانت بينيلوب محتالة\". لاحظت بينيلوب، \"إيفلين محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايسون محتال  \n(2) إسكندر محتال  \n(3) ليلي فارس  \n(4) داوود محتال  \n(5) إيفلين فارس  \n(6) يوسف محتال  \n(7) بينيلوب محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: جاكسون، جيمس، لوغان، صوفيا، داوود، يوسف، وإيثان. علق جاكسون، \"داوود محتال أو داوود فارس\". علق جيمس، \"جيمس فارس أو صوفيا محتالة\". علق لوغان، \"داوود محتال وصوفيا فارس\". \"لوغان محتال وإيثان محتال\" - صوفيا. قال داوود إن يوسف محتال. أخبرك يوسف أن جيمس محتال أو صوفيا محتالة. علق إيثان، \"لوغان ليس محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون فارس  \n(2) جيمس فارس  \n(3) لوغان محتال  \n(4) صوفيا فارس  \n(5) داوود فارس  \n(6) يوسف محتال  \n(7) إيثان محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ويليام، إيلا، آريا، مايكل، غريس، آفا، وجيمس. في تصريح من ويليام: \"آفا فارس\". قالت إيلا: \"جيمس ليس محتالًا\". \"جيمس محتال إذا وفقط إذا كانت غريس محتالًا\"، أعلنت آريا. قال مايكل: \"إذا كان ويليام فارسًا، فإن آفا محتالًا\". علقت غريس: \"مايكل محتال أو آفا محتال\". قالت آفا: \"آريا فارس ومايكل فارس\". سمع جيمس يقول: \"ويليام فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام محتال  \n(2) إيلا محتالة  \n(3) آريا محتالة  \n(4) مايكل فارس  \n(5) غريس فارسة  \n(6) آفا محتالة  \n(7) جيمس محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: إليزابيث، غريس، دانيال، صوفيا، لوغان، إيلا، وإسكندر. كما قالت إليزابيث: \"دانيال فارس ودانيال محتال\". في تصريح من غريس: \"صوفيا محتالة\". أخبرك دانيال أن إسكندر فارس. في كلمات صوفيا: \"إليزابيث ليست فارسًا\". علق لوغان، \"صوفيا فارس\". قالت إيلا إن غريس محتالة إذا وفقط إذا كانت إليزابيث فارسًا. قال إسكندر، \"إيلا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث محتالة  \n(2) غريس محتالة  \n(3) دانيال محتال  \n(4) صوفيا فارس  \n(5) لوغان فارس  \n(6) إيلا محتالة  \n(7) إسكندر محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: يوسف، لوغان، ليلي، صوفيا، جيمس، لوكاس، وأوين. قال يوسف: \"صوفيا محتالة\". علق لوغان: \"لوغان فارس أو صوفيا فارس\". أكدت ليلي: \"يوسف فارس إذا وفقط إذا كان جيمس فارس\". ذكرت صوفيا: \"إذا كان أوين محتالاً، فإن يوسف فارس\". قال جيمس: \"لوكاس فارس إذا وفقط إذا كان لوغان محتالاً\". في بيان من لوكاس: \"صوفيا محتالة ويوسف محتال\". قال أوين إن لوكاس محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف محتال  \n(2) لوغان فارس  \n(3) ليلي محتالة  \n(4) صوفيا فارسة  \n(5) جيمس فارس  \n(6) لوكاس محتال  \n(7) أوين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: بينيلوب، نوح، لوكاس، بنيامين، جاكسون، ليلي، وشارلوت. تم سماع بينيلوب تقول: \"ليلي فارس أو بينيلوب فارس\". وفقًا لنوح، \"شارلوت محتالة وجاكسون محتال\". قال لوكاس إن بينيلوب فارس. في تصريح لبنيامين: \"إذا كانت شارلوت محتالة، فإن بينيلوب فارس\". في تصريح لجكسون: \"بينيلوب فارس أو لوكاس محتال\". كما قالت ليلي: \"جاكسون محتال إذا وفقط إذا كان بنيامين محتال\". قالت شارلوت إن جاكسون فارس أو لوكاس فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب فارس  \n(2) نوح محتال  \n(3) لوكاس فارس  \n(4) بنيامين فارس  \n(5) جاكسون فارس  \n(6) ليلي فارس  \n(7) شارلوت فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: نوح، فيكتوريا، لوغان، صوفيا، جاك، إيفلين، وغريس. قال نوح: \"لوغان فارس.\" قالت فيكتوريا: \"نوح محتال وغريس فارس.\" في تصريح من لوغان: \"فيكتوريا فارس أو فيكتوريا محتالة\". عبرت صوفيا عن أن نوح محتال إذا وفقط إذا كانت غريس محتالة. أعلن جاك: \"فيكتوريا فارس ونوح محتال.\" صرحت إيفلين: \"جاك محتال أو لوغان فارس\". \"نوح فارس أو لوغان فارس\" - غريس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح فارس  \n(2) فيكتوريا محتالة  \n(3) لوغان فارس  \n(4) صوفيا فارس  \n(5) جاك محتال  \n(6) إيفلين فارس  \n(7) غريس فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: أوليفيا، لوكاس، إيزابيلا، إيما، دانيال، أورورا، وإيلا. قالت أوليفيا: \"دانيال فارس\". كما قال لوكاس: \"إيزابيلا ليست محتالة\". صرحت إيزابيلا: \"إيلا محتالة\". علقت إيما: \"أوليفيا فارس أو لوكاس محتال\". كما قال دانيال: \"أورورا فارس ودانيال فارس\". أشارت أورورا: \"أورورا فارس ولوكاس فارس\". وفقًا لإيلا: \"أورورا فارس أو أوليفيا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا محتالة  \n(2) لوكاس فارس  \n(3) إيزابيلا فارس  \n(4) إيما محتالة  \n(5) دانيال محتال  \n(6) أورورا محتالة  \n(7) إيلا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: لوغان، سباستيان، بنيامين، غريس، آفا، مايكل، وإيزابيلا. في تصريح لوغان: \"آفا ليست محتالة\". قال سباستيان: \"غريس فارس أو بنيامين فارس\". قال بنيامين: \"لوغان محتال أو مايكل فارس\". عبرت غريس عن أن إيزابيلا محتالة. قالت آفا: \"إذا كانت آفا فارسة، فإن مايكل فارس\". قال مايكل إن بنيامين ليس محتالاً. كما قالت إيزابيلا: \"إذا كانت إيزابيلا فارسة، فإن غريس محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان فارس  \n(2) سباستيان فارس  \n(3) بنيامين فارس  \n(4) غريس محتالة  \n(5) آفا فارس  \n(6) مايكل فارس  \n(7) إيزابيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ليلي، جاكسون، فيكتوريا، زوي، أيدن، دانيال، وهنري. قالت ليلي إن أيدن محتال أو دانيال فارس. أعلن جاكسون: \"فيكتوريا فارس إذا وفقط إذا كان دانيال فارس\". ذكرت فيكتوريا: \"زوي فارس أو هنري فارس\". سُمعت زوي تقول: \"زوي فارس وهنري فارس\". سُمِعَ أيدن يقول: \"ليلي ليست محتالة\". في كلمات دانيال: \"ليلي فارس إذا وفقط إذا كان دانيال فارس\". علق هنري: \"ليلي ليست فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي فارس  \n(2) جاكسون محتال  \n(3) فيكتوريا محتالة  \n(4) زوي محتالة  \n(5) أيدن فارس  \n(6) دانيال فارس  \n(7) هنري محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: آفا، صوفيا، إليزابيث، أفري، إيزابيلا، كلوي، ويوسف. قالت آفا: \"أفري فارس إذا وفقط إذا كان يوسف محتالاً\". صرحت صوفيا، \"إليزابيث ليست محتالة\". وفقاً لإليزابيث، \"أفري ليست محتالة\". في كلمات أفري: \"إذا كان يوسف فارساً، فإن صوفيا فارس\". أعلنت إيزابيلا، \"كلوي محتالة أو آفا فارس\". سُمعت كلوي تقول، \"إذا كانت صوفيا فارساً، فإن أفري محتالة\". أشار يوسف، \"كلوي محتالة إذا وفقط إذا كانت إليزابيث محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا فارس  \n(2) صوفيا فارس  \n(3) إليزابيث فارس  \n(4) أفري فارس  \n(5) إيزابيلا فارس  \n(6) كلوي محتالة  \n(7) يوسف محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: أفري، آريا، بنيامين، يوسف، فيكتوريا، إسكندر، وإميلي. أفري أخبرك أن يوسف محتال. في تصريح آريا: \"إذا كانت إميلي محتالة، فإن فيكتوريا فارس\". في كلمات بنيامين: \"آريا ليست فارسة\". يوسف علق، \"إميلي محتالة أو أفري فارس\". \"إذا كان إسكندر فارساً، فإن أفري فارس\"، أعلنت فيكتوريا. قال إسكندر، \"فيكتوريا فارسة إذا وفقط إذا كانت أفري فارسة.\" قالت إميلي، \"بنيامين محتال.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري محتالة  \n(2) آريا محتالة  \n(3) بنيامين فارس  \n(4) يوسف فارس  \n(5) فيكتوريا محتالة  \n(6) إسكندر فارس  \n(7) إميلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: صوفيا، جاكسون، بينيلوب، إيزابيلا، أفري، ليلي، وهاربر. علقت صوفيا، \"إيزابيلا فارس إذا وفقط إذا كانت ليلي فارساً\". أكد جاكسون: \"صوفيا محتالة أو هاربر محتالة\". أكدت بينيلوب: \"جاكسون محتال وهاربر محتالة\". كما قالت إيزابيلا، \"صوفيا محتالة إذا وفقط إذا كان جاكسون محتالاً\". عبرت أفري عن أن صوفيا فارس. أكدت ليلي: \"إذا كانت إيزابيلا محتالة، فإن إيزابيلا فارس\". قالت هاربر، \"إذا كان جاكسون فارساً، فإن ليلي فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) جاكسون محتال  \n(3) بينيلوب محتالة  \n(4) إيزابيلا محتالة  \n(5) أفري فارس  \n(6) ليلي محتالة  \n(7) هاربر فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: أفري، لوك، هاربر، إليزابيث، شارلوت، آريا، ولوغان. أخبرتك أفري أنه إذا كانت آريا محتالة، فإن إليزابيث محتالة. قال لوك: \"هاربر محتال وآريا محتالة\". أعلنت هاربر: \"إذا كان لوك فارسًا، فإن إليزابيث محتالة\". أخبرتك إليزابيث أن لوغان ليس محتالًا. علقت شارلوت: \"إذا كان لوك محتالًا، فإن أفري فارس\". أخبرت آريا أنك إليزابيث فارس. قال لوغان: \"شارلوت ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري فارس  \n(2) لوك محتال  \n(3) هاربر فارس  \n(4) إليزابيث فارس  \n(5) شارلوت فارس  \n(6) آريا فارس  \n(7) لوغان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: إميلي، إيما، صوفيا، هاربر، ليلي، آريا، وجاكسون. وفقاً لإميلي، \"ليلي محتالة أو إميلي فارس\". في تصريح من إيما: \"إميلي ليست فارساً\". صوفيا لاحظت، \"إميلي محتالة وإيما فارس\". هاربر علق، \"جاكسون فارس أو آريا فارس\". ليلي أكدت: \"إيما ليست محتالة\". كما قالت آريا، \"هاربر محتال إذا وفقط إذا كان هاربر فارساً\". في كلمات جاكسون: \"إذا كانت إميلي محتالة، فإن هاربر محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي فارس  \n(2) إيما محتالة  \n(3) صوفيا محتالة  \n(4) هاربر فارس  \n(5) ليلي محتالة  \n(6) آريا محتالة  \n(7) جاكسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: إليزابيث، ليلي، صوفيا، أوين، جاك، إسكندر، وأورورا. كما قالت إليزابيث: \"ليلي ليست محتالة\". قالت ليلي: \"أورورا فارس.\" قالت صوفيا: \"جاك فارس وأورورا فارس.\" أخبرك أوين أن أورورا فارس إذا وفقط إذا كان إسكندر فارس. بكلمات جاك: \"صوفيا فارس وإسكندر فارس\". أخبرك إسكندر أنه إذا كان أوين فارسًا فإن إليزابيث محتالة. كما قالت أورورا: \"إذا كان جاك محتالًا فإن أوين فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث محتالة  \n(2) ليلي محتالة  \n(3) صوفيا محتالة  \n(4) أوين محتال  \n(5) جاك محتال  \n(6) إسكندر فارس  \n(7) أورورا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: ليلي، جيمس، بينيلوب، إيزابيلا، سباستيان، جاكسون، وإليزابيث. قالت ليلي: \"إذا كان جيمس محتالًا، فإن إيزابيلا فارس\". أكد جيمس: \"إيزابيلا محتالة إذا وفقط إذا كان جاكسون فارسًا\". وفقًا لبينيلوب، \"إيزابيلا فارس إذا وفقط إذا كان جيمس محتالًا\". في كلمات إيزابيلا: \"جاكسون ليس فارسًا\". كما قال سباستيان: \"إليزابيث ليست محتالة\". في كلمات جاكسون: \"إذا كانت بينيلوب فارسًا، فإن سباستيان محتال\". عبرت إليزابيث عن أن إيزابيلا محتالة إذا وفقط إذا كانت إليزابيث فارسًا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي فارس  \n(2) جيمس فارس  \n(3) بينيلوب فارس  \n(4) إيزابيلا محتالة  \n(5) سباستيان محتال  \n(6) جاكسون فارس  \n(7) إليزابيث محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: لوغان، لوكاس، ويليام، أبيجيل، ليام، إيثان، وأميليا. في تصريح لوغان: \"ليام ليس محتالًا\". في كلمات لوكاس: \"ليام فارس إذا وفقط إذا كان لوغان فارسًا\". ويليام قال إن ويليام فارس أو لوكاس فارس. أبيجيل أخبرتك أن أميليا فارس وإيثان فارس. ليام أشار، \"إيثان ليس فارسًا\". إيثان أشار، \"لوغان فارس إذا وفقط إذا كان إيثان فارسًا\". \"ليام محتال أو لوغان فارس\"، أعلنت أميليا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان فارس  \n(2) لوكاس فارس  \n(3) ويليام فارس  \n(4) أبيجيل محتالة  \n(5) ليام فارس  \n(6) إيثان محتال  \n(7) أميليا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: أفري، إيما، إيثان، صموئيل، هاربر، إيزابيلا، وإسكندر. وفقًا لأفري، \"إسكندر محتال إذا وفقط إذا كانت إيزابيلا محتالة\". علق إيما، \"أفري ليست فارسًا\". بكلمات إيثان: \"هاربر محتالة أو إيما فارس\". علق صموئيل، \"إسكندر محتال أو أفري فارس\". أكدت هاربر: \"إسكندر فارس أو إيما محتالة\". سُمعت إيزابيلا تقول، \"إيثان ليس محتالًا\". أشار إسكندر، \"إيزابيلا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري فارس  \n(2) إيما محتالة  \n(3) إيثان محتال  \n(4) صموئيل فارس  \n(5) هاربر فارس  \n(6) إيزابيلا محتالة  \n(7) إسكندر محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: أفري، أوليفيا، أميليا، آفا، آريا، سكارليت، وبنيامين. قالت أفري: \"إذا كانت آفا محتالة، فإن أفري فارس.\" علقت أوليفيا: \"أميليا ليست فارسة\". أخبرتك أميليا أنه إذا كانت آريا فارسة، فإن بنيامين محتال. أخبرتك آفا أن آريا ليست فارسة. وفقًا لآريا، \"أوليفيا فارسة أو أميليا محتالة\". قالت سكارليت إن بنيامين محتال إذا وفقط إذا كانت آريا فارسة. سمع بنيامين يقول: \"أوليفيا محتالة وأفري فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أفري فارس  \n(2) أوليفيا محتالة  \n(3) أميليا فارس  \n(4) آفا فارس  \n(5) آريا محتالة  \n(6) سكارليت فارس  \n(7) بنيامين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: مايكل، إسكندر، آفا، لوك، لوكاس، جيمس، وإيلا. قال مايكل إن لوكاس محتال وإن لوكاس فارس. \"آفا فارس وجيمس محتال\" - إسكندر. \"لوك فارس إذا وفقط إذا كانت إيلا محتالة\"، ادعت آفا. \"لوكاس محتال ومايكل فارس\"، ذكر لوك. \"مايكل فارس\"، ذكر لوكاس. أشار جيمس، \"إذا كانت إيلا فارس، فإن جيمس فارس\". وفقًا لإيلا، \"جيمس فارس أو آفا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل محتال  \n(2) إسكندر محتال  \n(3) آفا فارس  \n(4) لوك محتال  \n(5) لوكاس محتال  \n(6) جيمس فارس  \n(7) إيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: دانيال، جاكسون، أيدن، أبيجيل، سكارليت، لوغان، وإيلا. سمع دانيال يقول: \"إيلا محتالة ولوغان محتال\". في كلمات جاكسون: \"إذا كان أيدن محتالًا، فإن إيلا محتالة\". سمع أيدن يقول: \"أيدن فارس إذا وفقط إذا كان لوغان محتالًا\". لاحظت أبيجيل: \"لوغان ليس محتالًا\". قالت سكارليت إن إيلا محتالة. \"جاكسون فارس أو دانيال فارس\"، ادعى لوغان. \"إذا كان دانيال فارسًا، فإن جاكسون فارس\"، أعلنت إيلا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال محتال  \n(2) جاكسون محتال  \n(3) أيدن محتال  \n(4) أبيجيل محتالة  \n(5) سكارليت محتالة  \n(6) لوغان محتال  \n(7) إيلا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: إيفلين، إسكندر، صوفيا، هنري، يعقوب، إيثان، وآريا. أخبرتك إيفلين أن آريا محتالة إذا وفقط إذا كان إسكندر محتالًا. كما قال إسكندر: \"إيثان ليس محتالًا\". صوفيا عبرت عن أن آريا محتالة أو هنري فارس. في تصريح لهنري: \"صوفيا ليست فارسة\". في تصريح ليعقوب: \"آريا فارسة وصوفيا فارسة\". إيثان عبر عن أن هنري فارس ويعقوب فارس. في كلمات آريا: \"يعقوب ليس محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين فارس  \n(2) إسكندر محتال  \n(3) صوفيا فارس  \n(4) هنري محتال  \n(5) يعقوب محتال  \n(6) إيثان محتال  \n(7) آريا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: إليزابيث، سكارليت، أميليا، آريا، يعقوب، لوغان، ونوح. قالت إليزابيث إن سكارليت محتالة. \"إذا كان نوح محتالًا، فإن أميليا فارس\" - سكارليت. قالت أميليا إن آريا ليست محتالة. قالت آريا: \"إليزابيث فارس وآريا فارس.\" قال يعقوب: \"إليزابيث محتالة إذا وفقط إذا كانت إليزابيث فارسًا.\" في تصريح من لوغان: \"يعقوب ليس فارسًا\". قال نوح: \"لوغان محتال.\" إذن، من هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث فارس  \n(2) سكارليت محتالة  \n(3) أميليا محتالة  \n(4) آريا محتالة  \n(5) يعقوب محتال  \n(6) لوغان فارس  \n(7) نوح محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: ليلي، داوود، لوغان، نوح، بينيلوب، بنيامين، وصوفيا. في تصريح ليلي: \"داوود فارس\". علق داوود، \"لوغان فارس أو صوفيا محتالة\". في كلمات لوغان: \"صوفيا فارسة وليلي محتالة\". قال نوح، \"ليلي فارسة وبنيامين فارس\". وفقاً لبينيلوب، \"إذا كان نوح فارساً فإن صوفيا محتالة\". \"نوح ليس محتالاً\" - بنيامين. علق صوفيا، \"إذا كانت بينيلوب فارسة فإن بنيامين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي فارس  \n(2) داوود فارس  \n(3) لوغان محتار  \n(4) نوح محتال  \n(5) بينيلوب فارس  \n(6) بنيامين محتال  \n(7) صوفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: نوح، صموئيل، إيفلين، لوك، لوكاس، جاكسون، ومايسون. أكد نوح: \"إيفلين فارس\". في كلمات صموئيل: \"لوكاس ليس فارسًا\". كما قالت إيفلين: \"جاكسون فارس أو مايسون فارس\". \"إذا كان جاكسون محتالًا، فإن صموئيل فارس\"، ادعى لوك. لوكاس أشار، \"نوح ليس محتالًا\". سمع جاكسون يقول، \"إيفلين فارس أو إيفلين محتالة\". \"صموئيل فارس\"، أعلن مايسون. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح فارس  \n(2) صموئيل محتال  \n(3) إيفلين فارس  \n(4) لوك فارس  \n(5) لوكاس فارس  \n(6) جاكسون فارس  \n(7) مايسون محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: إيزابيلا، دانيال، صوفيا، سكارليت، يوسف، إيما، وفيكتوريا. علقت إيزابيلا، \"دانيال ليس فارسًا\". علق دانيال، \"إيزابيلا محتالة وفيكتوريا فارسة\". علقت صوفيا، \"إيزابيلا محتالة أو إيما فارسة\". قالت سكارليت إن إيما فارسة أو صوفيا فارسة. قال يوسف إنه إذا كانت فيكتوريا محتالة، فإن صوفيا فارسة. أكدت إيما: \"فيكتوريا محتالة أو سكارليت محتالة\". علقت فيكتوريا، \"يوسف محتال إذا وفقط إذا كانت صوفيا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيزابيلا فارس  \n(2) دانيال محتال  \n(3) صوفيا فارس  \n(4) سكارليت فارس  \n(5) يوسف فارس  \n(6) إيما فارس  \n(7) فيكتوريا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: زوي، يعقوب، إيلا، كلوي، إيثان، لوك، وليلي. \"كلوي فارس أو كلوي محتال\"، ادعت زوي. علق يعقوب، \"إيثان محتال\". قالت إيلا إن يعقوب فارس وليلي فارس. \"ليلي ليست فارسًا\"، ادعت كلوي. علق إيثان، \"كلوي ليست فارسًا\". \"إيلا ليست فارسًا\"، ادعى لوك. لاحظت ليلي، \"لوك فارس وزوي محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) زوي فارس  \n(2) يعقوب فارس  \n(3) إيلا محتالة  \n(4) كلوي فارس  \n(5) إيثان محتال  \n(6) لوك فارس  \n(7) ليلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: جاكسون، ميا، أبيجيل، بنيامين، هاربر، أوليفر، وإيميلي. قال جاكسون: \"هاربر فارس إذا وفقط إذا كان جاكسون فارسًا.\" وفقًا لميا، \"هاربر محتال أو إيميلي فارس.\" \"جاكسون محتال\"، ادعت أبيجيل. قال بنيامين إن جاكسون فارس وجاكسون محتال. في كلمات هاربر: \"جاكسون ليس محتالًا.\" \"إذا كانت أبيجيل محتالة، فإن ميا محتالة\"، ذكر أوليفر. عبرت إيميلي عن أن بنيامين فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون فارس  \n(2) ميا محتالة  \n(3) أبيجيل محتالة  \n(4) بنيامين محتال  \n(5) هاربر فارس  \n(6) أوليفر فارس  \n(7) إميلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بـ 7 سكان: لوكاس، سباستيان، بنيامين، يعقوب، إيما، ليلي، ومايكل. في تصريح من لوكاس: \"ليلي محتالة أو مايكل محتال\". سمع سباستيان يقول: \"إذا كان لوكاس فارساً، فإن ليلي محتالة\". أخبرك بنيامين أن لوكاس فارس أو بنيامين فارس. صرح يعقوب: \"مايكل ليس محتالاً\". سمع إيما تقول: \"يعقوب فارس إذا وفقط إذا كانت ليلي فارسة\". \"إيما ليست فارسة\"، أعلنت ليلي. عبر مايكل عن أن إيما ليست محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس فارس  \n(2) سباستيان محتال  \n(3) بنيامين فارس  \n(4) يعقوب محتال  \n(5) إيما محتالة  \n(6) ليلي فارس  \n(7) مايكل محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: يوسف، ليلي، إيما، هاربر، كلوي، إيثان، ولوغان. أكد يوسف: \"هاربر فارس وهاربر محتال\". في تصريح ليلي: \"هاربر فارس\". \"يوسف ليس محتالًا\"، أعلنت إيما. في كلمات هاربر: \"كلوي فارس\". لاحظت كلوي، \"إذا كانت ليلي محتالة، فإن إيما محتالة\". في تصريح إيثان: \"يوسف فارس ولوغان محتال\". قال لوغان إن إيثان محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف محتال  \n(2) ليلي فارس  \n(3) إيما محتالة  \n(4) هاربر فارس  \n(5) كلوي فارس  \n(6) إيثان محتال  \n(7) لوغان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: أيدن، يوسف، غريس، أورورا، صوفيا، كلوي، وليام. قال أيدن إن وليام محتال إذا وفقط إذا كان يوسف محتالًا. \"إذا كانت غريس محتالة، فإن وليام محتال\"، ذكر يوسف. وفقًا لغريس، \"صوفيا محتالة\". قالت أورورا إنه إذا كان أيدن محتالًا، فإن غريس فارس. أكدت صوفيا: \"كلوي محتالة إذا وفقط إذا كان أيدن فارسًا\". \"غريس ليست فارسًا\"، ذكرت كلوي. وفقًا لوليام، \"أورورا ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن محتال  \n(2) يوسف فارس  \n(3) غريس محتالة  \n(4) أورورا محتالة  \n(5) صوفيا فارس  \n(6) كلوي فارس  \n(7) ليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بـ 7 سكان: جيمس، يوسف، إيلا، مايسون، دانيال، أوليفيا، وصوفيا. قال جيمس: \"صوفيا ليست فارسة\". قال يوسف إن مايسون ليس محتالًا. في تصريح من إيلا: \"صوفيا محتالة إذا وفقط إذا كان جيمس فارسًا\". أكد مايسون: \"أوليفيا فارسة\". عبر دانيال عن أن مايسون محتال إذا وفقط إذا كانت إيلا محتالة. سُمعت أوليفيا تقول: \"يوسف فارس أو إيلا فارسة\". سُمعت صوفيا تقول: \"مايسون فارس إذا وفقط إذا كان مايسون محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس فارس  \n(2) يوسف فارس  \n(3) إيلا فارس  \n(4) مايسون فارس  \n(5) دانيال فارس  \n(6) أوليفيا فارس  \n(7) صوفيا محتالة"
    }
]