[
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: إيثان، أبيجيل، داوود، ونوح. أشار إيثان: \"داوود محتال أو أبيجيل محتالة\". سُمعت أبيجيل تقول: \"إذا كانت أبيجيل فارسة، فإن داوود فارس\". \"نوح فارس وإيثان محتال\" - داوود. علق نوح: \"أبيجيل محتالة إذا وفقط إذا كان إيثان فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان محتال  \n(2) أبيجيل فارس  \n(3) داوود فارس  \n(4) نوح فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: إليزابيث، صوفيا، مايسون، وأبيجيل. قالت إليزابيث: \"أبيجيل محتالة ومايسون محتال\". وفي كلمات صوفيا: \"إذا كانت أبيجيل محتالة، فإن أبيجيل فارس\". أعلن مايسون: \"مايسون فارس وأبيجيل فارس\". ذكرت أبيجيل: \"مايسون فارس وأبيجيل فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث فارس  \n(2) صوفيا محتالة  \n(3) مايسون محتال  \n(4) أبيجيل محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: لوكاس، هاربر، أميليا، وإميلي. كما قال لوكاس: \"لوكاس فارس أو هاربر فارس\". \"لوكاس فارس أو لوكاس محتال\"، أعلنت هاربر. أميليا أكدت: \"لوكاس فارس وهاربر محتال\". في تصريح لإميلي: \"إذا كانت هاربر محتالاً، فإن أميليا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس فارس  \n(2) هاربر فارس  \n(3) أميليا محتالة  \n(4) إميلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: يوسف، صوفيا، ويليام، وكلوي. \"إذا كان يوسف فارساً، فإن ويليام فارس\"، ادعى يوسف. وفي كلمات صوفيا: \"يوسف فارس أو كلوي فارس\". في تصريح ويليام: \"يوسف ليس محتالاً\". وقد سمع كلوي تقول: \"ويليام ليس محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف فارس  \n(2) صوفيا فارس  \n(3) ويليام فارس  \n(4) كلوي فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: سكارليت، هاربر، هنري، وإسكندر. وفقاً لسكارليت، \"إسكندر هو محتال إذا وفقط إذا كان إسكندر فارساً\". سمع هاربر يقول، \"إذا كانت سكارليت فارساً، فإن هاربر فارس\". علق هنري، \"هاربر فارس أو إسكندر محتال\". \"هنري ليس محتالاً\"، ذكر إسكندر. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سكارليت محتالة  \n(2) هاربر فارس  \n(3) هنري فارس  \n(4) إسكندر فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: رايلي، أوين، أوليفر، وأميليا. قالت رايلي إن أميليا ليست محتالة. أخبرك أوين أن أوليفر محتال أو أميليا محتالة. كما قال أوليفر: \"رايلي فارس وأميليا محتالة\". عبرت أميليا عن أن أوليفر فارس وأميليا فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) رايلي محتالة  \n(2) أوين فارس  \n(3) أوليفر محتال  \n(4) أميليا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: إميلي، إليزابيث، يوسف، وليام. قالت إميلي: \"ليام ليس محتالًا.\" علقت إليزابيث: \"إذا كانت إميلي محتالة، فإن يوسف فارس.\" قال يوسف: \"إذا كان ليام محتالًا، فإن إليزابيث محتالة.\" أكد ليام: \"يوسف فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي فارس  \n(2) إليزابيث فارس  \n(3) يوسف فارس  \n(4) ليام فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: هاربر، أبيجيل، آفا، وإيثان. في كلمات هاربر: \"إذا كانت آفا محتالة، فإن أبيجيل فارس\". أبيجيل علقت، \"آفا محتالة\". آفا أخبرتك أنه إذا كانت آفا فارسة، فإن هاربر فارس. سمع إيثان يقول، \"آفا ليست فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر فارس  \n(2) أبيجيل محتالة  \n(3) آفا فارس  \n(4) إيثان محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: أيدن، مايسون، زوي، وإسكندر. أيدن قال: \"إسكندر ليس فارساً\". مايسون علق: \"أيدن فارس أو إسكندر فارس\". زوي قالت: \"أيدن فارس أو مايسون فارس\". إسكندر عبر عن أن زوي محتالة أو زوي فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن محتال  \n(2) مايسون فارس  \n(3) زوي فارس  \n(4) إسكندر فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: جاكسون، فيكتوريا، يوسف، وإيثان. كما قال جاكسون، \"إيثان فارس\". قالت فيكتوريا إن إيثان محتال وجاكسون محتال. علق يوسف، \"جاكسون محتال إذا وفقط إذا كان إيثان محتال\". علق إيثان، \"فيكتوريا فارس أو يوسف فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون فارس  \n(2) فيكتوريا محتالة  \n(3) يوسف فارس  \n(4) إيثان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: ليلي، ليام، بينيلوب، وشارلوت. \"ليام محتال وليام فارس\"، أعلنت ليلي. أعرب ليام عن أنه إذا كان ليام فارساً، فإن شارلوت محتالة. وفقاً لبينيلوب، \"ليام محتال\". قالت شارلوت، \"ليام محتال أو شارلوت فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي محتالة  \n(2) ليام فارس  \n(3) بينيلوب محتالة  \n(4) شارلوت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: سباستيان، صموئيل، رايلي، ولوغان. كما قال سباستيان: \"صموئيل فارس ولوغان محتال\". في تصريح لصموئيل: \"سباستيان فارس إذا وفقط إذا كان صموئيل فارس\". أكد رايلي: \"إذا كان لوغان فارس، فإن رايلي فارس\". أكد لوغان: \"رايلي محتال أو سباستيان محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سباستيان فارس  \n(2) صموئيل فارس  \n(3) رايلي فارس  \n(4) لوغان محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: يوسف، هاربر، يعقوب، وليلي. قال يوسف: \"ليلي محتالة.\" سمع هاربر يقول: \"ليلي محتالة.\" \"ليلي محتالة ويعقوب فارس\" - يعقوب. قالت ليلي: \"هاربر فارس أو يعقوب محتال.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يوسف محتال  \n(2) هاربر محتالة  \n(3) يعقوب محتال  \n(4) ليلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: جيمس، آفا، لوغان، وإسكندر. جيمس أعرب عن أن إسكندر فارس إذا وفقط إذا كانت آفا محتالة. سُمِعَت آفا تقول: \"لوغان فارس إذا وفقط إذا كان إسكندر فارس\". لوغان أخبرك أن لوغان فارس إذا وفقط إذا كان جيمس محتالًا. إسكندر أشار إلى أنه \"إذا كان لوغان محتالًا، فإن إسكندر فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس محتال  \n(2) آفا فارس  \n(3) لوغان فارس  \n(4) إسكندر فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: أوين، ماثيو، إيفلين، وويليام. \"ماثيو فارس\"، أعلن أوين. قال ماثيو إن ويليام محتال وإيفلين محتالة. عبرت إيفلين عن أنه إذا كانت إيفلين فارسة، فإن أوين محتال. أكد ويليام: \"ماثيو فارس إذا وفقط إذا كانت إيفلين فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين محتال  \n(2) ماثيو محتال  \n(3) إيفلين فارس  \n(4) ويليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: إيلا، شارلوت، زوي، وصموئيل. في كلمات إيلا: \"زوي فارس وصموئيل فارس\". أكدت شارلوت: \"إيلا محتالة أو زوي فارس\". سُمعت زوي تقول: \"إذا كانت شارلوت محتالة، فإن إيلا فارس\". قال صموئيل إن زوي محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا محتالة  \n(2) شارلوت فارسة  \n(3) زوي فارسة  \n(4) صموئيل محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: إليزابيث، كلوي، بنيامين، وليام. علقت إليزابيث، \"كلوي محتالة وبنيامين فارس\". لاحظت كلوي، \"إليزابيث فارس إذا وفقط إذا كان وليام محتالاً\". في كلمات بنيامين: \"وليام محتال أو كلوي محتالة\". في كلمات وليام: \"وليام فارس وبنيامين محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث محتالة  \n(2) كلوي فارسة  \n(3) بنيامين محتال  \n(4) ليام فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: دانيال، لوكاس، كلوي، وإسكندر. \"إسكندر فارس\" - دانيال. لاحظ لوكاس، \"إسكندر فارس\". \"دانيال فارس وإسكندر محتال\" - كلوي. أخبرك إسكندر أن كلوي فارس وإسكندر فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال محتال  \n(2) لوكاس محتال  \n(3) كلوي محتالة  \n(4) إسكندر محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: بينيلوب، ماثيو، بنيامين، وسباستيان. قالت بينيلوب: \"إذا كان سباستيان محتالاً، فإن بينيلوب فارس.\" قال ماثيو: \"إذا كان ماثيو فارساً، فإن بنيامين محتال.\" علق بنيامين: \"بينيلوب محتالة إذا وفقط إذا كان سباستيان فارساً.\" قال سباستيان: \"بينيلوب فارس أو ماثيو فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب فارس  \n(2) ماثيو فارس  \n(3) بنيامين محتال  \n(4) سباستيان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: جيمس، إيثان، صموئيل، وإميلي. \"إميلي ليست فارسًا\" - جيمس. قال إيثان إن إميلي محتالة. صرح صموئيل، \"إيثان فارس وإميلي فارس\". سُمعت إميلي تقول، \"صموئيل فارس أو صموئيل محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس محتال  \n(2) إيثان محتال  \n(3) صموئيل محتال  \n(4) إميلي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: داوود، مايسون، صموئيل، ودانيال. \"إذا كان مايسون فارساً، فإن صموئيل محتال\"، أعلن داوود. \"مايسون فارس إذا وفقط إذا كان داوود محتالاً\"، أعلن مايسون. علق صموئيل، \"دانيال فارس أو داوود محتال\". عبر دانيال عن أن داوود فارس وصموئيل محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود محتال  \n(2) مايسون فارس  \n(3) صموئيل فارس  \n(4) دانيال محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: إميلي، أبيجيل، هاربر، وجيمس. سُمعت إميلي تقول: \"إذا كان جيمس فارسًا، فإن جيمس محتال\". علق أبيجيل: \"جيمس محتال\". قال هاربر: \"إميلي محتالة إذا وفقط إذا كان هاربر فارسًا\". \"إذا كان هاربر فارسًا، فإن أبيجيل فارس\" - جيمس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي محتالة  \n(2) أبيجيل محتالة  \n(3) هاربر محتالة  \n(4) جيمس فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: لوكاس، صوفيا، صوفيا، ومايكل. قال لوكاس: \"إذا كانت صوفيا فارساً، فإن صوفيا محتالة\". أكدت صوفيا: \"لوكاس فارس وصوفيا فارس\". قالت صوفيا: \"إذا كانت صوفيا محتالة، فإن مايكل محتال\". قال مايكل: \"إذا كانت صوفيا محتالة، فإن صوفيا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس فارس  \n(2) صوفيا محتالة  \n(3) صوفيا محتالة  \n(4) مايكل فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: ميا، إيفلين، صوفيا، وشارلوت. قالت ميا: \"صوفيا محتالة أو شارلوت محتالة\". علق إيفلين: \"ميا محتالة أو ميا فارسة\". في تصريح لصوفيا: \"إذا كانت إيفلين فارسة، فإن شارلوت محتالة\". قالت شارلوت: \"ميا ليست فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا فارس  \n(2) إيفلين فارس  \n(3) صوفيا فارس  \n(4) شارلوت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: غريس، نوح، أوليفر، وشارلوت. أكدت غريس: \"أوليفر محتال وشارلوت فارس\". علق نوح، \"أوليفر فارس\". أخبرك أوليفر أن شارلوت محتالة إذا وفقط إذا كانت شارلوت فارس. صرحت شارلوت، \"أوليفر محتال أو غريس محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) غريس فارس  \n(2) نوح محتال  \n(3) أوليفر محتال  \n(4) شارلوت فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: جيمس، أفري، إليزابيث، وسباستيان. علق جيمس قائلاً: \"سباستيان ليس محتالًا\". قال أفري: \"جيمس فارس أو إليزابيث فارس\". قالت إليزابيث: \"إليزابيث فارس\". سمع سباستيان يقول: \"إذا كانت إليزابيث فارسًا، فإن جيمس محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس فارس  \n(2) أفري فارس  \n(3) إليزابيث محتالة  \n(4) سباستيان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: غريس، إيثان، هاربر، وليام. في تصريح من غريس: \"إيثان محتال أو ليام محتال\". كما قال إيثان: \"غريس ليست محتالة\". كما قال هاربر: \"إذا كانت غريس محتالة، فإن هاربر فارس\". وفقاً لوليام، \"وليام فارس وهاربر فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) غريس فارس  \n(2) إيثان فارس  \n(3) هاربر فارس  \n(4) ليام محتار"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: إيفلين، آريا، إليزابيث، وإميلي. وفقاً لإيفلين، \"إليزابيث ليست فارساً\". \"إميلي ليست فارساً\"، ادعت آريا. \"آريا محتالة وآريا فارس\"، أعلنت إليزابيث. \"إليزابيث محتالة\"، أعلنت إميلي. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين فارس  \n(2) آريا محتالة  \n(3) إليزابيث محتالة  \n(4) إميلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: بنيامين، آفا، نوح، وسكارليت. في كلمات بنيامين: \"سكارليت محتالة\". قالت آفا: \"سكارليت محتالة وبنيامين فارس\". قال نوح إن نوح فارس إذا وفقط إذا كانت سكارليت فارسة. علق سكارليت: \"نوح محتال أو آفا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين محتال  \n(2) آفا محتالة  \n(3) نوح محتال  \n(4) سكارليت فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: مايسون، إيزابيلا، إميلي، وفيكتوريا. أخبرك مايسون أن إيزابيلا ليست فارسًا. في تصريح لإيزابيلا: \"إذا كانت فيكتوريا محتالة، فإن فيكتوريا فارس.\" علقت إميلي، \"مايسون ليس محتالًا.\" قالت فيكتوريا، \"إيزابيلا محتالة أو إميلي محتالة.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايسون محتال  \n(2) إيزابيلا فارس  \n(3) إميلي محتالة  \n(4) فيكتوريا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: إيلا، ليام، رايلي، وليلي. \"ليام محتال\"، أعلنت إيلا. أخبرك ليام أن إيلا فارس ورايلي محتال. وفقًا لرايلي، \"ليام فارس أو إيلا فارس\". وفقًا لليلي، \"إيلا فارس إذا وفقط إذا كان ليام محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا فارس  \n(2) ليام محتال  \n(3) رايلي فارس  \n(4) ليلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: بنيامين، نوح، إيزابيلا، وصوفيا. قال بنيامين: \"إذا كانت صوفيا فارسة، فإن إيزابيلا فارسة\". سمع نوح يقول: \"صوفيا ليست محتالة\". ذكرت إيزابيلا: \"بنيامين محتال\". أعلنت صوفيا: \"إيزابيلا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين فارس  \n(2) نوح محتال  \n(3) إيزابيلا محتالة  \n(4) صوفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: مايكل، رايلي، ماثيو، وميا. \"إذا كانت رايلي فارسة، فإن مايكل فارس\"، أعلن مايكل. في كلمات رايلي: \"ماثيو فارس ورايلي فارسة\". \"إذا كانت رايلي فارسة، فإن رايلي محتالة\"، ادعى ماثيو. سُمعت ميا تقول: \"ماثيو فارس أو ميا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل فارس  \n(2) رايلي محتالة  \n(3) ماثيو فارس  \n(4) ميا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: جيمس، لوك، أورورا، وسكارليت. علق جيمس، \"لوك محتال وأورورا محتالة\". أشار لوك، \"جيمس ليس محتالًا\". أخبرتك أورورا أن جيمس محتال إذا وفقط إذا كان لوك محتالًا. أخبرتك سكارليت أن لوك محتال أو سكارليت فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس محتال  \n(2) لوك محتال  \n(3) أورورا فارس  \n(4) سكارليت فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: أيدن، ميا، إليزابيث، وسباستيان. \"ميا فارس\" - أيدن. \"أيدن فارس أو سباستيان محتـال\" ، ادعت ميا. سُمعت إليزابيث تقول، \"أيدن فارس إذا وفقط إذا كانت ميا فارس\". سُمِعَ سباستيان يقول، \"ميا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن فارس  \n(2) ميا فارس  \n(3) إليزابيث فارس  \n(4) سباستيان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: يعقوب، ليام، إميلي، وصوفيا. ادعى يعقوب: \"صوفيا محتالة أو ليام فارس\". قال ليام: \"إميلي فارسة أو يعقوب فارس\". لاحظت إميلي: \"صوفيا فارسة أو صوفيا محتالة\". أعلنت صوفيا: \"إميلي فارسة أو إميلي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب فارس  \n(2) ليام فارس  \n(3) إميلي فارس  \n(4) صوفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: لوغان، إيلا، إيزابيلا، وأوين. قال لوغان: \"أوين محتال وإيزابيلا فارس\". لاحظت إيلا: \"إيزابيلا محتالة\". سُمعت إيزابيلا تقول: \"لوغان محتال أو إيلا فارس\". لاحظ أوين: \"أوين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان محتال  \n(2) إيلا محتالة  \n(3) إيزابيلا فارسة  \n(4) أوين فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: لوكاس، أوليفيا، آريا، وشارلوت. أكد لوكاس: \"أوليفيا فارس إذا وفقط إذا كانت آريا محتالة\". وفي كلمات أوليفيا: \"شارلوت فارس إذا وفقط إذا كانت آريا فارس\". ادعت آريا: \"لوكاس محتال وأوليفيا محتالة\". علقّت شارلوت: \"أوليفيا محتالة أو لوكاس محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس فارس  \n(2) أوليفيا فارس  \n(3) آريا محتالة  \n(4) شارلوت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: مايسون، أورورا، بينيلوب، ولوكاس. سُمع مايسون يقول، \"لوكاس فارس\". قالت أورورا إنه إذا كانت بينيلوب فارساً، فإن بينيلوب محتالة. لاحظت بينيلوب، \"مايسون محتال أو لوكاس فارس\". صرح لوكاس، \"بينيلوب فارس وأورورا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايسون محتال  \n(2) أورورا محتالة  \n(3) بينيلوب فارسة  \n(4) لوكاس محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: جيمس، ماثيو، صوفيا، وإيفلين. في تصريح لجيمس: \"ماثيو محتال أو إيفلين محتالة\". عبر ماثيو عن أن صوفيا ليست محتالة. أكدت صوفيا: \"إيفلين ليست محتالة\". في تصريح لإيفلين: \"صوفيا فارس إذا وفقط إذا كان جيمس فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس فارس  \n(2) ماثيو محتال  \n(3) صوفيا محتالة  \n(4) إيفلين محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: جاك، كلوي، ويليام، ولوك. قال جاك: \"لوك فارس\". قالت كلوي: \"جاك محتال أو ويليام فارس\". علق ويليام: \"إذا كان لوك فارسًا، فإن جاك فارس\". قال لوك: \"جاك فارس وجاك محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاك محتال  \n(2) كلوي فارس  \n(3) ويليام فارس  \n(4) لوك محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: نوح، صوفيا، إليزابيث، وإيلا. قال نوح إن صوفيا فارس. قالت صوفيا: \"نوح محتال أو إليزابيث فارس.\" \"إذا كانت إيلا محتالة، فإن صوفيا محتالة\" - إليزابيث. سُمعت إيلا تقول: \"إيلا فارس وإليزابيث فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح فارس  \n(2) صوفيا فارسة  \n(3) إليزابيث فارسة  \n(4) إيلا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: جيمس، صموئيل، هنري، ولوك. علق جيمس قائلاً: \"هنري فارس\". قال صموئيل إن لوك محتال. أخبرك هنري أن صموئيل فارس ولوك فارس. كما قال لوك: \"جيمس فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جيمس محتال  \n(2) صموئيل فارس  \n(3) هنري محتال  \n(4) لوك محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: إميلي، لوغان، سكارليت، ومايسون. قالت إميلي: \"لوغان ليس محتالاً\". سمع لوغان يقول: \"إميلي فارس أو مايسون فارس\". سمع سكارليت تقول: \"إميلي فارس إذا وفقط إذا كان مايسون فارس\". قال مايسون: \"سكارليت فارس أو لوغان فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي فارس  \n(2) لوغان فارس  \n(3) سكارليت فارس  \n(4) مايسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: فيكتوريا، سكارليت، إيفلين، ولوكاس. قالت فيكتوريا: \"لوكاس فارس وسكارليت محتالة\". علق سكارليت، \"سكارليت فارس وإيفلين محتالة\". كما قالت إيفلين، \"فيكتوريا فارس\". وفقاً للوكاس، \"إذا كان لوكاس فارساً، فإن إيفلين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) فيكتوريا فارس  \n(2) سكارليت محتالة  \n(3) إيفلين فارسة  \n(4) لوكاس فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: أوين، مايكل، إسكندر، ولوغان. \"مايكل ليس محتالاً\"، أعلن أوين. سمع مايكل يقول، \"أوين فارس وأوين محتال\". أشار إسكندر، \"مايكل محتال أو أوين فارس\". كما قال لوغان، \"مايكل محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين محتال  \n(2) مايكل محتال  \n(3) إسكندر فارس  \n(4) لوغان فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: دانيال، داوود، بنيامين، وليلي. وفقًا لدانيال، \"إذا كان بنيامين محتالًا، فإن ليلي فارس\". \"داوود فارس أو ليلي محتالة\"، ادعى داوود. علق بنيامين، \"دانيال ليس فارسًا\". أخبرتك ليلي أن داوود ليس محتالًا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال فارس  \n(2) داوود فارس  \n(3) بنيامين محتال  \n(4) ليلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: فيكتوريا، بنيامين، سباستيان، وصوفيا. قالت فيكتوريا: \"سباستيان فارس إذا وفقط إذا كان سباستيان محتالًا\". قال بنيامين إن صوفيا فارس وصوفيا محتالة. كما قال سباستيان: \"إذا كان بنيامين محتالًا، فإن فيكتوريا فارس\". سُمعت صوفيا تقول: \"بنيامين فارس أو فيكتوريا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) فيكتوريا محتالة  \n(2) بنيامين محتال  \n(3) سباستيان محتال  \n(4) صوفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: داوود، زوي، ليام، وويليام. قال داوود إن ويليام محتال إذا وفقط إذا كان ليام محتالاً. زوي صرحت، \"ويليام محتال وداوود فارس\". ليام أخبرك أن ويليام فارس إذا وفقط إذا كان ويليام محتالاً. ويليام أخبرك أن ليام محتال إذا وفقط إذا كان ليام فارساً. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود فارس  \n(2) زوي فارس  \n(3) ليام محتال  \n(4) ويليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: أيدن، سكارليت، مايكل، وميا. \"إذا كانت ميا فارسة، فإن ميا محتالة\" - أيدن. علق سكارليت، \"ميا فارسة أو سكارليت فارسة\". \"أيدن فارس أو سكارليت فارسة\" - مايكل. \"مايكل ليس محتالًا\" - ميا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن محتال  \n(2) سكارليت فارسة  \n(3) مايكل فارس  \n(4) ميا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: بنيامين، هاربر، لوك، وأوين. علق بنيامين، \"بنيامين فارس إذا وفقط إذا كان لوك محتالاً\". قالت هاربر، \"أوين ليس محتالاً.\" \"بنيامين محتال وأوين فارس\"، أعلن لوك. \"بنيامين ليس فارساً\"، ادعى أوين. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين فارس  \n(2) هاربر محتالة  \n(3) لوك محتال  \n(4) أوين محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: آفا، دانيال، هنري، وداوود. قالت آفا إن هنري محتال إذا وفقط إذا كان هنري فارسًا. قال دانيال إن آفا فارس أو آفا محتالة. \"إذا كان داوود محتالًا، فإن دانيال فارس\"، ذكر هنري. علق داوود، \"هنري ليس فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا محتالة  \n(2) دانيال فارس  \n(3) هنري فارس  \n(4) داوود محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: سباستيان، لوغان، أفري، ودانيال. قال لك سباستيان إن سباستيان فارس. سمع لوغان يقول: \"أفري محتال إذا وفقط إذا كان سباستيان محتالًا\". علق أفري قائلاً: \"إذا كان لوغان محتالًا، فإن سباستيان فارس\". عبر دانيال عن أن سباستيان محتال ودانيال فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سباستيان فارس  \n(2) لوغان فارس  \n(3) أفري فارس  \n(4) دانيال محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: ويليام، إيما، غريس، وآريا. قال ويليام: \"ويليام فارس وآريا فارس\". كما قالت إيما: \"غريس محتالة\". \"إذا كان ويليام محتالاً، فإن آريا فارس\"، ذكرت غريس. سُمعت آريا تقول: \"إذا كانت غريس فارسة، فإن ويليام محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام محتال  \n(2) إيما محتالة  \n(3) غريس فارسة  \n(4) آريا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: إيلا، أوليفر، يوسف، وآفا. قالت إيلا إن إيلا فارس وأوليفر محتال. \"إذا كان أوليفر فارسًا، فإن يوسف فارس\"، أعلن أوليفر. سُمع يوسف يقول، \"إيلا ليست فارسًا\". أخبرتك آفا أن آفا فارس أو أن إيلا محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا محتالة  \n(2) أوليفر فارس  \n(3) يوسف فارس  \n(4) آفا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: غريس، داوود، آريا، وميا. تم سماع غريس تقول: \"إذا كانت ميا محتالة، فإن آريا فارسة\". أخبرك داوود أنه إذا كان داوود فارساً، فإن غريس محتالة. أكدت آريا: \"ميا فارسة إذا وفقط إذا كان داوود فارساً\". كما قالت ميا: \"داوود ليس فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) غريس محتالة  \n(2) داوود فارس  \n(3) آريا محتالة  \n(4) ميا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: أوليفر، بينيلوب، فيكتوريا، وصموئيل. قال أوليفر إنه إذا كانت بينيلوب فارسًا، فإن صموئيل محتال. سُمعت بينيلوب تقول: \"صموئيل محتال أو بينيلوب فارس\". علقّت فيكتوريا قائلة: \"بينيلوب محتالة\". عبّر صموئيل عن أن فيكتوريا محتالة وأن بينيلوب محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفر فارس  \n(2) بينيلوب فارس  \n(3) فيكتوريا محتالة  \n(4) صموئيل محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: فيكتوريا، أفري، أبيجيل، ومايسون. كما قالت فيكتوريا: \"أبيجيل فارس\". أكد أفري: \"مايسون محتال أو أبيجيل فارس\". في بيان من أبيجيل: \"أبيجيل فارس أو فيكتوريا محتالة\". كما قال مايسون: \"فيكتوريا محتالة وأفري فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) فيكتوريا فارس  \n(2) أفري فارس  \n(3) أبيجيل فارس  \n(4) مايسون محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: إيثان، إسكندر، صوفيا، وزوي. قال إيثان: \"إسكندر محتال أو صوفيا محتالة\". علق إسكندر، \"إذا كانت زوي فارسة، فإن إسكندر فارس\". قالت صوفيا إن إيثان ليس محتالاً. علق زوي، \"إيثان محتال أو صوفيا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان فارس  \n(2) إسكندر محتال  \n(3) صوفيا فارس  \n(4) زوي فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: شارلوت، أوين، نوح، ورايلي. علقت شارلوت، \"نوح محتال\". علق أوين، \"رايلي فارس إذا وفقط إذا كانت شارلوت فارساً\". أخبرك نوح أن أوين فارس. صرحت رايلي، \"نوح محتال أو رايلي فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت محتالة  \n(2) أوين فارس  \n(3) نوح فارس  \n(4) رايلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: ميا، أفري، لوك، ونوح. قالت ميا إن أفري فارس إذا وفقط إذا كان أفري محتالًا. كما قال أفري، \"لوك فارس أو لوك محتال\". سمع لوك يقول، \"ميا فارس إذا وفقط إذا كان أفري محتالًا\". صرح نوح، \"إذا كان لوك محتالًا، فإن أفري محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا محتالة  \n(2) أفري فارسة  \n(3) لوك فارس  \n(4) نوح فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: أوليفر، إيثان، غريس، وآفا. كما قال أوليفر، \"إيثان محتال أو غريس فارس\". علق إيثان، \"غريس محتالة وغريس فارس\". \"غريس فارس وإيثان فارس\" - غريس. كما قالت آفا، \"غريس محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفر فارس  \n(2) إيثان محتال  \n(3) غريس محتالة  \n(4) آفا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: أوين، إيما، إسكندر، وأورورا. قال أوين: \"إيما فارس أو إسكندر محتال.\" أعلنت إيما: \"إذا كان إسكندر فارسًا، فإن أوين محتال.\" أخبرك إسكندر أن أورورا ليست محتالة. قالت أورورا إن إيما محتالة وإسكندر محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين فارس  \n(2) إيما فارس  \n(3) إسكندر محتال  \n(4) أورورا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: يعقوب، ماثيو، أفري، وجاكسون. في تصريح من يعقوب: \"ماثيو محتال\". \"ماثيو فارس إذا وفقط إذا كان يعقوب فارساً\"، ذكر ماثيو. وفقاً لأفري، \"يعقوب فارس أو يعقوب محتال\". جاكسون عبر عن أن يعقوب محتال وأفري محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب فارس  \n(2) ماثيو محتال  \n(3) أفري فارس  \n(4) جاكسون محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: هنري، آفا، شارلوت، ونوح. علق هنري قائلاً: \"آفا محتالة وهنري فارس\". في تصريح آفا: \"نوح ليس محتالًا\". قالت شارلوت: \"آفا ليست محتالة\". أكد نوح: \"هنري فارس أو هنري محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هنري محتال  \n(2) آفا فارس  \n(3) شارلوت فارس  \n(4) نوح فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: لوغان، أوليفيا، أيدن، وإيما. كما قال لوغان: \"أوليفيا محتالة وأيدن محتال\". أكدت أوليفيا: \"إذا كان لوغان محتالًا، فإن لوغان فارس\". أكد أيدن: \"إذا كان لوغان محتالًا، فإن أوليفيا محتالة\". قالت إيما إن أوليفيا محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان محتال  \n(2) أوليفيا محتالة  \n(3) أيدن فارس  \n(4) إيما فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: ويليام، هنري، بينيلوب، وآفا. \"إذا كانت بينيلوب فارساً، فإن بينيلوب محتالة\"، ادعى ويليام. كما قال هنري، \"ويليام ليس فارساً\". صرحت بينيلوب، \"آفا فارساً\". قالت آفا، \"ويليام فارس إذا وفقط إذا كان هنري فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام فارس  \n(2) هنري محتال  \n(3) بينيلوب محتالة  \n(4) آفا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: فيكتوريا، لوكاس، رايلي، وكلوي. علقت فيكتوريا، \"رايلي ليست فارساً\". أكد لوكاس: \"إذا كانت فيكتوريا فارساً، فإن رايلي فارس\". \"إذا كانت فيكتوريا محتالة، فإن كلوي محتالة\" - رايلي. علقت كلوي، \"لوكاس ليس فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) فيكتوريا محتالة  \n(2) لوكاس فارس  \n(3) رايلي فارس  \n(4) كلوي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: إميلي، ويليام، مايكل، وميا. وفقاً لإميلي، \"إذا كانت ميا فارساً، فإن ويليام محتال.\" \"ميا ليست فارساً\"، أعلن ويليام. قال مايكل، \"ويليام محتال.\" \"إذا كان ويليام فارساً، فإن مايكل محتال\"، ذكرت ميا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي فارس  \n(2) ويليام محتال  \n(3) مايكل فارس  \n(4) ميا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: إسكندر، صوفيا، مايسون، ويوسف. قال إسكندر: \"صوفيا ليست فارسة\". كما قالت صوفيا: \"مايسون محتـال\". كما قال مايسون: \"إذا كانت صوفيا محتالة، فإن إسكندر فارس\". علق يوسف: \"إسكندر ليس فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إسكندر فارس  \n(2) صوفيا محتالة  \n(3) مايسون فارس  \n(4) يوسف محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: ميا، صوفيا، فيكتوريا، وويليام. قالت ميا: \"صوفيا فارس أو صوفيا محتال\". سُمعت صوفيا تقول: \"إذا كانت ميا فارسًا، فإن فيكتوريا محتال\". قالت فيكتوريا: \"صوفيا محتال أو ميا فارس\". وفقًا لويليام، \"فيكتوريا محتال وصوفيا محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا فارس  \n(2) صوفيا محتالة  \n(3) فيكتوريا فارس  \n(4) ويليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: هاربر، شارلوت، صوفيا، وليام. وفقاً لهاربر، \"شارلوت فارس\". قالت شارلوت إن صوفيا فارس. \"صوفيا فارس ووليام فارس\"، ذكرت صوفيا. في بيان لوليام: \"صوفيا فارس إذا وفقط إذا كانت شارلوت محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر محتالة  \n(2) شارلوت محتالة  \n(3) صوفيا محتالة  \n(4) ليام محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: آفا، أوليفيا، ماثيو، وإيلا. قالت آفا: \"آفا فارس وماثيو محتال\". قالت أوليفيا: \"إيلا فارس أو آفا فارس\". في تصريح لماثيو: \"أوليفيا محتالة إذا وفقط إذا كان ماثيو فارس\". علقت إيلا: \"ماثيو فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا محتالة  \n(2) أوليفيا محتالة  \n(3) ماثيو محتال  \n(4) إيلا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: أوليفر، أفري، زوي، وسباستيان. قال أوليفر: \"أفري ليست محتالة\". قالت أفري: \"زوي محتالة وسباستيان محتال\". علق زوي: \"سباستيان ليس محتالًا\". علق سباستيان: \"أفري فارس وأفري محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفر فارس  \n(2) أفري فارس  \n(3) زوي محتالة  \n(4) سباستيان محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: ليلي، آفا، هنري، وأميليا. قالت ليلي إن آفا محتالة وأن ليلي فارسة. سُمعت آفا تقول: \"هنري محتال إذا وفقط إذا كانت آفا فارسة\". أخبرك هنري أن هنري فارس أو آفا محتالة. أكدت أميليا: \"هنري محتال إذا وفقط إذا كانت ليلي فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي محتالة  \n(2) آفا فارسة  \n(3) هنري محتال  \n(4) أميليا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: ماثيو، هاربر، ليلي، ولوغان. \"ليلي محتالة وهاربر فارس\"، أعلن ماثيو. وفقاً لهاربر، \"ليلي محتالة أو ليلي فارس\". أكدت ليلي: \"ماثيو فارس ولوغان فارس\". في كلمات لوغان: \"هاربر فارس وهاربر محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ماثيو فارس  \n(2) هاربر فارس  \n(3) ليلي محتالة  \n(4) لوغان محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: مايسون، ليلي، لوكاس، وهنري. سمع مايسون يقول: \"مايسون فارس ولوكاس محتال\". أعلنت ليلي: \"إذا كان مايسون محتالاً، فإن لوكاس محتال\". سمع لوكاس يقول: \"إذا كان هنري محتالاً، فإن هنري فارس\". أشار هنري: \"مايسون فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايسون محتال  \n(2) ليلي فارس  \n(3) لوكاس محتال  \n(4) هنري محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: مايكل، سباستيان، إيما، وأوين. في تصريح لمايكل: \"إيما محتالة إذا وفقط إذا كان أوين محتالًا\". قال سباستيان: \"مايكل محتال\". أعربت إيما عن أن مايكل ليس فارسًا. \"مايكل محتال إذا وفقط إذا كان أوين فارسًا\" - أوين. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل محتال  \n(2) سباستيان فارس  \n(3) إيما فارس  \n(4) أوين محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: شارلوت، ميا، فيكتوريا، ويعقوب. كما قالت شارلوت: \"ميا فارس أو يعقوب محتال\". أكدت ميا: \"شارلوت ليست فارساً\". \"يعقوب فارس\"، ادعت فيكتوريا. وفقاً ليعقوب، \"يعقوب فارس وميا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت فارس  \n(2) ميا محتالة  \n(3) فيكتوريا محتالة  \n(4) يعقوب محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: لوكاس، كلوي، رايلي، وداوود. \"رايلي فارس إذا وفقط إذا كانت كلوي محتالة\"، أعلن لوكاس. علقت كلوي، \"رايلي فارس ولوكاس محتال\". \"لوكاس محتال\"، ذكر رايلي. في كلمات داوود: \"رايلي فارس وكلوي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس محتال  \n(2) كلوي فارس  \n(3) رايلي فارس  \n(4) داوود محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: ميا، فيكتوريا، أميليا، ودانيال. \"ميا فارس إذا وفقط إذا كانت فيكتوريا محتالة\"، ادعت ميا. \"إذا كان دانيال محتالاً، فإن أميليا محتالة\"، ذكرت فيكتوريا. أميليا أكدت: \"إذا كانت ميا فارسة، فإن فيكتوريا فارسة\". \"دانيال فارس وفيكتوريا محتالة\"، ادعى دانيال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا محتالة  \n(2) فيكتوريا محتالة  \n(3) أميليا فارسة  \n(4) دانيال محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: بنيامين، لوكاس، إسكندر، ودانيال. كما قال بنيامين: \"إذا كان لوكاس فارساً، فإن دانيال فارس\". بكلمات لوكاس: \"دانيال ليس محتالاً\". \"بنيامين فارس ولوكاس محتال\" - إسكندر. في تصريح لدانيال: \"بنيامين ليس محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بنيامين فارس  \n(2) لوكاس فارس  \n(3) إسكندر محتال  \n(4) دانيال فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: آفا، ليام، لوغان، وأميليا. قالت آفا إن ليام محتال إذا وفقط إذا كان لوغان فارساً. \"أميليا ليست فارساً\"، ادعى ليام. \"إذا كان ليام فارساً، فإن أميليا محتالة\"، ادعى لوغان. \"ليام محتال إذا وفقط إذا كانت آفا فارساً\"، ذكرت أميليا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا فارس  \n(2) ليام محتال  \n(3) لوغان فارس  \n(4) أميليا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: صوفيا، ميا، هاربر، وإميلي. في كلمات صوفيا: \"هاربر فارس وميا فارس\". \"إذا كان هاربر فارساً، فإن هاربر محتار\"، ذكرت ميا. هاربر أشار، \"إميلي فارس إذا وفقط إذا كانت ميا محتالة\". \"إذا كان هاربر فارساً، فإن ميا فارس\"، أعلنت إميلي. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا محتالة  \n(2) ميا فارسة  \n(3) هاربر محتالة  \n(4) إميلي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: مايكل، جاكسون، إليزابيث، ودانيال. \"إليزابيث محتالة\"، ادعى مايكل. قال جاكسون إن دانيال محتال إذا وفقط إذا كان مايكل فارساً. \"مايكل فارس إذا وفقط إذا كان دانيال فارساً\"، أعلنت إليزابيث. \"جاكسون محتال أو مايكل محتال\"، ادعى دانيال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل فارس  \n(2) جاكسون فارس  \n(3) إليزابيث محتالة  \n(4) دانيال محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: رايلي، أبيجيل، أوليفر، وسكارليت. رايلي أعربت عن أن سكارليت محتالة وأن رايلي فارس. كما قالت أبيجيل: \"رايلي ليست فارسًا\". كما قال أوليفر: \"أبيجيل محتالة ورايلي محتالة\". \"إذا كان أوليفر فارسًا، فإن أبيجيل فارسًا\"، ادعت سكارليت. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) رايلي محتالة  \n(2) أبيجيل فارسة  \n(3) أوليفر محتال  \n(4) سكارليت فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: بينيلوب، أميليا، آفا، ولوكاس. في تصريح لبينيلوب: \"آفا ليست فارسة\". أميليا علقت، \"بينيلوب محتالة أو لوكاس فارس\". آفا لاحظت، \"إذا كانت أميليا محتالة، فإن بينيلوب محتالة\". لوكاس قال، \"بينيلوب ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب محتالة  \n(2) أميليا فارسة  \n(3) آفا فارسة  \n(4) لوكاس محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: صموئيل، بينيلوب، مايسون، وداوود. سُمع صموئيل يقول: \"بينيلوب فارس إذا وفقط إذا كان مايسون محتالًا\". قالت بينيلوب إن داوود محتال وبينيلوب فارس. أكد مايسون: \"بينيلوب محتال\". \"مايسون محتال إذا وفقط إذا كانت بينيلوب فارس\" - داوود. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صموئيل فارس  \n(2) بينيلوب محتالة  \n(3) مايسون فارس  \n(4) داوود فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: صموئيل، إسكندر، أميليا، وليلي. صرح صموئيل، \"صموئيل فارس وإسكندر فارس\". \"صموئيل محتال\" - إسكندر. أكدت أميليا: \"صموئيل ليس محتالًا\". قالت ليلي، \"إذا كان صموئيل فارسًا، فإن أميليا فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صموئيل محتال  \n(2) إسكندر فارس  \n(3) أميليا محتالة  \n(4) ليلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: صوفيا، أميليا، إليزابيث، وأبيجيل. صوفيا علقت، \"أميليا فارس\". أميليا أكدت: \"صوفيا محتالة وأميليا فارس\". إليزابيث قالت، \"إليزابيث فارس أو صوفيا محتالة.\" كما قالت أبيجيل، \"إذا كانت أميليا محتالة، فإن إليزابيث محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا محتالة  \n(2) أميليا محتالة  \n(3) إليزابيث فارسة  \n(4) أبيجيل محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: سباستيان، أميليا، رايلي، وإيزابيلا. أخبرك سباستيان أن إيزابيلا فارس إذا وفقط إذا كانت رايلي فارس. بكلمات أميليا: \"سباستيان ليس فارسًا\". لاحظت رايلي، \"إذا كانت إيزابيلا فارسًا، فإن أميليا فارسًا\". \"إيزابيلا فارس وسباستيان محتار\"، أعلنت إيزابيلا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سباستيان محتال  \n(2) أميليا فارس  \n(3) رايلي فارس  \n(4) إيزابيلا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: صموئيل، ليلي، هاربر، ومايسون. قال صموئيل: \"صموئيل فارس أو ليلي محتالة\". علقت ليلي: \"إذا كان هاربر محتالاً، فإن مايسون فارس\". قال هاربر: \"إذا كان مايسون محتالاً، فإن صموئيل محتال\". أكد مايسون: \"إذا كان هاربر فارساً، فإن صموئيل محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صموئيل محتال  \n(2) ليلي فارس  \n(3) هاربر فارس  \n(4) مايسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: ليلي، إيثان، جاك، وإميلي. كما قالت ليلي: \"جاك ليس محتالًا\". \"إذا كانت ليلي محتالة، فإن ليلي فارس\"، ذكر إيثان. وفقًا لجاك، \"إيثان محتال أو ليلي فارس\". \"ليلي محتالة\" - إميلي. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليلي فارس  \n(2) إيثان فارس  \n(3) جاك فارس  \n(4) إميلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: أوين، جيمس، لوغان، وميا. في كلمات أوين: \"لوغان محتال إذا وفقط إذا كان جيمس فارساً\". علق جيمس، \"إذا كانت ميا فارساً، فإن جيمس فارس\". صرح لوغان، \"إذا كان جيمس محتالاً، فإن ميا فارساً\". علقّت ميا، \"أوين فارس إذا وفقط إذا كان لوغان محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين محتال  \n(2) جيمس فارس  \n(3) لوغان فارس  \n(4) ميا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: آريا، أوليفر، مايكل، وأفري. \"إذا كان أوليفر محتالاً، فإن أفري فارس\"، أعلنت آريا. سمع أوليفر يقول: \"إذا كانت آريا فارساً، فإن أفري محتالة\". وفي كلمات مايكل: \"أوليفر محتال أو آريا محتالة\". وفي كلمات أفري: \"إذا كان مايكل فارساً، فإن أفري فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آريا فارس  \n(2) أوليفر محتال  \n(3) مايكل فارس  \n(4) أفري فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: أيدن، شارلوت، صوفيا، وسباستيان. وفقاً لأيدن، \"شارلوت محتالة\". في تصريح من شارلوت: \"صوفيا محتالة إذا وفقط إذا كانت صوفيا فارسة\". كما قالت صوفيا، \"أيدن فارس وسباستيان فارس\". \"شارلوت فارسة وأيدن فارس\"، ادعى سباستيان. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن فارس  \n(2) شارلوت محتالة  \n(3) صوفيا محتالة  \n(4) سباستيان محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: هنري، جيمس، إيما، وإيزابيلا. قال هنري: \"إذا كان هنري فارسًا، فإن جيمس محتال\". صرح جيمس: \"إيزابيلا محتالة إذا وفقط إذا كانت إيما فارسة\". كما قالت إيما: \"جيمس فارس إذا وفقط إذا كان هنري محتالًا\". قالت إيزابيلا: \"هنري فارس وجيمس محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هنري فارس  \n(2) جيمس محتال  \n(3) إيما فارس  \n(4) إيزابيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: نوح، لوك، صموئيل، وفيكتوريا. قال لك نوح: \"إذا كانت فيكتوريا فارسة، فإن لوك فارس.\" أشار لوك: \"صموئيل فارس أو نوح فارس.\" ذكر صموئيل: \"فيكتوريا فارسة أو فيكتوريا محتالة.\" قالت فيكتوريا: \"إذا كان صموئيل محتالًا، فإن لوك محتال.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح فارس  \n(2) لوك فارس  \n(3) صموئيل فارس  \n(4) فيكتوريا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: ليام، إيما، لوك، وأوليفر. \"ليام فارس أو إيما فارس\" - ليام. في كلمات إيما: \"ليام محتال أو ليام فارس\". في كلمات لوك: \"ليام فارس إذا وفقط إذا كان ليام محتال\". قال أوليفر إن ليام فارس وإيما محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام فارس  \n(2) إيما فارس  \n(3) لوك محتال  \n(4) أوليفر محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: نوح، دانيال، داوود، وبينيلوب. \"داوود فارس ودانيال محتال\"، أعلن نوح. عبر دانيال عن أن دانيال فارس وداوود فارس. سمع داوود يقول، \"دانيال ليس فارسًا\". قالت بينيلوب إنه إذا كان دانيال محتالًا، فإن نوح فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح فارس  \n(2) دانيال محتال  \n(3) داوود فارس  \n(4) بينيلوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: أوليفيا، دانيال، بينيلوب، وسباستيان. قالت أوليفيا: \"إذا كان سباستيان فارساً، فإن بينيلوب محتالة\". كما قال دانيال: \"سباستيان ليس محتالاً\". وفي تصريح لبينيلوب: \"إذا كان سباستيان محتالاً، فإن دانيال محتال\". قال سباستيان: \"إذا كانت أوليفيا فارسة، فإن دانيال محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا محتالة  \n(2) دانيال فارس  \n(3) بينيلوب فارسة  \n(4) سباستيان فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: إيلا، زوي، دانيال، وآفا. قالت إيلا: \"إذا كانت زوي محتالة، فإن آفا محتالة.\" زعمت زوي: \"آفا محتالة ودانيال محتال.\" زعم دانيال: \"إذا كانت آفا فارسة، فإن زوي محتالة.\" لاحظت آفا: \"دانيال محتال أو زوي محتالة.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا محتالة  \n(2) زوي محتالة  \n(3) دانيال فارس  \n(4) آفا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: إيفلين، ليام، نوح، ومايكل. كما قالت إيفلين: \"نوح محتال أو ليام فارس\". أكد ليام: \"نوح ليس محتالاً\". صرح نوح: \"إذا كان مايكل محتالاً، فإن نوح فارس\". علق مايكل: \"نوح محتال أو إيفلين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين فارس  \n(2) ليام فارس  \n(3) نوح فارس  \n(4) مايكل فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: لوك، إيما، أوليفر، وإيزابيلا. في تصريح من لوك: \"إيما ليست محتالة\". قالت إيما إنه إذا كان لوك محتالًا، فإن أوليفر محتال. \"إذا كانت إيزابيلا فارسة، فإن إيزابيلا محتالة\"، ذكر أوليفر. \"إيما فارسة أو أوليفر فارس\"، أعلنت إيزابيلا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) إيما فارس  \n(3) أوليفر محتال  \n(4) إيزابيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: إسكندر، لوك، آفا، وويليام. أبدى إسكندر أن لوك ليس محتالًا. أخبرك لوك أن آفا محتالة وويليام محتال. أبدت آفا أن ويليام محتال. أبدى ويليام أنه إذا كان إسكندر فارسًا، فإن لوك محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إسكندر محتال  \n(2) لوك محتال  \n(3) آفا محتالة  \n(4) ويليام فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: داوود، صوفيا، أورورا، وجاكسون. في كلمات داوود: \"أورورا فارس أو داوود فارس\". صوفيا علقت، \"إذا كانت صوفيا فارساً، فإن جاكسون فارس\". أورورا علقت، \"داوود ليس فارساً\". سمع جاكسون يقول، \"صوفيا ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود فارس  \n(2) صوفيا فارس  \n(3) أورورا محتالة  \n(4) جاكسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: لوكاس، سباستيان، إيثان، ورايلي. كما قال لوكاس، \"سباستيان محتال إذا وفقط إذا كان إيثان فارساً\". سباستيان عبر عن أن لوكاس فارس. سمع إيثان يقول، \"لوكاس فارس إذا وفقط إذا كانت رايلي فارساً\". أخبرتك رايلي أن سباستيان فارس أو إيثان محتال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوكاس محتال  \n(2) سباستيان محتال  \n(3) إيثان محتال  \n(4) رايلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: إيلا، سباستيان، لوكاس، وآفا. سُمعت إيلا تقول: \"آفا فارس\". سُمِعَ سباستيان يقول: \"إذا كانت آفا فارسًا، فإن آفا محتالة\". سُمِعَ لوكاس يقول: \"إذا كانت إيلا فارسًا، فإن آفا محتالة\". لاحظت آفا: \"لوكاس محتال أو لوكاس فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا فارس  \n(2) سباستيان محتال  \n(3) لوكاس محتال  \n(4) آفا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: ويليام، إيلا، لوكاس، ويعقوب. قال ويليام: \"إذا كان يعقوب محتالًا، فإن إيلا محتالة.\" أخبرتك إيلا أن ويليام محتال أو لوكاس محتال. عبر لوكاس عن أنه إذا كان يعقوب فارسًا، فإن ويليام محتال. أشار يعقوب: \"إيلا فارس وويليام محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام فارس  \n(2) إيلا محتالة  \n(3) لوكاس فارس  \n(4) يعقوب محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: رايلي، أميليا، ويليام، ودانيال. \"إذا كان دانيال محتالاً، فإن ويليام محتال\" - أعلنت رايلي. \"دانيال محتال إذا وفقط إذا كان ويليام فارساً\" - أميليا. كما قال ويليام، \"دانيال ليس محتالاً\". \"رايلي ليست فارسة\" - ذكر دانيال. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) رايلي فارس  \n(2) أميليا محتالة  \n(3) ويليام محتال  \n(4) دانيال محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: أوين، إيزابيلا، نوح، وجاكسون. أكد أوين: \"إيزابيلا فارس\". لاحظت إيزابيلا، \"إذا كان نوح فارساً، فإن جاكسون محتار\". قال نوح إن جاكسون محتال وأن نوح فارس. في بيان من جاكسون: \"أوين فارس أو نوح محتار\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوين فارس  \n(2) إيزابيلا فارس  \n(3) نوح محتال  \n(4) جاكسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: رايلي، بينيلوب، إيزابيلا، وإسكندر. قالت رايلي إن إسكندر فارس وإن بينيلوب فارس. قالت بينيلوب إن إيزابيلا محتالة إذا وفقط إذا كانت إيزابيلا فارسة. قالت إيزابيلا: \"رايلي فارس أو إسكندر فارس.\" \"رايلي فارس ورايلي محتال,\" ذكر إسكندر. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) رايلي محتالة  \n(2) بينيلوب محتالة  \n(3) إيزابيلا محتالة  \n(4) إسكندر محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: كلوي، أورورا، جاك، وأوليفر. كما قالت كلوي، \"أوليفر فارس إذا وفقط إذا كان جاك محتالاً\". سُمعت أورورا تقول، \"إذا كان أوليفر فارساً، فإن كلوي فارس\". قال جاك إن كلوي فارس. قال أوليفر إن كلوي محتالة إذا وفقط إذا كانت أورورا فارساً. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) كلوي فارس  \n(2) أورورا فارس  \n(3) جاك فارس  \n(4) أوليفر محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: أوليفيا، آريا، سكارليت، وبنيامين. سُمعت أوليفيا تقول: \"سكارليت محتالة\". علق آريا: \"إذا كانت سكارليت فارسة، فإن بنيامين فارس\". قالت سكارليت: \"أوليفيا فارسة وبنيامين فارس\". ادعى بنيامين: \"سكارليت ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا فارس  \n(2) آريا فارس  \n(3) سكارليت محتالة  \n(4) بنيامين محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: أميليا، أوليفيا، هنري، وأورورا. علقت أميليا، \"أورورا فارس أو هنري فارس\". قالت أوليفيا، \"هنري محتال\". \"أوليفيا محتالة أو أوليفيا فارس\"، ادعى هنري. \"أميليا محتالة\" - أورورا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا فارس  \n(2) أوليفيا محتالة  \n(3) هنري فارس  \n(4) أورورا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: ويليام، إيثان، ليلي، وأميليا. قال ويليام: \"ليلي فارس.\" صرح إيثان: \"ليلي محتالة أو أميليا محتالة.\" كما قالت ليلي: \"إيثان محتال إذا وفقط إذا كانت أميليا محتالة.\" ذكرت أميليا: \"إيثان فارس إذا وفقط إذا كان إيثان محتال.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام محتال  \n(2) إيثان فارس  \n(3) ليلي محتالة  \n(4) أميليا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: إيفلين، مايسون، ليام، وبينيلوب. \"ليام ليس محتالاً\"، أعلنت إيفلين. وفقاً لمايسون، \"ليام فارس أو ليام محتال\". كما قال ليام، \"مايسون محتال وإيفلين فارس\". في كلمات بينيلوب: \"بينيلوب فارس وإيفلين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين محتالة  \n(2) مايسون فارس  \n(3) ليام محتال  \n(4) بينيلوب محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: نوح، إسكندر، بينيلوب، وكلوي. أعرب نوح عن أن بينيلوب فارس وكلوي محتالة. أعرب إسكندر أنه إذا كانت بينيلوب فارساً فإن كلوي أيضاً فارس. وفقاً لبينيلوب، \"بينيلوب فارس وكلوي محتالة\". \"إذا كان نوح محتالاً فإن إسكندر فارس\"، أعلنت كلوي. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح محتال  \n(2) إسكندر فارس  \n(3) بينيلوب محتالة  \n(4) كلوي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: شارلوت، آريا، ويليام، ورايلي. قالت شارلوت: \"آريا فارس ورايلي محتال\". عبرت آريا عن أن رايلي فارس أو رايلي محتال. أكد ويليام: \"شارلوت محتالة إذا وفقط إذا كان رايلي فارس\". في تصريح من رايلي: \"إذا كانت آريا فارساً، فإن ويليام فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت محتالة  \n(2) آريا فارسة  \n(3) ويليام فارس  \n(4) رايلي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: جاكسون، سباستيان، دانيال، وليلي. سمع جاكسون يقول: \"إذا كانت ليلي محتالة، فإن جاكسون فارس\". سمع سباستيان يقول: \"جاكسون فارس إذا وفقط إذا كان دانيال محتالاً\". \"دانيال فارس إذا وفقط إذا كان سباستيان محتالاً\"، ذكر دانيال. كما قالت ليلي: \"جاكسون ليس فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون فارس  \n(2) سباستيان محتال  \n(3) دانيال فارس  \n(4) ليلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: بينيلوب، إيثان، أيدن، وإيفلين. أكدت بينيلوب: \"أيدن محتال أو إيثان محتال\". في تصريح لإيثان: \"إذا كان أيدن فارسًا، فإن إيفلين فارس\". قال أيدن إنه إذا كان أيدن فارسًا، فإن إيفلين محتالة. وأشارت إيفلين، \"إيثان محتال إذا وفقط إذا كان إيثان فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب هي فارس  \n(2) إيثان محتال  \n(3) أيدن هو فارس  \n(4) إيفلين محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: أوليفيا، مايكل، إليزابيث، وجاكسون. سُمعت أوليفيا تقول: \"إذا كان مايكل محتالاً، فإن جاكسون فارس\". قال مايكل إن أوليفيا فارس إذا وفقط إذا كان جاكسون محتالاً. \"مايكل فارس\"، ذكرت إليزابيث. \"أوليفيا ليست فارساً\" - جاكسون. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا فارس  \n(2) مايكل فارس  \n(3) إليزابيث فارس  \n(4) جاكسون محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: كلوي، زوي، داوود، وشارلوت. \"زوي محتالة إذا وفقط إذا كانت شارلوت محتالة\" - كلوي. \"كلوي ليست فارسة\"، أعلنت زوي. وفقاً لداوود، \"شارلوت ليست محتالة\". كما قالت شارلوت، \"زوي محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) كلوي محتالة  \n(2) زوي فارسة  \n(3) داوود محتال  \n(4) شارلوت محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: لوغان، ليام، شارلوت، وهاربر. قال لوغان: \"لوغان فارس أو هاربر فارس\". وفقًا ليام، \"شارلوت محتالة\". في تصريح شارلوت: \"لوغان فارس\". كما قالت هاربر: \"ليام فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان فارس  \n(2) ليام محتال  \n(3) شارلوت فارس  \n(4) هاربر محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: بينيلوب، لوك، نوح، وأورورا. قالت بينيلوب: \"لوك محتال أو أورورا فارس\". \"نوح فارس أو نوح محتال\" - لوك. كما قال نوح: \"لوك محتال أو أورورا محتالة\". \"أورورا فارس إذا وفقط إذا كان نوح محتالاً\"، ذكرت أورورا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب فارس  \n(2) لوك فارس  \n(3) نوح محتال  \n(4) أورورا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: إليزابيث، بنيامين، أيدن، وإيما. في كلمات إليزابيث: \"إيما محتالة وأيدن فارس\". كما قال بنيامين: \"إليزابيث فارس إذا وفقط إذا كانت إيما فارسة\". أشار أيدن: \"إيما ليست محتالة\". في تصريح من إيما: \"إليزابيث ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث محتالة  \n(2) بنيامين فارس  \n(3) أيدن محتال  \n(4) إيما محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: كلوي، فيكتوريا، دانيال، وبنيامين. قالت كلوي: \"فيكتوريا فارس\". لاحظت فيكتوريا: \"دانيال محتال وفيكتوريا فارس\". قال دانيال: \"كلوي فارس إذا وفقط إذا كانت فيكتوريا محتالة\". لاحظ بنيامين: \"إذا كان بنيامين فارساً، فإن فيكتوريا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) كلوي فارس  \n(2) فيكتوريا فارس  \n(3) دانيال محتال  \n(4) بنيامين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: ويليام، صوفيا، أورورا، وإيثان. في كلمات ويليام: \"أورورا فارس إذا وفقط إذا كان إيثان محتالًا\". \"إذا كان ويليام فارسًا، فإن ويليام محتال\"، أعلنت صوفيا. لاحظت أورورا، \"ويليام ليس محتالًا\". علق إيثان، \"أورورا ليست فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام فارس  \n(2) صوفيا محتالة  \n(3) أورورا فارس  \n(4) إيثان محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: أورورا، لوغان، شارلوت، وإيفلين. أكدت أورورا: \"لوغان محتال وشارلوت فارس\". سمع لوغان يقول: \"أورورا محتالة وإيفلين محتالة\". علقت شارلوت: \"إذا كانت شارلوت فارساً، فإن إيفلين فارس\". علق إيفلين: \"أورورا ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أورورا فارس  \n(2) لوغان محتال  \n(3) شارلوت فارس  \n(4) إيفلين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: ماثيو، زوي، ويليام، ويوسف. قال ماثيو لك إن يوسف ليس فارسًا. زوي قالت إن ماثيو محتال إذا وفقط إذا كان ماثيو فارسًا. \"ماثيو محتال إذا وفقط إذا كان يوسف محتالًا\"، ذكر ويليام. وفي كلمات يوسف: \"زوي ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ماثيو فارس  \n(2) زوي محتالة  \n(3) ويليام محتال  \n(4) يوسف محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: أميليا، لوكاس، مايسون، وصوفيا. قالت أميليا إن صوفيا محتالة أو مايسون فارس. كما قال لوكاس: \"إذا كانت أميليا محتالة، فإن لوكاس فارس\". \"إذا كانت صوفيا محتالة، فإن صوفيا فارس\" - مايسون. أكدت صوفيا: \"لوكاس ليس محتالًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا فارس  \n(2) لوكاس فارس  \n(3) مايسون فارس  \n(4) صوفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: صموئيل، جيمس، لوكاس، وصوفيا. قال صموئيل: \"لوكاس محتال وصوفيا فارس\". \"جيمس فارس وصوفيا محتالة\" - جيمس. قال لوكاس: \"إذا كان صموئيل محتالاً، فإن جيمس محتال\". كما قالت صوفيا: \"إذا كان لوكاس محتالاً، فإن جيمس فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صموئيل محتال  \n(2) جيمس محتال  \n(3) لوكاس فارس  \n(4) صوفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: أميليا، إيزابيلا، دانيال، وداوود. كما قالت أميليا، \"إيزابيلا فارس إذا وفقط إذا كانت أميليا فارسًا\". علق إيزابيلا، \"أميليا فارس إذا وفقط إذا كان داوود محتالًا\". \"داوود محتال إذا وفقط إذا كان دانيال فارسًا\"، ادعى دانيال. سمع داوود يقول، \"دانيال محتال إذا وفقط إذا كانت إيزابيلا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا فارس  \n(2) إيزابيلا فارس  \n(3) دانيال محتال  \n(4) داوود محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: جاك، لوكاس، أورورا، وأفري. \"جاك فارس وأورورا فارس\"، ادعى جاك. في كلمات لوكاس: \"جاك ليس محتالاً\". \"إذا كان جاك فارساً، فإن جاك محتال\"، ادعت أورورا. كما قالت أفري: \"جاك محتال إذا وفقط إذا كانت أورورا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاك محتال  \n(2) لوكاس محتال  \n(3) أورورا فارس  \n(4) أفري محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: جاك، إليزابيث، إيلا، ومايكل. قال جاك: \"مايكل فارس إذا وفقط إذا كانت إليزابيث محتالة\". وفي كلمات إليزابيث: \"إيلا فارس أو إيلا محتالة\". قالت إيلا: \"جاك محتال أو إليزابيث محتالة\". وفي كلمات مايكل: \"إذا كانت إيلا فارساً، فإن مايكل فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاك محتال  \n(2) إليزابيث فارسة  \n(3) إيلا فارسة  \n(4) مايكل فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: آفا، صوفيا، أوليفر، ومايسون. قالت آفا: \"صوفيا محتالة\". علق صوفيا: \"مايسون ليس محتالاً\". أشار أوليفر: \"آفا فارس أو مايسون محتال\". قال مايسون: \"إذا كان مايسون فارساً، فإن صوفيا فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا محتالة  \n(2) صوفيا فارسة  \n(3) أوليفر محتال  \n(4) مايسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: أوليفيا، جاك، ليلي، وبنيامين. قالت أوليفيا إن ليلي فارس. \"أوليفيا محتالة\"، ذكر جاك. صرحت ليلي، \"جاك محتال وبنيامين محتال\". علق بنيامين، \"ليلي ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا محتالة  \n(2) جاك فارس  \n(3) ليلي محتالة  \n(4) بنيامين محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: كلوي، زوي، جاك، وصوفيا. قالت كلوي: \"جاك محتال\". لاحظت زوي: \"جاك فارس\". أعرب جاك عن أن زوي محتالة وكلوي محتالة. قالت صوفيا إن كلوي فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) كلوي فارس  \n(2) زوي محتالة  \n(3) جاك محتال  \n(4) صوفيا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: إيلا، إسكندر، إيما، وليلي. علقت إيلا قائلة: \"إيما محتالة وإيلا فارس\". سمع إسكندر يقول: \"إيما فارسة وليلي فارسة\". صرحت إيما: \"إيلا ليست محتالة\". \"إيما فارسة وإسكندر فارس\" - ليلي. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا محتالة  \n(2) إسكندر محتال  \n(3) إيما محتالة  \n(4) ليلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: إليزابيث، إيثان، أبيجيل، وليلي. تم سماع إليزابيث تقول: \"إذا كان إيثان فارسًا، فإن أبيجيل فارسًا\". أشار إيثان: \"ليلي محتالة أو إليزابيث محتالة\". أشار أبيجيل: \"إليزابيث فارس إذا وفقط إذا كان إيثان فارسًا\". \"إيثان محتال إذا وفقط إذا كانت ليلي فارسًا\" - ليلي. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث فارس  \n(2) إيثان محتال  \n(3) أبيجيل محتالة  \n(4) ليلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: آريا، أميليا، أورورا، وآفا. علقت آريا، \"أميليا محتالة إذا وفقط إذا كانت أورورا محتالة\". \"أورورا محتالة أو أورورا فارس\"، ادعت أميليا. وفقًا لأورورا، \"آفا محتالة\". \"آفا فارس أو أورورا فارس\" - آفا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آريا محتالة  \n(2) أميليا فارسة  \n(3) أورورا محتالة  \n(4) آفا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: إليزابيث، هاربر، ويليام، وبنيامين. في كلمات إليزابيث: \"ويليام فارس وهاربر فارس\". هاربر قال: \"بنيامين ليس فارساً\". ويليام قال إن بنيامين فارس. \"هاربر فارس وبنيامين فارس\" - بنيامين. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث محتالة  \n(2) هاربر فارس  \n(3) ويليام محتال  \n(4) بنيامين محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: أوليفر، يوسف، كلوي، ولوغان. قال أوليفر إن لوغان ليس فارسًا. أشار يوسف، \"لوغان فارس أو أوليفر فارس\". قالت كلوي، \"إذا كان أوليفر محتالًا، فإن لوغان محتال\". أعلن لوغان، \"أوليفر فارس وكلوي محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفر فارس  \n(2) يوسف فارس  \n(3) كلوي فارس  \n(4) لوغان محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: جاكسون، إليزابيث، إيفلين، ومايسون. وفقًا لما قاله جاكسون: \"إيفلين محتالة\". بكلمات إليزابيث: \"مايسون فارس إذا وفقط إذا كانت إيفلين فارسة\". \"إذا كان جاكسون محتالًا، فإن مايسون فارس\"، ذكرت إيفلين. أخبرك مايسون أنه إذا كان جاكسون محتالًا، فإن إليزابيث فارسة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) جاكسون محتال  \n(2) إليزابيث فارسة  \n(3) إيفلين فارسة  \n(4) مايسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: هنري، لوغان، صوفيا، وغريس. علق هنري، \"لوغان فارس إذا وفقط إذا كانت صوفيا فارساً\". أخبرك لوغان أن غريس فارس إذا وفقط إذا كانت صوفيا فارساً. قالت صوفيا إن هنري فارس إذا وفقط إذا كانت غريس محتالة. علق غريس، \"هنري محتال أو غريس فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هنري فارس  \n(2) لوغان محتار  \n(3) صوفيا محتالة  \n(4) غريس فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: كلوي، ميا، أفري، ويوسف. سُمعت كلوي تقول: \"ميا ليست محتالة\". \"ميا فارس أو كلوي محتالة\" - ميا. أخبرك أفري أن أفري فارس أو ميا فارس. \"ميا فارس إذا وفقط إذا كانت أفري محتالة\"، ادعى يوسف. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) كلوي فارس  \n(2) ميا فارس  \n(3) أفري فارس  \n(4) يوسف محتار"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: لوك، أميليا، هنري، وليلي. قال لوك: \"هنري محتال إذا وفقط إذا كانت ليلي محتالة\". أعلنت أميليا: \"ليلي فارس أو هنري فارس\". قال هنري: \"أميليا محتالة أو لوك فارس\". ادعت ليلي: \"لوك فارس إذا وفقط إذا كانت أميليا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) أميليا فارسة  \n(3) هنري فارس  \n(4) ليلي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: أيدن، ماثيو، إيلا، ورايلي. أيدن أخبرك أن إيلا محتالة. ماثيو قال: \"رايلي ليست محتالة.\" \"أيدن محتال إذا وفقط إذا كانت رايلي فارسة\" - إيلا. رايلي أخبرك أن أيدن فارس ورايلي فارسة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن فارس  \n(2) ماثيو فارس  \n(3) إيلا محتالة  \n(4) رايلي فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: لوك، هاربر، بينيلوب، وأورورا. في كلمات لوك: \"بينيلوب فارس إذا وفقط إذا كانت بينيلوب محتالة\". قالت هاربر: \"أورورا محتالة وهاربر فارس.\" عبرت بينيلوب عن أن لوك محتال. صرحت أورورا: \"هاربر فارس إذا وفقط إذا كانت أورورا فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك محتال  \n(2) هاربر فارس  \n(3) بينيلوب فارس  \n(4) أورورا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: مايكل، سباستيان، بنيامين، وإيزابيلا. قال مايكل: \"إيزابيلا محتالة وسباستيان محتال\". علق سباستيان: \"سباستيان فارس\". أكد بنيامين: \"إذا كانت إيزابيلا فارسة، فإن إيزابيلا محتالة\". قالت إيزابيلا: \"سباستيان محتال ومايكل فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل محتال  \n(2) سباستيان فارس  \n(3) بنيامين فارس  \n(4) إيزابيلا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: نوح، يعقوب، آريا، وإيثان. \"إيثان فارس أو إيثان محتال\"، أعلن نوح. علق يعقوب، \"إذا كانت آريا فارسة، فإن إيثان محتال\". علق آريا، \"إذا كان إيثان محتالاً، فإن نوح محتال\". \"نوح ليس فارساً\"، ادعى إيثان. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) نوح فارس  \n(2) يعقوب فارس  \n(3) آريا محتالة  \n(4) إيثان محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: لوغان، سكارليت، إيثان، وغريس. قال لوغان لك: \"إذا كانت غريس محتالة، فإن سكارليت محتالة.\" قالت سكارليت: \"إذا كان لوغان محتالًا، فإن غريس محتالة.\" علق إيثان: \"لوغان محتال.\" قالت غريس إن سكارليت فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان فارس  \n(2) سكارليت فارس  \n(3) إيثان محتال  \n(4) غريس فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: إيما، أميليا، إيثان، وإيزابيلا. قالت إيما: \"إيزابيلا ليست فارسة\". سُمعت أميليا تقول: \"إيزابيلا محتالة\". \"إيزابيلا ليست محتالة\"، ادعى إيثان. \"إيما فارسة إذا وفقط إذا كان إيثان فارسًا\"، أعلنت إيزابيلا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما فارس  \n(2) أميليا فارس  \n(3) إيثان محتال  \n(4) إيزابيلا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: بينيلوب، أوين، بنيامين، وجاكسون. علقت بينيلوب، \"أوين محتال أو جاكسون محتال\". وفقًا لأوين، \"بينيلوب فارس أو بينيلوب محتالة\". \"إذا كان بنيامين فارسًا، فإن أوين فارس\"، أعلن بنيامين. صرح جاكسون، \"أوين فارس أو بنيامين فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب محتالة  \n(2) أوين فارس  \n(3) بنيامين فارس  \n(4) جاكسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: إليزابيث، زوي، سكارليت، وبنيامين. قالت إليزابيث: \"سكارليت محتالة أو سكارليت فارسة\". \"بنيامين ليس فارساً\" - زوي. قالت سكارليت: \"زوي محتالة إذا وفقط إذا كانت إليزابيث فارسة\". قال بنيامين: \"إليزابيث فارسة أو إليزابيث محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إليزابيث فارس  \n(2) زوي محتالة  \n(3) سكارليت فارس  \n(4) بنيامين فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: شارلوت، غريس، آريا، وصوفيا. \"غريس فارس إذا وفقط إذا كانت غريس محتالة\"، أعلنت شارلوت. \"آريا فارس وشارلوت محتالة\"، ذكرت غريس. \"إذا كانت آريا فارسًا، فإن غريس فارس\"، ادعت آريا. \"شارلوت ليست فارسًا\" - صوفيا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) شارلوت محتالة  \n(2) غريس فارسة  \n(3) آريا فارسة  \n(4) صوفيا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: أميليا، أيدن، جاك، وميا. أميليا أعربت عن أن جاك محتار وأن أيدن فارس. \"أميليا فارس\" - أيدن. جاك أخبرك أنه إذا كانت أميليا محتالة، فإن أيدن محتال. كما قالت ميا، \"أميليا فارس إذا وفقط إذا كانت أميليا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا محتالة  \n(2) أيدن محتال  \n(3) جاك فارس  \n(4) ميا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: ماثيو، ليام، لوغان، وإيلا. \"لوغان محتال إذا وفقط إذا كان ليام فارسًا\"، أعلن ماثيو. سمع ليام يقول: \"ماثيو محتال أو إيلا فارس\". أكد لوغان: \"إذا كان ماثيو محتالًا، فإن ليام فارس\". \"ليام محتال\"، ذكرت إيلا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ماثيو محتال  \n(2) ليام فارس  \n(3) لوغان فارس  \n(4) إيلا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: صوفيا، ليلي، دانيال، وفيكتوريا. وفقاً لصوفيا، \"ليلي فارس إذا وفقط إذا كانت فيكتوريا محتالة\". \"صوفيا محتالة أو دانيال محتال\"، أعلنت ليلي. أشار دانيال، \"إذا كان دانيال فارساً، فإن صوفيا فارس\". قالت فيكتوريا، \"صوفيا فارس أو دانيال فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) صوفيا فارس  \n(2) ليلي محتالة  \n(3) دانيال فارس  \n(4) فيكتوريا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: بينيلوب، جيمس، يعقوب، وصوفيا. كما قالت بينيلوب: \"صوفيا محتالة\". سمع جيمس يقول: \"يعقوب محتال إذا وفقط إذا كانت صوفيا فارسة\". وفقاً ليعقوب، \"إذا كان جيمس محتالاً، فإن جيمس فارس\". في بيان من صوفيا: \"يعقوب فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) بينيلوب هي فارسة  \n(2) جيمس محتار  \n(3) يعقوب محتال  \n(4) صوفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: آفا، دانيال، جاك، وويليام. \"إذا كانت آفا فارسًا، فإن دانيال فارس\" - آفا. أعرب دانيال عن أنه إذا كان جاك فارسًا، فإن آفا فارس. أعرب جاك عن أنه إذا كان دانيال محتالًا، فإن دانيال فارس. أعرب ويليام عن أن جاك ليس محتالًا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا فارس  \n(2) دانيال فارس  \n(3) جاك فارس  \n(4) ويليام فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: لوك، أوين، إسكندر، وسباستيان. قال لوك إنه إذا كان أوين محتالًا، فإن إسكندر فارس. \"لوك محتال وإسكندر فارس\" - أوين. \"إذا كان سباستيان محتالًا، فإن لوك فارس\" - أعلن إسكندر. \"أوين محتال إذا وفقط إذا كان لوك محتالًا\" - ادعى سباستيان. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) أوين محتال  \n(3) إسكندر فارس  \n(4) سباستيان محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: إيفلين، جاكسون، أفري، وإسكندر. في تصريح لإيفلين: \"إسكندر فارس إذا وفقط إذا كان جاكسون فارسًا\". لاحظ جاكسون، \"أفري محتالة إذا وفقط إذا كانت إيفلين محتالة\". سمع أفري يقول، \"جاكسون فارس\". قال إسكندر إن جاكسون فارس وأفري محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين فارس  \n(2) جاكسون محتال  \n(3) أفري محتالة  \n(4) إسكندر محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: أيدن، أميليا، صوفيا، ورايلي. \"أميليا فارس أو رايلي محتالة\"، أعلن أيدن. \"أيدن محتال أو أيدن فارس\" - أميليا. صوفيا أخبرتك أن رايلي محتالة ورايلي فارس. رايلي لاحظت، \"أيدن ليس فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أيدن فارس  \n(2) أميليا فارس  \n(3) صوفيا محتالة  \n(4) رايلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: أوليفيا، إيفلين، دانيال، وإيزابيلا. أكدت أوليفيا: \"إيفلين فارس أو إيزابيلا فارس\". ادعت إيفلين: \"دانيال محتال\". وفقاً لدانيال، \"إيفلين محتالة إذا وفقط إذا كانت إيفلين فارساً\". عبرت إيزابيلا عن أن أوليفيا فارس أو إيفلين فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أوليفيا فارس  \n(2) إيفلين فارس  \n(3) دانيال محتال  \n(4) إيزابيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: مايسون، رايلي، دانيال، وهنري. في كلمات مايسون: \"مايسون فارس ودانيال فارس\". علق رايلي، \"هنري محتال أو دانيال فارس\". قال دانيال إن هنري محتال إذا وفقط إذا كان مايسون محتالاً. في بيان لهنري: \"دانيال ليس محتالاً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايسون فارس  \n(2) رايلي فارس  \n(3) دانيال فارس  \n(4) هنري فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: رايلي، آفا، أوليفيا، وبينيلوب. \"أوليفيا فارس إذا وفقط إذا كانت بينيلوب محتالة\" - رايلي. عبرت آفا عن أن رايلي فارس إذا وفقط إذا كانت بينيلوب محتالة. وفقًا لأوليفيا، \"بينيلوب فارس\". أخبرتك بينيلوب أن رايلي محتال أو آفا محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) رايلي محتالة  \n(2) آفا فارسة  \n(3) أوليفيا فارسة  \n(4) بينيلوب فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: مايكل، أورورا، مايسون، وبينيلوب. قال مايكل: \"مايسون محتال إذا وفقط إذا كان مايسون فارساً\". أخبرتك أورورا أن بينيلوب محتالة وأن مايكل فارس. صرح مايسون: \"بينيلوب محتالة\". علقت بينيلوب: \"مايكل محتال وأورورا فارسة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل محتال  \n(2) أورورا محتالة  \n(3) مايسون فارس  \n(4) بينيلوب محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: سباستيان، إيثان، بينيلوب، وأفري. قال لك سباستيان إن أفري ليست محتالة. \"سباستيان محتال أو بينيلوب محتالة\"، ادعى إيثان. كما قالت بينيلوب، \"سباستيان محتال وإيثان فارس\". عبرت أفري عن أن بينيلوب فارس وأفري فارس. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سباستيان محتال  \n(2) إيثان فارس  \n(3) بينيلوب فارس  \n(4) أفري محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: إميلي، لوك، سكارليت، وميا. قالت إميلي: \"سكارليت ليست فارسة\". علق لوك: \"إذا كانت إميلي محتالة، فإن ميا فارسة\". لاحظت سكارليت: \"إميلي محتالة وميا فارسة\". أكدت ميا: \"إميلي فارسة ولوك فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إميلي فارس  \n(2) لوك فارس  \n(3) سكارليت محتالة  \n(4) ميا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: يعقوب، كلوي، أفري، وسكارليت. قال يعقوب: \"إذا كانت سكارليت فارساً، فإن كلوي محتالة\". أعلنت كلوي: \"إذا كان يعقوب فارساً، فإن أفري فارساً\". علق أفري: \"يعقوب ليس فارساً\". قالت سكارليت: \"يعقوب فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) يعقوب فارس  \n(2) كلوي محتالة  \n(3) أفري محتالة  \n(4) سكارليت فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: لوغان، أورورا، هاربر، وجاكسون. قال لوغان: \"أورورا محتالة وجاكسون محتال\". أعلنت أورورا: \"جاكسون ليس محتالًا\". أشار هاربر: \"هاربر فارس\". قال جاكسون: \"إذا كان لوغان محتالًا، فإن هاربر محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوغان محتال  \n(2) أورورا فارس  \n(3) هاربر محتالة  \n(4) جاكسون فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: هاربر، بنيامين، داوود، وآفا. \"بنيامين محتال\"، أعلن هاربر. عبر بنيامين عن أن داوود فارس. \"هاربر محتال وآفا فارس\"، ذكر داوود. في تصريح من آفا: \"بنيامين محتال أو داوود محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هاربر فارس  \n(2) بنيامين محتال  \n(3) داوود محتال  \n(4) آفا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: إسكندر، جاكسون، ماثيو، وأفري. أكد إسكندر: \"إذا كانت أفري فارسًا، فإن جاكسون محتال\". عبر جاكسون عن أن إسكندر محتال وإسكندر فارس. كما قال ماثيو: \"إسكندر محتال أو أفري محتالة\". كما قالت أفري: \"ماثيو فارس وماثيو محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إسكندر فارس  \n(2) جاكسون محتال  \n(3) ماثيو فارس  \n(4) أفري محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: إيما، سكارليت، هاربر، وويليام. \"هاربر محتال وإيما فارس\" - إيما. كما قالت سكارليت، \"ويليام محتال أو سكارليت فارس\". \"ويليام فارس\"، ادعى هاربر. \"إذا كانت سكارليت محتالة، فإن سكارليت فارس\"، ذكر ويليام. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما محتالة  \n(2) سكارليت فارسة  \n(3) هاربر فارسة  \n(4) ويليام فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: ويليام، آفا، جاك، وأميليا. قال ويليام: \"أميليا محتالة وجاك محتال\". وفقًا لآفا، \"إذا كان ويليام فارسًا، فإن ويليام محتال\". قال جاك: \"أميليا ليست محتالة\". \"إذا كانت أميليا فارسة، فإن ويليام محتال\"، أعلنت أميليا. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ويليام محتال  \n(2) آفا فارسة  \n(3) جاك فارس  \n(4) أميليا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: داوود، رايلي، سباستيان، وإليزابيث. كما قال داوود: \"سباستيان فارس\". صرحت رايلي: \"إليزابيث ليست محتالة\". \"داوود فارس إذا وفقط إذا كان داوود محتالاً\"، أعلن سباستيان. \"داوود فارس\"، أعلنت إليزابيث. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) داوود محتال  \n(2) رايلي محتالة  \n(3) سباستيان محتال  \n(4) إليزابيث محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: مايسون، صوفيا، ويليام، وآفا. كما قال مايسون، \"إذا كانت آفا فارسة، فإن صوفيا محتالة\". \"آفا محتالة\"، ذكرت صوفيا. علق ويليام، \"إذا كانت آفا فارسة، فإن ويليام فارس\". وفقاً لآفا، \"صوفيا فارسة إذا وفقط إذا كان ويليام فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايسون فارس  \n(2) صوفيا محتالة  \n(3) ويليام محتال  \n(4) آفا فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: إيلا، ليلي، أميليا، ورايلي. قالت إيلا: \"رايلي فارس ورايلي محتالة\". علقت ليلي: \"أميليا محتالة وإيلا محتالة\". في كلمات أميليا: \"إيلا محتالة\". وفقاً لرايلي، \"إيلا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيلا محتالة  \n(2) ليلي محتالة  \n(3) أميليا فارسة  \n(4) رايلي فارسة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: إيفلين، ويليام، داوود، وسباستيان. قالت إيفلين: \"داوود محتال.\" قال ويليام: \"إيفلين ليست فارسة.\" ادعى داوود: \"ويليام محتال إذا وفقط إذا كان سباستيان فارساً.\" في تصريح لسباستيان: \"سباستيان فارس إذا وفقط إذا كان ويليام محتالاً.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيفلين فارس  \n(2) ويليام محتال  \n(3) داوود محتال  \n(4) سباستيان محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: هنري، يعقوب، شارلوت، وإيلا. قال هنري: \"هنري فارس\". علق يعقوب: \"شارلوت ليست محتالة\". عبرت شارلوت عن أنه إذا كانت إيلا فارسة، فإن هنري محتال. وفي كلمات إيلا: \"شارلوت ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هنري محتال  \n(2) يعقوب فارس  \n(3) شارلوت فارس  \n(4) إيلا فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: إيما، ليلي، أفري، وإليزابيث. \"إليزابيث ليست محتالة\" - إيما. كما قالت ليلي، \"إيما فارس إذا وفقط إذا كانت إليزابيث فارسة\". أشار أفري، \"إيما محتالة إذا وفقط إذا كانت إليزابيث محتالة\". \"إذا كانت إليزابيث فارسة، فإن ليلي فارسة\"، ادعت إليزابيث. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيما فارس  \n(2) ليلي فارس  \n(3) أفري فارس  \n(4) إليزابيث فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: مايكل، صوفيا، يعقوب، وصموئيل. قال مايكل: \"يعقوب محتال أو صموئيل فارس\". قالت صوفيا إن مايكل فارس إذا وفقط إذا كان يعقوب محتالًا. في تصريح ليعقوب: \"مايكل ليس فارسًا\". كما قال صموئيل: \"يعقوب فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل فارس  \n(2) صوفيا فارسة  \n(3) يعقوب محتار  \n(4) صموئيل محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: سباستيان، جيمس، يعقوب، وجاك. أخبرك سباستيان أن يعقوب ليس محتالاً. سمع جيمس يقول: \"جاك ليس محتالاً\". أكد يعقوب: \"سباستيان محتال إذا وفقط إذا كان جيمس محتالاً\". ذكر جاك: \"يعقوب ليس فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سباستيان محتال  \n(2) جيمس فارس  \n(3) يعقوب محتال  \n(4) جاك فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: ميا، جاكسون، لوكاس، وهاربر. قالت ميا: \"إذا كانت ميا فارسًا، فإن هاربر محتال\". علق جاكسون: \"جاكسون فارس\". أشار لوكاس: \"جاكسون فارس إذا وفقط إذا كان هاربر فارسًا\". سمع هاربر يقول: \"لوكاس محتال إذا وفقط إذا كان هاربر فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ميا فارس  \n(2) جاكسون فارس  \n(3) لوكاس محتال  \n(4) هاربر محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: أبيجيل، إيما، هنري، وإيزابيلا. قالت أبيجيل: \"هنري فارس إذا وفقط إذا كانت إيما فارسة\". \"إيزابيلا محتالة\" - إيما. قال هنري إن إيزابيلا فارسة وأبيجيل فارسة. قالت إيزابيلا: \"إذا كانت أبيجيل محتالة، فإن أبيجيل فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أبيجيل محتالة  \n(2) إيما فارسة  \n(3) هنري محتال  \n(4) إيزابيلا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: إيثان، أميليا، أوليفيا، وأيدن. علق إيثان، \"إذا كانت أوليفيا فارسة، فإن أميليا محتالة\". وفقاً لأميليا، \"أيدن فارس أو أوليفيا محتالة\". \"إذا كان إيثان فارساً، فإن إيثان محتال\"، أعلنت أوليفيا. قال أيدن إن أميليا محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) إيثان فارس  \n(2) أميليا فارس  \n(3) أوليفيا محتالة  \n(4) أيدن محتال"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: دانيال، أبيجيل، آفا، وهاربر. كما قال دانيال: \"أبيجيل محتالة إذا وفقط إذا كانت آفا محتالة\". \"آفا ليست محتالة\"، ذكرت أبيجيل. سُمعت آفا تقول: \"دانيال فارس أو دانيال محتال\". كما قال هاربر: \"آفا محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) دانيال فارس  \n(2) أبيجيل فارس  \n(3) آفا فارس  \n(4) هاربر محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: سكارليت، غريس، يعقوب، وإميلي. أخبرتك سكارليت أن غريس محتالة إذا وفقط إذا كانت إميلي محتالة. أكدت غريس: \"سكارليت محتالة\". في كلمات يعقوب: \"إذا كانت إميلي فارسة، فإن إميلي محتالة\". كما قالت إميلي: \"سكارليت ليست محتالة\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سكارليت محتالة  \n(2) غريس فارسة  \n(3) يعقوب فارس  \n(4) إميلي محتالة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: مايكل، إيثان، لوغان، وصوفيا. في تصريح لمايكل: \"إيثان محتال أو مايكل فارس\". علق إيثان، \"إذا كان مايكل فارسًا، فإن إيثان فارس\". علق لوغان، \"إذا كانت صوفيا محتالة، فإن إيثان محتال\". علق صوفيا، \"لوغان ليس فارسًا\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) مايكل فارس  \n(2) إيثان محتال  \n(3) لوغان فارس  \n(4) صوفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: لوك، جاكسون، غريس، وصوفيا. في تصريح من لوك: \"غريس فارس وجاكسون محتال\". قال جاكسون إن صوفيا محتالة وأن لوك فارس. أخبرتك غريس أن صوفيا فارس. صوفيا أكدت: \"جاكسون ليس فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) لوك فارس  \n(2) جاكسون محتال  \n(3) غريس فارس  \n(4) صوفيا فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: أميليا، جاكسون، داوود، وصوفيا. قالت أميليا إنه إذا كان جاكسون فارساً، فإن صوفيا فارس. \"داوود محتال أو جاكسون فارس\" - جاكسون. أخبرك داوود أن صوفيا فارس. قالت صوفيا إن داوود فارس وأميليا محتالة. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا محتالة  \n(2) جاكسون فارس  \n(3) داوود محتال  \n(4) صوفيا محتالة"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: آفا، إيلا، ماثيو، ونوح. أكدت آفا: \"ماثيو محتال إذا وفقط إذا كان ماثيو فارساً\". علقّت إيلا، \"إذا كان ماثيو محتالاً، فإن نوح فارس\". \"إذا كانت إيلا فارساً، فإن إيلا محتالة\" - ماثيو. سمع نوح يقول، \"إذا كانت آفا محتالة، فإن ماثيو محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) آفا محتالة  \n(2) إيلا فارسة  \n(3) ماثيو محتال  \n(4) نوح فارس"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: ماثيو، إيما، مايسون، ويعقوب. \"إيما محتالة\"، أعلن ماثيو. في كلمات إيما: \"مايسون فارس\". لاحظ مايسون، \"إيما محتالة وماثيو محتال\". كما قال يعقوب، \"مايسون محتال\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ماثيو فارس  \n(2) إيما محتالة  \n(3) مايسون محتال  \n(4) يعقوب فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: فيكتوريا، داوود، إيثان، وسكارليت. عبرت فيكتوريا عن أن فيكتوريا فارس إذا وفقط إذا كان إيثان فارساً. \"فيكتوريا محتالة وسكارليت محتالة\" - داوود. صرح إيثان، \"داوود محتال إذا وفقط إذا كانت سكارليت فارسة\". قالت سكارليت، \"داوود محتال إذا وفقط إذا كانت فيكتوريا فارسة.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) فيكتوريا فارس  \n(2) داوود محتال  \n(3) إيثان فارس  \n(4) سكارليت فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: هنري، دانيال، سباستيان، وجيمس. علق هنري قائلاً: \"دانيال محتال أو جيمس فارس\". أشار دانيال إلى أن \"سباستيان فارس أو سباستيان محتال\". ذكر سباستيان: \"إذا كان جيمس محتالاً، فإن دانيال محتال\". علق جيمس قائلاً: \"إذا كان سباستيان فارساً، فإن هنري فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هنري فارس  \n(2) دانيال فارس  \n(3) سباستيان فارس  \n(4) جيمس فارس"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: أميليا، جاك، إيما، وداوود. أميليا أكدت: \"داوود ليس محتالاً\". جاك صرح، \"داوود محتال\". إيما قالت، \"إذا كانت إيما فارسة، فإن أميليا محتالة.\" داوود قال، \"داوود فارس وجاك فارس.\" فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) أميليا محتالة  \n(2) جاك فارس  \n(3) إيما فارس  \n(4) داوود محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: هنري، فيكتوريا، أفري، وإيما. في كلمات هنري: \"فيكتوريا محتالة\". أكدت فيكتوريا: \"إذا كان هنري فارساً، فإن أفري فارس\". صرحت أفري، \"فيكتوريا ليست فارسة\". \"أفري محتالة وهنري محتال\"، ادعت إيما. فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) هنري محتال  \n(2) فيكتوريا فارسة  \n(3) أفري محتالة  \n(4) إيما فارسة"
    },
    {
        "quiz": "جزيرة خاصة جدًا يسكنها فقط الفرسان والمحتالون. الفرسان دائمًا يقولون الحقيقة، والمحتالون دائمًا يكذبون. تلتقي بأربعة سكان: ليام، أوين، مايسون، وأوليفر. قال ليام إن مايسون محتال وأوليفر محتال. \"ليام فارس إذا وفقط إذا كان ليام محتالًا\"، ذكر أوين. كما قال مايسون، \"أوليفر فارس إذا وفقط إذا كان ليام فارسًا\". وفقًا لأوليفر، \"مايسون فارس\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) ليام فارس  \n(2) أوين محتال  \n(3) مايسون محتال  \n(4) أوليفر محتال"
    },
    {
        "quiz": "جزيرة خاصة جداً يسكنها فقط الفرسان والمحتالون. الفرسان دائماً يقولون الحقيقة، والمحتالون دائماً يكذبون. تلتقي بأربعة سكان: سكارليت، أوليفيا، مايسون، وإليزابيث. علقت سكارليت، \"مايسون ليس محتالاً\". وفي كلمات أوليفيا: \"مايسون فارس أو إليزابيث فارس\". قال مايسون إن إليزابيث ليست فارساً. وفي بيان إليزابيث: \"إليزابيث فارس إذا وفقط إذا كان مايسون فارساً\". فمن هو الفارس ومن هو المحتال؟",
        "solution_text_format": "(1) سكارليت فارس  \n(2) أوليفيا فارس  \n(3) مايسون فارس  \n(4) إليزابيث محتالة"
    }
]