[
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: नूह, विक्टोरिया, एवा, लिली, डैनियल, अलेक्जेंडर, और मैथ्यू। नूह ने कहा कि मैथ्यू एक शूरवीर है और विक्टोरिया एक शूरवीर है। \"लिली एक धूर्त है यदि और केवल यदि मैथ्यू एक शूरवीर है,\" विक्टोरिया ने उल्लेख किया। एवा के एक बयान में: \"मैथ्यू एक शूरवीर है या विक्टोरिया एक शूरवीर है\"। लिली को यह कहते हुए सुना गया, \"यदि विक्टोरिया एक धूर्त है तो मैथ्यू एक धूर्त है\"। डैनियल ने टिप्पणी की, \"अलेक्जेंडर एक शूरवीर नहीं है\"। अलेक्जेंडर ने कहा, \"नूह एक शूरवीर है या एवा एक धूर्त है\"। \"एवा एक धूर्त है\" - मैथ्यू। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक धूर्त है  \n(2) विक्टोरिया एक शूरवीर है  \n(3) एवा एक शूरवीर है  \n(4) लिली एक शूरवीर है  \n(5) डैनियल एक शूरवीर है  \n(6) अलेक्जेंडर एक धूर्त है  \n(7) मैथ्यू एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: डैनियल, सैमुएल, माइकल, सोफिया, मेसन, आरिया, और अलेक्जेंडर। जैसा कि डैनियल ने कहा, \"माइकल एक धूर्त है यदि और केवल यदि अलेक्जेंडर एक शूरवीर है\"। सैमुएल ने कहा कि माइकल एक शूरवीर है और अलेक्जेंडर एक धूर्त है। माइकल ने asserted किया: \"आरिया एक धूर्त नहीं है\"। सोफिया ने व्यक्त किया कि अलेक्जेंडर एक शूरवीर है और मेसन एक धूर्त है। मेसन ने नोट किया, \"अलेक्जेंडर एक शूरवीर नहीं है\"। आरिया के अनुसार, \"यदि माइकल एक शूरवीर है तो अलेक्जेंडर एक धूर्त है\"। अलेक्जेंडर ने आपको बताया कि आरिया एक धूर्त है और डैनियल एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक शूरवीर है  \n(2) सैमुएल एक शूरवीर है  \n(3) माइकल एक शूरवीर है  \n(4) सोफिया एक धूर्त है  \n(5) मेसन एक शूरवीर है  \n(6) आरिया एक शूरवीर है  \n(7) अलेक्जेंडर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: अमेलिया, लोगन, बेंजामिन, यूसुफ, माइकल, लुकास, और ज़ोई। अमेलिया ने आपको बताया कि ज़ोई एक धूर्त है यदि और केवल यदि माइकल एक धूर्त है। \"लोगन एक शूरवीर है यदि और केवल यदि अमेलिया एक धूर्त है\" - लोगन। \"यदि लोगन एक धूर्त है तो बेंजामिन एक शूरवीर है,\" बेंजामिन ने दावा किया। यूसुफ को यह कहते हुए सुना गया, \"यदि बेंजामिन एक धूर्त है तो लुकास एक शूरवीर है\"। माइकल ने कहा, \"अमेलिया एक शूरवीर है\"। \"यूसुफ एक धूर्त है यदि और केवल यदि माइकल एक शूरवीर है,\" लुकास ने दावा किया। ज़ोई ने कहा, \"लुकास एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक धूर्त है  \n(2) लोगन एक धूर्त है  \n(3) बेंजामिन एक धूर्त है  \n(4) यूसुफ एक धूर्त है  \n(5) माइकल एक धूर्त है  \n(6) लुकास एक धूर्त है  \n(7) ज़ोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: इसाबेला, ग्रेस, एलिज़ाबेथ, औरोरा, सोफिया, राइली, और अलेक्जेंडर। इसाबेला ने कहा, \"अलेक्जेंडर एक शूरवीर है या ग्रेस एक शूरवीर है\"। ग्रेस ने कहा, \"एलिज़ाबेथ एक धूर्त नहीं है\"। एलिज़ाबेथ ने कहा, \"एलिज़ाबेथ एक शूरवीर है और राइली एक शूरवीर है\"। औरोरा के अनुसार, \"सोफिया एक शूरवीर नहीं है\"। सोफिया को यह कहते हुए सुना गया, \"औरोरा एक शूरवीर है और अलेक्जेंडर एक धूर्त है\"। \"अलेक्जेंडर एक धूर्त है\" - राइली। अलेक्जेंडर ने कहा, \"अगर ग्रेस एक शूरवीर है तो इसाबेला एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक शूरवीर है  \n(2) ग्रेस एक धूर्त है  \n(3) एलिज़ाबेथ एक धूर्त है  \n(4) औरोरा एक शूरवीर है  \n(5) सोफिया एक धूर्त है  \n(6) राइली एक धूर्त है  \n(7) अलेक्जेंडर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ओलिवर, हार्पर, अलेक्जेंडर, ग्रेस, लुकास, एवलिन, और एला। ओलिवर ने कहा: \"हार्पर एक धूर्त है यदि और केवल यदि एला एक धूर्त है\"। हार्पर के शब्दों में: \"एला एक शूरवीर है और लुकास एक धूर्त है\"। \"ओलिवर एक शूरवीर है और लुकास एक धूर्त है\" - अलेक्जेंडर। ग्रेस को यह कहते हुए सुना गया, \"लुकास एक धूर्त है यदि और केवल यदि लुकास एक शूरवीर है\"। लुकास ने कहा, \"ओलिवर एक धूर्त है या ग्रेस एक धूर्त है।\" एवलिन ने कहा, \"लुकास एक शूरवीर नहीं है\"। \"ग्रेस एक शूरवीर है,\" एला ने दावा किया। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ओलिवर एक शूरवीर है  \n(2) हार्पर एक धूर्त है  \n(3) अलेक्जेंडर एक धूर्त है  \n(4) ग्रेस एक धूर्त है  \n(5) लुकास एक शूरवीर है  \n(6) एवलिन एक धूर्त है  \n(7) एला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: राइली, डेविड, विक्टोरिया, औरोरा, बेंजामिन, एलिज़ाबेथ, और ऐडन। राइली ने कहा, \"अगर एलिज़ाबेथ एक शूरवीर है तो विक्टोरिया एक धूर्त है।\" डेविड ने कहा कि ऐडन एक धूर्त है यदि और केवल यदि बेंजामिन एक धूर्त है। विक्टोरिया ने कहा, \"राइली एक शूरवीर नहीं है।\" औरोरा ने टिप्पणी की, \"विक्टोरिया एक धूर्त है या एलिज़ाबेथ एक धूर्त है।\" \"राइली एक शूरवीर है यदि और केवल यदि राइली एक धूर्त है,\" बेंजामिन ने घोषणा की। एलिज़ाबेथ ने कहा कि ऐडन एक धूर्त नहीं है। जैसे ऐडन ने कहा, \"औरोरा एक धूर्त नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक शूरवीर है  \n(2) डेविड एक धूर्त है  \n(3) विक्टोरिया एक धूर्त है  \n(4) औरोरा एक शूरवीर है  \n(5) बेंजामिन एक धूर्त है  \n(6) एलिज़ाबेथ एक शूरवीर है  \n(7) ऐडन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: राइली, बेंजामिन, माइकल, एमिली, नूह, मेसन, और लियम। \"एमिली एक शूरवीर है यदि और केवल यदि मेसन एक शूरवीर है\" - राइली। \"यदि नूह एक धूर्त है तो राइली एक धूर्त है,\" बेंजामिन ने घोषित किया। \"एमिली एक शूरवीर है या मेसन एक शूरवीर है,\" माइकल ने उल्लेख किया। एमिली ने कहा कि नूह एक धूर्त है या एमिली एक शूरवीर है। जैसे नूह ने कहा, \"राइली एक धूर्त है यदि और केवल यदि बेंजामिन एक शूरवीर है\"। \"बेंजामिन एक धूर्त है और मेसन एक शूरवीर है,\" मेसन ने दावा किया। लियम ने कहा कि माइकल एक शूरवीर है यदि और केवल यदि माइकल एक धूर्त है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) राइली एक धूर्त है  \n(2) बेंजामिन एक शूरवीर है  \n(3) माइकल एक शूरवीर है  \n(4) एमिली एक शूरवीर है  \n(5) नूह एक शूरवीर है  \n(6) मेसन एक धूर्त है  \n(7) लियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: स्कारलेट, ईथन, ज़ोई, एवा, लुकास, विक्टोरिया, और अलेक्जेंडर। स्कारलेट ने आपको बताया कि एवा एक शूरवीर है या ईथन एक शूरवीर है। ईथन ने कहा, \"अगर ईथन एक शूरवीर है तो अलेक्जेंडर एक धूर्त है।\" \"अगर स्कारलेट एक धूर्त है तो एवा एक शूरवीर है,\" ज़ोई ने कहा। एवा के शब्दों में: \"ज़ोई एक धूर्त नहीं है।\" लुकास को यह कहते हुए सुना गया, \"अलेक्जेंडर एक शूरवीर है और स्कारलेट एक धूर्त है।\" \"अगर लुकास एक धूर्त है तो ज़ोई एक धूर्त है,\" विक्टोरिया ने दावा किया। अलेक्जेंडर ने कहा, \"ईथन एक शूरवीर है और स्कारलेट एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) स्कारलेट एक शूरवीर है  \n(2) ईथन एक शूरवीर है  \n(3) ज़ोई एक शूरवीर है  \n(4) एवा एक शूरवीर है  \n(5) लुकास एक धूर्त है  \n(6) विक्टोरिया एक धूर्त है  \n(7) अलेक्जेंडर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: जैक, हेनरी, ल्यूक, एवरी, जेम्स, मेसन, और सैमुएल। जैक ने टिप्पणी की, \"जैक एक शूरवीर है यदि और केवल यदि सैमुएल एक धूर्त है\"। हेनरी के एक बयान में: \"एवरी एक धूर्त है और एवरी एक शूरवीर है\"। ल्यूक ने टिप्पणी की, \"जेम्स एक धूर्त है और एवरी एक धूर्त है\"। जैसे एवरी ने कहा, \"सैमुएल एक शूरवीर है या जैक एक धूर्त है\"। जेम्स ने आपको बताया कि मेसन एक धूर्त है यदि और केवल यदि एवरी एक शूरवीर है। मेसन ने आपको बताया कि हेनरी एक शूरवीर है और मेसन एक शूरवीर है। \"ल्यूक एक शूरवीर है और मेसन एक धूर्त है\" - सैमुएल। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक एक धूर्त है  \n(2) हेनरी एक धूर्त है  \n(3) ल्यूक एक धूर्त है  \n(4) एवरी एक शूरवीर है  \n(5) जेम्स एक शूरवीर है  \n(6) मेसन एक धूर्त है  \n(7) सैमुएल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: मैथ्यू, आरिया, ईथन, मिया, एवरी, क्लोई, और हार्पर। \"एवरी एक धूर्त है और हार्पर एक शूरवीर है,\" मैथ्यू ने कहा। आरिया ने टिप्पणी की, \"मिया एक धूर्त है यदि और केवल यदि मैथ्यू एक शूरवीर है\"। ईथन के एक बयान में: \"आरिया एक धूर्त है या मिया एक धूर्त है\"। मिया को यह कहते हुए सुना गया, \"यदि एवरी एक शूरवीर है तो एवरी एक धूर्त है\"। एवरी को यह कहते हुए सुना गया, \"मिया एक शूरवीर है या मिया एक धूर्त है\"। क्लोई ने टिप्पणी की, \"मिया एक धूर्त है यदि और केवल यदि आरिया एक धूर्त है\"। हार्पर ने कहा, \"ईथन एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक धूर्त है  \n(2) आरिया एक धूर्त है  \n(3) ईथन एक शूरवीर है  \n(4) मिया एक धूर्त है  \n(5) एवरी एक शूरवीर है  \n(6) क्लोई एक शूरवीर है  \n(7) हार्पर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: अबिगेल, आरिया, याकूब, लियम, जेम्स, अमेलिया, और डेविड। अबिगेल के शब्दों में: \"डेविड एक शूरवीर है यदि और केवल यदि लियम एक शूरवीर है\"। आरिया ने कहा, \"यदि अबिगेल एक शूरवीर है तो लियम एक शूरवीर है\"। \"अबिगेल एक धूर्त है\" - याकूब। जैसा कि लियम ने कहा, \"यदि अमेलिया एक शूरवीर है तो अबिगेल एक शूरवीर है\"। \"याकूब एक शूरवीर है या अमेलिया एक धूर्त है,\" जेम्स ने दावा किया। \"डेविड एक शूरवीर नहीं है\" - अमेलिया। डेविड ने कहा कि याकूब एक धूर्त है और डेविड एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) अबिगेल एक शूरवीर है  \n(2) आरिया एक शूरवीर है  \n(3) याकूब एक धूर्त है  \n(4) लियम एक शूरवीर है  \n(5) जेम्स एक शूरवीर है  \n(6) अमेलिया एक धूर्त है  \n(7) डेविड एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: विक्टोरिया, जैक्सन, जैक, याकूब, क्लोई, डैनियल, और लोगन। विक्टोरिया ने कहा कि अगर लोगन एक शूरवीर है तो डैनियल एक शूरवीर है। जैक्सन ने कहा कि लोगन एक धूर्त है या जैक एक धूर्त है। जैक के शब्दों में: \"अगर जैक्सन एक शूरवीर है तो विक्टोरिया एक शूरवीर है\"। याकूब ने आपको बताया कि अगर डैनियल एक शूरवीर है तो विक्टोरिया एक शूरवीर है। \"विक्टोरिया एक धूर्त नहीं है,\" क्लोई ने घोषणा की। डैनियल को यह कहते हुए सुना गया, \"याकूब एक शूरवीर है या जैक्सन एक धूर्त है\"। लोगन के एक बयान में: \"डैनियल एक शूरवीर नहीं है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) विक्टोरिया एक शूरवीर है  \n(2) जैक्सन एक शूरवीर है  \n(3) जैक एक शूरवीर है  \n(4) याकूब एक शूरवीर है  \n(5) क्लोई एक शूरवीर है  \n(6) डैनियल एक शूरवीर है  \n(7) लोगन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: जेम्स, अबिगेल, डैनियल, लुकास, ओलिवर, राइली, और मैथ्यू। जेम्स ने कहा: \"डैनियल एक धूर्त है\"। अबिगेल ने आपको बताया कि अगर राइली एक शूरवीर है तो लुकास एक शूरवीर है। डैनियल ने कहा, \"अगर राइली एक शूरवीर है तो लुकास एक शूरवीर है।\" लुकास के अनुसार, \"अगर डैनियल एक धूर्त है तो ओलिवर एक धूर्त है\"। ओलिवर ने कहा: \"डैनियल एक शूरवीर है और अबिगेल एक धूर्त है\"। राइली ने कहा कि अबिगेल एक शूरवीर नहीं है। मैथ्यू ने कहा, \"ओलिवर एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक धूर्त है  \n(2) अबिगेल एक शूरवीर है  \n(3) डैनियल एक शूरवीर है  \n(4) लुकास एक शूरवीर है  \n(5) ओलिवर एक धूर्त है  \n(6) राइली एक धूर्त है  \n(7) मैथ्यू एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: नूह, औरोरा, जैक, ओलिवर, मिया, एवलिन, और सोफिया। \"मिया एक शूरवीर है यदि और केवल यदि सोफिया एक शूरवीर है,\" नूह ने घोषणा की। औरोरा ने कहा, \"सोफिया एक शूरवीर है और मिया एक शूरवीर है\"। \"एवलिन एक धूर्त नहीं है\" - जैक। \"एवलिन एक धूर्त नहीं है,\" ओलिवर ने उल्लेख किया। \"यदि एवलिन एक शूरवीर है तो सोफिया एक धूर्त है,\" मिया ने घोषणा की। एवलिन ने कहा, \"जैक एक शूरवीर है या मिया एक शूरवीर है\"। सोफिया को यह कहते हुए सुना गया, \"नूह एक शूरवीर है और औरोरा एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक धूर्त है  \n(2) औरोरा एक धूर्त है  \n(3) जैक एक शूरवीर है  \n(4) ओलिवर एक शूरवीर है  \n(5) मिया एक शूरवीर है  \n(6) एवलिन एक शूरवीर है  \n(7) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: सैमुएल, लिली, लोगन, याकूब, विलियम, ऐडन, और हेनरी। सैमुएल के शब्दों में: \"लोगन एक धूर्त है और ऐडन एक शूरवीर है\"। लिली के शब्दों में: \"याकूब एक शूरवीर है यदि और केवल यदि विलियम एक शूरवीर है\"। लोगन ने कहा, \"यदि लिली एक धूर्त है तो सैमुएल एक शूरवीर है\"। याकूब ने कहा, \"यदि हेनरी एक धूर्त है तो सैमुएल एक धूर्त है\"। \"ऐडन एक शूरवीर है और हेनरी एक धूर्त है\" - विलियम। ऐडन को यह कहते हुए सुना गया, \"यदि लिली एक शूरवीर है तो हेनरी एक धूर्त है\"। हेनरी ने कहा, \"विलियम एक धूर्त है या ऐडन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक धूर्त है  \n(2) लिली एक शूरवीर है  \n(3) लोगन एक शूरवीर है  \n(4) याकूब एक शूरवीर है  \n(5) विलियम एक शूरवीर है  \n(6) ऐडन एक शूरवीर है  \n(7) हेनरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ल्यूक, ओलिवर, जेम्स, एवरी, जैक्सन, लोगन, और ओवेन। ल्यूक के अनुसार, \"एवरी एक धूर्त है\"। ओलिवर ने कहा, \"लोगन एक धूर्त है यदि और केवल यदि लोगन एक शूरवीर है\"। जेम्स ने कहा, \"एवरी एक धूर्त है और ल्यूक एक शूरवीर है\"। एवरी ने कहा, \"जेम्स एक शूरवीर है या लोगन एक धूर्त है\"। जैक्सन ने कहा, \"यदि जेम्स एक धूर्त है तो लोगन एक धूर्त है\"। लोगन ने कहा, \"एवरी एक धूर्त है\"। ओवेन ने कहा, \"यदि ओलिवर एक शूरवीर है तो जैक्सन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक धूर्त है  \n(2) ओलिवर एक धूर्त है  \n(3) जेम्स एक धूर्त है  \n(4) एवरी एक शूरवीर है  \n(5) जैक्सन एक शूरवीर है  \n(6) लोगन एक धूर्त है  \n(7) ओवेन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लियम, शार्लट, ग्रेस, सैमुएल, डैनियल, सोफिया, और ओलिवर। लियम के अनुसार, \"लियम एक शूरवीर है\"। शार्लट ने कहा, \"लियम एक शूरवीर है\"। ग्रेस ने कहा कि लियम एक धूर्त है यदि और केवल यदि डैनियल एक शूरवीर है। सैमुएल ने कहा, \"सोफिया एक धूर्त है यदि और केवल यदि डैनियल एक धूर्त है\"। डैनियल ने आपको बताया कि सैमुएल एक शूरवीर नहीं है। \"ओलिवर एक शूरवीर है या लियम एक शूरवीर है\" - सोफिया। ओलिवर ने कहा, \"डैनियल एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक धूर्त है  \n(2) शार्लट एक धूर्त है  \n(3) ग्रेस एक धूर्त है  \n(4) सैमुएल एक शूरवीर है  \n(5) डैनियल एक धूर्त है  \n(6) सोफिया एक धूर्त है  \n(7) ओलिवर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: शार्लट, एवलिन, नूह, अमेलिया, माइकल, जैक्सन, और ग्रेस। शार्लट ने कहा कि अगर एवलिन एक धूर्त है तो अमेलिया एक धूर्त है। एवलिन ने कहा कि ग्रेस एक धूर्त है या शार्लट एक धूर्त है। \"शार्लट एक शूरवीर है यदि और केवल यदि माइकल एक धूर्त है\" - नूह। अमेलिया ने आपको बताया कि ग्रेस एक धूर्त है। माइकल ने कहा कि जैक्सन एक धूर्त है और नूह एक शूरवीर है। \"अमेलिया एक शूरवीर है यदि और केवल यदि शार्लट एक शूरवीर है,\" जैक्सन ने कहा। \"शार्लट एक धूर्त है या एवलिन एक धूर्त है\" - ग्रेस। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) शार्लट एक शूरवीर है  \n(2) एवलिन एक शूरवीर है  \n(3) नूह एक शूरवीर है  \n(4) अमेलिया एक शूरवीर है  \n(5) माइकल एक धूर्त है  \n(6) जैक्सन एक शूरवीर है  \n(7) ग्रेस एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एमिली, शार्लट, जैक्सन, ओलिवर, सोफिया, सैमुएल, और डेविड। एमिली के अनुसार, \"जैक्सन एक धूर्त है यदि और केवल यदि सैमुएल एक धूर्त है\"। शार्लट ने आपको बताया कि सैमुएल एक धूर्त नहीं है। जैक्सन ने कहा, \"डेविड एक धूर्त है और सोफिया एक शूरवीर है\"। ओलिवर ने कहा, \"एमिली एक शूरवीर नहीं है\"। सोफिया ने व्यक्त किया कि एमिली एक धूर्त है या डेविड एक धूर्त है। \"शार्लट एक धूर्त है और सैमुएल एक शूरवीर है,\" सैमुएल ने घोषणा की। डेविड ने कहा, \"डेविड एक शूरवीर है और ओलिवर एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक धूर्त है  \n(2) शार्लट एक धूर्त है  \n(3) जैक्सन एक शूरवीर है  \n(4) ओलिवर एक शूरवीर है  \n(5) सोफिया एक शूरवीर है  \n(6) सैमुएल एक धूर्त है  \n(7) डेविड एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एवा, मिया, नूह, ईथन, माइकल, क्लोई, और अबिगेल। एवा के अनुसार, \"ईथन एक धूर्त है यदि और केवल यदि माइकल एक शूरवीर है\"। \"एवा एक शूरवीर है या माइकल एक धूर्त है\" - मिया। नूह ने कहा कि ईथन एक शूरवीर है और माइकल एक शूरवीर है। ईथन ने टिप्पणी की, \"मिया एक शूरवीर है\"। माइकल ने कहा कि ईथन एक धूर्त है या अबिगेल एक शूरवीर है। क्लोई ने कहा कि मिया एक शूरवीर है और ईथन एक धूर्त है। अबिगेल ने कहा, \"माइकल एक शूरवीर है या ईथन एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एवा एक शूरवीर है  \n(2) मिया एक शूरवीर है  \n(3) नूह एक धूर्त है  \n(4) ईथन एक शूरवीर है  \n(5) माइकल एक धूर्त है  \n(6) क्लोई एक धूर्त है  \n(7) अबिगेल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ओवेन, एमिली, लिली, हेनरी, हार्पर, औरोरा, और सोफिया। जैसे ओवेन ने कहा, \"ओवेन एक शूरवीर है\"। जैसे एमिली ने कहा, \"लिली एक धूर्त नहीं है\"। लिली ने कहा, \"अगर सोफिया एक शूरवीर है तो ओवेन एक शूरवीर है\"। हेनरी ने कहा, \"एमिली एक शूरवीर है या एमिली एक धूर्त है\"। हार्पर ने कहा, \"हार्पर एक शूरवीर है और औरोरा एक धूर्त है\"। औरोरा को यह कहते हुए सुना गया, \"हेनरी एक शूरवीर है या लिली एक शूरवीर है\"। सोफिया ने कहा कि लिली एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओवेन एक शूरवीर है  \n(2) एमिली एक शूरवीर है  \n(3) लिली एक शूरवीर है  \n(4) हेनरी एक शूरवीर है  \n(5) हार्पर एक धूर्त है  \n(6) औरोरा एक शूरवीर है  \n(7) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: अबिगेल, राइली, पेनलोप, लुकास, एवलिन, लिली, और मिया। अबिगेल ने कहा, \"एवलिन एक धूर्त है और लिली एक शूरवीर है।\" राइली ने कहा कि अगर मिया एक शूरवीर है तो अबिगेल एक धूर्त है। पेनलोप ने कहा: \"एवलिन एक शूरवीर है और लुकास एक धूर्त है।\" लुकास ने कहा: \"मिया एक शूरवीर है और एवलिन एक शूरवीर है।\" एवलिन ने टिप्पणी की, \"लिली एक शूरवीर है या राइली एक शूरवीर है।\" \"मिया एक धूर्त है या एवलिन एक धूर्त है,\" लिली ने कहा। मिया ने टिप्पणी की, \"पेनलोप एक शूरवीर है और लुकास एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अबिगेल एक धूर्त है  \n(2) राइली एक शूरवीर है  \n(3) पेनलोप एक शूरवीर है  \n(4) लुकास एक धूर्त है  \n(5) एवलिन एक शूरवीर है  \n(6) लिली एक शूरवीर है  \n(7) मिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ओलिविया, अबिगेल, अमेलिया, एलिज़ाबेथ, हार्पर, औरोरा, और सोफिया। ओलिविया के अनुसार, \"अमेलिया एक धूर्त नहीं है।\" \"सोफिया एक शूरवीर नहीं है,\" अबिगेल ने दावा किया। \"अगर सोफिया एक शूरवीर है तो हार्पर एक शूरवीर है,\" अमेलिया ने उल्लेख किया। \"हार्पर एक धूर्त नहीं है,\" एलिज़ाबेथ ने घोषित किया। \"अबिगेल एक धूर्त है,\" हार्पर ने उल्लेख किया। औरोरा ने कहा, \"एलिज़ाबेथ एक शूरवीर है या अमेलिया एक धूर्त है।\" \"अगर एलिज़ाबेथ एक धूर्त है तो ओलिविया एक शूरवीर है,\" सोफिया ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक शूरवीर है  \n(2) अबिगेल एक धूर्त है  \n(3) अमेलिया एक शूरवीर है  \n(4) एलिज़ाबेथ एक शूरवीर है  \n(5) हार्पर एक शूरवीर है  \n(6) औरोरा एक शूरवीर है  \n(7) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: जेम्स, ईथन, पेनलोप, हेनरी, ओलिवर, माइकल, और विलियम। जेम्स ने कहा कि विलियम एक शूरवीर है या पेनलोप एक शूरवीर है। ईथन ने कहा, \"पेनलोप एक धूर्त है और माइकल एक शूरवीर है।\" \"माइकल एक शूरवीर है यदि और केवल यदि ईथन एक धूर्त है,\" पेनलोप ने घोषणा की। हेनरी ने कहा, \"जेम्स एक धूर्त है।\" ओलिवर के अनुसार, \"विलियम एक धूर्त है।\" माइकल के शब्दों में: \"यदि जेम्स एक शूरवीर है तो विलियम एक धूर्त है।\" जैसे विलियम ने कहा, \"पेनलोप एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक धूर्त है  \n(2) ईथन एक शूरवीर है  \n(3) पेनलोप एक धूर्त है  \n(4) हेनरी एक शूरवीर है  \n(5) ओलिवर एक शूरवीर है  \n(6) माइकल एक शूरवीर है  \n(7) विलियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: नूह, स्कारलेट, औरोरा, ओलिवर, जेम्स, हार्पर, और मिया। \"मिया एक शूरवीर है या मिया एक धूर्त है\" - नूह। स्कारलेट ने कहा, \"मिया एक शूरवीर है\"। \"ओलिवर एक शूरवीर नहीं है,\" औरोरा ने घोषित किया। ओलिवर के एक बयान में: \"औरोरा एक धूर्त है या औरोरा एक शूरवीर है\"। जेम्स ने कहा, \"स्कारलेट एक शूरवीर है और औरोरा एक शूरवीर है\"। हार्पर के अनुसार, \"अगर नूह एक धूर्त है तो स्कारलेट एक धूर्त है\"। मिया ने कहा कि स्कारलेट एक धूर्त है और मिया एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) नूह एक शूरवीर है  \n(2) स्कारलेट एक धूर्त है  \n(3) औरोरा एक धूर्त है  \n(4) ओलिवर एक शूरवीर है  \n(5) जेम्स एक धूर्त है  \n(6) हार्पर एक शूरवीर है  \n(7) मिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: इसाबेला, विलियम, एमिली, जेम्स, जैक्सन, लोगन, और आरिया। इसाबेला के अनुसार, \"अगर लोगन एक शूरवीर है तो एमिली एक शूरवीर है\"। विलियम के एक बयान में: \"इसाबेला एक शूरवीर नहीं है\"। एमिली के शब्दों में: \"विलियम एक शूरवीर है यदि और केवल यदि जेम्स एक शूरवीर है\"। जेम्स ने कहा, \"जैक्सन एक शूरवीर नहीं है\"। \"अगर लोगन एक धूर्त है तो जेम्स एक शूरवीर है,\" जैक्सन ने कहा। लोगन को यह कहते हुए सुना गया, \"एमिली एक शूरवीर है और इसाबेला एक शूरवीर है\"। आरिया ने टिप्पणी की, \"अगर इसाबेला एक शूरवीर है तो विलियम एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक शूरवीर है  \n(2) विलियम एक धूर्त है  \n(3) एमिली एक शूरवीर है  \n(4) जेम्स एक धूर्त है  \n(5) जैक्सन एक शूरवीर है  \n(6) लोगन एक शूरवीर है  \n(7) आरिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लुकास, अमेलिया, ईथन, लियम, जेम्स, स्कारलेट, और मेसन। लुकास के शब्दों में: \"मेसन शूरवीर नहीं है\"। \"लियम शूरवीर है यदि और केवल यदि लियम धूर्त है,\" अमेलिया ने घोषणा की। ईथन को यह कहते हुए सुना गया, \"जेम्स शूरवीर है और लियम शूरवीर है\"। लियम ने कहा, \"स्कारलेट शूरवीर है और जेम्स धूर्त है।\" जेम्स ने कहा, \"स्कारलेट शूरवीर नहीं है।\" स्कारलेट ने कहा, \"यदि अमेलिया शूरवीर है तो लियम शूरवीर है।\" मेसन के अनुसार, \"ईथन धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक शूरवीर है  \n(2) अमेलिया एक धूर्त है  \n(3) ईथन एक धूर्त है  \n(4) लियम एक शूरवीर है  \n(5) जेम्स एक धूर्त है  \n(6) स्कारलेट एक शूरवीर है  \n(7) मेसन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एमिली, राइली, हेनरी, ज़ोई, नूह, जैक्सन, और अबिगेल। एमिली ने कहा, \"अगर अबिगेल एक धूर्त है तो हेनरी एक धूर्त है\"। राइली ने कहा कि जैक्सन एक शूरवीर है और नूह एक शूरवीर है। हेनरी ने कहा: \"अबिगेल एक शूरवीर है और एमिली एक धूर्त है\"। ज़ोई के एक बयान में: \"जैक्सन एक धूर्त नहीं है\"। नूह ने टिप्पणी की, \"हेनरी एक शूरवीर है\"। जैक्सन ने कहा कि राइली एक शूरवीर नहीं है। अबिगेल ने कहा, \"अगर नूह एक शूरवीर है तो एमिली एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक शूरवीर है  \n(2) राइली एक धूर्त है  \n(3) हेनरी एक धूर्त है  \n(4) ज़ोई एक शूरवीर है  \n(5) नूह एक धूर्त है  \n(6) जैक्सन एक शूरवीर है  \n(7) अबिगेल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: हार्पर, एवरी, एलिज़ाबेथ, नूह, शार्लट, एला, और एवा। \"शार्लट एक शूरवीर है,\" हार्पर ने दावा किया। एवरी के एक बयान में: \"अगर एवा एक शूरवीर है तो हार्पर एक धूर्त है\"। एलिज़ाबेथ ने नोट किया, \"हार्पर एक धूर्त है\"। नूह ने asserted किया: \"एलिज़ाबेथ एक शूरवीर है या हार्पर एक धूर्त है\"। शार्लट के एक बयान में: \"एवरी एक शूरवीर है और एवा एक शूरवीर है\"। जैसे एला ने कहा, \"शार्लट एक धूर्त है\"। जैसे एवा ने कहा, \"हार्पर एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) हार्पर एक धूर्त है  \n(2) एवरी एक शूरवीर है  \n(3) एलिज़ाबेथ एक शूरवीर है  \n(4) नूह एक शूरवीर है  \n(5) शार्लट एक धूर्त है  \n(6) एला एक शूरवीर है  \n(7) एवा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: इसाबेला, सोफिया, लियम, सेबेस्टियन, माइकल, अलेक्जेंडर, और ऐडन। इसाबेला ने कहा: \"लियम एक शूरवीर है\"। सोफिया ने कहा, \"सेबेस्टियन एक शूरवीर है।\" लियम ने कहा: \"अगर अलेक्जेंडर एक शूरवीर है तो इसाबेला एक शूरवीर है\"। सेबेस्टियन ने कहा, \"अलेक्जेंडर एक धूर्त है\"। माइकल ने टिप्पणी की, \"सेबेस्टियन एक शूरवीर है यदि और केवल यदि सोफिया एक धूर्त है\"। अलेक्जेंडर ने कहा, \"लियम एक धूर्त नहीं है\"। ऐडन ने कहा: \"अगर इसाबेला एक धूर्त है तो सेबेस्टियन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक शूरवीर है  \n(2) सोफिया एक धूर्त है  \n(3) लियम एक शूरवीर है  \n(4) सेबेस्टियन एक धूर्त है  \n(5) माइकल एक धूर्त है  \n(6) अलेक्जेंडर एक शूरवीर है  \n(7) ऐडन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: हार्पर, जैक्सन, हेनरी, ग्रेस, ओवेन, लियम, और आरिया। हार्पर ने कहा: \"ग्रेस एक धूर्त है\"। जैक्सन ने कहा, \"हेनरी एक धूर्त है या आरिया एक धूर्त है।\" \"लियम एक धूर्त है यदि और केवल यदि ओवेन एक धूर्त है,\" हेनरी ने दावा किया। ग्रेस ने कहा कि जैक्सन एक धूर्त है और हार्पर एक शूरवीर है। ओवेन ने नोट किया, \"यदि हेनरी एक धूर्त है तो जैक्सन एक शूरवीर है\"। लियम ने कहा: \"आरिया एक शूरवीर है और हेनरी एक शूरवीर है\"। \"हेनरी एक शूरवीर है और ग्रेस एक धूर्त है\" - आरिया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक शूरवीर है  \n(2) जैक्सन एक शूरवीर है  \n(3) हेनरी एक धूर्त है  \n(4) ग्रेस एक धूर्त है  \n(5) ओवेन एक शूरवीर है  \n(6) लियम एक धूर्त है  \n(7) आरिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त निवास करते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: अलेक्जेंडर, मैथ्यू, ओलिविया, एवलिन, याकूब, शार्लट, और इसाबेला। \"एवलिन एक शूरवीर है यदि और केवल यदि एवलिन एक धूर्त है,\" अलेक्जेंडर ने कहा। मैथ्यू ने कहा: \"इसाबेला एक शूरवीर है\"। ओलिविया ने कहा कि ओलिविया एक शूरवीर है या याकूब एक शूरवीर है। एवलिन ने कहा: \"अलेक्जेंडर एक शूरवीर है\"। याकूब ने कहा, \"शार्लट एक शूरवीर है और अलेक्जेंडर एक धूर्त है\"। शार्लट के शब्दों में: \"अलेक्जेंडर एक शूरवीर नहीं है\"। इसाबेला के शब्दों में: \"एवलिन एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अलेक्जेंडर एक धूर्त है  \n(2) मैथ्यू एक धूर्त है  \n(3) ओलिविया एक शूरवीर है  \n(4) एवलिन एक धूर्त है  \n(5) याकूब एक शूरवीर है  \n(6) शार्लट एक शूरवीर है  \n(7) इसाबेला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: विलियम, अबिगेल, ऐडन, एवलिन, सोफिया, विक्टोरिया, और ओवेन। विलियम ने कहा कि सोफिया एक शूरवीर है। अबिगेल ने कहा, \"विलियम एक शूरवीर नहीं है।\" ऐडन ने कहा, \"एवलिन एक शूरवीर है या ऐडन एक शूरवीर है।\" एवलिन ने कहा, \"अबिगेल एक शूरवीर है या अबिगेल एक धूर्त है।\" सोफिया को यह कहते हुए सुना गया, \"एवलिन एक धूर्त नहीं है।\" विक्टोरिया ने कहा, \"विलियम एक शूरवीर है या अबिगेल एक शूरवीर है।\" ओवेन के अनुसार, \"विक्टोरिया एक शूरवीर है और अबिगेल एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) अबिगेल एक धूर्त है  \n(3) ऐडन एक शूरवीर है  \n(4) एवलिन एक शूरवीर है  \n(5) सोफिया एक शूरवीर है  \n(6) विक्टोरिया एक शूरवीर है  \n(7) ओवेन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: यूसुफ, जेम्स, एला, सेबेस्टियन, आरिया, बेंजामिन, और लिली। यूसुफ ने टिप्पणी की, \"सेबेस्टियन एक शूरवीर है या जेम्स एक शूरवीर है\"। जेम्स ने remarked किया, \"एला एक शूरवीर है और यूसुफ एक शूरवीर है\"। एला ने कहा, \"बेंजामिन एक शूरवीर नहीं है\"। \"बेंजामिन एक शूरवीर नहीं है,\" सेबेस्टियन ने घोषित किया। आरिया ने आपको बताया कि यूसुफ एक शूरवीर है यदि और केवल यदि बेंजामिन एक शूरवीर है। बेंजामिन ने कहा कि लिली एक धूर्त है यदि और केवल यदि आरिया एक शूरवीर है। \"बेंजामिन एक शूरवीर है या आरिया एक धूर्त है,\" लिली ने दावा किया। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) यूसुफ एक धूर्त है  \n(2) जेम्स एक धूर्त है  \n(3) एला एक धूर्त है  \n(4) सेबेस्टियन एक धूर्त है  \n(5) आरिया एक धूर्त है  \n(6) बेंजामिन एक शूरवीर है  \n(7) लिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ज़ोई, एला, जैक, डैनियल, जैक्सन, एवलिन, और विलियम। ज़ोई ने कहा, \"ज़ोई एक शूरवीर है या विलियम एक शूरवीर है\"। \"अगर एवलिन एक धूर्त है तो एवलिन एक शूरवीर है,\" एला ने दावा किया। \"ज़ोई एक शूरवीर है,\" जैक ने उल्लेख किया। डैनियल ने कहा, \"जैक्सन एक धूर्त है या जैक एक शूरवीर है\"। जैक्सन ने कहा, \"अगर एवलिन एक शूरवीर है तो विलियम एक धूर्त है\"। एवलिन के अनुसार, \"ज़ोई एक धूर्त है और जैक्सन एक शूरवीर है\"। विलियम के एक बयान में: \"ज़ोई एक धूर्त है और एवलिन एक शूरवीर है\"। तो कौन एक शूरवीर है और कौन एक धूर्त है?",
        "solution_text_format": "(1) ज़ोई एक शूरवीर है  \n(2) एला एक धूर्त है  \n(3) जैक एक शूरवीर है  \n(4) डैनियल एक शूरवीर है  \n(5) जैक्सन एक शूरवीर है  \n(6) एवलिन एक धूर्त है  \n(7) विलियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: सैमुएल, माइकल, डैनियल, लियम, मेसन, एलिज़ाबेथ, और आरिया। सैमुएल ने कहा, \"माइकल शूरवीर नहीं है\"। माइकल के शब्दों में: \"मेसेन धूर्त है\"। डैनियल ने कहा कि आरिया धूर्त है। \"लियम शूरवीर है या सैमुएल शूरवीर है,\" लियम ने दावा किया। \"डैनियल शूरवीर है यदि और केवल यदि लियम धूर्त है,\" मेसन ने कहा। \"आरिया शूरवीर है या आरिया धूर्त है,\" एलिज़ाबेथ ने कहा। आरिया ने कहा कि लियम धूर्त है यदि और केवल यदि आरिया शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक धूर्त है  \n(2) माइकल एक शूरवीर है  \n(3) डैनियल एक धूर्त है  \n(4) लियम एक धूर्त है  \n(5) मेसन एक धूर्त है  \n(6) एलिज़ाबेथ एक शूरवीर है  \n(7) आरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लियम, ऐडन, अबिगेल, एवरी, सोफिया, हेनरी, और इसाबेला। जैसा कि लियम ने कहा, \"सोफिया एक शूरवीर है यदि और केवल यदि अबिगेल एक धूर्त है\"। जैसा कि ऐडन ने कहा, \"ऐडन एक शूरवीर है और इसाबेला एक शूरवीर है\"। अबिगेल के शब्दों में: \"एवरी एक धूर्त है और लियम एक शूरवीर है\"। \"यदि अबिगेल एक धूर्त है तो ऐडन एक शूरवीर है\" - एवरी। सोफिया के अनुसार, \"एवरी एक शूरवीर है या सोफिया एक शूरवीर है\"। हेनरी ने कहा कि अबिगेल एक शूरवीर है। इसाबेला ने कहा, \"एवरी एक धूर्त है और सोफिया एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक धूर्त है  \n(2) ऐडन एक धूर्त है  \n(3) अबिगेल एक धूर्त है  \n(4) एवरी एक धूर्त है  \n(5) सोफिया एक धूर्त है  \n(6) हेनरी एक धूर्त है  \n(7) इसाबेला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ओलिविया, अमेलिया, सैमुएल, एवा, माइकल, शार्लट, और अलेक्जेंडर। जैसे ओलिविया ने कहा, \"अलेक्जेंडर एक शूरवीर है या अलेक्जेंडर एक धूर्त है\"। अमेलिया के एक बयान में: \"ओलिविया एक धूर्त नहीं है\"। \"माइकल एक धूर्त है और एवा एक धूर्त है,\" सैमुएल ने कहा। एवा ने कहा: \"ओलिविया एक शूरवीर है या अमेलिया एक धूर्त है\"। माइकल के शब्दों में: \"अलेक्जेंडर एक धूर्त है और ओलिविया एक धूर्त है\"। शार्लट ने आपको बताया कि सैमुएल एक धूर्त नहीं है। \"सैमुएल एक धूर्त है और ओलिविया एक धूर्त है\" - अलेक्जेंडर। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक शूरवीर है  \n(2) अमेलिया एक शूरवीर है  \n(3) सैमुएल एक धूर्त है  \n(4) एवा एक शूरवीर है  \n(5) माइकल एक धूर्त है  \n(6) शार्लट एक धूर्त है  \n(7) अलेक्जेंडर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: विलियम, अमेलिया, सोफिया, ओवेन, जैक, यूसुफ, और डेविड। विलियम के शब्दों में: \"अगर विलियम एक शूरवीर है तो डेविड एक धूर्त है\"। \"यूसुफ एक धूर्त है या विलियम एक धूर्त है,\" अमेलिया ने कहा। सोफिया ने टिप्पणी की, \"विलियम एक धूर्त नहीं है\"। ओवेन ने asserted किया: \"अमेलिया एक शूरवीर है यदि और केवल यदि यूसुफ एक शूरवीर है\"। जैक को कहते हुए सुना गया, \"अगर विलियम एक धूर्त है तो अमेलिया एक शूरवीर है\"। यूसुफ ने नोट किया, \"अमेलिया एक धूर्त है और ओवेन एक शूरवीर है\"। \"विलियम एक शूरवीर है और यूसुफ एक शूरवीर है,\" डेविड ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) अमेलिया एक शूरवीर है  \n(3) सोफिया एक शूरवीर है  \n(4) ओवेन एक धूर्त है  \n(5) जैक एक शूरवीर है  \n(6) यूसुफ एक धूर्त है  \n(7) डेविड एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: हेनरी, सोफिया, मिया, जैक्सन, ओलिवर, सैमुएल, और औरोरा। \"ओलिवर एक शूरवीर है और सोफिया एक धूर्त है,\" हेनरी ने दावा किया। \"सोफिया एक शूरवीर है\" - सोफिया। \"जैक्सन एक शूरवीर है यदि और केवल यदि हेनरी एक शूरवीर है\" - मिया। जैक्सन ने कहा, \"सोफिया एक शूरवीर है\"। ओलिवर ने कहा, \"जैक्सन एक शूरवीर है या मिया एक शूरवीर है\"। सैमुएल ने आपको बताया कि मिया एक शूरवीर है यदि और केवल यदि जैक्सन एक धूर्त है। औरोरा ने कहा कि सैमुएल एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हेनरी एक धूर्त है  \n(2) सोफिया एक शूरवीर है  \n(3) मिया एक धूर्त है  \n(4) जैक्सन एक शूरवीर है  \n(5) ओलिवर एक शूरवीर है  \n(6) सैमुएल एक शूरवीर है  \n(7) औरोरा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: विलियम, आरिया, सेबेस्टियन, इसाबेला, एवलिन, पेनलोप, और ग्रेस। \"इसाबेला एक धूर्त है यदि और केवल यदि ग्रेस एक धूर्त है,\" विलियम ने दावा किया। आरिया के एक बयान में: \"ग्रेस एक धूर्त है या ग्रेस एक शूरवीर है\"। सेबेस्टियन ने नोट किया, \"एवलिन एक धूर्त है\"। \"इसाबेला एक शूरवीर है या ग्रेस एक शूरवीर है\" - इसाबेला। \"पेनलोप एक धूर्त है और पेनलोप एक शूरवीर है,\" एवलिन ने उल्लेख किया। पेनलोप ने टिप्पणी की, \"आरिया एक शूरवीर है\"। ग्रेस ने नोट किया, \"यदि पेनलोप एक शूरवीर है तो आरिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) आरिया एक शूरवीर है  \n(3) सेबेस्टियन एक शूरवीर है  \n(4) इसाबेला एक शूरवीर है  \n(5) एवलिन एक धूर्त है  \n(6) पेनलोप एक शूरवीर है  \n(7) ग्रेस एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लिली, यूसुफ, डैनियल, सोफिया, एवरी, सोफिया, और नूह। लिली ने कहा कि अगर सोफिया एक धूर्त है तो एवरी एक धूर्त है। यूसुफ ने नोट किया, \"एवरी एक शूरवीर नहीं है\"। डैनियल के शब्दों में: \"नूह एक धूर्त है\"। जैसे सोफिया ने कहा, \"अगर एवरी एक शूरवीर है तो लिली एक शूरवीर है\"। जैसे एवरी ने कहा, \"सोफिया एक शूरवीर है\"। सोफिया ने आपको बताया कि एवरी एक धूर्त नहीं है। \"यूसुफ एक धूर्त है या एवरी एक धूर्त है,\" नूह ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लिली एक शूरवीर है  \n(2) यूसुफ एक धूर्त है  \n(3) डैनियल एक धूर्त है  \n(4) सोफिया एक शूरवीर है  \n(5) एवरी एक शूरवीर है  \n(6) सोफिया एक शूरवीर है  \n(7) नूह एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: हार्पर, यूसुफ, लिली, ओवेन, क्लोई, जेम्स, और एवलिन। हार्पर ने कहा, \"एवलिन एक धूर्त है या यूसुफ एक धूर्त है।\" यूसुफ ने कहा, \"जेम्स एक धूर्त है या एवलिन एक शूरवीर है।\" \"हार्पर एक धूर्त है या यूसुफ एक शूरवीर है\" - लिली। ओवेन ने कहा कि अगर जेम्स एक शूरवीर है तो जेम्स एक धूर्त है। \"जेम्स एक शूरवीर है या यूसुफ एक धूर्त है,\" क्लोई ने कहा। जेम्स ने टिप्पणी की, \"हार्पर एक धूर्त है यदि और केवल यदि यूसुफ एक शूरवीर है।\" एवलिन के एक बयान में: \"ओवेन एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक शूरवीर है  \n(2) यूसुफ एक धूर्त है  \n(3) लिली एक धूर्त है  \n(4) ओवेन एक धूर्त है  \n(5) क्लोई एक शूरवीर है  \n(6) जेम्स एक शूरवीर है  \n(7) एवलिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: हेनरी, क्लोई, याकूब, एला, लियम, मेसन, और माइकल। हेनरी के अनुसार, \"अगर मेसन एक धूर्त है तो याकूब एक धूर्त है\"। क्लोई ने कहा: \"अगर माइकल एक धूर्त है तो याकूब एक धूर्त है\"। \"लियम एक धूर्त है और हेनरी एक शूरवीर है\" - याकूब। एला ने कहा कि क्लोई एक धूर्त है यदि और केवल यदि मेसन एक धूर्त है। लियम ने कहा, \"माइकल एक धूर्त है\"। मेसन ने कहा: \"माइकल एक शूरवीर है\"। माइकल ने आपको बताया कि हेनरी एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हेनरी एक शूरवीर है  \n(2) क्लोई एक शूरवीर है  \n(3) याकूब एक शूरवीर है  \n(4) एला एक शूरवीर है  \n(5) लियम एक धूर्त है  \n(6) मेसन एक शूरवीर है  \n(7) माइकल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: हार्पर, ओलिविया, पेनलोप, अमेलिया, क्लोई, बेंजामिन, और एला। \"अगर बेंजामिन एक धूर्त है तो बेंजामिन एक शूरवीर है,\" हार्पर ने कहा। ओलिविया ने आपको बताया कि हार्पर एक धूर्त है या पेनलोप एक शूरवीर है। पेनलोप ने कहा, \"हार्पर एक शूरवीर है या बेंजामिन एक शूरवीर है\"। अमेलिया ने कहा: \"हार्पर एक धूर्त है यदि और केवल यदि ओलिविया एक धूर्त है\"। क्लोई के शब्दों में: \"एला एक धूर्त है यदि और केवल यदि पेनलोप एक धूर्त है\"। बेंजामिन के शब्दों में: \"एला एक शूरवीर नहीं है\"। एला के एक बयान में: \"क्लोई एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक शूरवीर है  \n(2) ओलिविया एक शूरवीर है  \n(3) पेनलोप एक शूरवीर है  \n(4) अमेलिया एक शूरवीर है  \n(5) क्लोई एक धूर्त है  \n(6) बेंजामिन एक शूरवीर है  \n(7) एला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ऐडन, अलेक्जेंडर, याकूब, औरोरा, माइकल, इसाबेला, और हेनरी। ऐडन ने टिप्पणी की, \"ऐडन एक शूरवीर है और औरोरा एक शूरवीर है\"। \"ऐडन एक शूरवीर है यदि और केवल यदि औरोरा एक धूर्त है,\" अलेक्जेंडर ने दावा किया। याकूब ने कहा, \"ऐडन एक शूरवीर है।\" औरोरा के एक बयान में: \"माइकल एक शूरवीर है यदि और केवल यदि याकूब एक धूर्त है\"। माइकल ने asserted किया: \"इसाबेला एक शूरवीर नहीं है\"। इसाबेला ने टिप्पणी की, \"औरोरा एक शूरवीर है या अलेक्जेंडर एक शूरवीर है\"। हेनरी ने आपको बताया कि यदि औरोरा एक धूर्त है तो ऐडन एक धूर्त है। तो कौन एक शूरवीर है और कौन एक धूर्त है?",
        "solution_text_format": "(1) ऐडन एक शूरवीर है  \n(2) अलेक्जेंडर एक धूर्त है  \n(3) याकूब एक शूरवीर है  \n(4) औरोरा एक शूरवीर है  \n(5) माइकल एक धूर्त है  \n(6) इसाबेला एक शूरवीर है  \n(7) हेनरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एवलिन, बेंजामिन, लिली, एमिली, ऐडन, अलेक्जेंडर, और मैथ्यू। \"ऐडन धूर्त नहीं है\" - एवलिन। बेंजामिन के अनुसार, \"अलेक्जेंडर एक धूर्त है\"। लिली ने कहा कि मैथ्यू एक शूरवीर है और एवलिन एक शूरवीर है। जैसे कि एमिली ने कहा, \"लिली एक धूर्त है और एवलिन एक धूर्त है\"। ऐडन को यह कहते हुए सुना गया, \"मैथ्यू एक धूर्त है या अलेक्जेंडर एक धूर्त है\"। जैसे कि अलेक्जेंडर ने कहा, \"ऐडन धूर्त नहीं है\"। मैथ्यू ने कहा कि बेंजामिन एक शूरवीर है या मैथ्यू एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक शूरवीर है  \n(2) बेंजामिन एक धूर्त है  \n(3) लिली एक धूर्त है  \n(4) एमिली एक धूर्त है  \n(5) ऐडन एक शूरवीर है  \n(6) अलेक्जेंडर एक शूरवीर है  \n(7) मैथ्यू एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: इसाबेला, मैथ्यू, ऐडन, क्लोई, जैक्सन, शार्लट, और ईथन। इसाबेला ने कहा, \"शार्लट एक शूरवीर नहीं है\"। मैथ्यू के शब्दों में: \"ऐडन एक धूर्त है और क्लोई एक शूरवीर है\"। ऐडन के बयान में: \"अगर इसाबेला एक धूर्त है तो शार्लट एक शूरवीर है\"। क्लोई ने कहा, \"मैथ्यू एक धूर्त है और ईथन एक शूरवीर है\"। जैक्सन ने आपको बताया कि मैथ्यू एक शूरवीर है और शार्लट एक शूरवीर है। \"जैक्सन एक शूरवीर नहीं है,\" शार्लट ने घोषणा की। ईथन ने कहा: \"इसाबेला एक धूर्त है यदि और केवल यदि मैथ्यू एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक धूर्त है  \n(2) मैथ्यू एक धूर्त है  \n(3) ऐडन एक शूरवीर है  \n(4) क्लोई एक शूरवीर है  \n(5) जैक्सन एक धूर्त है  \n(6) शार्लट एक शूरवीर है  \n(7) ईथन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ओलिवर, लियम, विलियम, सोफिया, ज़ोई, ल्यूक, और लिली। ओलिवर ने कहा, \"अगर ल्यूक एक शूरवीर है तो लिली एक शूरवीर है\"। लियम ने कहा: \"विलियम एक शूरवीर है और लिली एक धूर्त है\"। विलियम ने टिप्पणी की, \"लिली एक धूर्त है और सोफिया एक धूर्त है\"। सोफिया के एक बयान में: \"ज़ोई एक शूरवीर है यदि और केवल यदि ज़ोई एक धूर्त है\"। ज़ोई ने कहा कि लिली एक धूर्त है या सोफिया एक शूरवीर है। \"विलियम एक धूर्त नहीं है,\" ल्यूक ने दावा किया। लिली को यह कहते हुए सुना गया, \"सोफिया एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिवर एक धूर्त है  \n(2) लियम एक शूरवीर है  \n(3) विलियम एक शूरवीर है  \n(4) सोफिया एक धूर्त है  \n(5) ज़ोई एक शूरवीर है  \n(6) ल्यूक एक शूरवीर है  \n(7) लिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: मिया, स्कारलेट, एला, ग्रेस, अबिगेल, नूह, और जेम्स। मिया ने कहा, \"अबिगेल एक धूर्त है और नूह एक धूर्त है\"। स्कारलेट ने कहा कि अबिगेल एक शूरवीर है या मिया एक धूर्त है। एला ने टिप्पणी की, \"मिया एक शूरवीर है या जेम्स एक शूरवीर है\"। ग्रेस के अनुसार, \"मिया एक धूर्त है\"। अबिगेल को यह कहते हुए सुना गया, \"ग्रेस एक शूरवीर है या अबिगेल एक शूरवीर है\"। नूह के शब्दों में: \"एला एक धूर्त नहीं है\"। जेम्स ने टिप्पणी की, \"अगर स्कारलेट एक धूर्त है तो ग्रेस एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक धूर्त है  \n(2) स्कारलेट एक शूरवीर है  \n(3) एला एक शूरवीर है  \n(4) ग्रेस एक शूरवीर है  \n(5) अबिगेल एक शूरवीर है  \n(6) नूह एक शूरवीर है  \n(7) जेम्स एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: मैथ्यू, औरोरा, लुकास, ग्रेस, शार्लट, आरिया, और मिया। मैथ्यू ने कहा, \"ग्रेस धूर्त नहीं है\"। \"मिया धूर्त है यदि और केवल यदि शार्लट धूर्त है\" - औरोरा। लुकास को यह कहते हुए सुना गया, \"मिया धूर्त है या आरिया शूरवीर है\"। ग्रेस ने कहा, \"लुकास धूर्त है\"। शार्लट को यह कहते हुए सुना गया, \"आरिया धूर्त है और मैथ्यू शूरवीर है\"। \"मिया धूर्त है या ग्रेस धूर्त है,\" आरिया ने घोषणा की। \"मैथ्यू शूरवीर है और औरोरा धूर्त है,\" मिया ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक धूर्त है  \n(2) औरोरा एक शूरवीर है  \n(3) लुकास एक शूरवीर है  \n(4) ग्रेस एक धूर्त है  \n(5) शार्लट एक धूर्त है  \n(6) आरिया एक शूरवीर है  \n(7) मिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: माइकल, लिली, लुकास, जैक्सन, एवा, मैथ्यू, और हार्पर। माइकल ने कहा: \"मैथ्यू एक धूर्त है या एवा एक शूरवीर है\"। \"लिली एक शूरवीर है या लुकास एक शूरवीर है,\" लिली ने दावा किया। लुकास ने कहा, \"अगर हार्पर एक धूर्त है तो हार्पर एक शूरवीर है\"। जैक्सन को यह कहते हुए सुना गया, \"माइकल एक शूरवीर है यदि और केवल यदि माइकल एक धूर्त है\"। एवा के शब्दों में: \"मैथ्यू एक शूरवीर है यदि और केवल यदि हार्पर एक शूरवीर है\"। मैथ्यू ने टिप्पणी की, \"जैक्सन एक शूरवीर है\"। \"अगर लिली एक धूर्त है तो मैथ्यू एक धूर्त है\" - हार्पर। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक शूरवीर है  \n(2) लिली एक शूरवीर है  \n(3) लुकास एक शूरवीर है  \n(4) जैक्सन एक धूर्त है  \n(5) एवा एक धूर्त है  \n(6) मैथ्यू एक धूर्त है  \n(7) हार्पर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: पेनलोप, अबिगेल, जैक्सन, लिली, माइकल, औरोरा, और सोफिया। \"जैक्सन एक शूरवीर है या सोफिया एक धूर्त है,\" पेनलोप ने दावा किया। अबिगेल के शब्दों में: \"जैक्सन एक शूरवीर है\"। जैक्सन ने कहा, \"लिली एक शूरवीर है या पेनलोप एक धूर्त है\"। लिली ने कहा, \"पेनलोप एक धूर्त है और माइकल एक शूरवीर है\"। \"अगर अबिगेल एक शूरवीर है तो औरोरा एक धूर्त है,\" माइकल ने घोषित किया। औरोरा ने remarked किया, \"लिली एक धूर्त है या सोफिया एक धूर्त है\"। सोफिया ने नोट किया, \"जैक्सन एक धूर्त है यदि और केवल यदि माइकल एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक शूरवीर है  \n(2) अबिगेल एक धूर्त है  \n(3) जैक्सन एक धूर्त है  \n(4) लिली एक धूर्त है  \n(5) माइकल एक शूरवीर है  \n(6) औरोरा एक शूरवीर है  \n(7) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: स्कारलेट, एवरी, राइली, ओलिवर, ईथन, विलियम, और एम्मा। स्कारलेट ने कहा, \"एवरी एक शूरवीर है और विलियम एक शूरवीर है।\" \"ईथन एक धूर्त है यदि और केवल यदि स्कारलेट एक शूरवीर है,\" एवरी ने दावा किया। राइली के शब्दों में: \"यदि एम्मा एक धूर्त है तो एवरी एक धूर्त है।\" ओलिवर ने कहा, \"राइली एक शूरवीर नहीं है।\" \"ओलिवर एक शूरवीर है,\" ईथन ने घोषित किया। \"राइली एक शूरवीर नहीं है,\" विलियम ने घोषित किया। एम्मा को यह कहते हुए सुना गया, \"विलियम एक शूरवीर नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) स्कारलेट एक धूर्त है  \n(2) एवरी एक धूर्त है  \n(3) राइली एक शूरवीर है  \n(4) ओलिवर एक धूर्त है  \n(5) ईथन एक धूर्त है  \n(6) विलियम एक धूर्त है  \n(7) एम्मा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: राइली, अलेक्जेंडर, नूह, स्कारलेट, जैक्सन, औरोरा, और एवरी। \"एवरी शूरवीर नहीं है,\" राइली ने घोषणा की। \"अलेक्जेंडर शूरवीर है यदि और केवल यदि एवरी शूरवीर है\" - अलेक्जेंडर। नूह ने remarked किया, \"राइली धूर्त है और अलेक्जेंडर धूर्त है\"। \"एवरी शूरवीर है,\" स्कारलेट ने दावा किया। \"राइली धूर्त है या नूह धूर्त है,\" जैक्सन ने उल्लेख किया। औरोरा ने कहा कि राइली शूरवीर है और औरोरा शूरवीर है। एवरी ने remarked किया, \"अलेक्जेंडर शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक धूर्त है  \n(2) अलेक्जेंडर एक शूरवीर है  \n(3) नूह एक धूर्त है  \n(4) स्कारलेट एक शूरवीर है  \n(5) जैक्सन एक शूरवीर है  \n(6) औरोरा एक धूर्त है  \n(7) एवरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: नूह, लिली, ओलिवर, सैमुएल, ग्रेस, मिया, और स्कारलेट। नूह के शब्दों में: \"स्कारलेट शूरवीर नहीं है\"। लिली ने कहा, \"नूह शूरवीर है या ओलिवर शूरवीर है\"। ओलिवर ने कहा, \"मिया धूर्त है या मिया शूरवीर है\"। सैमुएल ने कहा कि लिली धूर्त नहीं है। ग्रेस को यह कहते हुए सुना गया, \"लिली शूरवीर है या सैमुएल शूरवीर है\"। मिया को यह कहते हुए सुना गया, \"स्कारलेट धूर्त नहीं है\"। स्कारलेट ने कहा: \"अगर लिली धूर्त है तो ग्रेस शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक धूर्त है  \n(2) लिली एक शूरवीर है  \n(3) ओलिवर एक शूरवीर है  \n(4) सैमुएल एक शूरवीर है  \n(5) ग्रेस एक शूरवीर है  \n(6) मिया एक शूरवीर है  \n(7) स्कारलेट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ओवेन, एला, डेविड, मेसन, हार्पर, औरोरा, और क्लोई। ओवेन ने कहा, \"डेविड एक धूर्त है या ओवेन एक शूरवीर है\"। एला ने कहा, \"ओवेन एक धूर्त है और क्लोई एक धूर्त है\"। डेविड ने कहा, \"क्लोई एक शूरवीर नहीं है\"। मेसन को यह कहते हुए सुना गया, \"औरोरा एक शूरवीर है यदि और केवल यदि एला एक धूर्त है\"। हार्पर ने कहा, \"एला एक शूरवीर नहीं है\"। \"क्लोई एक शूरवीर है,\" औरोरा ने घोषणा की। क्लोई के एक बयान में: \"डेविड एक धूर्त है यदि और केवल यदि क्लोई एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओवेन एक शूरवीर है  \n(2) एला एक धूर्त है  \n(3) डेविड एक धूर्त है  \n(4) मेसन एक शूरवीर है  \n(5) हार्पर एक शूरवीर है  \n(6) औरोरा एक शूरवीर है  \n(7) क्लोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: सोफिया, अलेक्जेंडर, मेसन, क्लोई, एवलिन, पेनलोप, और ल्यूक। सोफिया ने आपको बताया कि अलेक्जेंडर एक शूरवीर है यदि और केवल यदि सोफिया एक शूरवीर है। \"सोफिया एक शूरवीर है या क्लोई एक धूर्त है,\" अलेक्जेंडर ने दावा किया। \"क्लोई एक धूर्त है यदि और केवल यदि क्लोई एक शूरवीर है,\" मेसन ने उल्लेख किया। क्लोई ने asserted किया: \"यदि क्लोई एक शूरवीर है तो मेसन एक धूर्त है\"। एवलिन ने व्यक्त किया कि मेसन एक धूर्त है या क्लोई एक धूर्त है। पेनलोप ने asserted किया: \"सोफिया एक धूर्त है या अलेक्जेंडर एक धूर्त है\"। ल्यूक ने टिप्पणी की, \"एवलिन एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) अलेक्जेंडर एक शूरवीर है  \n(3) मेसन एक धूर्त है  \n(4) क्लोई एक शूरवीर है  \n(5) एवलिन एक शूरवीर है  \n(6) पेनलोप एक धूर्त है  \n(7) ल्यूक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: मैथ्यू, सोफिया, एवलिन, ईथन, हेनरी, जेम्स, और अबिगेल। मैथ्यू को यह कहते हुए सुना गया, \"जेम्स धूर्त नहीं है\"। \"यदि अबिगेल धूर्त है तो जेम्स शूरवीर है\" - सोफिया। एवलिन ने आपको बताया कि जेम्स धूर्त है यदि और केवल यदि मैथ्यू धूर्त है। ईथन ने कहा: \"एवलिन धूर्त नहीं है\"। \"मैथ्यू शूरवीर है यदि और केवल यदि सोफिया धूर्त है,\" हेनरी ने दावा किया। जेम्स को यह कहते हुए सुना गया, \"एवलिन धूर्त नहीं है\"। अबिगेल के एक बयान में: \"जेम्स शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक शूरवीर है  \n(2) सोफिया एक शूरवीर है  \n(3) एवलिन एक शूरवीर है  \n(4) ईथन एक शूरवीर है  \n(5) हेनरी एक धूर्त है  \n(6) जेम्स एक शूरवीर है  \n(7) अबिगेल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: सैमुएल, ऐडन, विक्टोरिया, अलेक्जेंडर, ओलिविया, जेम्स, और नूह। सैमुएल ने कहा, \"अलेक्जेंडर एक धूर्त है यदि और केवल यदि अलेक्जेंडर एक शूरवीर है।\" ऐडन ने कहा, \"नूह एक शूरवीर है और ओलिविया एक धूर्त है।\" विक्टोरिया ने कहा, \"नूह एक शूरवीर है और जेम्स एक शूरवीर है।\" \"विक्टोरिया एक शूरवीर नहीं है,\" अलेक्जेंडर ने घोषणा की। ओलिविया को यह कहते हुए सुना गया, \"जेम्स एक धूर्त है और ऐडन एक धूर्त है।\" \"विक्टोरिया एक धूर्त है\" - जेम्स। नूह ने नोट किया, \"विक्टोरिया एक शूरवीर है यदि और केवल यदि सैमुएल एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक धूर्त है  \n(2) ऐडन एक धूर्त है  \n(3) विक्टोरिया एक धूर्त है  \n(4) अलेक्जेंडर एक शूरवीर है  \n(5) ओलिविया एक धूर्त है  \n(6) जेम्स एक शूरवीर है  \n(7) नूह एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: सोफिया, विक्टोरिया, ज़ोई, एला, आरिया, मिया, और ओलिविया। सोफिया ने कहा कि एला एक शूरवीर है या विक्टोरिया एक धूर्त है। \"आरिया एक धूर्त है,\" विक्टोरिया ने दावा किया। ज़ोई ने आपको बताया कि सोफिया एक शूरवीर है यदि और केवल यदि विक्टोरिया एक धूर्त है। एला के शब्दों में: \"ओलिविया एक शूरवीर है और ओलिविया एक धूर्त है\"। \"एला एक धूर्त है,\" आरिया ने घोषणा की। \"विक्टोरिया एक शूरवीर है और ओलिविया एक धूर्त है\" - मिया। \"यदि सोफिया एक शूरवीर है तो आरिया एक शूरवीर है,\" ओलिविया ने कहा। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) विक्टोरिया एक धूर्त है  \n(3) ज़ोई एक शूरवीर है  \n(4) एला एक धूर्त है  \n(5) आरिया एक शूरवीर है  \n(6) मिया एक धूर्त है  \n(7) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एवा, ल्यूक, स्कारलेट, लोगन, अमेलिया, औरोरा, और ईथन। एवा को यह कहते हुए सुना गया, \"लोगन एक धूर्त है और अमेलिया एक धूर्त है\"। ल्यूक ने कहा, \"औरोरा एक शूरवीर नहीं है\"। \"ल्यूक एक शूरवीर है,\" स्कारलेट ने दावा किया। लोगन ने नोट किया, \"ल्यूक एक शूरवीर है\"। अमेलिया ने आपको बताया कि अगर ल्यूक एक शूरवीर है तो लोगन एक शूरवीर है। \"लोगन एक धूर्त है और अमेलिया एक धूर्त है,\" औरोरा ने उल्लेख किया। \"अमेलिया एक शूरवीर है,\" ईथन ने घोषित किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक धूर्त है  \n(2) ल्यूक एक शूरवीर है  \n(3) स्कारलेट एक शूरवीर है  \n(4) लोगन एक शूरवीर है  \n(5) अमेलिया एक शूरवीर है  \n(6) औरोरा एक धूर्त है  \n(7) ईथन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एवलिन, एमिली, लिली, यूसुफ, ओवेन, एम्मा, और ग्रेस। एवलिन ने कहा कि यूसुफ एक धूर्त है या लिली एक शूरवीर है। \"यूसुफ एक शूरवीर है\" - एमिली। \"अगर ओवेन एक शूरवीर है तो यूसुफ एक धूर्त है\" - लिली। \"लिली एक शूरवीर नहीं है,\" यूसुफ ने दावा किया। ओवेन ने कहा कि एमिली एक धूर्त है। एम्मा ने कहा कि लिली एक शूरवीर है और ग्रेस एक धूर्त है। ग्रेस के एक बयान में: \"यूसुफ एक शूरवीर है और ओवेन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक शूरवीर है  \n(2) एमिली एक धूर्त है  \n(3) लिली एक शूरवीर है  \n(4) यूसुफ एक धूर्त है  \n(5) ओवेन एक शूरवीर है  \n(6) एम्मा एक शूरवीर है  \n(7) ग्रेस एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एवरी, सैमुएल, एम्मा, डैनियल, लोगन, डेविड, और ओलिवर। एवरी ने कहा, \"सैमुएल एक शूरवीर है और एवरी एक शूरवीर है।\" सैमुएल ने कहा, \"एम्मा एक धूर्त है और एवरी एक शूरवीर है।\" \"डेविड एक धूर्त है और ओलिवर एक धूर्त है,\" एम्मा ने घोषित किया। डैनियल के एक बयान में: \"डैनियल एक शूरवीर है और एवरी एक शूरवीर है।\" लोगन ने आपको बताया कि एवरी एक धूर्त नहीं है। \"अगर ओलिवर एक धूर्त है तो एम्मा एक शूरवीर है\" - डेविड। ओलिवर के एक बयान में: \"लोगन एक धूर्त है यदि और केवल यदि एम्मा एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक धूर्त है  \n(2) सैमुएल एक धूर्त है  \n(3) एम्मा एक धूर्त है  \n(4) डैनियल एक धूर्त है  \n(5) लोगन एक धूर्त है  \n(6) डेविड एक शूरवीर है  \n(7) ओलिवर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: नूह, माइकल, एवा, हार्पर, जेम्स, ओवेन, और सोफिया। नूह के अनुसार, \"सोफिया एक शूरवीर है\"। माइकल के अनुसार, \"हार्पर एक धूर्त है यदि और केवल यदि नूह एक धूर्त है\"। एवा के शब्दों में: \"एवा एक शूरवीर है और जेम्स एक शूरवीर है\"। \"माइकल एक शूरवीर है या जेम्स एक शूरवीर है,\" हार्पर ने कहा। जेम्स ने कहा, \"ओवेन एक शूरवीर है या सोफिया एक धूर्त है\"। \"माइकल एक धूर्त है और सोफिया एक शूरवीर है\" - ओवेन। सोफिया को यह कहते हुए सुना गया, \"हार्पर एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक शूरवीर है  \n(2) माइकल एक शूरवीर है  \n(3) एवा एक धूर्त है  \n(4) हार्पर एक शूरवीर है  \n(5) जेम्स एक धूर्त है  \n(6) ओवेन एक धूर्त है  \n(7) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: याकूब, जेम्स, ओलिविया, स्कारलेट, एम्मा, शार्लट, और विक्टोरिया। याकूब के एक बयान में: \"स्कारलेट एक धूर्त है या विक्टोरिया एक धूर्त है\"। \"विक्टोरिया एक धूर्त है या ओलिविया एक शूरवीर है\" - जेम्स। ओलिविया ने कहा, \"याकूब एक शूरवीर नहीं है\"। स्कारलेट ने कहा कि शार्लट एक धूर्त नहीं है। एम्मा ने टिप्पणी की, \"अगर विक्टोरिया एक शूरवीर है तो ओलिविया एक धूर्त है\"। शार्लट ने टिप्पणी की, \"एम्मा एक धूर्त है\"। विक्टोरिया के शब्दों में: \"जेम्स एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) याकूब एक धूर्त है  \n(2) जेम्स एक शूरवीर है  \n(3) ओलिविया एक शूरवीर है  \n(4) स्कारलेट एक शूरवीर है  \n(5) एम्मा एक धूर्त है  \n(6) शार्लट एक शूरवीर है  \n(7) विक्टोरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एम्मा, हार्पर, इसाबेला, ईथन, एवा, डेविड, और सैमुएल। एम्मा के अनुसार, \"सैमुएल एक धूर्त नहीं है\"। \"डेविड एक शूरवीर है,\" हार्पर ने घोषणा की। इसाबेला ने कहा, \"इसाबेला एक शूरवीर है और एवा एक शूरवीर है\"। ईथन ने कहा, \"सैमुएल एक शूरवीर है और डेविड एक धूर्त है\"। \"हार्पर एक धूर्त नहीं है\" - एवा। डेविड ने नोट किया, \"एम्मा एक धूर्त नहीं है\"। सैमुएल ने remarked किया, \"ईथन एक शूरवीर है और एम्मा एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एम्मा एक धूर्त है  \n(2) हार्पर एक धूर्त है  \n(3) इसाबेला एक धूर्त है  \n(4) ईथन एक धूर्त है  \n(5) एवा एक धूर्त है  \n(6) डेविड एक धूर्त है  \n(7) सैमुएल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: पेनलोप, ओवेन, ग्रेस, अमेलिया, ऐडन, लुकास, और मिया। पेनलोप ने कहा, \"अगर मिया एक शूरवीर है तो ऐडन एक धूर्त है।\" ओवेन ने कहा कि ग्रेस एक शूरवीर है या पेनलोप एक शूरवीर है। ग्रेस के एक बयान में: \"पेनलोप एक शूरवीर है या अमेलिया एक धूर्त है।\" अमेलिया ने नोट किया, \"ओवेन एक धूर्त नहीं है।\" ऐडन के एक बयान में: \"पेनलोप एक शूरवीर है यदि और केवल यदि ओवेन एक धूर्त है।\" लुकास के अनुसार, \"ऐडन एक शूरवीर है यदि और केवल यदि ओवेन एक धूर्त है।\" मिया ने कहा, \"ओवेन एक धूर्त नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक शूरवीर है  \n(2) ओवेन एक शूरवीर है  \n(3) ग्रेस एक शूरवीर है  \n(4) अमेलिया एक शूरवीर है  \n(5) ऐडन एक धूर्त है  \n(6) लुकास एक शूरवीर है  \n(7) मिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: अलेक्जेंडर, सोफिया, सैमुएल, डेविड, इसाबेला, विलियम, और अबिगेल। अलेक्जेंडर के एक बयान में: \"अबिगेल एक धूर्त है\"। सोफिया ने कहा कि इसाबेला एक धूर्त नहीं है। सैमुएल के अनुसार, \"विलियम एक धूर्त नहीं है\"। डेविड ने टिप्पणी की, \"इसाबेला एक शूरवीर नहीं है\"। इसाबेला ने कहा कि सोफिया एक शूरवीर है या विलियम एक शूरवीर है। विलियम ने कहा, \"अलेक्जेंडर एक शूरवीर है या अबिगेल एक धूर्त है\"। अबिगेल ने कहा कि विलियम एक धूर्त है यदि और केवल यदि इसाबेला एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अलेक्जेंडर एक धूर्त है  \n(2) सोफिया एक धूर्त है  \n(3) सैमुएल एक धूर्त है  \n(4) डेविड एक शूरवीर है  \n(5) इसाबेला एक धूर्त है  \n(6) विलियम एक धूर्त है  \n(7) अबिगेल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: राइली, हेनरी, एलिज़ाबेथ, इसाबेला, जेम्स, बेंजामिन, और सोफिया। राइली ने कहा, \"राइली एक शूरवीर है यदि और केवल यदि जेम्स एक धूर्त है।\" \"हेनरी एक शूरवीर है यदि और केवल यदि बेंजामिन एक धूर्त है,\" हेनरी ने घोषित किया। एलिज़ाबेथ ने आपको बताया कि यदि बेंजामिन एक धूर्त है तो राइली एक धूर्त है। इसाबेला ने कहा, \"बेंजामिन एक धूर्त है।\" जेम्स ने नोट किया, \"राइली एक शूरवीर है और सोफिया एक शूरवीर है।\" बेंजामिन के शब्दों में: \"एलिज़ाबेथ एक शूरवीर है।\" सोफिया के एक बयान में: \"हेनरी एक धूर्त है यदि और केवल यदि एलिज़ाबेथ एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक शूरवीर है  \n(2) हेनरी एक धूर्त है  \n(3) एलिज़ाबेथ एक धूर्त है  \n(4) इसाबेला एक शूरवीर है  \n(5) जेम्स एक धूर्त है  \n(6) बेंजामिन एक धूर्त है  \n(7) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ज़ोई, एवा, याकूब, विलियम, हेनरी, इसाबेला, और ऐडन। ज़ोई ने कहा, \"ऐडन एक शूरवीर है यदि और केवल यदि याकूब एक शूरवीर है\"। एवा ने asserted: \"ऐडन एक शूरवीर है या ज़ोई एक धूर्त है\"। याकूब के अनुसार, \"एवा एक शूरवीर है यदि और केवल यदि ऐडन एक शूरवीर है\"। विलियम ने आपको बताया कि विलियम एक शूरवीर है और हेनरी एक शूरवीर है। \"याकूब एक धूर्त है या इसाबेला एक शूरवीर है,\" हेनरी ने दावा किया। इसाबेला ने asserted: \"एवा एक शूरवीर है यदि और केवल यदि ऐडन एक धूर्त है\"। \"इसाबेला एक धूर्त है या याकूब एक धूर्त है,\" ऐडन ने घोषित किया। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ज़ोई एक शूरवीर है  \n(2) एवा एक शूरवीर है  \n(3) याकूब एक शूरवीर है  \n(4) विलियम एक धूर्त है  \n(5) हेनरी एक धूर्त है  \n(6) इसाबेला एक धूर्त है  \n(7) ऐडन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: पेनलोप, ओलिवर, याकूब, मेसन, जेम्स, एम्मा, और लुकास। पेनलोप ने आपको बताया कि मेसन एक धूर्त है। ओलिवर को यह कहते हुए सुना गया, \"लुकास एक धूर्त है या ओलिवर एक शूरवीर है\"। याकूब के अनुसार, \"यदि पेनलोप एक शूरवीर है तो एम्मा एक धूर्त है\"। मेसन ने कहा कि ओलिवर एक धूर्त नहीं है। \"मेसन एक धूर्त है यदि और केवल यदि ओलिवर एक शूरवीर है,\" जेम्स ने कहा। एम्मा के एक बयान में: \"जेम्स एक शूरवीर है यदि और केवल यदि मेसन एक धूर्त है\"। लुकास ने कहा: \"एम्मा एक शूरवीर है या जेम्स एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक धूर्त है  \n(2) ओलिवर एक शूरवीर है  \n(3) याकूब एक शूरवीर है  \n(4) मेसन एक शूरवीर है  \n(5) जेम्स एक धूर्त है  \n(6) एम्मा एक शूरवीर है  \n(7) लुकास एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एवरी, एवा, मिया, पेनलोप, राइली, सैमुएल, और ओलिविया। एवरी के अनुसार, \"एवा एक शूरवीर है और पेनलोप एक शूरवीर है\"। एवा ने कहा कि मिया एक शूरवीर है और पेनलोप एक शूरवीर है। मिया के एक बयान में: \"पेनलोप एक धूर्त है और एवरी एक शूरवीर है\"। पेनलोप ने नोट किया, \"राइली एक शूरवीर है\"। \"अगर मिया एक धूर्त है तो एवरी एक शूरवीर है,\" राइली ने कहा। \"पेनलोप एक धूर्त है या एवा एक धूर्त है,\" सैमुएल ने दावा किया। \"सैमुएल एक शूरवीर है यदि और केवल यदि एवरी एक शूरवीर है,\" ओलिविया ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक धूर्त है  \n(2) एवा एक धूर्त है  \n(3) मिया एक धूर्त है  \n(4) पेनलोप एक धूर्त है  \n(5) राइली एक धूर्त है  \n(6) सैमुएल एक शूरवीर है  \n(7) ओलिविया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: पेनलोप, सोफिया, लिली, औरोरा, नूह, जैक्सन, और ल्यूक। पेनलोप ने कहा कि सोफिया एक धूर्त है। सोफिया ने कहा कि ल्यूक एक धूर्त है। \"जैक्सन एक धूर्त है और औरोरा एक शूरवीर है,\" लिली ने दावा किया। औरोरा ने asserted किया: \"लिली एक धूर्त नहीं है\"। नूह को यह कहते हुए सुना गया, \"जैक्सन एक धूर्त नहीं है\"। जैक्सन के शब्दों में: \"ल्यूक एक धूर्त नहीं है\"। ल्यूक ने टिप्पणी की, \"औरोरा एक धूर्त है यदि और केवल यदि नूह एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक धूर्त है  \n(2) सोफिया एक शूरवीर है  \n(3) लिली एक शूरवीर है  \n(4) औरोरा एक शूरवीर है  \n(5) नूह एक धूर्त है  \n(6) जैक्सन एक धूर्त है  \n(7) ल्यूक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: मैथ्यू, एला, हार्पर, अलेक्जेंडर, पेनलोप, बेंजामिन, और एवा। \"हार्पर एक शूरवीर है,\" मैथ्यू ने घोषणा की। एला को यह कहते हुए सुना गया, \"एवा एक धूर्त है या मैथ्यू एक धूर्त है।\" हार्पर ने कहा, \"एवा एक शूरवीर नहीं है।\" अलेक्जेंडर ने कहा, \"एला एक शूरवीर है यदि और केवल यदि एवा एक धूर्त है।\" पेनलोप के अनुसार, \"यदि एवा एक शूरवीर है तो अलेक्जेंडर एक धूर्त है।\" \"एवा एक शूरवीर है यदि और केवल यदि हार्पर एक शूरवीर है,\" बेंजामिन ने घोषणा की। एवा ने कहा, \"यदि मैथ्यू एक धूर्त है तो हार्पर एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक धूर्त है  \n(2) एला एक शूरवीर है  \n(3) हार्पर एक धूर्त है  \n(4) अलेक्जेंडर एक धूर्त है  \n(5) पेनलोप एक शूरवीर है  \n(6) बेंजामिन एक धूर्त है  \n(7) एवा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: मैथ्यू, बेंजामिन, ईथन, मेसन, विक्टोरिया, याकूब, और लुकास। मैथ्यू के अनुसार, \"विक्टोरिया एक धूर्त नहीं है\"। बेंजामिन ने टिप्पणी की, \"अगर मेसन एक शूरवीर है तो मैथ्यू एक धूर्त है\"। ईथन को यह कहते हुए सुना गया, \"मैथ्यू एक शूरवीर है यदि और केवल यदि लुकास एक शूरवीर है\"। मेसन को यह कहते हुए सुना गया, \"मेसेन एक शूरवीर है यदि और केवल यदि विक्टोरिया एक शूरवीर है\"। विक्टोरिया को यह कहते हुए सुना गया, \"अगर याकूब एक धूर्त है तो बेंजामिन एक धूर्त है\"। \"मैथ्यू एक धूर्त है\" - याकूब। लुकास ने नोट किया, \"बेंजामिन एक धूर्त है यदि और केवल यदि याकूब एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक शूरवीर है  \n(2) बेंजामिन एक धूर्त है  \n(3) ईथन एक शूरवीर है  \n(4) मेसन एक शूरवीर है  \n(5) विक्टोरिया एक शूरवीर है  \n(6) याकूब एक धूर्त है  \n(7) लुकास एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: विलियम, हार्पर, मेसन, जेम्स, सैमुएल, अमेलिया, और मैथ्यू। विलियम ने कहा कि अगर मेसन एक शूरवीर है तो सैमुएल एक धूर्त है। हार्पर ने कहा, \"मेसन एक शूरवीर है या जेम्स एक शूरवीर है\"। मेसन ने कहा कि सैमुएल एक धूर्त है और सैमुएल एक शूरवीर है। जेम्स ने आपको बताया कि अमेलिया एक धूर्त नहीं है। सैमुएल को यह कहते हुए सुना गया, \"विलियम एक धूर्त नहीं है\"। अमेलिया के एक बयान में: \"मैथ्यू एक धूर्त है यदि और केवल यदि जेम्स एक धूर्त है\"। मैथ्यू के अनुसार, \"अगर हार्पर एक शूरवीर है तो अमेलिया एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) हार्पर एक धूर्त है  \n(3) मेसन एक धूर्त है  \n(4) जेम्स एक धूर्त है  \n(5) सैमुएल एक शूरवीर है  \n(6) अमेलिया एक धूर्त है  \n(7) मैथ्यू एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: डेविड, ऐडन, अबिगेल, अलेक्जेंडर, एम्मा, जैक्सन, और एवा। डेविड ने आपको बताया कि ऐडन एक शूरवीर है यदि और केवल यदि जैक्सन एक धूर्त है। जैसे ऐडन ने कहा, \"एवा एक धूर्त है या अलेक्जेंडर एक शूरवीर है\"। अबिगेल ने कहा, \"अलेक्जेंडर एक धूर्त है या एवा एक शूरवीर है\"। अलेक्जेंडर के अनुसार, \"जैक्सन एक शूरवीर नहीं है\"। एम्मा ने आपको बताया कि यदि डेविड एक शूरवीर है तो अबिगेल एक शूरवीर है। जैक्सन ने कहा कि डेविड एक शूरवीर है और एम्मा एक धूर्त है। एवा ने कहा, \"यदि एम्मा एक शूरवीर है तो अलेक्जेंडर एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक शूरवीर है  \n(2) ऐडन एक शूरवीर है  \n(3) अबिगेल एक शूरवीर है  \n(4) अलेक्जेंडर एक शूरवीर है  \n(5) एम्मा एक शूरवीर है  \n(6) जैक्सन एक धूर्त है  \n(7) एवा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एलिज़ाबेथ, जेम्स, ऐडन, मिया, ओलिविया, ज़ोई, और औरोरा। एलिज़ाबेथ ने कहा, \"अगर मिया एक धूर्त है तो ज़ोई एक धूर्त है।\" जेम्स ने कहा, \"ऐडन एक शूरवीर है।\" \"ज़ोई एक धूर्त है या एलिज़ाबेथ एक धूर्त है,\" ऐडन ने घोषणा की। मिया को यह कहते हुए सुना गया, \"अगर जेम्स एक धूर्त है तो मिया एक शूरवीर है।\" ओलिविया ने टिप्पणी की, \"अगर जेम्स एक धूर्त है तो औरोरा एक धूर्त है।\" \"मिया एक शूरवीर है या औरोरा एक शूरवीर है,\" ज़ोई ने घोषणा की। औरोरा ने कहा, \"मिया एक शूरवीर नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक शूरवीर है  \n(2) जेम्स एक धूर्त है  \n(3) ऐडन एक धूर्त है  \n(4) मिया एक शूरवीर है  \n(5) ओलिविया एक शूरवीर है  \n(6) ज़ोई एक शूरवीर है  \n(7) औरोरा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ग्रेस, स्कारलेट, अमेलिया, लिली, सेबेस्टियन, डैनियल, और विक्टोरिया। ग्रेस को यह कहते हुए सुना गया, \"डैनियल एक शूरवीर है यदि और केवल यदि डैनियल एक धूर्त है\"। स्कारलेट ने कहा, \"सेबेस्टियन एक धूर्त है और विक्टोरिया एक धूर्त है\"। अमेलिया के एक बयान में: \"स्कारलेट एक धूर्त है यदि और केवल यदि विक्टोरिया एक शूरवीर है\"। \"डैनियल एक शूरवीर नहीं है,\" लिली ने कहा। \"यदि अमेलिया एक धूर्त है तो अमेलिया एक शूरवीर है,\" सेबेस्टियन ने कहा। डैनियल के अनुसार, \"यदि सेबेस्टियन एक शूरवीर है तो लिली एक धूर्त है\"। विक्टोरिया ने कहा कि डैनियल एक धूर्त है यदि और केवल यदि ग्रेस एक धूर्त है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ग्रेस एक धूर्त है  \n(2) स्कारलेट एक धूर्त है  \n(3) अमेलिया एक शूरवीर है  \n(4) लिली एक शूरवीर है  \n(5) सेबेस्टियन एक शूरवीर है  \n(6) डैनियल एक धूर्त है  \n(7) विक्टोरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: बेंजामिन, क्लोई, एमिली, राइली, मिया, इसाबेला, और पेनलोप। \"एमिली एक शूरवीर है और इसाबेला एक धूर्त है,\" बेंजामिन ने दावा किया। क्लोई के अनुसार, \"पेनलोप एक शूरवीर है\"। एमिली ने कहा, \"एमिली एक शूरवीर है या बेंजामिन एक धूर्त है\"। राइली को यह कहते हुए सुना गया, \"मिया एक धूर्त है और एमिली एक धूर्त है\"। मिया के अनुसार, \"इसाबेला एक शूरवीर है यदि और केवल यदि एमिली एक धूर्त है\"। इसाबेला ने कहा, \"राइली एक शूरवीर नहीं है\"। \"एमिली एक शूरवीर है और इसाबेला एक शूरवीर है,\" पेनलोप ने उल्लेख किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक धूर्त है  \n(2) क्लोई एक शूरवीर है  \n(3) एमिली एक शूरवीर है  \n(4) राइली एक धूर्त है  \n(5) मिया एक धूर्त है  \n(6) इसाबेला एक शूरवीर है  \n(7) पेनलोप एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: डेविड, बेंजामिन, माइकल, एवलिन, शार्लट, अमेलिया, और जेम्स। डेविड के शब्दों में: \"माइकल एक धूर्त है\"। बेंजामिन ने कहा, \"शार्लट एक धूर्त नहीं है\"। माइकल के शब्दों में: \"शार्लट एक शूरवीर है यदि और केवल यदि डेविड एक शूरवीर है\"। एवलिन के शब्दों में: \"जेम्स एक शूरवीर है या बेंजामिन एक धूर्त है\"। \"यदि एवलिन एक शूरवीर है तो माइकल एक धूर्त है,\" शार्लट ने घोषणा की। अमेलिया ने आपको बताया कि जेम्स एक धूर्त नहीं है। जेम्स के शब्दों में: \"डेविड एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक धूर्त है  \n(2) बेंजामिन एक धूर्त है  \n(3) माइकल एक शूरवीर है  \n(4) एवलिन एक शूरवीर है  \n(5) शार्लट एक धूर्त है  \n(6) अमेलिया एक धूर्त है  \n(7) जेम्स एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: बेंजामिन, सोफिया, मेसन, एवा, आरिया, अबिगेल, और लियम। बेंजामिन ने कहा कि लियम एक धूर्त है और लियम एक शूरवीर है। सोफिया ने कहा, \"एवा एक शूरवीर है और लियम एक शूरवीर है\"। मेसन के अनुसार, \"एवा एक शूरवीर है या अबिगेल एक धूर्त है\"। \"लियम एक शूरवीर है या अबिगेल एक धूर्त है,\" एवा ने दावा किया। \"मेसन एक शूरवीर है और अबिगेल एक धूर्त है,\" आरिया ने दावा किया। अबिगेल के शब्दों में: \"एवा एक धूर्त है और बेंजामिन एक शूरवीर है\"। \"एवा एक धूर्त है और सोफिया एक धूर्त है\" - लियम। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक धूर्त है  \n(2) सोफिया एक धूर्त है  \n(3) मेसन एक शूरवीर है  \n(4) एवा एक शूरवीर है  \n(5) आरिया एक शूरवीर है  \n(6) अबिगेल एक धूर्त है  \n(7) लियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: इसाबेला, लुकास, अबिगेल, ईथन, ओलिवर, ज़ोई, और विलियम। इसाबेला ने कहा: \"अगर ओलिवर एक शूरवीर है तो विलियम एक शूरवीर है\"। लुकास ने कहा कि इसाबेला एक शूरवीर है। \"ओलिवर एक धूर्त है और अबिगेल एक शूरवीर है\" - अबिगेल। ईथन ने आपको बताया कि ज़ोई एक धूर्त है। ओलिवर ने कहा, \"ईथन एक शूरवीर है यदि और केवल यदि अबिगेल एक धूर्त है\"। ज़ोई के अनुसार, \"अगर लुकास एक शूरवीर है तो इसाबेला एक शूरवीर है\"। \"ज़ोई एक धूर्त है और ईथन एक शूरवीर है,\" विलियम ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक शूरवीर है  \n(2) लुकास एक शूरवीर है  \n(3) अबिगेल एक धूर्त है  \n(4) ईथन एक धूर्त है  \n(5) ओलिवर एक धूर्त है  \n(6) ज़ोई एक शूरवीर है  \n(7) विलियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लोगन, एम्मा, ग्रेस, अलेक्जेंडर, एमिली, डैनियल, और ओलिवर। \"डैनियल एक शूरवीर है\" - लोगन। एम्मा ने कहा, \"लोगन एक शूरवीर नहीं है\"। ग्रेस को यह कहते हुए सुना गया, \"डैनियल एक शूरवीर है या डैनियल एक धूर्त है\"। अलेक्जेंडर के शब्दों में: \"अगर डैनियल एक धूर्त है तो एमिली एक शूरवीर है\"। एमिली ने टिप्पणी की, \"ओलिवर एक शूरवीर है\"। डैनियल ने कहा, \"ग्रेस एक धूर्त नहीं है\"। ओलिवर ने कहा कि लोगन एक धूर्त है या ग्रेस एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) लोगन एक शूरवीर है  \n(2) एम्मा एक धूर्त है  \n(3) ग्रेस एक शूरवीर है  \n(4) अलेक्जेंडर एक शूरवीर है  \n(5) एमिली एक शूरवीर है  \n(6) डैनियल एक शूरवीर है  \n(7) ओलिवर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एला, विक्टोरिया, औरोरा, नूह, लिली, हेनरी, और अलेक्जेंडर। एला ने कहा, \"अलेक्जेंडर एक शूरवीर है या औरोरा एक शूरवीर है\"। \"लिली एक शूरवीर है और लिली एक धूर्त है,\" विक्टोरिया ने कहा। \"अगर नूह एक शूरवीर है तो विक्टोरिया एक धूर्त है\" - औरोरा। \"अलेक्जेंडर एक धूर्त है या हेनरी एक धूर्त है,\" नूह ने दावा किया। लिली ने कहा कि विक्टोरिया एक धूर्त है। हेनरी ने कहा, \"औरोरा एक शूरवीर नहीं है\"। अलेक्जेंडर के एक बयान में: \"अगर औरोरा एक धूर्त है तो अलेक्जेंडर एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक शूरवीर है  \n(2) विक्टोरिया एक धूर्त है  \n(3) औरोरा एक शूरवीर है  \n(4) नूह एक शूरवीर है  \n(5) लिली एक शूरवीर है  \n(6) हेनरी एक धूर्त है  \n(7) अलेक्जेंडर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ओलिविया, डेविड, एवा, बेंजामिन, क्लोई, अमेलिया, और डैनियल। ओलिविया के शब्दों में: \"बेंजामिन एक शूरवीर है यदि और केवल यदि डेविड एक धूर्त है\"। डेविड ने कहा, \"अमेलिया एक धूर्त है या बेंजामिन एक शूरवीर है\"। एवा के अनुसार, \"क्लोई एक शूरवीर है या डैनियल एक शूरवीर है\"। बेंजामिन के अनुसार, \"डेविड एक धूर्त है यदि और केवल यदि बेंजामिन एक शूरवीर है\"। क्लोई ने आपको बताया कि यदि डेविड एक शूरवीर है तो डैनियल एक शूरवीर है। अमेलिया ने कहा, \"अमेलिया एक शूरवीर है\"। \"एवा एक धूर्त है,\" डैनियल ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक धूर्त है  \n(2) डेविड एक धूर्त है  \n(3) एवा एक शूरवीर है  \n(4) बेंजामिन एक धूर्त है  \n(5) क्लोई एक शूरवीर है  \n(6) अमेलिया एक शूरवीर है  \n(7) डैनियल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लिली, जेम्स, अलेक्जेंडर, ओवेन, स्कारलेट, सोफिया, और डेविड। लिली ने कहा कि सोफिया एक शूरवीर है। \"स्कारलेट एक धूर्त है,\" जेम्स ने दावा किया। \"जेम्स एक शूरवीर है यदि और केवल यदि लिली एक शूरवीर है,\" अलेक्जेंडर ने उल्लेख किया। \"ओवेन एक शूरवीर है या स्कारलेट एक शूरवीर है\" - ओवेन। स्कारलेट के एक बयान में: \"यदि जेम्स एक धूर्त है तो डेविड एक शूरवीर है\"। सोफिया के शब्दों में: \"डेविड एक शूरवीर है या स्कारलेट एक शूरवीर है\"। डेविड के एक बयान में: \"सोफिया एक धूर्त है या डेविड एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) लिली एक शूरवीर है  \n(2) जेम्स एक धूर्त है  \n(3) अलेक्जेंडर एक धूर्त है  \n(4) ओवेन एक शूरवीर है  \n(5) स्कारलेट एक शूरवीर है  \n(6) सोफिया एक शूरवीर है  \n(7) डेविड एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ज़ोई, एवलिन, सोफिया, मैथ्यू, जैक्सन, ओवेन, और बेंजामिन। ज़ोई ने कहा, \"ज़ोई एक शूरवीर है या सोफिया एक धूर्त है\"। एवलिन के एक बयान में: \"ज़ोई एक शूरवीर है\"। सोफिया ने कहा: \"जैक्सन एक धूर्त है या ज़ोई एक शूरवीर है\"। मैथ्यू ने कहा कि अगर बेंजामिन एक धूर्त है तो ज़ोई एक धूर्त है। जैक्सन के एक बयान में: \"सोफिया एक शूरवीर है\"। ओवेन ने कहा, \"मैथ्यू एक शूरवीर नहीं है\"। \"ज़ोई एक शूरवीर है,\" बेंजामिन ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ज़ोई एक शूरवीर है  \n(2) एवलिन एक शूरवीर है  \n(3) सोफिया एक शूरवीर है  \n(4) मैथ्यू एक शूरवीर है  \n(5) जैक्सन एक शूरवीर है  \n(6) ओवेन एक धूर्त है  \n(7) बेंजामिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: डैनियल, अलेक्जेंडर, एवा, याकूब, बेंजामिन, मैथ्यू, और अबिगेल। जैसा कि डैनियल ने कहा, \"अगर मैथ्यू एक धूर्त है तो अबिगेल एक शूरवीर है\"। \"मैथ्यू एक धूर्त है और डैनियल एक शूरवीर है\" - अलेक्जेंडर। एवा ने टिप्पणी की, \"याकूब एक धूर्त है\"। याकूब ने कहा, \"डैनियल एक शूरवीर है या अलेक्जेंडर एक शूरवीर है\"। बेंजामिन ने कहा कि अलेक्जेंडर एक शूरवीर है और अलेक्जेंडर एक धूर्त है। मैथ्यू के शब्दों में: \"बेंजामिन एक शूरवीर है और एवा एक धूर्त है\"। अबिगेल ने आपको बताया कि बेंजामिन एक शूरवीर नहीं है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक शूरवीर है  \n(2) अलेक्जेंडर एक शूरवीर है  \n(3) एवा एक धूर्त है  \n(4) याकूब एक शूरवीर है  \n(5) बेंजामिन एक धूर्त है  \n(6) मैथ्यू एक धूर्त है  \n(7) अबिगेल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: बेंजामिन, पेनलोप, विक्टोरिया, ऐडन, माइकल, इसाबेला, और जैक्सन। \"अगर विक्टोरिया एक शूरवीर है तो माइकल एक शूरवीर है,\" बेंजामिन ने घोषणा की। पेनलोप ने आपको बताया कि विक्टोरिया एक शूरवीर है या ऐडन एक धूर्त है। विक्टोरिया ने टिप्पणी की, \"ऐडन एक शूरवीर है\"। ऐडन ने asserted किया: \"पेनलोप एक शूरवीर है या विक्टोरिया एक धूर्त है\"। माइकल ने stated किया, \"बेंजामिन एक धूर्त है या माइकल एक शूरवीर है\"। \"ऐडन एक धूर्त नहीं है\" - इसाबेला। जैक्सन ने asserted किया: \"बेंजामिन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक शूरवीर है  \n(2) पेनलोप एक शूरवीर है  \n(3) विक्टोरिया एक शूरवीर है  \n(4) ऐडन एक शूरवीर है  \n(5) माइकल एक शूरवीर है  \n(6) इसाबेला एक शूरवीर है  \n(7) जैक्सन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: इसाबेला, सोफिया, मैथ्यू, एलिज़ाबेथ, लुकास, बेंजामिन, और ओवेन। इसाबेला ने टिप्पणी की, \"ओवेन एक धूर्त है और सोफिया एक धूर्त है\"। सोफिया ने कहा कि इसाबेला एक शूरवीर है यदि और केवल यदि लुकास एक शूरवीर है। मैथ्यू के शब्दों में: \"मैथ्यू एक शूरवीर है यदि और केवल यदि लुकास एक धूर्त है\"। \"मैथ्यू एक धूर्त है और सोफिया एक धूर्त है\" - एलिज़ाबेथ। लुकास के अनुसार, \"मैथ्यू एक शूरवीर है यदि और केवल यदि इसाबेला एक शूरवीर है\"। बेंजामिन ने नोट किया, \"सोफिया एक धूर्त नहीं है\"। ओवेन के अनुसार, \"यदि इसाबेला एक शूरवीर है तो सोफिया एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) इसाबेला एक धूर्त है  \n(2) सोफिया एक शूरवीर है  \n(3) मैथ्यू एक शूरवीर है  \n(4) एलिज़ाबेथ एक धूर्त है  \n(5) लुकास एक धूर्त है  \n(6) बेंजामिन एक शूरवीर है  \n(7) ओवेन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: बेंजामिन, एला, एवा, अबिगेल, मैथ्यू, शार्लट, और जैक। \"जैक एक धूर्त है यदि और केवल यदि मैथ्यू एक शूरवीर है\" - बेंजामिन। एला के अनुसार, \"जैक एक धूर्त है या एवा एक धूर्त है\"। एवा को यह कहते हुए सुना गया, \"मैथ्यू एक शूरवीर नहीं है\"। जैसा कि अबिगेल ने कहा, \"मैथ्यू एक धूर्त है यदि और केवल यदि एवा एक शूरवीर है\"। \"जैक एक शूरवीर है और बेंजामिन एक धूर्त है\" - मैथ्यू। \"एला एक शूरवीर है या मैथ्यू एक शूरवीर है\" - शार्लट। \"एला एक धूर्त नहीं है,\" जैक ने दावा किया। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) बेंजामिन एक धूर्त है  \n(2) एला एक शूरवीर है  \n(3) एवा एक धूर्त है  \n(4) अबिगेल एक शूरवीर है  \n(5) मैथ्यू एक शूरवीर है  \n(6) शार्लट एक शूरवीर है  \n(7) जैक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: याकूब, अमेलिया, डेविड, एवलिन, मिया, सेबेस्टियन, और ग्रेस। याकूब ने कहा कि एवलिन एक शूरवीर नहीं है। अमेलिया ने कहा, \"अगर ग्रेस एक धूर्त है तो एवलिन एक शूरवीर है।\" डेविड ने कहा, \"याकूब एक शूरवीर है यदि और केवल यदि डेविड एक शूरवीर है।\" एवलिन ने कहा कि याकूब एक धूर्त है या डेविड एक धूर्त है। मिया ने कहा, \"एवलिन एक धूर्त है यदि और केवल यदि ग्रेस एक शूरवीर है।\" सेबेस्टियन ने कहा, \"मिया एक शूरवीर है।\" ग्रेस ने टिप्पणी की, \"याकूब एक धूर्त है और ग्रेस एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) याकूब एक शूरवीर है  \n(2) अमेलिया एक धूर्त है  \n(3) डेविड एक शूरवीर है  \n(4) एवलिन एक धूर्त है  \n(5) मिया एक धूर्त है  \n(6) सेबेस्टियन एक धूर्त है  \n(7) ग्रेस एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: सोफिया, अबिगेल, एवा, ईथन, सैमुएल, माइकल, और राइली। सोफिया ने कहा कि एवा एक धूर्त है यदि और केवल यदि एवा एक शूरवीर है। अबिगेल ने कहा, \"यदि सोफिया एक शूरवीर है तो राइली एक धूर्त है\"। एवा ने asserted किया: \"अबिगेल एक धूर्त नहीं है\"। ईथन ने व्यक्त किया कि यदि सैमुएल एक शूरवीर है तो माइकल एक धूर्त है। \"राइली एक शूरवीर है और एवा एक धूर्त है,\" सैमुएल ने दावा किया। \"राइली एक शूरवीर है और एवा एक शूरवीर है\" - माइकल। राइली ने आपको बताया कि ईथन एक धूर्त है या सोफिया एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) अबिगेल एक शूरवीर है  \n(3) एवा एक शूरवीर है  \n(4) ईथन एक शूरवीर है  \n(5) सैमुएल एक धूर्त है  \n(6) माइकल एक धूर्त है  \n(7) राइली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: जेम्स, जैक्सन, एमिली, लियम, याकूब, ओलिवर, और जैक। जेम्स ने टिप्पणी की, \"जैक एक धूर्त है यदि और केवल यदि जेम्स एक शूरवीर है\"। \"याकूब एक शूरवीर नहीं है,\" जैक्सन ने कहा। एमिली के एक बयान में: \"लियम एक धूर्त है\"। लियम के एक बयान में: \"जेम्स एक शूरवीर है या जैक्सन एक शूरवीर है\"। याकूब ने कहा, \"जेम्स एक धूर्त नहीं है\"। ओलिवर के अनुसार, \"लियम एक धूर्त नहीं है\"। जैक ने कहा, \"याकूब एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) जैक्सन एक धूर्त है  \n(3) एमिली एक धूर्त है  \n(4) लियम एक शूरवीर है  \n(5) याकूब एक शूरवीर है  \n(6) ओलिवर एक शूरवीर है  \n(7) जैक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: विलियम, एला, हेनरी, मेसन, जेम्स, एम्मा, और हार्पर। विलियम ने कहा: \"अगर विलियम एक शूरवीर है तो मेसन एक धूर्त है\"। एला ने कहा, \"मेसन एक धूर्त है\"। हेनरी ने टिप्पणी की, \"हेनरी एक शूरवीर है यदि और केवल यदि जेम्स एक शूरवीर है\"। मेसन के अनुसार, \"हेनरी एक धूर्त है\"। \"हेनरी एक धूर्त है या हेनरी एक शूरवीर है,\" जेम्स ने दावा किया। \"हेनरी एक धूर्त नहीं है\" - एम्मा। हार्पर ने कहा कि विलियम एक शूरवीर है या एला एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) एला एक शूरवीर है  \n(3) हेनरी एक शूरवीर है  \n(4) मेसन एक धूर्त है  \n(5) जेम्स एक शूरवीर है  \n(6) एम्मा एक शूरवीर है  \n(7) हार्पर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ओवेन, आरिया, विक्टोरिया, पेनलोप, क्लोई, याकूब, और ओलिविया। ओवेन ने कहा, \"ओलिविया एक शूरवीर है यदि और केवल यदि आरिया एक शूरवीर है।\" आरिया ने कहा: \"पेनलोप एक शूरवीर है या ओलिविया एक धूर्त है।\" विक्टोरिया ने कहा, \"पेनलोप एक शूरवीर है यदि और केवल यदि याकूब एक धूर्त है।\" पेनलोप ने कहा: \"याकूब एक धूर्त है और याकूब एक शूरवीर है।\" क्लोई ने कहा, \"ओलिविया एक धूर्त नहीं है।\" याकूब ने कहा, \"विक्टोरिया एक धूर्त है और पेनलोप एक शूरवीर है।\" \"यदि विक्टोरिया एक शूरवीर है तो विक्टोरिया एक धूर्त है,\" ओलिविया ने कहा। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ओवेन एक धूर्त है  \n(2) आरिया एक धूर्त है  \n(3) विक्टोरिया एक धूर्त है  \n(4) पेनलोप एक धूर्त है  \n(5) क्लोई एक शूरवीर है  \n(6) याकूब एक धूर्त है  \n(7) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लोगन, एम्मा, औरोरा, लियम, जैक्सन, आरिया, और ऐडन। \"अगर एम्मा एक शूरवीर है तो औरोरा एक धूर्त है,\" लोगन ने दावा किया। एम्मा ने टिप्पणी की, \"लियम एक धूर्त नहीं है\"। औरोरा ने कहा, \"जैक्सन एक शूरवीर नहीं है\"। लियम ने कहा, \"आरिया एक शूरवीर है\"। \"लोगन एक शूरवीर है,\" जैक्सन ने उल्लेख किया। आरिया के अनुसार, \"ऐडन एक धूर्त है और जैक्सन एक शूरवीर है\"। ऐडन के शब्दों में: \"अगर जैक्सन एक शूरवीर है तो लोगन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक शूरवीर है  \n(2) एम्मा एक शूरवीर है  \n(3) औरोरा एक धूर्त है  \n(4) लियम एक शूरवीर है  \n(5) जैक्सन एक शूरवीर है  \n(6) आरिया एक शूरवीर है  \n(7) ऐडन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ओलिविया, ऐडन, औरोरा, माइकल, लिली, अमेलिया, और नूह। ओलिविया ने कहा, \"अमेलिया एक शूरवीर है और लिली एक धूर्त है\"। ऐडन ने नोट किया, \"लिली एक धूर्त है\"। औरोरा ने कहा, \"अमेलिया एक शूरवीर नहीं है\"। माइकल ने remarked किया, \"नूह एक शूरवीर है और औरोरा एक शूरवीर है\"। लिली ने remarked किया, \"ऐडन एक शूरवीर है यदि और केवल यदि अमेलिया एक धूर्त है\"। अमेलिया ने कहा कि यदि माइकल एक धूर्त है तो लिली एक धूर्त है। जैसे नूह ने कहा, \"लिली एक शूरवीर है और अमेलिया एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ओलिविया एक शूरवीर है  \n(2) ऐडन एक शूरवीर है  \n(3) औरोरा एक धूर्त है  \n(4) माइकल एक धूर्त है  \n(5) लिली एक धूर्त है  \n(6) अमेलिया एक शूरवीर है  \n(7) नूह एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: मेसन, माइकल, बेंजामिन, जैक्सन, इसाबेला, डेविड, और ओलिविया। \"बेंजामिन एक धूर्त नहीं है,\" मेसन ने कहा। माइकल के एक बयान में: \"माइकल एक शूरवीर है और डेविड एक शूरवीर है\"। बेंजामिन के अनुसार, \"इसाबेला एक शूरवीर है\"। जैक्सन के एक बयान में: \"माइकल एक शूरवीर है या ओलिविया एक धूर्त है\"। इसाबेला के शब्दों में: \"मेसन एक धूर्त है और डेविड एक शूरवीर है\"। डेविड ने कहा, \"मेसन एक शूरवीर है यदि और केवल यदि इसाबेला एक धूर्त है\"। ओलिविया ने कहा, \"बेंजामिन एक धूर्त है और माइकल एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) माइकल एक धूर्त है  \n(3) बेंजामिन एक धूर्त है  \n(4) जैक्सन एक धूर्त है  \n(5) इसाबेला एक धूर्त है  \n(6) डेविड एक धूर्त है  \n(7) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ल्यूक, माइकल, ग्रेस, एला, एवरी, सोफिया, और एवा। ल्यूक को यह कहते हुए सुना गया, \"अगर सोफिया एक धूर्त है तो एला एक शूरवीर है\"। माइकल के एक बयान में: \"ल्यूक एक शूरवीर है या सोफिया एक शूरवीर है\"। ग्रेस को यह कहते हुए सुना गया, \"माइकल एक शूरवीर है और एला एक शूरवीर है\"। एला को यह कहते हुए सुना गया, \"एवरी एक शूरवीर नहीं है\"। एवरी के एक बयान में: \"एवा एक शूरवीर है\"। सोफिया ने कहा कि एवरी एक धूर्त है। एवा के शब्दों में: \"एवरी एक शूरवीर है यदि और केवल यदि सोफिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) माइकल एक शूरवीर है  \n(3) ग्रेस एक शूरवीर है  \n(4) एला एक शूरवीर है  \n(5) एवरी एक धूर्त है  \n(6) सोफिया एक शूरवीर है  \n(7) एवा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: अलेक्जेंडर, विलियम, लियम, हेनरी, ओलिविया, राइली, और सोफिया। \"हेनरी एक धूर्त है या लियम एक शूरवीर है\" - अलेक्जेंडर। विलियम ने कहा, \"राइली एक शूरवीर है\"। लियम ने कहा कि ओलिविया एक धूर्त है और सोफिया एक शूरवीर है। \"अगर ओलिविया एक धूर्त है तो ओलिविया एक शूरवीर है,\" हेनरी ने घोषित किया। \"सोफिया एक शूरवीर है,\" ओलिविया ने घोषित किया। \"अगर विलियम एक शूरवीर है तो ओलिविया एक शूरवीर है,\" राइली ने दावा किया। सोफिया के शब्दों में: \"अगर अलेक्जेंडर एक शूरवीर है तो ओलिविया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अलेक्जेंडर एक धूर्त है  \n(2) विलियम एक शूरवीर है  \n(3) लियम एक धूर्त है  \n(4) हेनरी एक शूरवीर है  \n(5) ओलिविया एक शूरवीर है  \n(6) राइली एक शूरवीर है  \n(7) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एवा, आरिया, सोफिया, एम्मा, औरोरा, मेसन, और बेंजामिन। \"एम्मा धूर्त नहीं है,\" एवा ने कहा। आरिया के अनुसार, \"औरोरा शूरवीर है यदि और केवल यदि बेंजामिन धूर्त है\"। \"आरिया शूरवीर है,\" सोफिया ने दावा किया। एम्मा ने कहा, \"मेसन शूरवीर नहीं है\"। जैसे औरोरा ने कहा, \"बेंजामिन शूरवीर है और बेंजामिन धूर्त है\"। मेसन को यह कहते हुए सुना गया, \"बेंजामिन शूरवीर है या एम्मा धूर्त है\"। जैसे बेंजामिन ने कहा, \"एवा धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक धूर्त है  \n(2) आरिया एक धूर्त है  \n(3) सोफिया एक धूर्त है  \n(4) एम्मा एक धूर्त है  \n(5) औरोरा एक धूर्त है  \n(6) मेसन एक शूरवीर है  \n(7) बेंजामिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: मिया, यूसुफ, सैमुएल, ग्रेस, इसाबेला, नूह, और एवलिन। \"सैमुएल एक शूरवीर है या इसाबेला एक धूर्त है,\" मिया ने कहा। जैसा कि यूसुफ ने कहा, \"इसाबेला एक धूर्त है या सैमुएल एक शूरवीर है।\" \"यूसुफ एक शूरवीर है या सैमुएल एक शूरवीर है,\" सैमुएल ने घोषित किया। ग्रेस ने asserted किया: \"एवलिन एक शूरवीर है।\" \"ग्रेस एक धूर्त है और ग्रेस एक शूरवीर है,\" इसाबेला ने दावा किया। \"अगर मिया एक धूर्त है तो ग्रेस एक शूरवीर है,\" नूह ने दावा किया। एवलिन के शब्दों में: \"नूह एक धूर्त नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक शूरवीर है  \n(2) यूसुफ एक शूरवीर है  \n(3) सैमुएल एक शूरवीर है  \n(4) ग्रेस एक शूरवीर है  \n(5) इसाबेला एक धूर्त है  \n(6) नूह एक शूरवीर है  \n(7) एवलिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लिली, एलिज़ाबेथ, क्लोई, माइकल, लोगन, विलियम, और यूसुफ। लिली ने कहा, \"क्लोई एक धूर्त है या लोगन एक धूर्त है।\" एलिज़ाबेथ के शब्दों में: \"यूसुफ एक शूरवीर नहीं है।\" क्लोई ने कहा, \"एलिज़ाबेथ एक शूरवीर है।\" माइकल ने नोट किया, \"लिली एक धूर्त है यदि और केवल यदि एलिज़ाबेथ एक धूर्त है।\" \"विलियम एक धूर्त है,\" लोगन ने घोषणा की। \"यदि एलिज़ाबेथ एक धूर्त है तो माइकल एक धूर्त है,\" विलियम ने घोषणा की। यूसुफ को यह कहते हुए सुना गया, \"यदि लिली एक धूर्त है तो माइकल एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लिली एक शूरवीर है  \n(2) एलिज़ाबेथ एक धूर्त है  \n(3) क्लोई एक धूर्त है  \n(4) माइकल एक धूर्त है  \n(5) लोगन एक धूर्त है  \n(6) विलियम एक शूरवीर है  \n(7) यूसुफ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: विक्टोरिया, इसाबेला, नूह, ईथन, जैक्सन, अमेलिया, और ज़ोई। \"ईथन एक धूर्त है या ज़ोई एक शूरवीर है,\" विक्टोरिया ने कहा। इसाबेला ने कहा, \"नूह एक शूरवीर है और विक्टोरिया एक शूरवीर है\"। नूह के एक बयान में: \"अगर ज़ोई एक शूरवीर है तो ईथन एक धूर्त है\"। जैसा कि ईथन ने कहा, \"अमेलिया एक धूर्त है या ज़ोई एक शूरवीर है\"। जैक्सन ने नोट किया, \"ईथन एक शूरवीर है\"। अमेलिया के शब्दों में: \"नूह एक शूरवीर है\"। ज़ोई ने आपको बताया कि अमेलिया एक शूरवीर है या अमेलिया एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विक्टोरिया एक शूरवीर है  \n(2) इसाबेला एक धूर्त है  \n(3) नूह एक धूर्त है  \n(4) ईथन एक शूरवीर है  \n(5) जैक्सन एक शूरवीर है  \n(6) अमेलिया एक धूर्त है  \n(7) ज़ोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: जेम्स, एवरी, नूह, याकूब, क्लोई, अमेलिया, और जैक्सन। जेम्स ने कहा, \"जैक्सन एक धूर्त है और क्लोई एक धूर्त है।\" एवरी के अनुसार, \"जेम्स एक धूर्त है या अमेलिया एक धूर्त है।\" नूह ने कहा कि जैक्सन एक शूरवीर है या जेम्स एक शूरवीर है। याकूब ने कहा कि अमेलिया एक धूर्त है यदि और केवल यदि एवरी एक शूरवीर है। क्लोई ने कहा, \"क्लोई एक शूरवीर है यदि और केवल यदि याकूब एक शूरवीर है।\" अमेलिया ने कहा कि यदि क्लोई एक धूर्त है तो याकूब एक धूर्त है। जैक्सन ने कहा, \"याकूब एक धूर्त है यदि और केवल यदि नूह एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक धूर्त है  \n(2) एवरी एक शूरवीर है  \n(3) नूह एक शूरवीर है  \n(4) याकूब एक शूरवीर है  \n(5) क्लोई एक धूर्त है  \n(6) अमेलिया एक धूर्त है  \n(7) जैक्सन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एला, एम्मा, सैमुएल, इसाबेला, डैनियल, अमेलिया, और एवरी। एला के शब्दों में: \"डैनियल एक शूरवीर है या एवरी एक धूर्त है\"। एम्मा के अनुसार, \"अगर डैनियल एक धूर्त है तो एवरी एक धूर्त है\"। सैमुएल ने कहा, \"अगर अमेलिया एक शूरवीर है तो सैमुएल एक शूरवीर है\"। इसाबेला ने कहा, \"डैनियल एक धूर्त है या अमेलिया एक धूर्त है\"। डैनियल ने कहा कि एवरी एक धूर्त है और डैनियल एक शूरवीर है। अमेलिया ने कहा कि डैनियल एक शूरवीर है। एवरी को यह कहते हुए सुना गया, \"डैनियल एक धूर्त है या इसाबेला एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक धूर्त है  \n(2) एम्मा एक धूर्त है  \n(3) सैमुएल एक शूरवीर है  \n(4) इसाबेला एक शूरवीर है  \n(5) डैनियल एक धूर्त है  \n(6) अमेलिया एक धूर्त है  \n(7) एवरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: इसाबेला, ओवेन, माइकल, सोफिया, सैमुएल, अबिगेल, और बेंजामिन। इसाबेला के अनुसार, \"सोफिया एक धूर्त है यदि और केवल यदि बेंजामिन एक धूर्त है\"। ओवेन ने कहा: \"अबिगेल एक शूरवीर नहीं है\"। माइकल ने कहा, \"बेंजामिन एक धूर्त है और अबिगेल एक शूरवीर है\"। सोफिया ने कहा, \"बेंजामिन एक शूरवीर है\"। सैमुएल ने कहा कि इसाबेला एक शूरवीर है यदि और केवल यदि बेंजामिन एक धूर्त है। अबिगेल ने कहा, \"ओवेन एक शूरवीर है या माइकल एक धूर्त है।\" \"अबिगेल एक शूरवीर है या इसाबेला एक शूरवीर है\" - बेंजामिन। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक शूरवीर है  \n(2) ओवेन एक धूर्त है  \n(3) माइकल एक धूर्त है  \n(4) सोफिया एक शूरवीर है  \n(5) सैमुएल एक धूर्त है  \n(6) अबिगेल एक शूरवीर है  \n(7) बेंजामिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ऐडन, इसाबेला, सेबेस्टियन, ओलिविया, लोगन, विलियम, और ज़ोई। ऐडन के शब्दों में: \"सेबेस्टियन एक शूरवीर है और इसाबेला एक धूर्त है\"। इसाबेला ने आपको बताया कि विलियम एक धूर्त नहीं है। सेबेस्टियन ने कहा: \"ओलिविया एक धूर्त नहीं है\"। ओलिविया के शब्दों में: \"ऐडन एक धूर्त है या सेबेस्टियन एक शूरवीर है\"। लोगन के अनुसार, \"ऐडन एक धूर्त है या विलियम एक धूर्त है\"। विलियम ने कहा, \"अगर ऐडन एक धूर्त है तो इसाबेला एक शूरवीर है\"। ज़ोई के एक बयान में: \"अगर ऐडन एक शूरवीर है तो लोगन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक धूर्त है  \n(2) इसाबेला एक शूरवीर है  \n(3) सेबेस्टियन एक शूरवीर है  \n(4) ओलिविया एक शूरवीर है  \n(5) लोगन एक शूरवीर है  \n(6) विलियम एक शूरवीर है  \n(7) ज़ोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: सोफिया, इसाबेला, विक्टोरिया, डेविड, अबिगेल, पेनलोप, और एवलिन। सोफिया के एक बयान में: \"पेनलोप एक धूर्त है और इसाबेला एक धूर्त है\"। इसाबेला ने आपको बताया कि अबिगेल एक धूर्त है। \"पेनलोप एक शूरवीर नहीं है,\" विक्टोरिया ने घोषणा की। डेविड ने asserted: \"विक्टोरिया एक शूरवीर है\"। अबिगेल के एक बयान में: \"पेनलोप एक शूरवीर नहीं है\"। पेनलोप के एक बयान में: \"डेविड एक धूर्त है या डेविड एक शूरवीर है\"। \"डेविड एक शूरवीर नहीं है,\" एवलिन ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) इसाबेला एक शूरवीर है  \n(3) विक्टोरिया एक धूर्त है  \n(4) डेविड एक धूर्त है  \n(5) अबिगेल एक धूर्त है  \n(6) पेनलोप एक शूरवीर है  \n(7) एवलिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: यूसुफ, लियम, ग्रेस, सोफिया, सेबेस्टियन, औरोरा, और जैक। जैसा कि यूसुफ ने कहा, \"ग्रेस एक शूरवीर है और जैक एक शूरवीर है\"। लियम ने आपको बताया कि जैक एक शूरवीर नहीं है। \"औरोरा एक धूर्त है यदि और केवल यदि जैक एक शूरवीर है,\" ग्रेस ने दावा किया। सोफिया ने asserted किया: \"यदि ग्रेस एक धूर्त है तो लियम एक धूर्त है\"। सेबेस्टियन ने कहा कि ग्रेस एक शूरवीर है। औरोरा ने कहा, \"यदि सोफिया एक धूर्त है तो जैक एक धूर्त है\"। जैक ने asserted किया: \"सोफिया एक शूरवीर है और औरोरा एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) यूसुफ एक धूर्त है  \n(2) लियम एक शूरवीर है  \n(3) ग्रेस एक शूरवीर है  \n(4) सोफिया एक शूरवीर है  \n(5) सेबेस्टियन एक शूरवीर है  \n(6) औरोरा एक शूरवीर है  \n(7) जैक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ओलिवर, ओलिविया, राइली, जेम्स, शार्लट, मेसन, और एला। \"ओलिविया एक धूर्त है और राइली एक धूर्त है,\" ओलिवर ने कहा। ओलिविया के अनुसार, \"अगर ओलिविया एक शूरवीर है तो शार्लट एक शूरवीर है\"। राइली ने कहा: \"मेसन एक धूर्त नहीं है\"। जेम्स ने कहा, \"अगर मेसन एक शूरवीर है तो ओलिविया एक धूर्त है\"। शार्लट ने कहा: \"ओलिविया एक शूरवीर है\"। मेसन के अनुसार, \"शार्लट एक धूर्त है और ओलिविया एक धूर्त है\"। एला ने कहा, \"अगर मेसन एक धूर्त है तो राइली एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिवर एक धूर्त है  \n(2) ओलिविया एक शूरवीर है  \n(3) राइली एक धूर्त है  \n(4) जेम्स एक शूरवीर है  \n(5) शार्लट एक शूरवीर है  \n(6) मेसन एक धूर्त है  \n(7) एला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: हार्पर, यूसुफ, एवलिन, बेंजामिन, मैथ्यू, ओलिविया, और एवरी। हार्पर ने कहा, \"अगर बेंजामिन एक धूर्त है तो बेंजामिन एक शूरवीर है\"। यूसुफ ने आपको बताया कि एवलिन एक धूर्त है यदि और केवल यदि हार्पर एक शूरवीर है। एवलिन ने आपको बताया कि एवलिन एक शूरवीर है यदि और केवल यदि मैथ्यू एक धूर्त है। बेंजामिन ने कहा, \"एवलिन एक शूरवीर है या यूसुफ एक धूर्त है\"। \"एवरी एक धूर्त नहीं है\" - मैथ्यू। ओलिविया ने आपको बताया कि हार्पर एक शूरवीर है। एवरी ने कहा, \"ओलिविया एक धूर्त है और एवरी एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक शूरवीर है  \n(2) यूसुफ एक धूर्त है  \n(3) एवलिन एक शूरवीर है  \n(4) बेंजामिन एक शूरवीर है  \n(5) मैथ्यू एक धूर्त है  \n(6) ओलिविया एक शूरवीर है  \n(7) एवरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: अमेलिया, इसाबेला, विलियम, मेसन, मैथ्यू, ईथन, और ल्यूक। अमेलिया के शब्दों में: \"मेसन एक शूरवीर है और ईथन एक धूर्त है\"। \"मेसन एक धूर्त है\" - इसाबेला। \"इसाबेला एक धूर्त है\" - विलियम। मेसन ने कहा कि अगर ल्यूक एक शूरवीर है तो विलियम एक शूरवीर है। मैथ्यू ने कहा कि मेसन एक धूर्त है। ईथन ने कहा, \"मेसन एक शूरवीर है यदि और केवल यदि ल्यूक एक शूरवीर है\"। ल्यूक ने कहा, \"अगर मेसन एक शूरवीर है तो अमेलिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक धूर्त है  \n(2) इसाबेला एक शूरवीर है  \n(3) विलियम एक धूर्त है  \n(4) मेसन एक धूर्त है  \n(5) मैथ्यू एक शूरवीर है  \n(6) ईथन एक धूर्त है  \n(7) ल्यूक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लियम, आरिया, मेसन, इसाबेला, शार्लट, हेनरी, और डेविड। जैसा कि लियम ने कहा, \"डेविड एक धूर्त नहीं है\"। \"हेनरी एक धूर्त है और डेविड एक शूरवीर है,\" आरिया ने कहा। मेसन ने टिप्पणी की, \"आरिया एक शूरवीर है या डेविड एक शूरवीर है\"। इसाबेला ने कहा, \"हेनरी एक धूर्त है यदि और केवल यदि लियम एक शूरवीर है।\" शार्लट ने आपको बताया कि आरिया एक धूर्त है। हेनरी ने कहा, \"यदि लियम एक धूर्त है तो हेनरी एक शूरवीर है।\" डेविड ने कहा, \"शार्लट एक शूरवीर है या लियम एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक शूरवीर है  \n(2) आरिया एक धूर्त है  \n(3) मेसन एक शूरवीर है  \n(4) इसाबेला एक धूर्त है  \n(5) शार्लट एक शूरवीर है  \n(6) हेनरी एक शूरवीर है  \n(7) डेविड एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: नूह, ओलिवर, एवलिन, अबिगेल, ग्रेस, एम्मा, और डेविड। नूह के अनुसार, \"ओलिवर शूरवीर नहीं है\"। \"एम्मा एक धूर्त है या ओलिवर एक शूरवीर है,\" ओलिवर ने कहा। एवलिन ने कहा कि अबिगेल एक धूर्त नहीं है। अबिगेल को यह कहते हुए सुना गया, \"अगर ग्रेस एक शूरवीर है तो एवलिन एक शूरवीर है\"। ग्रेस ने कहा, \"डेविड एक शूरवीर है और डेविड एक धूर्त है\"। एम्मा ने कहा: \"अगर ओलिवर एक धूर्त है तो ग्रेस एक शूरवीर है\"। डेविड के शब्दों में: \"अबिगेल एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक धूर्त है  \n(2) ओलिवर एक शूरवीर है  \n(3) एवलिन एक शूरवीर है  \n(4) अबिगेल एक शूरवीर है  \n(5) ग्रेस एक धूर्त है  \n(6) एम्मा एक शूरवीर है  \n(7) डेविड एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: जेम्स, राइली, इसाबेला, यूसुफ, पेनलोप, विक्टोरिया, और अमेलिया। जेम्स ने कहा कि राइली एक धूर्त है या इसाबेला एक शूरवीर है। राइली ने आपको बताया कि यूसुफ एक धूर्त है। इसाबेला ने टिप्पणी की, \"पेनलोप एक धूर्त है और पेनलोप एक शूरवीर है\"। यूसुफ ने कहा कि अमेलिया एक शूरवीर है। पेनलोप ने आपको बताया कि विक्टोरिया एक धूर्त है। विक्टोरिया ने कहा कि पेनलोप एक शूरवीर है या जेम्स एक शूरवीर है। अमेलिया के शब्दों में: \"अगर विक्टोरिया एक धूर्त है तो इसाबेला एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) राइली एक धूर्त है  \n(3) इसाबेला एक धूर्त है  \n(4) यूसुफ एक शूरवीर है  \n(5) पेनलोप एक धूर्त है  \n(6) विक्टोरिया एक शूरवीर है  \n(7) अमेलिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लोगन, क्लोई, जैक्सन, सैमुएल, पेनलोप, मैथ्यू, और एमिली। लोगन के एक बयान में: \"सैमुएल शूरवीर नहीं है\"। क्लोई के अनुसार, \"लोगन एक धूर्त है\"। जैक्सन ने कहा कि पेनलोप एक धूर्त है या क्लोई एक धूर्त है। सैमुएल ने कहा कि पेनलोप एक शूरवीर है। पेनलोप के एक बयान में: \"क्लोई एक धूर्त है यदि और केवल यदि मैथ्यू एक धूर्त है\"। मैथ्यू ने कहा, \"क्लोई एक धूर्त नहीं है\"। एमिली ने कहा, \"क्लोई एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक धूर्त है  \n(2) क्लोई एक शूरवीर है  \n(3) जैक्सन एक धूर्त है  \n(4) सैमुएल एक शूरवीर है  \n(5) पेनलोप एक शूरवीर है  \n(6) मैथ्यू एक शूरवीर है  \n(7) एमिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ल्यूक, डेविड, हेनरी, ईथन, जैक, बेंजामिन, और याकूब। \"हेनरी एक शूरवीर है और याकूब एक शूरवीर है,\" ल्यूक ने घोषणा की। डेविड को यह कहते हुए सुना गया, \"बेंजामिन एक शूरवीर है यदि और केवल यदि याकूब एक धूर्त है\"। \"डेविड एक धूर्त है या जैक एक धूर्त है\" - हेनरी। ईथन ने व्यक्त किया कि याकूब एक शूरवीर है यदि और केवल यदि जैक एक शूरवीर है। \"यदि ल्यूक एक शूरवीर है तो डेविड एक शूरवीर है,\" जैक ने कहा। बेंजामिन ने कहा: \"ल्यूक एक धूर्त नहीं है\"। \"बेंजामिन एक शूरवीर नहीं है\" - याकूब। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक धूर्त है  \n(2) डेविड एक शूरवीर है  \n(3) हेनरी एक धूर्त है  \n(4) ईथन एक शूरवीर है  \n(5) जैक एक शूरवीर है  \n(6) बेंजामिन एक धूर्त है  \n(7) याकूब एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: मिया, लियम, ओलिविया, अबिगेल, अमेलिया, लोगन, और डैनियल। \"लियम एक धूर्त है और डैनियल एक शूरवीर है,\" मिया ने दावा किया। \"लोगन एक धूर्त है और मिया एक धूर्त है\" - लियम। ओलिविया ने कहा, \"लियम एक धूर्त नहीं है।\" अबिगेल ने asserted किया: \"अगर ओलिविया एक शूरवीर है तो अबिगेल एक शूरवीर है।\" \"लियम एक धूर्त नहीं है,\" अमेलिया ने उल्लेख किया। लोगन के अनुसार, \"अगर लियम एक धूर्त है तो अबिगेल एक धूर्त है।\" डैनियल ने टिप्पणी की, \"अबिगेल एक धूर्त है यदि और केवल यदि लोगन एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक शूरवीर है  \n(2) लियम एक धूर्त है  \n(3) ओलिविया एक धूर्त है  \n(4) अबिगेल एक शूरवीर है  \n(5) अमेलिया एक धूर्त है  \n(6) लोगन एक धूर्त है  \n(7) डैनियल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लिली, जेम्स, एला, इसाबेला, शार्लट, ग्रेस, और नूह। \"अगर इसाबेला एक धूर्त है तो शार्लट एक धूर्त है,\" लिली ने दावा किया। जेम्स ने कहा कि नूह एक शूरवीर है। \"जेम्स एक शूरवीर नहीं है,\" एला ने घोषित किया। \"अगर इसाबेला एक शूरवीर है तो शार्लट एक शूरवीर है\" - इसाबेला। शार्लट ने आपको बताया कि शार्लट एक शूरवीर है। जैसे ग्रेस ने कहा, \"अगर नूह एक शूरवीर है तो शार्लट एक शूरवीर है\"। \"जेम्स एक धूर्त है और इसाबेला एक धूर्त है\" - नूह। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) लिली एक शूरवीर है  \n(2) जेम्स एक धूर्त है  \n(3) एला एक शूरवीर है  \n(4) इसाबेला एक शूरवीर है  \n(5) शार्लट एक शूरवीर है  \n(6) ग्रेस एक शूरवीर है  \n(7) नूह एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: जेम्स, विलियम, याकूब, लियम, अमेलिया, लुकास, और डैनियल। जेम्स ने कहा कि अमेलिया एक धूर्त है। \"अमेलिया एक शूरवीर है\" - विलियम। याकूब के एक बयान में: \"यदि डैनियल एक धूर्त है तो अमेलिया एक धूर्त है\"। लियम ने कहा कि अमेलिया एक शूरवीर है। अमेलिया ने कहा, \"जेम्स एक शूरवीर है और डैनियल एक धूर्त है\"। लुकास ने कहा: \"जेम्स एक शूरवीर है यदि और केवल यदि विलियम एक शूरवीर है\"। डैनियल ने कहा, \"अमेलिया एक शूरवीर है यदि और केवल यदि याकूब एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) विलियम एक धूर्त है  \n(3) याकूब एक शूरवीर है  \n(4) लियम एक धूर्त है  \n(5) अमेलिया एक धूर्त है  \n(6) लुकास एक धूर्त है  \n(7) डैनियल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लिली, आरिया, नूह, सोफिया, एला, डेविड, और शार्लट। लिली ने कहा कि अगर डेविड एक धूर्त है तो डेविड एक शूरवीर है। आरिया ने आपको बताया कि डेविड एक शूरवीर है यदि और केवल यदि लिली एक शूरवीर है। नूह ने कहा कि लिली एक शूरवीर है यदि और केवल यदि शार्लट एक शूरवीर है। सोफिया के शब्दों में: \"डेविड एक धूर्त है यदि और केवल यदि डेविड एक शूरवीर है\"। एला के शब्दों में: \"आरिया एक धूर्त है और आरिया एक शूरवीर है\"। डेविड ने कहा, \"नूह एक धूर्त नहीं है\"। शार्लट ने कहा कि अगर डेविड एक शूरवीर है तो आरिया एक धूर्त है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) लिली एक धूर्त है  \n(2) आरिया एक शूरवीर है  \n(3) नूह एक धूर्त है  \n(4) सोफिया एक धूर्त है  \n(5) एला एक धूर्त है  \n(6) डेविड एक धूर्त है  \n(7) शार्लट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: शार्लट, यूसुफ, नूह, ग्रेस, डैनियल, एम्मा, और जैक। \"एम्मा शूरवीर नहीं है,\" शार्लट ने कहा। \"यूसुफ शूरवीर है,\" यूसुफ ने घोषणा की। नूह ने कहा कि जैक शूरवीर नहीं है। ग्रेस ने कहा, \"यूसुफ शूरवीर है या शार्लट धूर्त है।\" डैनियल ने कहा कि अगर एम्मा धूर्त है तो शार्लट धूर्त है। \"अगर नूह शूरवीर है तो डैनियल धूर्त है,\" एम्मा ने घोषणा की। जैक ने कहा, \"नूह शूरवीर है यदि और केवल यदि यूसुफ शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक धूर्त है  \n(2) यूसुफ एक धूर्त है  \n(3) नूह एक धूर्त है  \n(4) ग्रेस एक शूरवीर है  \n(5) डैनियल एक शूरवीर है  \n(6) एम्मा एक शूरवीर है  \n(7) जैक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ऐडन, ग्रेस, औरोरा, शार्लट, माइकल, लोगन, और क्लोई। \"अगर ऐडन एक शूरवीर है तो ग्रेस एक धूर्त है,\" ऐडन ने दावा किया। \"शार्लट एक शूरवीर है,\" ग्रेस ने उल्लेख किया। जैसे औरोरा ने कहा, \"माइकल एक शूरवीर है और ग्रेस एक शूरवीर है\"। शार्लट ने कहा, \"ऐडन एक शूरवीर है यदि और केवल यदि माइकल एक शूरवीर है\"। माइकल ने नोट किया, \"माइकल एक शूरवीर है यदि और केवल यदि ग्रेस एक धूर्त है\"। लोगन के शब्दों में: \"औरोरा एक धूर्त है यदि और केवल यदि ग्रेस एक धूर्त है\"। क्लोई ने कहा, \"अगर ऐडन एक धूर्त है तो ऐडन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक शूरवीर है  \n(2) ग्रेस एक धूर्त है  \n(3) औरोरा एक धूर्त है  \n(4) शार्लट एक धूर्त है  \n(5) माइकल एक धूर्त है  \n(6) लोगन एक शूरवीर है  \n(7) क्लोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: यूसुफ, जेम्स, इसाबेला, ईथन, सोफिया, जैक, और औरोरा। यूसुफ ने कहा, \"इसाबेला एक धूर्त है\"। \"ईथन एक धूर्त है यदि और केवल यदि इसाबेला एक धूर्त है,\" जेम्स ने घोषणा की। इसाबेला के अनुसार, \"सोफिया एक शूरवीर है और जेम्स एक धूर्त है\"। \"जेम्स एक शूरवीर है\" - ईथन। सोफिया ने कहा कि जैक एक शूरवीर है या जैक एक धूर्त है। जैक के अनुसार, \"ईथन एक शूरवीर है और जेम्स एक धूर्त है\"। औरोरा ने कहा, \"इसाबेला एक शूरवीर है या सोफिया एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) यूसुफ एक धूर्त है  \n(2) जेम्स एक धूर्त है  \n(3) इसाबेला एक शूरवीर है  \n(4) ईथन एक धूर्त है  \n(5) सोफिया एक शूरवीर है  \n(6) जैक एक धूर्त है  \n(7) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: जेम्स, ईथन, शार्लट, हेनरी, यूसुफ, याकूब, और आरिया। जेम्स को यह कहते हुए सुना गया, \"याकूब एक धूर्त है और शार्लट एक धूर्त है\"। जैसा कि ईथन ने कहा, \"यदि याकूब एक शूरवीर है तो हेनरी एक धूर्त है\"। शार्लट ने कहा, \"याकूब एक धूर्त है यदि और केवल यदि आरिया एक धूर्त है\"। हेनरी ने कहा, \"जेम्स एक धूर्त है यदि और केवल यदि हेनरी एक शूरवीर है\"। यूसुफ के एक बयान में: \"यदि आरिया एक शूरवीर है तो ईथन एक धूर्त है\"। याकूब ने टिप्पणी की, \"याकूब एक शूरवीर है और ईथन एक शूरवीर है\"। आरिया ने कहा कि ईथन एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक धूर्त है  \n(2) ईथन एक शूरवीर है  \n(3) शार्लट एक शूरवीर है  \n(4) हेनरी एक धूर्त है  \n(5) यूसुफ एक धूर्त है  \n(6) याकूब एक शूरवीर है  \n(7) आरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: विक्टोरिया, जेम्स, आरिया, ल्यूक, राइली, यूसुफ, और इसाबेला। विक्टोरिया ने कहा कि आरिया एक शूरवीर नहीं है। जेम्स के एक बयान में: \"ल्यूक एक धूर्त नहीं है\"। \"यूसुफ एक शूरवीर है यदि और केवल यदि यूसुफ एक धूर्त है,\" आरिया ने घोषणा की। \"यदि आरिया एक शूरवीर है तो राइली एक शूरवीर है,\" ल्यूक ने घोषणा की। \"यदि विक्टोरिया एक धूर्त है तो ल्यूक एक धूर्त है,\" राइली ने घोषणा की। यूसुफ ने व्यक्त किया कि आरिया एक धूर्त नहीं है। इसाबेला के अनुसार, \"ल्यूक एक धूर्त है यदि और केवल यदि विक्टोरिया एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) विक्टोरिया एक शूरवीर है  \n(2) जेम्स एक शूरवीर है  \n(3) आरिया एक धूर्त है  \n(4) ल्यूक एक शूरवीर है  \n(5) राइली एक शूरवीर है  \n(6) यूसुफ एक धूर्त है  \n(7) इसाबेला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ल्यूक, बेंजामिन, हेनरी, जैक्सन, एलिज़ाबेथ, मेसन, और अमेलिया। ल्यूक ने कहा कि बेंजामिन एक शूरवीर है। जैसा कि बेंजामिन ने कहा, \"अमेलिया एक धूर्त है और मेसन एक धूर्त है\"। हेनरी ने asserted किया: \"बेंजामिन एक धूर्त नहीं है\"। \"मेसेन एक धूर्त है और ल्यूक एक धूर्त है,\" जैक्सन ने उल्लेख किया। एलिज़ाबेथ ने asserted किया: \"बेंजामिन एक शूरवीर है\"। मेसन ने नोट किया, \"जैक्सन एक धूर्त है यदि और केवल यदि जैक्सन एक शूरवीर है\"। अमेलिया ने आपको बताया कि मेसन एक धूर्त है और मेसन एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) बेंजामिन एक शूरवीर है  \n(3) हेनरी एक शूरवीर है  \n(4) जैक्सन एक धूर्त है  \n(5) एलिज़ाबेथ एक शूरवीर है  \n(6) मेसन एक धूर्त है  \n(7) अमेलिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: मिया, याकूब, ओलिवर, अमेलिया, हेनरी, ओवेन, और लुकास। मिया ने कहा, \"मिया एक शूरवीर है और लुकास एक धूर्त है\"। \"ओलिवर एक धूर्त नहीं है\" - याकूब। \"अगर लुकास एक धूर्त है तो अमेलिया एक शूरवीर है\" - ओलिवर। \"लुकास एक धूर्त है या हेनरी एक धूर्त है,\" अमेलिया ने दावा किया। हेनरी के एक बयान में: \"ओवेन एक धूर्त है\"। ओवेन के एक बयान में: \"अगर ओलिवर एक धूर्त है तो ओवेन एक शूरवीर है\"। लुकास ने कहा, \"अगर ओलिवर एक धूर्त है तो हेनरी एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक धूर्त है  \n(2) याकूब एक शूरवीर है  \n(3) ओलिवर एक शूरवीर है  \n(4) अमेलिया एक शूरवीर है  \n(5) हेनरी एक धूर्त है  \n(6) ओवेन एक शूरवीर है  \n(7) लुकास एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ल्यूक, एमिली, मेसन, बेंजामिन, नूह, लिली, और ग्रेस। ल्यूक ने कहा, \"लिली एक शूरवीर नहीं है\"। \"नूह एक शूरवीर है,\" एमिली ने दावा किया। जैसे मेसन ने कहा, \"बेंजामिन एक धूर्त है यदि और केवल यदि ल्यूक एक धूर्त है\"। बेंजामिन के शब्दों में: \"नूह एक धूर्त है\"। नूह के एक बयान में: \"एमिली एक शूरवीर है और लिली एक धूर्त है\"। लिली ने कहा, \"यदि बेंजामिन एक शूरवीर है तो एमिली एक शूरवीर है\"। ग्रेस ने टिप्पणी की, \"यदि बेंजामिन एक धूर्त है तो बेंजामिन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) एमिली एक धूर्त है  \n(3) मेसन एक शूरवीर है  \n(4) बेंजामिन एक शूरवीर है  \n(5) नूह एक धूर्त है  \n(6) लिली एक धूर्त है  \n(7) ग्रेस एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: यूसुफ, सोफिया, जेम्स, सेबेस्टियन, एम्मा, अमेलिया, और जैक। जैसे यूसुफ ने कहा, \"जैक एक शूरवीर है और जैक एक धूर्त है\"। \"एम्मा एक शूरवीर है\" - सोफिया। जेम्स ने कहा, \"अगर यूसुफ एक शूरवीर है तो अमेलिया एक शूरवीर है।\" सेबेस्टियन ने कहा, \"यूसुफ एक शूरवीर है।\" एम्मा ने कहा: \"जेम्स एक धूर्त नहीं है\"। जैसे अमेलिया ने कहा, \"जैक एक शूरवीर है यदि और केवल यदि सोफिया एक धूर्त है\"। जैक ने आपको बताया कि एम्मा एक धूर्त नहीं है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) यूसुफ एक धूर्त है  \n(2) सोफिया एक शूरवीर है  \n(3) जेम्स एक शूरवीर है  \n(4) सेबेस्टियन एक धूर्त है  \n(5) एम्मा एक शूरवीर है  \n(6) अमेलिया एक धूर्त है  \n(7) जैक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: सेबेस्टियन, डैनियल, जैक्सन, लुकास, अबिगेल, अलेक्जेंडर, और स्कारलेट। सेबेस्टियन के शब्दों में: \"जैक्सन एक शूरवीर है या अलेक्जेंडर एक शूरवीर है\"। डैनियल के अनुसार, \"स्कारलेट एक धूर्त है यदि और केवल यदि जैक्सन एक शूरवीर है\"। जैक्सन के एक बयान में: \"डैनियल एक शूरवीर है यदि और केवल यदि डैनियल एक धूर्त है\"। लुकास ने कहा कि यदि अलेक्जेंडर एक धूर्त है तो सेबेस्टियन एक शूरवीर है। \"स्कारलेट एक शूरवीर है\" - अबिगेल। अलेक्जेंडर के एक बयान में: \"अबिगेल एक धूर्त है\"। स्कारलेट ने कहा, \"जैक्सन एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सेबेस्टियन एक धूर्त है  \n(2) डैनियल एक शूरवीर है  \n(3) जैक्सन एक धूर्त है  \n(4) लुकास एक धूर्त है  \n(5) अबिगेल एक शूरवीर है  \n(6) अलेक्जेंडर एक धूर्त है  \n(7) स्कारलेट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ईथन, औरोरा, सोफिया, नूह, एवा, विलियम, और ऐडन। ईथन को यह कहते हुए सुना गया, \"नूह एक शूरवीर है\"। औरोरा ने कहा: \"सोफिया एक धूर्त है\"। \"ईथन एक शूरवीर है,\" सोफिया ने घोषित किया। नूह ने कहा, \"ऐडन एक धूर्त है और नूह एक शूरवीर है।\" एवा के एक बयान में: \"विलियम एक शूरवीर है\"। विलियम ने आपको बताया कि नूह एक शूरवीर है या ईथन एक शूरवीर है। \"औरोरा एक धूर्त है या सोफिया एक धूर्त है,\" ऐडन ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक धूर्त है  \n(2) औरोरा एक शूरवीर है  \n(3) सोफिया एक धूर्त है  \n(4) नूह एक धूर्त है  \n(5) एवा एक धूर्त है  \n(6) विलियम एक धूर्त है  \n(7) ऐडन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ओलिविया, मैथ्यू, ओलिवर, सेबेस्टियन, पेनलोप, एवा, और शार्लट। ओलिविया को यह कहते हुए सुना गया, \"पेनलोप एक शूरवीर नहीं है\"। मैथ्यू ने आपको बताया कि मैथ्यू एक शूरवीर है या ओलिवर एक धूर्त है। \"मैथ्यू एक शूरवीर है या शार्लट एक धूर्त है,\" ओलिवर ने दावा किया। सेबेस्टियन ने कहा कि पेनलोप एक शूरवीर है और ओलिवर एक धूर्त है। पेनलोप ने कहा कि ओलिवर एक धूर्त है। एवा के एक बयान में: \"यदि शार्लट एक शूरवीर है तो ओलिवर एक धूर्त है\"। शार्लट ने कहा, \"यदि पेनलोप एक शूरवीर है तो शार्लट एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक शूरवीर है  \n(2) मैथ्यू एक शूरवीर है  \n(3) ओलिवर एक शूरवीर है  \n(4) सेबेस्टियन एक धूर्त है  \n(5) पेनलोप एक धूर्त है  \n(6) एवा एक धूर्त है  \n(7) शार्लट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ल्यूक, ज़ोई, सोफिया, यूसुफ, ग्रेस, ओलिविया, और सेबेस्टियन। ल्यूक ने कहा, \"ग्रेस एक धूर्त है\"। \"सेबेस्टियन एक शूरवीर है यदि और केवल यदि सोफिया एक शूरवीर है\" - ज़ोई। \"ओलिविया एक धूर्त नहीं है,\" सोफिया ने कहा। यूसुफ ने कहा, \"ओलिविया एक धूर्त है\"। \"ग्रेस एक शूरवीर है यदि और केवल यदि यूसुफ एक शूरवीर है,\" ग्रेस ने दावा किया। ओलिविया के अनुसार, \"ज़ोई एक शूरवीर नहीं है\"। सेबेस्टियन ने कहा, \"ग्रेस एक धूर्त है या सेबेस्टियन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक धूर्त है  \n(2) ज़ोई एक शूरवीर है  \n(3) सोफिया एक धूर्त है  \n(4) यूसुफ एक शूरवीर है  \n(5) ग्रेस एक शूरवीर है  \n(6) ओलिविया एक धूर्त है  \n(7) सेबेस्टियन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: मैथ्यू, एवलिन, सोफिया, बेंजामिन, एवरी, एम्मा, और ग्रेस। मैथ्यू ने कहा कि मैथ्यू एक शूरवीर है यदि और केवल यदि बेंजामिन एक शूरवीर है। एवलिन ने टिप्पणी की, \"यदि एम्मा एक शूरवीर है तो मैथ्यू एक धूर्त है\"। सोफिया के एक बयान में: \"मैथ्यू एक धूर्त है और ग्रेस एक धूर्त है\"। बेंजामिन ने कहा कि मैथ्यू एक धूर्त है। \"बेंजामिन एक शूरवीर है या मैथ्यू एक धूर्त है\" - एवरी। एम्मा ने आपको बताया कि एवरी एक धूर्त है यदि और केवल यदि मैथ्यू एक शूरवीर है। ग्रेस ने नोट किया, \"मैथ्यू एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक धूर्त है  \n(2) एवलिन एक शूरवीर है  \n(3) सोफिया एक शूरवीर है  \n(4) बेंजामिन एक शूरवीर है  \n(5) एवरी एक शूरवीर है  \n(6) एम्मा एक शूरवीर है  \n(7) ग्रेस एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: पेनलोप, एमिली, मैथ्यू, अलेक्जेंडर, बेंजामिन, क्लोई, और ईथन। पेनलोप के शब्दों में: \"क्लोई एक धूर्त है यदि और केवल यदि अलेक्जेंडर एक धूर्त है\"। एमिली ने कहा, \"पेनलोप एक धूर्त है और अलेक्जेंडर एक शूरवीर है\"। \"एमिली एक धूर्त है,\" मैथ्यू ने कहा। अलेक्जेंडर के शब्दों में: \"यदि क्लोई एक शूरवीर है तो बेंजामिन एक धूर्त है\"। बेंजामिन ने कहा: \"मैथ्यू एक धूर्त है या ईथन एक धूर्त है\"। क्लोई ने कहा कि ईथन एक शूरवीर है या बेंजामिन एक शूरवीर है। ईथन ने कहा, \"क्लोई एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक शूरवीर है  \n(2) एमिली एक धूर्त है  \n(3) मैथ्यू एक शूरवीर है  \n(4) अलेक्जेंडर एक शूरवीर है  \n(5) बेंजामिन एक धूर्त है  \n(6) क्लोई एक शूरवीर है  \n(7) ईथन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: सैमुएल, यूसुफ, अमेलिया, बेंजामिन, एवा, ओलिविया, और विलियम। सैमुएल ने कहा: \"विलियम एक धूर्त है या अमेलिया एक धूर्त है\"। यूसुफ ने कहा, \"अगर ओलिविया एक शूरवीर है तो बेंजामिन एक धूर्त है\"। अमेलिया ने कहा, \"ओलिविया एक धूर्त है\"। बेंजामिन ने कहा कि यूसुफ एक धूर्त है और एवा एक शूरवीर है। \"अमेलिया एक शूरवीर है और बेंजामिन एक धूर्त है\" - एवा। ओलिविया ने कहा, \"बेंजामिन एक धूर्त नहीं है।\" विलियम ने कहा कि ओलिविया एक धूर्त है यदि और केवल यदि अमेलिया एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक धूर्त है  \n(2) यूसुफ एक शूरवीर है  \n(3) अमेलिया एक शूरवीर है  \n(4) बेंजामिन एक धूर्त है  \n(5) एवा एक शूरवीर है  \n(6) ओलिविया एक धूर्त है  \n(7) विलियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: यूसुफ, लुकास, ज़ोई, ऐडन, डैनियल, शार्लट, और विलियम। यूसुफ ने कहा, \"शार्लट एक धूर्त नहीं है।\" लुकास ने कहा, \"शार्लट एक धूर्त है।\" \"विलियम एक धूर्त है या ऐडन एक धूर्त है,\" ज़ोई ने घोषणा की। \"लुकास एक शूरवीर नहीं है,\" ऐडन ने घोषणा की। डैनियल ने कहा, \"अगर यूसुफ एक धूर्त है तो शार्लट एक धूर्त है।\" \"ज़ोई एक शूरवीर है और डैनियल एक शूरवीर है,\" शार्लट ने कहा। विलियम ने कहा, \"विलियम एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) यूसुफ एक शूरवीर है  \n(2) लुकास एक धूर्त है  \n(3) ज़ोई एक शूरवीर है  \n(4) ऐडन एक शूरवीर है  \n(5) डैनियल एक शूरवीर है  \n(6) शार्लट एक शूरवीर है  \n(7) विलियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लियम, मैथ्यू, औरोरा, याकूब, माइकल, ओलिवर, और ग्रेस। लियम ने आपको बताया कि अगर याकूब एक शूरवीर है तो मैथ्यू एक शूरवीर है। मैथ्यू ने कहा, \"औरोरा एक शूरवीर नहीं है\"। औरोरा ने कहा, \"याकूब एक शूरवीर है और ओलिवर एक शूरवीर है\"। याकूब के अनुसार, \"माइकल एक शूरवीर है यदि और केवल यदि ओलिवर एक धूर्त है\"। माइकल ने आपको बताया कि ओलिवर एक शूरवीर है। ओलिवर ने कहा कि ग्रेस एक शूरवीर है और लियम एक शूरवीर है। ग्रेस ने कहा, \"मैथ्यू एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक शूरवीर है  \n(2) मैथ्यू एक शूरवीर है  \n(3) औरोरा एक धूर्त है  \n(4) याकूब एक धूर्त है  \n(5) माइकल एक शूरवीर है  \n(6) ओलिवर एक शूरवीर है  \n(7) ग्रेस एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: मेसन, याकूब, डेविड, डैनियल, हेनरी, मिया, और लोगन। मेसन के अनुसार, \"हेनरी एक शूरवीर नहीं है\"। याकूब के अनुसार, \"मिया एक धूर्त है और हेनरी एक धूर्त है\"। \"अगर लोगन एक धूर्त है तो मिया एक धूर्त है,\" डेविड ने घोषणा की। \"डैनियल एक शूरवीर है या मिया एक धूर्त है,\" डैनियल ने उल्लेख किया। हेनरी ने कहा, \"डेविड एक धूर्त है यदि और केवल यदि मिया एक धूर्त है\"। मिया के एक बयान में: \"मेसन एक धूर्त है\"। लोगन ने नोट किया, \"डेविड एक धूर्त है और लोगन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक शूरवीर है  \n(2) याकूब एक शूरवीर है  \n(3) डेविड एक शूरवीर है  \n(4) डैनियल एक शूरवीर है  \n(5) हेनरी एक धूर्त है  \n(6) मिया एक धूर्त है  \n(7) लोगन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: स्कारलेट, लिली, अलेक्जेंडर, डेविड, ओलिवर, हार्पर, और याकूब। स्कारलेट ने आपको बताया कि याकूब एक शूरवीर है। \"डेविड एक धूर्त है और हार्पर एक शूरवीर है\" - लिली। \"अगर लिली एक शूरवीर है तो डेविड एक शूरवीर है,\" अलेक्जेंडर ने घोषणा की। डेविड के अनुसार, \"अगर अलेक्जेंडर एक शूरवीर है तो डेविड एक शूरवीर है\"। ओलिवर ने कहा कि डेविड एक धूर्त है और याकूब एक धूर्त है। \"अलेक्जेंडर एक धूर्त नहीं है,\" हार्पर ने दावा किया। याकूब के अनुसार, \"हार्पर एक धूर्त है और अलेक्जेंडर एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) स्कारलेट एक धूर्त है  \n(2) लिली एक धूर्त है  \n(3) अलेक्जेंडर एक शूरवीर है  \n(4) डेविड एक शूरवीर है  \n(5) ओलिवर एक धूर्त है  \n(6) हार्पर एक शूरवीर है  \n(7) याकूब एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: जैक, इसाबेला, मिया, शार्लट, राइली, बेंजामिन, और लोगन। जैक ने कहा, \"शार्लट एक शूरवीर है।\" इसाबेला ने कहा, \"लोगन एक शूरवीर है और लोगन एक धूर्त है।\" मिया ने कहा: \"इसाबेला एक शूरवीर है।\" शार्लट ने कहा, \"इसाबेला एक शूरवीर नहीं है।\" \"मिया एक शूरवीर है और लोगन एक शूरवीर है,\" राइली ने कहा। बेंजामिन के शब्दों में: \"अगर शार्लट एक शूरवीर है तो जैक एक धूर्त है।\" लोगन ने कहा, \"मिया एक धूर्त है।\" तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) जैक एक शूरवीर है  \n(2) इसाबेला एक धूर्त है  \n(3) मिया एक धूर्त है  \n(4) शार्लट एक शूरवीर है  \n(5) राइली एक धूर्त है  \n(6) बेंजामिन एक धूर्त है  \n(7) लोगन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: याकूब, बेंजामिन, आरिया, हार्पर, ज़ोई, मैथ्यू, और विलियम। जैसे याकूब ने कहा, \"हार्पर एक धूर्त है यदि और केवल यदि ज़ोई एक शूरवीर है\"। बेंजामिन ने कहा कि यदि ज़ोई एक धूर्त है तो विलियम एक धूर्त है। आरिया ने आपको बताया कि हार्पर एक धूर्त है या ज़ोई एक धूर्त है। हार्पर ने कहा: \"बेंजामिन एक धूर्त है और ज़ोई एक शूरवीर है\"। ज़ोई को यह कहते हुए सुना गया, \"मैथ्यू एक शूरवीर है\"। मैथ्यू के शब्दों में: \"यदि विलियम एक शूरवीर है तो हार्पर एक शूरवीर है\"। जैसे विलियम ने कहा, \"आरिया एक धूर्त है और ज़ोई एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) याकूब एक शूरवीर है  \n(2) बेंजामिन एक शूरवीर है  \n(3) आरिया एक शूरवीर है  \n(4) हार्पर एक धूर्त है  \n(5) ज़ोई एक शूरवीर है  \n(6) मैथ्यू एक शूरवीर है  \n(7) विलियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: याकूब, एवरी, डेविड, लोगन, विक्टोरिया, पेनलोप, और जैक। याकूब ने आपको बताया कि पेनलोप एक शूरवीर है और विक्टोरिया एक धूर्त है। एवरी ने कहा, \"याकूब एक शूरवीर नहीं है\"। जैसा कि डेविड ने कहा, \"विक्टोरिया एक शूरवीर है यदि और केवल यदि याकूब एक धूर्त है\"। लोगन ने कहा कि जैक एक शूरवीर नहीं है। विक्टोरिया ने कहा कि लोगन एक धूर्त है और विक्टोरिया एक शूरवीर है। \"यदि एवरी एक धूर्त है तो जैक एक धूर्त है,\" पेनलोप ने दावा किया। जैक ने कहा कि याकूब एक शूरवीर है और डेविड एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) याकूब एक शूरवीर है  \n(2) एवरी एक धूर्त है  \n(3) डेविड एक शूरवीर है  \n(4) लोगन एक शूरवीर है  \n(5) विक्टोरिया एक धूर्त है  \n(6) पेनलोप एक शूरवीर है  \n(7) जैक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एम्मा, लुकास, डेविड, ईथन, ओवेन, यूसुफ, और औरोरा। एम्मा ने कहा कि ओवेन एक शूरवीर है या लुकास एक धूर्त है। लुकास के शब्दों में: \"यूसुफ एक धूर्त नहीं है\"। डेविड ने कहा, \"एम्मा एक धूर्त है\"। ईथन को यह कहते हुए सुना गया, \"एम्मा एक धूर्त है यदि और केवल यदि डेविड एक शूरवीर है\"। ओवेन के अनुसार, \"यदि लुकास एक धूर्त है तो ईथन एक धूर्त है\"। \"डेविड एक शूरवीर नहीं है,\" यूसुफ ने कहा। औरोरा के शब्दों में: \"लुकास एक धूर्त है या ईथन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एम्मा एक शूरवीर है  \n(2) लुकास एक शूरवीर है  \n(3) डेविड एक धूर्त है  \n(4) ईथन एक शूरवीर है  \n(5) ओवेन एक शूरवीर है  \n(6) यूसुफ एक शूरवीर है  \n(7) औरोरा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: हेनरी, एला, ल्यूक, अबिगेल, इसाबेला, जैक्सन, और शार्लट। हेनरी ने कहा, \"ल्यूक एक धूर्त नहीं है\"। एला के शब्दों में: \"ल्यूक एक शूरवीर नहीं है\"। ल्यूक के एक बयान में: \"हेनरी एक धूर्त है यदि और केवल यदि अबिगेल एक शूरवीर है\"। अबिगेल ने आपको बताया कि हेनरी एक शूरवीर है या इसाबेला एक धूर्त है। इसाबेला ने कहा, \"यदि अबिगेल एक शूरवीर है तो ल्यूक एक शूरवीर है।\" जैक्सन के अनुसार, \"यदि अबिगेल एक धूर्त है तो हेनरी एक शूरवीर है\"। शार्लट ने कहा कि यदि एला एक धूर्त है तो ल्यूक एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हेनरी एक धूर्त है  \n(2) एला एक शूरवीर है  \n(3) ल्यूक एक धूर्त है  \n(4) अबिगेल एक धूर्त है  \n(5) इसाबेला एक शूरवीर है  \n(6) जैक्सन एक धूर्त है  \n(7) शार्लट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: नूह, एलिज़ाबेथ, राइली, पेनलोप, सोफिया, ज़ोई, और एवा। नूह के शब्दों में: \"एवा एक शूरवीर है और एलिज़ाबेथ एक शूरवीर है\"। एलिज़ाबेथ के एक बयान में: \"नूह एक शूरवीर है या एवा एक धूर्त है\"। राइली ने कहा, \"एलिज़ाबेथ एक शूरवीर नहीं है\"। \"एवा एक शूरवीर है यदि और केवल यदि एवा एक धूर्त है,\" पेनलोप ने कहा। सोफिया ने कहा कि एवा एक शूरवीर है यदि और केवल यदि राइली एक धूर्त है। ज़ोई ने कहा, \"नूह एक धूर्त है यदि और केवल यदि राइली एक शूरवीर है\"। एवा ने आपको बताया कि राइली एक धूर्त है या ज़ोई एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक शूरवीर है  \n(2) एलिज़ाबेथ एक शूरवीर है  \n(3) राइली एक धूर्त है  \n(4) पेनलोप एक धूर्त है  \n(5) सोफिया एक शूरवीर है  \n(6) ज़ोई एक शूरवीर है  \n(7) एवा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लिली, स्कारलेट, एला, ओलिवर, एवा, ग्रेस, और याकूब। लिली ने कहा, \"एवा एक धूर्त है\"। स्कारलेट ने कहा, \"ओलिवर एक शूरवीर नहीं है\"। जैसा कि एला ने कहा, \"याकूब एक शूरवीर नहीं है\"। \"एला एक शूरवीर है,\" ओलिवर ने दावा किया। एवा को यह कहते हुए सुना गया, \"ग्रेस एक धूर्त है और ओलिवर एक शूरवीर है\"। \"एवा एक धूर्त है और स्कारलेट एक धूर्त है,\" ग्रेस ने दावा किया। याकूब ने आपको बताया कि ग्रेस एक धूर्त नहीं है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लिली एक धूर्त है  \n(2) स्कारलेट एक धूर्त है  \n(3) एला एक शूरवीर है  \n(4) ओलिवर एक शूरवीर है  \n(5) एवा एक शूरवीर है  \n(6) ग्रेस एक धूर्त है  \n(7) याकूब एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: मिया, ईथन, इसाबेला, पेनलोप, विलियम, एम्मा, और बेंजामिन। \"बेंजामिन एक धूर्त है या ईथन एक धूर्त है,\" मिया ने दावा किया। ईथन ने टिप्पणी की, \"एम्मा एक शूरवीर है या बेंजामिन एक धूर्त है।\" इसाबेला ने टिप्पणी की, \"अगर मिया एक शूरवीर है तो ईथन एक धूर्त है।\" पेनलोप ने आपको बताया कि एम्मा एक धूर्त है और बेंजामिन एक धूर्त है। विलियम ने आपको बताया कि बेंजामिन एक धूर्त है या इसाबेला एक धूर्त है। एम्मा ने कहा कि इसाबेला एक शूरवीर है या पेनलोप एक शूरवीर है। बेंजामिन ने कहा कि अगर इसाबेला एक धूर्त है तो विलियम एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक धूर्त है  \n(2) ईथन एक शूरवीर है  \n(3) इसाबेला एक शूरवीर है  \n(4) पेनलोप एक धूर्त है  \n(5) विलियम एक धूर्त है  \n(6) एम्मा एक शूरवीर है  \n(7) बेंजामिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: याकूब, सोफिया, डेविड, शार्लट, लोगन, ग्रेस, और ओलिविया। \"शार्लट एक शूरवीर है या डेविड एक शूरवीर है\" - याकूब। सोफिया ने कहा, \"याकूब एक धूर्त नहीं है\"। जैसा कि डेविड ने कहा, \"अगर याकूब एक शूरवीर है तो ओलिविया एक धूर्त है\"। शार्लट के अनुसार, \"ग्रेस एक धूर्त नहीं है\"। \"डेविड एक धूर्त है यदि और केवल यदि ग्रेस एक धूर्त है,\" लोगन ने घोषणा की। \"सोफिया एक शूरवीर है और शार्लट एक शूरवीर है\" - ग्रेस। ओलिविया ने कहा: \"याकूब एक धूर्त है या शार्लट एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) याकूब एक शूरवीर है  \n(2) सोफिया एक शूरवीर है  \n(3) डेविड एक शूरवीर है  \n(4) शार्लट एक शूरवीर है  \n(5) लोगन एक शूरवीर है  \n(6) ग्रेस एक शूरवीर है  \n(7) ओलिविया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: जेम्स, डैनियल, ल्यूक, शार्लट, मिया, एला, और राइली। जेम्स ने कहा, \"ल्यूक एक धूर्त है यदि और केवल यदि ल्यूक एक शूरवीर है\"। डैनियल ने कहा, \"शार्लट एक धूर्त है यदि और केवल यदि डैनियल एक शूरवीर है\"। ल्यूक ने कहा, \"मिया एक धूर्त है और मिया एक शूरवीर है\"। शार्लट को यह कहते हुए सुना गया, \"डैनियल एक धूर्त है यदि और केवल यदि मिया एक धूर्त है\"। मिया ने कहा, \"यदि मिया एक शूरवीर है तो डैनियल एक धूर्त है।\" \"ल्यूक एक शूरवीर नहीं है,\" एला ने दावा किया। \"जेम्स एक शूरवीर है या जेम्स एक धूर्त है,\" राइली ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक धूर्त है  \n(2) डैनियल एक धूर्त है  \n(3) ल्यूक एक धूर्त है  \n(4) शार्लट एक धूर्त है  \n(5) मिया एक शूरवीर है  \n(6) एला एक शूरवीर है  \n(7) राइली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: पेनलोप, सोफिया, जेम्स, स्कारलेट, एवरी, बेंजामिन, और सैमुएल। पेनलोप के एक बयान में: \"जेम्स एक धूर्त है और पेनलोप एक शूरवीर है\"। सोफिया ने कहा कि अगर सैमुएल एक धूर्त है तो जेम्स एक धूर्त है। जेम्स ने कहा कि अगर स्कारलेट एक धूर्त है तो सोफिया एक धूर्त है। स्कारलेट ने नोट किया, \"बेंजामिन एक शूरवीर है या एवरी एक शूरवीर है\"। एवरी ने कहा कि बेंजामिन एक धूर्त नहीं है। \"पेनलोप एक शूरवीर है,\" बेंजामिन ने घोषित किया। \"पेनलोप एक शूरवीर है या जेम्स एक शूरवीर है,\" सैमुएल ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक धूर्त है  \n(2) सोफिया एक शूरवीर है  \n(3) जेम्स एक धूर्त है  \n(4) स्कारलेट एक धूर्त है  \n(5) एवरी एक धूर्त है  \n(6) बेंजामिन एक धूर्त है  \n(7) सैमुएल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ल्यूक, मिया, अबिगेल, सेबेस्टियन, बेंजामिन, ज़ोई, और जैक। ल्यूक ने कहा, \"बेंजामिन एक धूर्त है\"। \"अगर ज़ोई एक शूरवीर है तो अबिगेल एक शूरवीर है,\" मिया ने दावा किया। अबिगेल ने नोट किया, \"ज़ोई एक शूरवीर है यदि और केवल यदि सेबेस्टियन एक शूरवीर है\"। \"ल्यूक एक शूरवीर है\" - सेबेस्टियन। बेंजामिन ने remarked किया, \"अबिगेल एक शूरवीर है और सेबेस्टियन एक शूरवीर है\"। \"ज़ोई एक शूरवीर है,\" ज़ोई ने घोषित किया। जैक के एक बयान में: \"ल्यूक एक धूर्त नहीं है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) मिया एक शूरवीर है  \n(3) अबिगेल एक धूर्त है  \n(4) सेबेस्टियन एक शूरवीर है  \n(5) बेंजामिन एक धूर्त है  \n(6) ज़ोई एक धूर्त है  \n(7) जैक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लुकास, याकूब, लियम, स्कारलेट, सैमुएल, विक्टोरिया, और एवरी। लुकास ने कहा कि अगर सैमुएल एक शूरवीर है तो लियम एक धूर्त है। याकूब को यह कहते हुए सुना गया, \"सैमुएल एक धूर्त नहीं है\"। लियम ने कहा, \"याकूब एक शूरवीर है यदि और केवल यदि स्कारलेट एक शूरवीर है\"। स्कारलेट के अनुसार, \"सैमुएल एक धूर्त नहीं है\"। सैमुएल ने कहा, \"स्कारलेट एक शूरवीर है और स्कारलेट एक धूर्त है\"। विक्टोरिया के अनुसार, \"लियम एक धूर्त है या याकूब एक शूरवीर है\"। एवरी ने कहा, \"लुकास एक धूर्त है और सैमुएल एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) लुकास एक शूरवीर है  \n(2) याकूब एक धूर्त है  \n(3) लियम एक शूरवीर है  \n(4) स्कारलेट एक धूर्त है  \n(5) सैमुएल एक धूर्त है  \n(6) विक्टोरिया एक धूर्त है  \n(7) एवरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: डेविड, एलिज़ाबेथ, ओलिवर, ऐडन, एवा, एमिली, और मैथ्यू। डेविड को यह कहते हुए सुना गया, \"मैथ्यू एक शूरवीर है या ऐडन एक धूर्त है\"। एलिज़ाबेथ ने कहा, \"ओलिवर एक शूरवीर है\"। जैसे ओलिवर ने कहा, \"डेविड एक धूर्त नहीं है\"। ऐडन ने कहा, \"डेविड एक शूरवीर है या ऐडन एक शूरवीर है\"। \"एमिली एक धूर्त है यदि और केवल यदि ओलिवर एक शूरवीर है,\" एवा ने घोषणा की। एमिली ने आपको बताया कि ऐडन एक शूरवीर है यदि और केवल यदि डेविड एक शूरवीर है। मैथ्यू ने टिप्पणी की, \"डेविड एक धूर्त है या ऐडन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक शूरवीर है  \n(2) एलिज़ाबेथ एक शूरवीर है  \n(3) ओलिवर एक शूरवीर है  \n(4) ऐडन एक शूरवीर है  \n(5) एवा एक धूर्त है  \n(6) एमिली एक शूरवीर है  \n(7) मैथ्यू एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: आरिया, डैनियल, मेसन, डेविड, मिया, एलिज़ाबेथ, और स्कारलेट। \"एलिज़ाबेथ एक शूरवीर है और डैनियल एक शूरवीर है,\" आरिया ने दावा किया। डैनियल के एक बयान में: \"अगर एलिज़ाबेथ एक शूरवीर है तो मिया एक शूरवीर है\"। मेसन को यह कहते हुए सुना गया, \"डेविड एक शूरवीर है या डेविड एक धूर्त है\"। डेविड ने asserted किया: \"डैनियल एक धूर्त है और स्कारलेट एक धूर्त है\"। मिया ने आपको बताया कि एलिज़ाबेथ एक धूर्त है और डैनियल एक शूरवीर है। एलिज़ाबेथ ने कहा कि अगर मेसन एक धूर्त है तो डेविड एक शूरवीर है। \"मिया एक धूर्त है यदि और केवल यदि आरिया एक शूरवीर है,\" स्कारलेट ने उल्लेख किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) आरिया एक धूर्त है  \n(2) डैनियल एक धूर्त है  \n(3) मेसन एक शूरवीर है  \n(4) डेविड एक शूरवीर है  \n(5) मिया एक धूर्त है  \n(6) एलिज़ाबेथ एक शूरवीर है  \n(7) स्कारलेट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: माइकल, सेबेस्टियन, जैक्सन, पेनलोप, नूह, इसाबेला, और ज़ोई। माइकल ने कहा, \"इसाबेला एक धूर्त नहीं है\"। सेबेस्टियन ने कहा, \"नूह एक धूर्त है या इसाबेला एक धूर्त है\"। जैक्सन के अनुसार, \"नूह एक धूर्त है और सेबेस्टियन एक शूरवीर है\"। \"ज़ोई एक धूर्त है\" - पेनलोप। \"यदि सेबेस्टियन एक धूर्त है तो नूह एक शूरवीर है\" - नूह। \"माइकल एक धूर्त है यदि और केवल यदि सेबेस्टियन एक शूरवीर है\" - इसाबेला। ज़ोई ने कहा, \"सेबेस्टियन एक धूर्त है या माइकल एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक शूरवीर है  \n(2) सेबेस्टियन एक धूर्त है  \n(3) जैक्सन एक धूर्त है  \n(4) पेनलोप एक धूर्त है  \n(5) नूह एक शूरवीर है  \n(6) इसाबेला एक शूरवीर है  \n(7) ज़ोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: पेनलोप, एवलिन, शार्लट, एला, ऐडन, आरिया, और जैक्सन। पेनलोप ने टिप्पणी की, \"पेनलोप एक शूरवीर है\"। एवलिन ने नोट किया, \"पेनलोप एक धूर्त नहीं है\"। शार्लट के शब्दों में: \"पेनलोप एक शूरवीर है या ऐडन एक शूरवीर है\"। एला ने कहा, \"शार्लट एक शूरवीर है या शार्लट एक धूर्त है\"। \"जैक्सन एक धूर्त है,\" ऐडन ने दावा किया। \"ऐडन एक धूर्त है और जैक्सन एक धूर्त है,\" आरिया ने दावा किया। जैक्सन ने कहा कि शार्लट एक शूरवीर है और एला एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) पेनलोप एक शूरवीर है  \n(2) एवलिन एक शूरवीर है  \n(3) शार्लट एक शूरवीर है  \n(4) एला एक शूरवीर है  \n(5) ऐडन एक धूर्त है  \n(6) आरिया एक धूर्त है  \n(7) जैक्सन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लोगन, ऐडन, डेविड, हार्पर, एवलिन, डैनियल, और विक्टोरिया। \"ऐडन एक शूरवीर है और डैनियल एक धूर्त है,\" लोगन ने दावा किया। ऐडन को यह कहते हुए सुना गया, \"डैनियल एक शूरवीर है यदि और केवल यदि डेविड एक शूरवीर है\"। \"विक्टोरिया एक शूरवीर है या ऐडन एक धूर्त है\" - डेविड। हार्पर के शब्दों में: \"एवलिन एक धूर्त है\"। एवलिन के अनुसार, \"यदि लोगन एक शूरवीर है तो ऐडन एक शूरवीर है\"। \"डेविड एक शूरवीर नहीं है,\" डैनियल ने घोषणा की। विक्टोरिया ने कहा कि एवलिन एक धूर्त नहीं है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक धूर्त है  \n(2) ऐडन एक धूर्त है  \n(3) डेविड एक शूरवीर है  \n(4) हार्पर एक धूर्त है  \n(5) एवलिन एक शूरवीर है  \n(6) डैनियल एक धूर्त है  \n(7) विक्टोरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: जैक, विलियम, हेनरी, मेसन, ओवेन, एलिज़ाबेथ, और बेंजामिन। \"एलिज़ाबेथ धूर्त नहीं है\" - जैक। विलियम ने कहा, \"अगर विलियम शूरवीर है तो एलिज़ाबेथ शूरवीर है\"। हेनरी ने कहा कि हेनरी शूरवीर है और जैक धूर्त है। \"जैक शूरवीर है,\" मेसन ने कहा। ओवेन ने कहा: \"ओवेन शूरवीर है और विलियम धूर्त है\"। एलिज़ाबेथ ने कहा: \"अगर जैक धूर्त है तो मेसन धूर्त है\"। बेंजामिन ने कहा, \"विलियम धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक एक शूरवीर है  \n(2) विलियम एक शूरवीर है  \n(3) हेनरी एक धूर्त है  \n(4) मेसन एक शूरवीर है  \n(5) ओवेन एक धूर्त है  \n(6) एलिज़ाबेथ एक शूरवीर है  \n(7) बेंजामिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: इसाबेला, हेनरी, मेसन, माइकल, ओलिविया, विक्टोरिया, और लियम। \"मेसन एक शूरवीर है और लियम एक धूर्त है,\" इसाबेला ने दावा किया। हेनरी ने कहा, \"अगर माइकल एक शूरवीर है तो विक्टोरिया एक शूरवीर है।\" मेसन के शब्दों में: \"माइकल एक शूरवीर है यदि और केवल यदि विक्टोरिया एक धूर्त है।\" \"विक्टोरिया एक शूरवीर है\" - माइकल। \"हेनरी एक धूर्त नहीं है,\" ओलिविया ने दावा किया। विक्टोरिया ने आपको बताया कि हेनरी एक धूर्त है और ओलिविया एक शूरवीर है। लियम ने नोट किया, \"माइकल एक शूरवीर है या ओलिविया एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक धूर्त है  \n(2) हेनरी एक शूरवीर है  \n(3) मेसन एक धूर्त है  \n(4) माइकल एक धूर्त है  \n(5) ओलिविया एक शूरवीर है  \n(6) विक्टोरिया एक धूर्त है  \n(7) लियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ओवेन, शार्लट, सेबेस्टियन, हार्पर, माइकल, विक्टोरिया, और मेसन। \"शार्लट शूरवीर नहीं है\" - ओवेन। शार्लट ने कहा कि मेसन शूरवीर है यदि और केवल यदि विक्टोरिया शूरवीर है। सेबेस्टियन ने टिप्पणी की, \"विक्टोरिया धूर्त है\"। \"ओवेन धूर्त है और शार्लट शूरवीर है,\" हार्पर ने घोषित किया। माइकल के अनुसार, \"विक्टोरिया शूरवीर है\"। जैसे विक्टोरिया ने कहा, \"माइकल धूर्त है और शार्लट शूरवीर है\"। मेसन ने remarked किया, \"माइकल धूर्त है या शार्लट धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओवेन एक शूरवीर है  \n(2) शार्लट एक धूर्त है  \n(3) सेबेस्टियन एक शूरवीर है  \n(4) हार्पर एक धूर्त है  \n(5) माइकल एक धूर्त है  \n(6) विक्टोरिया एक धूर्त है  \n(7) मेसन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एमिली, मिया, ओवेन, एवा, ओलिविया, डेविड, और ज़ोई। एमिली ने कहा: \"एमिली एक शूरवीर है और एवा एक धूर्त है\"। मिया ने आपको बताया कि ओवेन एक शूरवीर है यदि और केवल यदि एवा एक धूर्त है। ओवेन के अनुसार, \"मिया एक धूर्त है और डेविड एक शूरवीर है\"। जैसा कि एवा ने कहा, \"एवा एक शूरवीर है यदि और केवल यदि मिया एक शूरवीर है\"। ओलिविया ने कहा: \"ओवेन एक शूरवीर है\"। डेविड ने टिप्पणी की, \"डेविड एक शूरवीर है या ओवेन एक धूर्त है\"। ज़ोई ने टिप्पणी की, \"एमिली एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक धूर्त है  \n(2) मिया एक शूरवीर है  \n(3) ओवेन एक धूर्त है  \n(4) एवा एक शूरवीर है  \n(5) ओलिविया एक धूर्त है  \n(6) डेविड एक शूरवीर है  \n(7) ज़ोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: मेसन, अलेक्जेंडर, लिली, डेविड, एवलिन, यूसुफ, और पेनलोप। \"यूसुफ एक शूरवीर है या एवलिन एक धूर्त है,\" मेसन ने दावा किया। \"अलेक्जेंडर एक शूरवीर है यदि और केवल यदि यूसुफ एक धूर्त है,\" अलेक्जेंडर ने घोषित किया। लिली ने टिप्पणी की, \"पेनलोप एक धूर्त है और अलेक्जेंडर एक धूर्त है\"। \"यदि पेनलोप एक धूर्त है तो अलेक्जेंडर एक शूरवीर है,\" डेविड ने उल्लेख किया। एवलिन ने व्यक्त किया कि यदि लिली एक शूरवीर है तो डेविड एक धूर्त है। यूसुफ ने नोट किया, \"डेविड एक शूरवीर है यदि और केवल यदि पेनलोप एक धूर्त है\"। पेनलोप ने नोट किया, \"एवलिन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) अलेक्जेंडर एक धूर्त है  \n(3) लिली एक शूरवीर है  \n(4) डेविड एक धूर्त है  \n(5) एवलिन एक शूरवीर है  \n(6) यूसुफ एक धूर्त है  \n(7) पेनलोप एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: जैक्सन, जेम्स, लोगन, सोफिया, डेविड, यूसुफ, और ईथन। जैक्सन ने कहा, \"डेविड एक धूर्त है या डेविड एक शूरवीर है\"। जेम्स ने कहा, \"जेम्स एक शूरवीर है या सोफिया एक धूर्त है\"। लोगन ने टिप्पणी की, \"डेविड एक धूर्त है और सोफिया एक शूरवीर है\"। \"लोगन एक धूर्त है और ईथन एक धूर्त है\" - सोफिया। डेविड ने कहा कि यूसुफ एक धूर्त है। यूसुफ ने आपको बताया कि जेम्स एक धूर्त है या सोफिया एक धूर्त है। ईथन ने कहा, \"लोगन एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक शूरवीर है  \n(2) जेम्स एक शूरवीर है  \n(3) लोगन एक धूर्त है  \n(4) सोफिया एक शूरवीर है  \n(5) डेविड एक शूरवीर है  \n(6) यूसुफ एक धूर्त है  \n(7) ईथन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: विलियम, एला, आरिया, माइकल, ग्रेस, एवा, और जेम्स। विलियम ने कहा: \"एवा एक शूरवीर है\"। एला ने कहा, \"जेम्स एक धूर्त नहीं है\"। \"जेम्स एक धूर्त है यदि और केवल यदि ग्रेस एक धूर्त है,\" आरिया ने घोषणा की। माइकल ने कहा, \"यदि विलियम एक शूरवीर है तो एवा एक धूर्त है\"। ग्रेस ने कहा, \"माइकल एक धूर्त है या एवा एक धूर्त है\"। एवा ने कहा, \"आरिया एक शूरवीर है और माइकल एक शूरवीर है\"। जेम्स को यह कहते हुए सुना गया, \"विलियम एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) विलियम एक धूर्त है  \n(2) एला एक धूर्त है  \n(3) आरिया एक धूर्त है  \n(4) माइकल एक शूरवीर है  \n(5) ग्रेस एक शूरवीर है  \n(6) एवा एक धूर्त है  \n(7) जेम्स एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एलिज़ाबेथ, ग्रेस, डैनियल, सोफिया, लोगन, एला, और अलेक्जेंडर। जैसे कि एलिज़ाबेथ ने कहा, \"डैनियल एक शूरवीर है और डैनियल एक धूर्त है\"। ग्रेस के एक बयान में: \"सोफिया एक धूर्त है\"। डैनियल ने आपको बताया कि अलेक्जेंडर एक शूरवीर है। सोफिया के शब्दों में: \"एलिज़ाबेथ एक शूरवीर नहीं है\"। लोगन ने कहा, \"सोफिया एक शूरवीर है\"। एला ने कहा कि ग्रेस एक धूर्त है यदि और केवल यदि एलिज़ाबेथ एक शूरवीर है। अलेक्जेंडर ने कहा, \"एला एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक धूर्त है  \n(2) ग्रेस एक धूर्त है  \n(3) डैनियल एक धूर्त है  \n(4) सोफिया एक शूरवीर है  \n(5) लोगन एक शूरवीर है  \n(6) एला एक धूर्त है  \n(7) अलेक्जेंडर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: यूसुफ, लोगन, लिली, सोफिया, जेम्स, लुकास, और ओवेन। \"सोफिया एक धूर्त है,\" यूसुफ ने कहा। लोगन ने टिप्पणी की, \"लोगन एक शूरवीर है या सोफिया एक शूरवीर है\"। लिली ने कहा: \"यूसुफ एक शूरवीर है यदि और केवल यदि जेम्स एक शूरवीर है\"। सोफिया ने कहा, \"यदि ओवेन एक धूर्त है तो यूसुफ एक शूरवीर है\"। \"लुकास एक शूरवीर है यदि और केवल यदि लोगन एक धूर्त है,\" जेम्स ने कहा। लुकास के एक बयान में: \"सोफिया एक धूर्त है और यूसुफ एक धूर्त है\"। ओवेन ने कहा कि लुकास एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) यूसुफ एक धूर्त है  \n(2) लोगन एक शूरवीर है  \n(3) लिली एक धूर्त है  \n(4) सोफिया एक शूरवीर है  \n(5) जेम्स एक शूरवीर है  \n(6) लुकास एक धूर्त है  \n(7) ओवेन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: पेनलोप, नूह, लुकास, बेंजामिन, जैक्सन, लिली, और शार्लट। पेनलोप को यह कहते हुए सुना गया, \"लिली एक शूरवीर है या पेनलोप एक शूरवीर है\"। नूह के अनुसार, \"शार्लट एक धूर्त है और जैक्सन एक धूर्त है\"। लुकास ने कहा कि पेनलोप एक शूरवीर है। बेंजामिन के एक बयान में: \"अगर शार्लट एक धूर्त है तो पेनलोप एक शूरवीर है\"। जैक्सन के एक बयान में: \"पेनलोप एक शूरवीर है या लुकास एक धूर्त है\"। जैसा कि लिली ने कहा, \"जैक्सन एक धूर्त है यदि और केवल यदि बेंजामिन एक धूर्त है\"। शार्लट ने कहा कि जैक्सन एक शूरवीर है या लुकास एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) पेनलोप एक शूरवीर है  \n(2) नूह एक धूर्त है  \n(3) लुकास एक शूरवीर है  \n(4) बेंजामिन एक शूरवीर है  \n(5) जैक्सन एक शूरवीर है  \n(6) लिली एक शूरवीर है  \n(7) शार्लट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: नूह, विक्टोरिया, लोगन, सोफिया, जैक, एवलिन, और ग्रेस। नूह ने कहा, \"लोगन एक शूरवीर है।\" विक्टोरिया ने कहा, \"नूह एक धूर्त है और ग्रेस एक शूरवीर है।\" लोगन के एक बयान में: \"विक्टोरिया एक शूरवीर है या विक्टोरिया एक धूर्त है।\" सोफिया ने व्यक्त किया कि नूह एक धूर्त है यदि और केवल यदि ग्रेस एक धूर्त है। \"विक्टोरिया एक शूरवीर है और नूह एक धूर्त है,\" जैक ने घोषित किया। एवलिन ने कहा, \"जैक एक धूर्त है या लोगन एक शूरवीर है।\" \"नूह एक शूरवीर है या लोगन एक शूरवीर है\" - ग्रेस। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) नूह एक शूरवीर है  \n(2) विक्टोरिया एक धूर्त है  \n(3) लोगन एक शूरवीर है  \n(4) सोफिया एक शूरवीर है  \n(5) जैक एक धूर्त है  \n(6) एवलिन एक शूरवीर है  \n(7) ग्रेस एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ओलिविया, लुकास, इसाबेला, एम्मा, डैनियल, औरोरा, और एला। ओलिविया ने कहा, \"डैनियल एक शूरवीर है।\" लुकास ने कहा, \"इसाबेला एक धूर्त नहीं है।\" इसाबेला ने कहा, \"एला एक धूर्त है।\" एम्मा ने टिप्पणी की, \"ओलिविया एक शूरवीर है या लुकास एक धूर्त है।\" डैनियल ने कहा, \"औरोरा एक शूरवीर है और डैनियल एक शूरवीर है।\" औरोरा ने नोट किया, \"औरोरा एक शूरवीर है और लुकास एक शूरवीर है।\" एला के अनुसार, \"औरोरा एक शूरवीर है या ओलिविया एक शूरवीर है।\" तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ओलिविया एक धूर्त है  \n(2) लुकास एक शूरवीर है  \n(3) इसाबेला एक शूरवीर है  \n(4) एम्मा एक धूर्त है  \n(5) डैनियल एक धूर्त है  \n(6) औरोरा एक धूर्त है  \n(7) एला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लोगन, सेबेस्टियन, बेंजामिन, ग्रेस, एवा, माइकल, और इसाबेला। लोगन ने कहा: \"एवा एक धूर्त नहीं है\"। सेबेस्टियन ने कहा, \"ग्रेस एक शूरवीर है या बेंजामिन एक शूरवीर है\"। बेंजामिन ने कहा, \"लोगन एक धूर्त है या माइकल एक शूरवीर है।\" ग्रेस ने कहा कि इसाबेला एक धूर्त है। एवा ने कहा, \"अगर एवा एक शूरवीर है तो माइकल एक शूरवीर है।\" माइकल ने कहा कि बेंजामिन एक धूर्त नहीं है। इसाबेला ने कहा, \"अगर इसाबेला एक शूरवीर है तो ग्रेस एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक शूरवीर है  \n(2) सेबेस्टियन एक शूरवीर है  \n(3) बेंजामिन एक शूरवीर है  \n(4) ग्रेस एक धूर्त है  \n(5) एवा एक शूरवीर है  \n(6) माइकल एक शूरवीर है  \n(7) इसाबेला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लिली, जैक्सन, विक्टोरिया, ज़ोई, ऐडन, डैनियल, और हेनरी। लिली ने कहा कि ऐडन एक धूर्त है या डैनियल एक शूरवीर है। \"विक्टोरिया एक शूरवीर है यदि और केवल यदि डैनियल एक शूरवीर है,\" जैक्सन ने घोषणा की। \"ज़ोई एक शूरवीर है या हेनरी एक शूरवीर है,\" विक्टोरिया ने उल्लेख किया। ज़ोई को यह कहते हुए सुना गया, \"ज़ोई एक शूरवीर है और हेनरी एक शूरवीर है\"। ऐडन को यह कहते हुए सुना गया, \"लिली एक धूर्त नहीं है\"। डैनियल के शब्दों में: \"लिली एक शूरवीर है यदि और केवल यदि डैनियल एक शूरवीर है\"। हेनरी ने कहा, \"लिली एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लिली एक शूरवीर है  \n(2) जैक्सन एक धूर्त है  \n(3) विक्टोरिया एक धूर्त है  \n(4) ज़ोई एक धूर्त है  \n(5) ऐडन एक शूरवीर है  \n(6) डैनियल एक शूरवीर है  \n(7) हेनरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एवा, सोफिया, एलिज़ाबेथ, एवरी, इसाबेला, क्लोई, और यूसुफ। \"एवरी एक शूरवीर है यदि और केवल यदि यूसुफ एक धूर्त है,\" एवा ने दावा किया। सोफिया ने कहा, \"एलिज़ाबेथ एक धूर्त नहीं है\"। एलिज़ाबेथ के अनुसार, \"एवरी एक धूर्त नहीं है\"। एवरी के शब्दों में: \"यदि यूसुफ एक शूरवीर है तो सोफिया एक शूरवीर है\"। \"क्लोई एक धूर्त है या एवा एक शूरवीर है,\" इसाबेला ने घोषणा की। क्लोई को यह कहते हुए सुना गया, \"यदि सोफिया एक शूरवीर है तो एवरी एक धूर्त है\"। यूसुफ ने नोट किया, \"क्लोई एक धूर्त है यदि और केवल यदि एलिज़ाबेथ एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक शूरवीर है  \n(2) सोफिया एक शूरवीर है  \n(3) एलिज़ाबेथ एक शूरवीर है  \n(4) एवरी एक शूरवीर है  \n(5) इसाबेला एक शूरवीर है  \n(6) क्लोई एक धूर्त है  \n(7) यूसुफ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एवरी, आरिया, बेंजामिन, यूसुफ, विक्टोरिया, अलेक्जेंडर, और एमिली। एवरी ने आपको बताया कि यूसुफ एक धूर्त है। आरिया के एक बयान में: \"अगर एमिली एक धूर्त है तो विक्टोरिया एक शूरवीर है\"। बेंजामिन के शब्दों में: \"आरिया एक शूरवीर नहीं है\"। यूसुफ ने कहा, \"एमिली एक धूर्त है या एवरी एक शूरवीर है\"। \"अगर अलेक्जेंडर एक शूरवीर है तो एवरी एक शूरवीर है,\" विक्टोरिया ने घोषणा की। अलेक्जेंडर ने कहा, \"विक्टोरिया एक शूरवीर है यदि और केवल यदि एवरी एक शूरवीर है।\" एमिली ने कहा, \"बेंजामिन एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक धूर्त है  \n(2) आरिया एक धूर्त है  \n(3) बेंजामिन एक शूरवीर है  \n(4) यूसुफ एक शूरवीर है  \n(5) विक्टोरिया एक धूर्त है  \n(6) अलेक्जेंडर एक शूरवीर है  \n(7) एमिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: सोफिया, जैक्सन, पेनलोप, इसाबेला, एवरी, लिली, और हार्पर। सोफिया ने टिप्पणी की, \"इसाबेला एक शूरवीर है यदि और केवल यदि लिली एक शूरवीर है\"। जैक्सन ने asserted किया: \"सोफिया एक धूर्त है या हार्पर एक धूर्त है\"। पेनलोप ने asserted किया: \"जैक्सन एक धूर्त है और हार्पर एक धूर्त है\"। जैसे इसाबेला ने कहा, \"सोफिया एक धूर्त है यदि और केवल यदि जैक्सन एक धूर्त है\"। एवरी ने व्यक्त किया कि सोफिया एक शूरवीर है। लिली ने asserted किया: \"यदि इसाबेला एक धूर्त है तो इसाबेला एक शूरवीर है\"। हार्पर ने कहा, \"यदि जैक्सन एक शूरवीर है तो लिली एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) जैक्सन एक धूर्त है  \n(3) पेनलोप एक धूर्त है  \n(4) इसाबेला एक धूर्त है  \n(5) एवरी एक शूरवीर है  \n(6) लिली एक धूर्त है  \n(7) हार्पर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एवरी, ल्यूक, हार्पर, एलिज़ाबेथ, शार्लट, आरिया, और लोगन। एवरी ने आपको बताया कि अगर आरिया एक धूर्त है तो एलिज़ाबेथ एक धूर्त है। \"हार्पर एक धूर्त है और आरिया एक धूर्त है,\" ल्यूक ने दावा किया। \"अगर ल्यूक एक शूरवीर है तो एलिज़ाबेथ एक धूर्त है,\" हार्पर ने घोषणा की। एलिज़ाबेथ ने आपको बताया कि लोगन एक धूर्त नहीं है। शार्लट ने कहा, \"अगर ल्यूक एक धूर्त है तो एवरी एक शूरवीर है।\" आरिया ने आपको बताया कि एलिज़ाबेथ एक शूरवीर है। \"शार्लट एक धूर्त नहीं है,\" लोगन ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक शूरवीर है  \n(2) ल्यूक एक धूर्त है  \n(3) हार्पर एक शूरवीर है  \n(4) एलिज़ाबेथ एक शूरवीर है  \n(5) शार्लट एक शूरवीर है  \n(6) आरिया एक शूरवीर है  \n(7) लोगन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एमिली, एम्मा, सोफिया, हार्पर, लिली, आरिया, और जैक्सन। एमिली के अनुसार, \"लिली एक धूर्त है या एमिली एक शूरवीर है\"। एम्मा के एक बयान में: \"एमिली एक शूरवीर नहीं है\"। सोफिया ने कहा, \"एमिली एक धूर्त है और एम्मा एक शूरवीर है\"। हार्पर ने टिप्पणी की, \"जैक्सन एक शूरवीर है या आरिया एक शूरवीर है\"। लिली ने asserted किया: \"एम्मा एक धूर्त नहीं है\"। जैसा कि आरिया ने कहा, \"हार्पर एक धूर्त है यदि और केवल यदि हार्पर एक शूरवीर है\"। जैक्सन के शब्दों में: \"यदि एमिली एक धूर्त है तो हार्पर एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक शूरवीर है  \n(2) एम्मा एक धूर्त है  \n(3) सोफिया एक धूर्त है  \n(4) हार्पर एक शूरवीर है  \n(5) लिली एक धूर्त है  \n(6) आरिया एक धूर्त है  \n(7) जैक्सन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एलिज़ाबेथ, लिली, सोफिया, ओवेन, जैक, अलेक्जेंडर, और औरोरा। जैसे कि एलिज़ाबेथ ने कहा, \"लिली धूर्त नहीं है\"। लिली ने कहा, \"औरोरा एक शूरवीर है।\" सोफिया ने कहा, \"जैक एक शूरवीर है और औरोरा एक शूरवीर है।\" ओवेन ने आपको बताया कि औरोरा एक शूरवीर है यदि और केवल यदि अलेक्जेंडर एक शूरवीर है। जैक के शब्दों में: \"सोफिया एक शूरवीर है और अलेक्जेंडर एक शूरवीर है\"। अलेक्जेंडर ने आपको बताया कि यदि ओवेन एक शूरवीर है तो एलिज़ाबेथ एक धूर्त है। जैसे कि औरोरा ने कहा, \"यदि जैक एक धूर्त है तो ओवेन एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक धूर्त है  \n(2) लिली एक धूर्त है  \n(3) सोफिया एक धूर्त है  \n(4) ओवेन एक धूर्त है  \n(5) जैक एक धूर्त है  \n(6) अलेक्जेंडर एक शूरवीर है  \n(7) औरोरा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लिली, जेम्स, पेनलोप, इसाबेला, सेबेस्टियन, जैक्सन, और एलिज़ाबेथ। लिली ने कहा, \"अगर जेम्स एक धूर्त है तो इसाबेला एक शूरवीर है\"। जेम्स ने कहा: \"इसाबेला एक धूर्त है यदि और केवल यदि जैक्सन एक शूरवीर है\"। पेनलोप के अनुसार, \"इसाबेला एक शूरवीर है यदि और केवल यदि जेम्स एक धूर्त है\"। इसाबेला के शब्दों में: \"जैक्सन एक शूरवीर नहीं है\"। सेबेस्टियन ने कहा, \"एलिज़ाबेथ एक धूर्त नहीं है\"। जैक्सन के शब्दों में: \"अगर पेनलोप एक शूरवीर है तो सेबेस्टियन एक धूर्त है\"। एलिज़ाबेथ ने कहा कि इसाबेला एक धूर्त है यदि और केवल यदि एलिज़ाबेथ एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लिली एक शूरवीर है  \n(2) जेम्स एक शूरवीर है  \n(3) पेनलोप एक शूरवीर है  \n(4) इसाबेला एक धूर्त है  \n(5) सेबेस्टियन एक धूर्त है  \n(6) जैक्सन एक शूरवीर है  \n(7) एलिज़ाबेथ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लोगन, लुकास, विलियम, अबिगेल, लियम, ईथन, और अमेलिया। लोगन के एक बयान में: \"लियम धूर्त नहीं है\"। लुकास के शब्दों में: \"लियम शूरवीर है यदि और केवल यदि लोगन शूरवीर है\"। विलियम ने कहा कि विलियम शूरवीर है या लुकास शूरवीर है। अबिगेल ने आपको बताया कि अमेलिया शूरवीर है और ईथन शूरवीर है। लियम ने नोट किया, \"ईथन शूरवीर नहीं है\"। ईथन ने नोट किया, \"लोगन शूरवीर है यदि और केवल यदि ईथन शूरवीर है\"। \"लियम धूर्त है या लोगन शूरवीर है,\" अमेलिया ने घोषणा की। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) लोगन एक शूरवीर है  \n(2) लुकास एक शूरवीर है  \n(3) विलियम एक शूरवीर है  \n(4) अबिगेल एक धूर्त है  \n(5) लियम एक शूरवीर है  \n(6) ईथन एक धूर्त है  \n(7) अमेलिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एवरी, एम्मा, ईथन, सैमुएल, हार्पर, इसाबेला, और अलेक्जेंडर। एवरी के अनुसार, \"अलेक्जेंडर एक धूर्त है यदि और केवल यदि इसाबेला एक धूर्त है\"। एम्मा ने टिप्पणी की, \"एवरी एक शूरवीर नहीं है\"। ईथन के शब्दों में: \"हार्पर एक धूर्त है या एम्मा एक शूरवीर है\"। सैमुएल ने टिप्पणी की, \"अलेक्जेंडर एक धूर्त है या एवरी एक शूरवीर है\"। हार्पर ने कहा: \"अलेक्जेंडर एक शूरवीर है या एम्मा एक धूर्त है\"। इसाबेला को यह कहते हुए सुना गया, \"ईथन एक धूर्त नहीं है\"। अलेक्जेंडर ने नोट किया, \"इसाबेला एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक शूरवीर है  \n(2) एम्मा एक धूर्त है  \n(3) ईथन एक धूर्त है  \n(4) सैमुएल एक शूरवीर है  \n(5) हार्पर एक शूरवीर है  \n(6) इसाबेला एक धूर्त है  \n(7) अलेक्जेंडर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एवरी, ओलिविया, अमेलिया, एवा, आरिया, स्कारलेट, और बेंजामिन। एवरी ने कहा, \"अगर एवा एक धूर्त है तो एवरी एक शूरवीर है।\" ओलिविया ने कहा, \"अमेलिया एक शूरवीर नहीं है।\" अमेलिया ने आपको बताया कि अगर आरिया एक शूरवीर है तो बेंजामिन एक धूर्त है। एवा ने आपको बताया कि आरिया एक शूरवीर नहीं है। आरिया के अनुसार, \"ओलिविया एक शूरवीर है या अमेलिया एक धूर्त है।\" स्कारलेट ने कहा कि बेंजामिन एक धूर्त है यदि और केवल यदि आरिया एक शूरवीर है। बेंजामिन को यह कहते हुए सुना गया, \"ओलिविया एक धूर्त है और एवरी एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक शूरवीर है  \n(2) ओलिविया एक धूर्त है  \n(3) अमेलिया एक शूरवीर है  \n(4) एवा एक शूरवीर है  \n(5) आरिया एक धूर्त है  \n(6) स्कारलेट एक शूरवीर है  \n(7) बेंजामिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: माइकल, अलेक्जेंडर, एवा, ल्यूक, लुकास, जेम्स, और एला। माइकल ने कहा कि लुकास एक धूर्त है और लुकास एक शूरवीर है। \"एवा एक शूरवीर है और जेम्स एक धूर्त है\" - अलेक्जेंडर। \"ल्यूक एक शूरवीर है यदि और केवल यदि एला एक धूर्त है,\" एवा ने दावा किया। \"लुकास एक धूर्त है और माइकल एक शूरवीर है,\" ल्यूक ने उल्लेख किया। \"माइकल एक शूरवीर है,\" लुकास ने उल्लेख किया। जेम्स ने नोट किया, \"यदि एला एक शूरवीर है तो जेम्स एक शूरवीर है\"। एला के अनुसार, \"जेम्स एक शूरवीर है या एवा एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक धूर्त है  \n(2) अलेक्जेंडर एक धूर्त है  \n(3) एवा एक शूरवीर है  \n(4) ल्यूक एक धूर्त है  \n(5) लुकास एक धूर्त है  \n(6) जेम्स एक शूरवीर है  \n(7) एला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: डैनियल, जैक्सन, ऐडन, अबिगेल, स्कारलेट, लोगन, और एला। डैनियल को यह कहते हुए सुना गया, \"एला एक धूर्त है और लोगन एक धूर्त है\"। जैक्सन के शब्दों में: \"अगर ऐडन एक धूर्त है तो एला एक धूर्त है\"। ऐडन को यह कहते हुए सुना गया, \"ऐडन एक शूरवीर है यदि और केवल यदि लोगन एक धूर्त है\"। अबिगेल ने कहा, \"लोगन एक धूर्त नहीं है\"। स्कारलेट ने कहा कि एला एक धूर्त है। \"जैक्सन एक शूरवीर है या डैनियल एक शूरवीर है,\" लोगन ने दावा किया। \"अगर डैनियल एक शूरवीर है तो जैक्सन एक शूरवीर है,\" एला ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक धूर्त है  \n(2) जैक्सन एक धूर्त है  \n(3) ऐडन एक धूर्त है  \n(4) अबिगेल एक धूर्त है  \n(5) स्कारलेट एक धूर्त है  \n(6) लोगन एक धूर्त है  \n(7) एला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एवलिन, अलेक्जेंडर, सोफिया, हेनरी, याकूब, ईथन, और आरिया। एवलिन ने आपको बताया कि आरिया एक धूर्त है यदि और केवल यदि अलेक्जेंडर एक धूर्त है। जैसा कि अलेक्जेंडर ने कहा, \"ईथन एक धूर्त नहीं है\"। सोफिया ने कहा कि आरिया एक धूर्त है या हेनरी एक शूरवीर है। हेनरी के एक बयान में: \"सोफिया एक शूरवीर नहीं है\"। याकूब के एक बयान में: \"आरिया एक शूरवीर है और सोफिया एक शूरवीर है\"। ईथन ने कहा कि हेनरी एक शूरवीर है और याकूब एक शूरवीर है। आरिया के शब्दों में: \"याकूब एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक शूरवीर है  \n(2) अलेक्जेंडर एक धूर्त है  \n(3) सोफिया एक शूरवीर है  \n(4) हेनरी एक धूर्त है  \n(5) याकूब एक धूर्त है  \n(6) ईथन एक धूर्त है  \n(7) आरिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: एलिज़ाबेथ, स्कारलेट, अमेलिया, आरिया, याकूब, लोगन, और नूह। एलिज़ाबेथ ने कहा कि स्कारलेट एक धूर्त है। \"अगर नूह एक धूर्त है तो अमेलिया एक शूरवीर है\" - स्कारलेट। अमेलिया ने कहा कि आरिया एक धूर्त नहीं है। आरिया ने कहा, \"एलिज़ाबेथ एक शूरवीर है और आरिया एक शूरवीर है।\" याकूब ने कहा, \"एलिज़ाबेथ एक धूर्त है यदि और केवल यदि एलिज़ाबेथ एक शूरवीर है।\" लोगन के एक बयान में: \"याकूब एक शूरवीर नहीं है\"। नूह ने कहा, \"लोगन एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक शूरवीर है  \n(2) स्कारलेट एक धूर्त है  \n(3) अमेलिया एक धूर्त है  \n(4) आरिया एक धूर्त है  \n(5) याकूब एक धूर्त है  \n(6) लोगन एक शूरवीर है  \n(7) नूह एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लिली, डेविड, लोगन, नूह, पेनलोप, बेंजामिन, और सोफिया। लिली के एक बयान में: \"डेविड एक शूरवीर है\"। डेविड ने टिप्पणी की, \"लोगन एक शूरवीर है या सोफिया एक धूर्त है\"। लोगन के शब्दों में: \"सोफिया एक शूरवीर है और लिली एक धूर्त है\"। नूह ने कहा, \"लिली एक शूरवीर है और बेंजामिन एक शूरवीर है\"। पेनलोप के अनुसार, \"अगर नूह एक शूरवीर है तो सोफिया एक धूर्त है\"। \"नूह एक धूर्त नहीं है\" - बेंजामिन। सोफिया ने टिप्पणी की, \"अगर पेनलोप एक शूरवीर है तो बेंजामिन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लिली एक शूरवीर है  \n(2) डेविड एक शूरवीर है  \n(3) लोगन एक धूर्त है  \n(4) नूह एक धूर्त है  \n(5) पेनलोप एक शूरवीर है  \n(6) बेंजामिन एक धूर्त है  \n(7) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: नूह, सैमुएल, एवलिन, ल्यूक, लुकास, जैक्सन, और मेसन। नूह ने कहा: \"एवलिन एक शूरवीर है\"। सैमुएल के शब्दों में: \"लुकास एक शूरवीर नहीं है\"। एवलिन ने कहा, \"जैक्सन एक शूरवीर है या मेसन एक शूरवीर है\"। \"अगर जैक्सन एक धूर्त है तो सैमुएल एक शूरवीर है,\" ल्यूक ने दावा किया। लुकास ने नोट किया, \"नूह एक धूर्त नहीं है\"। जैक्सन को यह कहते हुए सुना गया, \"एवलिन एक शूरवीर है या एवलिन एक धूर्त है\"। \"सैमुएल एक शूरवीर है,\" मेसन ने घोषित किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक शूरवीर है  \n(2) सैमुएल एक धूर्त है  \n(3) एवलिन एक शूरवीर है  \n(4) ल्यूक एक शूरवीर है  \n(5) लुकास एक शूरवीर है  \n(6) जैक्सन एक शूरवीर है  \n(7) मेसन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: इसाबेला, डैनियल, सोफिया, स्कारलेट, यूसुफ, एम्मा, और विक्टोरिया। इसाबेला ने टिप्पणी की, \"डैनियल शूरवीर नहीं है\"। डैनियल ने कहा, \"इसाबेला धूर्त है और विक्टोरिया शूरवीर है\"। सोफिया ने टिप्पणी की, \"इसाबेला धूर्त है या एम्मा शूरवीर है\"। स्कारलेट ने कहा कि एम्मा शूरवीर है या सोफिया शूरवीर है। यूसुफ ने कहा कि अगर विक्टोरिया धूर्त है तो सोफिया शूरवीर है। एम्मा ने कहा: \"विक्टोरिया धूर्त है या स्कारलेट धूर्त है\"। विक्टोरिया ने टिप्पणी की, \"यूसुफ धूर्त है यदि और केवल यदि सोफिया शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक शूरवीर है  \n(2) डैनियल एक धूर्त है  \n(3) सोफिया एक शूरवीर है  \n(4) स्कारलेट एक शूरवीर है  \n(5) यूसुफ एक शूरवीर है  \n(6) एम्मा एक शूरवीर है  \n(7) विक्टोरिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ज़ोई, याकूब, एला, क्लोई, ईथन, ल्यूक, और लिली। \"क्लोई एक शूरवीर है या क्लोई एक धूर्त है,\" ज़ोई ने दावा किया। याकूब ने कहा, \"ईथन एक धूर्त है\"। एला ने कहा कि याकूब एक शूरवीर है और लिली एक शूरवीर है। \"लिली एक शूरवीर नहीं है,\" क्लोई ने दावा किया। ईथन ने टिप्पणी की, \"क्लोई एक शूरवीर नहीं है\"। \"एला एक शूरवीर नहीं है,\" ल्यूक ने दावा किया। लिली ने नोट किया, \"ल्यूक एक शूरवीर है और ज़ोई एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ज़ोई एक शूरवीर है  \n(2) याकूब एक शूरवीर है  \n(3) एला एक धूर्त है  \n(4) क्लोई एक शूरवीर है  \n(5) ईथन एक धूर्त है  \n(6) ल्यूक एक शूरवीर है  \n(7) लिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: जैक्सन, मिया, अबिगेल, बेंजामिन, हार्पर, ओलिवर, और एमिली। जैक्सन ने कहा, \"हार्पर एक शूरवीर है यदि और केवल यदि जैक्सन एक शूरवीर है।\" मिया के अनुसार, \"हार्पर एक धूर्त है या एमिली एक शूरवीर है।\" \"जैक्सन एक धूर्त है,\" अबिगेल ने दावा किया। बेंजामिन ने कहा कि जैक्सन एक शूरवीर है और जैक्सन एक धूर्त है। हार्पर के शब्दों में: \"जैक्सन एक धूर्त नहीं है।\" \"यदि अबिगेल एक धूर्त है तो मिया एक धूर्त है,\" ओलिवर ने उल्लेख किया। एमिली ने व्यक्त किया कि बेंजामिन एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक शूरवीर है  \n(2) मिया एक धूर्त है  \n(3) अबिगेल एक धूर्त है  \n(4) बेंजामिन एक धूर्त है  \n(5) हार्पर एक शूरवीर है  \n(6) ओलिवर एक शूरवीर है  \n(7) एमिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: लुकास, सेबेस्टियन, बेंजामिन, याकूब, एम्मा, लिली, और माइकल। लुकास के एक बयान में: \"लिली एक धूर्त है या माइकल एक धूर्त है\"। सेबेस्टियन को यह कहते हुए सुना गया, \"अगर लुकास एक शूरवीर है तो लिली एक धूर्त है\"। बेंजामिन ने आपको बताया कि लुकास एक शूरवीर है या बेंजामिन एक शूरवीर है। याकूब ने कहा, \"माइकल एक धूर्त नहीं है\"। एम्मा को यह कहते हुए सुना गया, \"याकूब एक शूरवीर है यदि और केवल यदि लिली एक शूरवीर है\"। \"एम्मा एक शूरवीर नहीं है,\" लिली ने घोषणा की। माइकल ने कहा कि एम्मा एक धूर्त नहीं है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक शूरवीर है  \n(2) सेबेस्टियन एक धूर्त है  \n(3) बेंजामिन एक शूरवीर है  \n(4) याकूब एक धूर्त है  \n(5) एम्मा एक धूर्त है  \n(6) लिली एक शूरवीर है  \n(7) माइकल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: यूसुफ, लिली, एम्मा, हार्पर, क्लोई, ईथन, और लोगन। यूसुफ ने कहा: \"हार्पर एक शूरवीर है और हार्पर एक धूर्त है\"। लिली के एक बयान में: \"हार्पर एक शूरवीर है\"। \"यूसुफ एक धूर्त नहीं है,\" एम्मा ने घोषणा की। हार्पर के शब्दों में: \"क्लोई एक शूरवीर है\"। क्लोई ने नोट किया, \"अगर लिली एक धूर्त है तो एम्मा एक धूर्त है\"। ईथन के एक बयान में: \"यूसुफ एक शूरवीर है और लोगन एक धूर्त है\"। लोगन ने कहा कि ईथन एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) यूसुफ एक धूर्त है  \n(2) लिली एक शूरवीर है  \n(3) एम्मा एक धूर्त है  \n(4) हार्पर एक शूरवीर है  \n(5) क्लोई एक शूरवीर है  \n(6) ईथन एक धूर्त है  \n(7) लोगन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: ऐडन, यूसुफ, ग्रेस, औरोरा, सोफिया, क्लोई, और लियम। ऐडन ने कहा कि लियम एक धूर्त है यदि और केवल यदि यूसुफ एक धूर्त है। \"यदि ग्रेस एक धूर्त है तो लियम एक धूर्त है,\" यूसुफ ने कहा। ग्रेस के अनुसार, \"सोफिया एक धूर्त है\"। औरोरा ने कहा कि यदि ऐडन एक धूर्त है तो ग्रेस एक शूरवीर है। सोफिया ने कहा: \"क्लोई एक धूर्त है यदि और केवल यदि ऐडन एक शूरवीर है\"। \"ग्रेस एक शूरवीर नहीं है,\" क्लोई ने कहा। लियम के अनुसार, \"औरोरा एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक धूर्त है  \n(2) यूसुफ एक शूरवीर है  \n(3) ग्रेस एक धूर्त है  \n(4) औरोरा एक धूर्त है  \n(5) सोफिया एक शूरवीर है  \n(6) क्लोई एक शूरवीर है  \n(7) लियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 7 निवासियों से मिलते हैं: जेम्स, यूसुफ, एला, मेसन, डैनियल, ओलिविया, और सोफिया। जेम्स ने कहा, \"सोफिया एक शूरवीर नहीं है।\" यूसुफ ने कहा कि मेसन एक धूर्त नहीं है। एला के एक बयान में: \"सोफिया एक धूर्त है यदि और केवल यदि जेम्स एक शूरवीर है।\" मेसन ने asserted किया: \"ओलिविया एक शूरवीर है।\" डैनियल ने व्यक्त किया कि मेसन एक धूर्त है यदि और केवल यदि एला एक धूर्त है। ओलिविया को यह कहते हुए सुना गया, \"यूसुफ एक शूरवीर है या एला एक शूरवीर है।\" सोफिया को यह कहते हुए सुना गया, \"मेसन एक शूरवीर है यदि और केवल यदि मेसन एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) यूसुफ एक शूरवीर है  \n(3) एला एक शूरवीर है  \n(4) मेसन एक शूरवीर है  \n(5) डैनियल एक शूरवीर है  \n(6) ओलिविया एक शूरवीर है  \n(7) सोफिया एक धूर्त है"
    }
]