[
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: औरोरा, ईथन, नूह, आरिया, और अबिगेल। \"अबिगेल धूर्त नहीं है\" - औरोरा। ईथन ने कहा, \"अबिगेल एक धूर्त है या आरिया एक धूर्त है\"। नूह के अनुसार, \"आरिया एक धूर्त है\"। आरिया ने आपको बताया कि औरोरा एक धूर्त है यदि और केवल यदि नूह एक शूरवीर है। अबिगेल ने कहा कि नूह एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) औरोरा एक शूरवीर है  \n(2) ईथन एक शूरवीर है  \n(3) नूह एक शूरवीर है  \n(4) आरिया एक धूर्त है  \n(5) अबिगेल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: अबिगेल, मेसन, एलिज़ाबेथ, एमिली, और सोफिया। \"सोफिया एक धूर्त है या एलिज़ाबेथ एक शूरवीर है,\" अबिगेल ने घोषणा की। \"सोफिया एक शूरवीर है,\" मेसन ने कहा। \"अबिगेल एक शूरवीर नहीं है,\" एलिज़ाबेथ ने दावा किया। एमिली के एक बयान में: \"अबिगेल एक शूरवीर है या एलिज़ाबेथ एक शूरवीर है\"। जैसे सोफिया ने कहा, \"अगर एमिली एक शूरवीर है तो एमिली एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अबिगेल एक शूरवीर है  \n(2) मेसन एक धूर्त है  \n(3) एलिज़ाबेथ एक धूर्त है  \n(4) एमिली एक शूरवीर है  \n(5) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: पेनलोप, लुकास, अमेलिया, एमिली, और ज़ोई। पेनलोप ने कहा: \"लुकास एक शूरवीर है या अमेलिया एक शूरवीर है\"। लुकास के एक बयान में: \"अगर लुकास एक शूरवीर है तो ज़ोई एक धूर्त है\"। अमेलिया ने कहा, \"एमिली एक धूर्त है\"। एमिली ने नोट किया, \"पेनलोप एक धूर्त है और ज़ोई एक धूर्त है\"। ज़ोई ने आपको बताया कि एमिली एक शूरवीर है और एमिली एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक शूरवीर है  \n(2) लुकास एक शूरवीर है  \n(3) अमेलिया एक शूरवीर है  \n(4) एमिली एक धूर्त है  \n(5) ज़ोई एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: विलियम, याकूब, ऐडन, आरिया, और लोगन। विलियम के एक बयान में: \"अगर ऐडन एक शूरवीर है तो आरिया एक धूर्त है\"। याकूब को यह कहते हुए सुना गया, \"लोगन एक धूर्त है और याकूब एक शूरवीर है\"। ऐडन ने कहा, \"आरिया एक धूर्त है या विलियम एक शूरवीर है।\" आरिया ने आपको बताया कि विलियम एक धूर्त है। लोगन ने कहा, \"याकूब एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) याकूब एक धूर्त है  \n(3) ऐडन एक शूरवीर है  \n(4) आरिया एक धूर्त है  \n(5) लोगन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: लुकास, अलेक्जेंडर, हेनरी, ऐडन, और सेबेस्टियन। लुकास ने टिप्पणी की, \"हेनरी एक शूरवीर है\"। \"ऐडन एक शूरवीर है,\" अलेक्जेंडर ने कहा। जैसे हेनरी ने कहा, \"सेबेस्टियन एक शूरवीर है और हेनरी एक शूरवीर है\"। \"लुकास एक शूरवीर नहीं है,\" ऐडन ने घोषणा की। सेबेस्टियन ने asserted किया: \"लुकास एक धूर्त है या ऐडन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक धूर्त है  \n(2) अलेक्जेंडर एक शूरवीर है  \n(3) हेनरी एक धूर्त है  \n(4) ऐडन एक शूरवीर है  \n(5) सेबेस्टियन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: अमेलिया, ज़ोई, ओवेन, सैमुएल, और आरिया। जैसे अमेलिया ने कहा, \"ज़ोई एक धूर्त है और ओवेन एक धूर्त है\"। ज़ोई ने कहा कि अमेलिया एक शूरवीर है और आरिया एक शूरवीर है। ओवेन को यह कहते हुए सुना गया, \"सैमुएल एक शूरवीर है और अमेलिया एक धूर्त है\"। \"अगर आरिया एक शूरवीर है तो ज़ोई एक शूरवीर है,\" सैमुएल ने घोषणा की। आरिया ने कहा, \"ज़ोई एक शूरवीर है यदि और केवल यदि ओवेन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक शूरवीर है  \n(2) ज़ोई एक धूर्त है  \n(3) ओवेन एक धूर्त है  \n(4) सैमुएल एक शूरवीर है  \n(5) आरिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: डैनियल, मेसन, आरिया, लियम, और माइकल। डैनियल ने कहा, \"माइकल एक धूर्त है।\" मेसन ने कहा: \"लियम एक धूर्त है।\" \"अगर मेसन एक धूर्त है तो माइकल एक धूर्त है\" - आरिया। लियम ने कहा, \"मेसन एक धूर्त है यदि और केवल यदि मेसन एक शूरवीर है।\" \"आरिया एक शूरवीर नहीं है\" - माइकल। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक शूरवीर है  \n(2) मेसन एक शूरवीर है  \n(3) आरिया एक शूरवीर है  \n(4) लियम एक धूर्त है  \n(5) माइकल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एवा, अबिगेल, हार्पर, पेनलोप, और ईथन। एवा ने आपको बताया कि ईथन एक शूरवीर है और अबिगेल एक धूर्त है। अबिगेल को यह कहते हुए सुना गया, \"अबिगेल एक शूरवीर है या पेनलोप एक धूर्त है\"। हार्पर के अनुसार, \"यदि हार्पर एक शूरवीर है तो अबिगेल एक शूरवीर है\"। \"अबिगेल एक धूर्त नहीं है,\" पेनलोप ने दावा किया। ईथन ने आपको बताया कि यदि एवा एक शूरवीर है तो अबिगेल एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक धूर्त है  \n(2) अबिगेल एक शूरवीर है  \n(3) हार्पर एक शूरवीर है  \n(4) पेनलोप एक शूरवीर है  \n(5) ईथन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: डेविड, एवलिन, जेम्स, ग्रेस, और मेसन। डेविड ने कहा, \"एवलिन एक धूर्त है या एवलिन एक शूरवीर है\"। एवलिन ने कहा कि ग्रेस एक धूर्त है और मेसन एक शूरवीर है। जेम्स ने कहा कि डेविड एक शूरवीर नहीं है। ग्रेस के शब्दों में: \"अगर डेविड एक धूर्त है तो जेम्स एक धूर्त है\"। मेसन ने टिप्पणी की, \"ग्रेस एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक शूरवीर है  \n(2) एवलिन एक धूर्त है  \n(3) जेम्स एक धूर्त है  \n(4) ग्रेस एक शूरवीर है  \n(5) मेसन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: आरिया, जैक्सन, ईथन, ओवेन, और हेनरी। आरिया ने टिप्पणी की, \"ओवेन एक शूरवीर है या आरिया एक शूरवीर है\"। जैक्सन ने टिप्पणी की, \"अगर ईथन एक शूरवीर है तो आरिया एक शूरवीर है\"। \"आरिया एक धूर्त है यदि और केवल यदि ओवेन एक धूर्त है,\" ईथन ने घोषित किया। ओवेन को यह कहते हुए सुना गया, \"अगर हेनरी एक शूरवीर है तो हेनरी एक धूर्त है\"। \"जैक्सन एक धूर्त है यदि और केवल यदि ओवेन एक धूर्त है,\" हेनरी ने उल्लेख किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) आरिया एक धूर्त है  \n(2) जैक्सन एक धूर्त है  \n(3) ईथन एक शूरवीर है  \n(4) ओवेन एक धूर्त है  \n(5) हेनरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: लियम, अबिगेल, ओलिवर, शार्लट, और यूसुफ। लियम के अनुसार, \"शार्लट एक शूरवीर है और यूसुफ एक धूर्त है\"। अबिगेल ने कहा, \"शार्लट एक धूर्त है या लियम एक शूरवीर है।\" ओलिवर के अनुसार, \"शार्लट एक शूरवीर है\"। शार्लट ने आपको बताया कि लियम एक धूर्त है। यूसुफ के शब्दों में: \"लियम एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक धूर्त है  \n(2) अबिगेल एक धूर्त है  \n(3) ओलिवर एक शूरवीर है  \n(4) शार्लट एक शूरवीर है  \n(5) यूसुफ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एला, विक्टोरिया, राइली, एवरी, और सोफिया। एला ने कहा: \"एला एक शूरवीर है या विक्टोरिया एक धूर्त है\"। विक्टोरिया ने कहा: \"अगर विक्टोरिया एक शूरवीर है तो राइली एक शूरवीर है\"। राइली ने कहा: \"एला एक शूरवीर नहीं है\"। \"सोफिया एक शूरवीर है या एला एक धूर्त है,\" एवरी ने घोषणा की। सोफिया ने कहा कि अगर विक्टोरिया एक धूर्त है तो राइली एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक धूर्त है  \n(2) विक्टोरिया एक शूरवीर है  \n(3) राइली एक शूरवीर है  \n(4) एवरी एक शूरवीर है  \n(5) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: यूसुफ, माइकल, एलिज़ाबेथ, लुकास, और आरिया। \"लुकास एक धूर्त है और एलिज़ाबेथ एक धूर्त है\" - यूसुफ। माइकल ने कहा, \"एलिज़ाबेथ एक धूर्त है और एलिज़ाबेथ एक शूरवीर है।\" एलिज़ाबेथ के शब्दों में: \"माइकल एक धूर्त नहीं है\"। लुकास ने कहा, \"माइकल एक शूरवीर नहीं है\"। आरिया ने कहा: \"आरिया एक शूरवीर है और यूसुफ एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) यूसुफ एक धूर्त है  \n(2) माइकल एक धूर्त है  \n(3) एलिज़ाबेथ एक धूर्त है  \n(4) लुकास एक शूरवीर है  \n(5) आरिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: अलेक्जेंडर, जेम्स, एवा, लोगन, और ग्रेस। अलेक्जेंडर ने आपको बताया कि अगर ग्रेस एक शूरवीर है तो लोगन एक शूरवीर है। जेम्स ने कहा, \"एवा एक धूर्त है या लोगन एक शूरवीर है।\" एवा के अनुसार, \"जेम्स एक धूर्त है यदि और केवल यदि अलेक्जेंडर एक शूरवीर है।\" \"अलेक्जेंडर एक धूर्त है यदि और केवल यदि जेम्स एक शूरवीर है,\" लोगन ने घोषणा की। \"एवा एक धूर्त है और एवा एक शूरवीर है,\" ग्रेस ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अलेक्जेंडर एक शूरवीर है  \n(2) जेम्स एक शूरवीर है  \n(3) एवा एक धूर्त है  \n(4) लोगन एक धूर्त है  \n(5) ग्रेस एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एवलिन, क्लोई, मैथ्यू, विलियम, और सोफिया। एवलिन ने कहा कि क्लोई एक धूर्त है या विलियम एक शूरवीर है। क्लोई ने कहा: \"मैथ्यू एक शूरवीर है या मैथ्यू एक धूर्त है\"। \"विलियम एक शूरवीर नहीं है,\" मैथ्यू ने दावा किया। विलियम के अनुसार, \"मैथ्यू एक धूर्त है यदि और केवल यदि एवलिन एक धूर्त है\"। सोफिया के शब्दों में: \"मैथ्यू एक शूरवीर है यदि और केवल यदि मैथ्यू एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक धूर्त है  \n(2) क्लोई एक शूरवीर है  \n(3) मैथ्यू एक शूरवीर है  \n(4) विलियम एक धूर्त है  \n(5) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: डेविड, शार्लट, जैक्सन, सैमुएल, और एवरी। डेविड को यह कहते हुए सुना गया, \"अगर सैमुएल एक शूरवीर है तो शार्लट एक धूर्त है\"। शार्लट ने कहा कि डेविड एक धूर्त है यदि और केवल यदि एवरी एक धूर्त है। जैक्सन ने कहा, \"शार्लट एक धूर्त है या एवरी एक धूर्त है\"। \"अगर जैक्सन एक धूर्त है तो डेविड एक शूरवीर है\" - सैमुएल। एवरी के अनुसार, \"शार्लट एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक धूर्त है  \n(2) शार्लट एक शूरवीर है  \n(3) जैक्सन एक शूरवीर है  \n(4) सैमुएल एक शूरवीर है  \n(5) एवरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: लियम, एलिज़ाबेथ, ऐडन, मैथ्यू, और बेंजामिन। लियम के शब्दों में: \"ऐडन एक शूरवीर है और बेंजामिन एक धूर्त है\"। एलिज़ाबेथ के शब्दों में: \"मैथ्यू एक शूरवीर है यदि और केवल यदि मैथ्यू एक धूर्त है\"। ऐडन के एक बयान में: \"यदि लियम एक धूर्त है तो लियम एक शूरवीर है\"। \"लियम एक शूरवीर नहीं है,\" मैथ्यू ने घोषणा की। बेंजामिन के अनुसार, \"ऐडन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक धूर्त है  \n(2) एलिज़ाबेथ एक धूर्त है  \n(3) ऐडन एक धूर्त है  \n(4) मैथ्यू एक शूरवीर है  \n(5) बेंजामिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ऐडन, शार्लट, अलेक्जेंडर, लुकास, और एमिली। \"अलेक्जेंडर एक धूर्त है या एमिली एक शूरवीर है\" - ऐडन। शार्लट ने आपको बताया कि ऐडन एक शूरवीर नहीं है। अलेक्जेंडर ने कहा, \"ऐडन एक धूर्त है\"। \"अगर एमिली एक शूरवीर है तो शार्लट एक शूरवीर है,\" लुकास ने दावा किया। एमिली ने कहा कि अगर शार्लट एक धूर्त है तो ऐडन एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक शूरवीर है  \n(2) शार्लट एक धूर्त है  \n(3) अलेक्जेंडर एक धूर्त है  \n(4) लुकास एक शूरवीर है  \n(5) एमिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: शार्लट, ओलिवर, एला, राइली, और डैनियल। शार्लट ने टिप्पणी की, \"ओलिवर एक धूर्त है\"। ओलिवर ने कहा, \"डैनियल एक शूरवीर नहीं है।\" \"शार्लट एक धूर्त है और शार्लट एक शूरवीर है\" - एला। राइली ने कहा: \"एला एक धूर्त है या शार्लट एक धूर्त है\"। डैनियल के अनुसार, \"ओलिवर एक धूर्त है यदि और केवल यदि शार्लट एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक शूरवीर है  \n(2) ओलिवर एक धूर्त है  \n(3) एला एक धूर्त है  \n(4) राइली एक शूरवीर है  \n(5) डैनियल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ईथन, जेम्स, एमिली, माइकल, और विक्टोरिया। ईथन ने कहा, \"एमिली एक धूर्त है या माइकल एक शूरवीर है\"। जेम्स को यह कहते हुए सुना गया, \"ईथन एक शूरवीर है और ईथन एक धूर्त है\"। एमिली ने कहा, \"जेम्स एक धूर्त है\"। माइकल ने कहा: \"अगर एमिली एक शूरवीर है तो एमिली एक धूर्त है\"। विक्टोरिया के अनुसार, \"ईथन एक धूर्त है या माइकल एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक धूर्त है  \n(2) जेम्स एक धूर्त है  \n(3) एमिली एक शूरवीर है  \n(4) माइकल एक धूर्त है  \n(5) विक्टोरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: मेसन, औरोरा, हेनरी, विक्टोरिया, और डैनियल। मेसन ने टिप्पणी की, \"अगर विक्टोरिया एक शूरवीर है तो औरोरा एक शूरवीर है\"। औरोरा ने कहा कि डैनियल एक शूरवीर है। हेनरी के शब्दों में: \"अगर मेसन एक धूर्त है तो औरोरा एक शूरवीर है\"। \"औरोरा एक शूरवीर है और डैनियल एक शूरवीर है\" - विक्टोरिया। जैसा कि डैनियल ने कहा, \"हेनरी एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक शूरवीर है  \n(2) औरोरा एक धूर्त है  \n(3) हेनरी एक शूरवीर है  \n(4) विक्टोरिया एक धूर्त है  \n(5) डैनियल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: जेम्स, लुकास, माइकल, अलेक्जेंडर, और औरोरा। जेम्स ने कहा, \"लुकास एक शूरवीर है और औरोरा एक शूरवीर है।\" \"अलेक्जेंडर एक धूर्त है या लुकास एक शूरवीर है\" - लुकास। \"लुकास एक धूर्त है या जेम्स एक शूरवीर है,\" माइकल ने दावा किया। अलेक्जेंडर के शब्दों में: \"अगर लुकास एक शूरवीर है तो माइकल एक धूर्त है।\" औरोरा ने कहा, \"अगर औरोरा एक शूरवीर है तो लुकास एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) लुकास एक शूरवीर है  \n(3) माइकल एक शूरवीर है  \n(4) अलेक्जेंडर एक धूर्त है  \n(5) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: अमेलिया, ज़ोई, अबिगेल, याकूब, और सोफिया। \"याकूब एक धूर्त है यदि और केवल यदि सोफिया एक शूरवीर है,\" अमेलिया ने दावा किया। ज़ोई ने कहा, \"याकूब एक धूर्त है।\" अबिगेल ने नोट किया, \"ज़ोई एक शूरवीर है यदि और केवल यदि अमेलिया एक धूर्त है।\" याकूब ने कहा, \"यदि ज़ोई एक धूर्त है तो याकूब एक शूरवीर है।\" सोफिया के अनुसार, \"ज़ोई एक शूरवीर नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक धूर्त है  \n(2) ज़ोई एक धूर्त है  \n(3) अबिगेल एक धूर्त है  \n(4) याकूब एक शूरवीर है  \n(5) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: सोफिया, मिया, एमिली, एवलिन, और शार्लट। सोफिया के एक बयान में: \"एवलिन एक धूर्त है यदि और केवल यदि मिया एक धूर्त है\"। मिया ने कहा, \"एवलिन एक धूर्त है या सोफिया एक शूरवीर है।\" एमिली के एक बयान में: \"मिया एक शूरवीर है या एवलिन एक धूर्त है\"। एवलिन के शब्दों में: \"यदि शार्लट एक धूर्त है तो मिया एक शूरवीर है\"। शार्लट ने कहा कि सोफिया एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) मिया एक शूरवीर है  \n(3) एमिली एक शूरवीर है  \n(4) एवलिन एक शूरवीर है  \n(5) शार्लट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: शार्लट, नूह, ज़ोई, जैक, और मिया। शार्लट ने आपको बताया कि मिया एक धूर्त है और नूह एक शूरवीर है। नूह ने कहा, \"शार्लट एक धूर्त है और ज़ोई एक शूरवीर है\"। ज़ोई ने कहा, \"नूह एक धूर्त है और शार्लट एक शूरवीर है\"। \"मिया एक शूरवीर नहीं है,\" जैक ने कहा। \"शार्लट एक धूर्त है और ज़ोई एक शूरवीर है\" - मिया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक धूर्त है  \n(2) नूह एक धूर्त है  \n(3) ज़ोई एक धूर्त है  \n(4) जैक एक शूरवीर है  \n(5) मिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एवरी, जेम्स, डैनियल, एला, और विलियम। एवरी ने कहा, \"विलियम एक धूर्त है।\" जेम्स को यह कहते हुए सुना गया, \"एला एक शूरवीर है या विलियम एक धूर्त है।\" डैनियल ने टिप्पणी की, \"अगर एवरी एक शूरवीर है तो एला एक शूरवीर है।\" एला के एक बयान में: \"डैनियल एक धूर्त है।\" विलियम के अनुसार, \"एवरी एक धूर्त है या डैनियल एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक धूर्त है  \n(2) जेम्स एक धूर्त है  \n(3) डैनियल एक शूरवीर है  \n(4) एला एक धूर्त है  \n(5) विलियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: जैक, लियम, ईथन, अमेलिया, और हार्पर। जैक के अनुसार, \"ईथन एक धूर्त है या अमेलिया एक धूर्त है\"। लियम के अनुसार, \"ईथन एक शूरवीर है या हार्पर एक शूरवीर है\"। ईथन के एक बयान में: \"जैक एक धूर्त नहीं है\"। अमेलिया के एक बयान में: \"यदि लियम एक शूरवीर है तो अमेलिया एक शूरवीर है\"। हार्पर के शब्दों में: \"यदि लियम एक धूर्त है तो अमेलिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक एक शूरवीर है  \n(2) लियम एक शूरवीर है  \n(3) ईथन एक शूरवीर है  \n(4) अमेलिया एक धूर्त है  \n(5) हार्पर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: पेनलोप, माइकल, डैनियल, मैथ्यू, और एवलिन। \"पेनलोप एक शूरवीर है और माइकल एक धूर्त है,\" पेनलोप ने घोषणा की। \"डैनियल एक धूर्त है या डैनियल एक शूरवीर है,\" माइकल ने घोषणा की। डैनियल ने टिप्पणी की, \"पेनलोप एक धूर्त है या एवलिन एक धूर्त है\"। मैथ्यू को यह कहते हुए सुना गया, \"पेनलोप एक शूरवीर है यदि और केवल यदि डैनियल एक शूरवीर है\"। एवलिन ने कहा, \"पेनलोप एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक धूर्त है  \n(2) माइकल एक शूरवीर है  \n(3) डैनियल एक शूरवीर है  \n(4) मैथ्यू एक धूर्त है  \n(5) एवलिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: सेबेस्टियन, नूह, बेंजामिन, हेनरी, और एवा। सेबेस्टियन ने कहा कि एवा एक धूर्त है यदि और केवल यदि एवा एक शूरवीर है। नूह ने टिप्पणी की, \"एवा एक धूर्त है\"। बेंजामिन को यह कहते हुए सुना गया, \"एवा एक धूर्त है या नूह एक शूरवीर है\"। \"एवा एक धूर्त है,\" हेनरी ने कहा। \"सेबेस्टियन एक धूर्त नहीं है,\" एवा ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सेबेस्टियन एक धूर्त है  \n(2) नूह एक शूरवीर है  \n(3) बेंजामिन एक शूरवीर है  \n(4) हेनरी एक शूरवीर है  \n(5) एवा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: मेसन, लियम, ओवेन, इसाबेला, और एमिली। मेसन ने कहा, \"लियम एक धूर्त है और एमिली एक धूर्त है\"। लियम ने कहा, \"एमिली एक धूर्त है या मेसन एक शूरवीर है।\" ओवेन ने कहा, \"लियम एक शूरवीर नहीं है\"। इसाबेला के अनुसार, \"अगर ओवेन एक शूरवीर है तो लियम एक शूरवीर है\"। एमिली ने कहा: \"मेसन एक शूरवीर है या मेसन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) लियम एक धूर्त है  \n(3) ओवेन एक शूरवीर है  \n(4) इसाबेला एक धूर्त है  \n(5) एमिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: लिली, लियम, एला, ऐडन, और सैमुएल। लिली के अनुसार, \"लियम एक शूरवीर है या सैमुएल एक धूर्त है\"। लियम के अनुसार, \"अगर एला एक धूर्त है तो लिली एक धूर्त है\"। \"लियम एक धूर्त नहीं है,\" एला ने दावा किया। ऐडन ने नोट किया, \"लिली एक धूर्त नहीं है\"। सैमुएल ने asserted किया: \"लिली एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लिली एक शूरवीर है  \n(2) लियम एक शूरवीर है  \n(3) एला एक शूरवीर है  \n(4) ऐडन एक शूरवीर है  \n(5) सैमुएल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: सोफिया, बेंजामिन, ओलिविया, यूसुफ, और इसाबेला। \"सोफिया एक शूरवीर है यदि और केवल यदि बेंजामिन एक धूर्त है,\" सोफिया ने कहा। \"ओलिविया एक धूर्त है,\" बेंजामिन ने घोषणा की। ओलिविया के शब्दों में: \"ओलिविया एक शूरवीर है यदि और केवल यदि इसाबेला एक शूरवीर है\"। \"यदि ओलिविया एक शूरवीर है तो बेंजामिन एक धूर्त है,\" यूसुफ ने कहा। \"सोफिया एक शूरवीर नहीं है,\" इसाबेला ने कहा। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) बेंजामिन एक धूर्त है  \n(3) ओलिविया एक शूरवीर है  \n(4) यूसुफ एक शूरवीर है  \n(5) इसाबेला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: माइकल, विलियम, सोफिया, सैमुएल, और राइली। \"सैमुएल एक धूर्त है और सोफिया एक धूर्त है,\" माइकल ने दावा किया। विलियम को यह कहते हुए सुना गया, \"सैमुएल एक शूरवीर है\"। सोफिया ने टिप्पणी की, \"माइकल एक धूर्त है\"। सैमुएल ने asserted किया: \"माइकल एक धूर्त है यदि और केवल यदि सोफिया एक शूरवीर है\"। राइली ने कहा कि माइकल एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक धूर्त है  \n(2) विलियम एक शूरवीर है  \n(3) सोफिया एक शूरवीर है  \n(4) सैमुएल एक शूरवीर है  \n(5) राइली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: लिली, ल्यूक, स्कारलेट, जेम्स, और पेनलोप। लिली ने आपको बताया कि स्कारलेट एक शूरवीर नहीं है। ल्यूक ने आपको बताया कि स्कारलेट एक शूरवीर नहीं है। \"जेम्स एक शूरवीर है यदि और केवल यदि ल्यूक एक धूर्त है,\" स्कारलेट ने कहा। जेम्स ने कहा कि लिली एक धूर्त है और ल्यूक एक धूर्त है। पेनलोप ने टिप्पणी की, \"ल्यूक एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लिली एक धूर्त है  \n(2) ल्यूक एक धूर्त है  \n(3) स्कारलेट एक शूरवीर है  \n(4) जेम्स एक शूरवीर है  \n(5) पेनलोप एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ग्रेस, मिया, ऐडन, सेबेस्टियन, और एलिज़ाबेथ। ग्रेस को यह कहते हुए सुना गया, \"अगर मिया एक धूर्त है तो ऐडन एक धूर्त है\"। मिया को यह कहते हुए सुना गया, \"सेबेस्टियन एक शूरवीर है या ग्रेस एक धूर्त है\"। ऐडन ने आपको बताया कि ग्रेस एक धूर्त है और सेबेस्टियन एक धूर्त है। \"मिया एक शूरवीर है या एलिज़ाबेथ एक धूर्त है,\" सेबेस्टियन ने दावा किया। एलिज़ाबेथ ने नोट किया, \"सेबेस्टियन एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक शूरवीर है  \n(2) मिया एक शूरवीर है  \n(3) ऐडन एक धूर्त है  \n(4) सेबेस्टियन एक शूरवीर है  \n(5) एलिज़ाबेथ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: लियम, याकूब, एमिली, एलिज़ाबेथ, और मेसन। लियम ने कहा, \"अगर एमिली एक शूरवीर है तो लियम एक शूरवीर है।\" \"एलिज़ाबेथ एक शूरवीर है,\" याकूब ने घोषणा की। एमिली ने कहा, \"एलिज़ाबेथ एक शूरवीर है।\" \"लियम एक धूर्त है यदि और केवल यदि याकूब एक शूरवीर है,\" एलिज़ाबेथ ने दावा किया। मेसन ने कहा, \"लियम एक धूर्त है या याकूब एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक धूर्त है  \n(2) याकूब एक शूरवीर है  \n(3) एमिली एक शूरवीर है  \n(4) एलिज़ाबेथ एक शूरवीर है  \n(5) मेसन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: लोगन, जैक्सन, क्लोई, लियम, और इसाबेला। लोगन को यह कहते हुए सुना गया, \"जैक्सन एक शूरवीर है या क्लोई एक शूरवीर है\"। जैक्सन ने कहा, \"लियम एक धूर्त है या क्लोई एक शूरवीर है\"। क्लोई ने कहा कि इसाबेला एक धूर्त है। लियम ने कहा, \"क्लोई एक शूरवीर है या इसाबेला एक शूरवीर है\"। इसाबेला ने कहा, \"लोगन एक शूरवीर है और क्लोई एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक शूरवीर है  \n(2) जैक्सन एक शूरवीर है  \n(3) क्लोई एक शूरवीर है  \n(4) लियम एक शूरवीर है  \n(5) इसाबेला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: लुकास, अबिगेल, ओलिविया, शार्लट, और मैथ्यू। \"मैथ्यू एक शूरवीर है और शार्लट एक शूरवीर है,\" लुकास ने दावा किया। अबिगेल ने remarked किया, \"अगर ओलिविया एक शूरवीर है तो मैथ्यू एक शूरवीर है\"। ओलिविया के अनुसार, \"अगर लुकास एक शूरवीर है तो लुकास एक धूर्त है\"। शार्लट ने asserted किया: \"शार्लट एक शूरवीर है यदि और केवल यदि मैथ्यू एक धूर्त है\"। जैसे मैथ्यू ने कहा, \"अबिगेल एक शूरवीर है या शार्लट एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक धूर्त है  \n(2) अबिगेल एक धूर्त है  \n(3) ओलिविया एक शूरवीर है  \n(4) शार्लट एक धूर्त है  \n(5) मैथ्यू एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: लुकास, ग्रेस, सोफिया, ल्यूक, और ओलिवर। लुकास ने कहा, \"ल्यूक एक शूरवीर है\"। ग्रेस ने कहा, \"ल्यूक एक धूर्त नहीं है\"। \"लुकास एक धूर्त है और ग्रेस एक शूरवीर है,\" सोफिया ने घोषणा की। ल्यूक ने टिप्पणी की, \"लुकास एक धूर्त है और लुकास एक शूरवीर है\"। ओलिवर के शब्दों में: \"सोफिया एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक धूर्त है  \n(2) ग्रेस एक धूर्त है  \n(3) सोफिया एक धूर्त है  \n(4) ल्यूक एक धूर्त है  \n(5) ओलिवर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: जेम्स, सोफिया, एला, राइली, और हेनरी। जेम्स ने कहा: \"हेनरी एक धूर्त है और एला एक धूर्त है\"। सोफिया के एक बयान में: \"यदि सोफिया एक शूरवीर है तो एला एक धूर्त है\"। एला के शब्दों में: \"हेनरी एक शूरवीर है यदि और केवल यदि एला एक शूरवीर है\"। \"यदि जेम्स एक शूरवीर है तो एला एक शूरवीर है\" - राइली। \"जेम्स एक धूर्त है,\" हेनरी ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक धूर्त है  \n(2) सोफिया एक शूरवीर है  \n(3) एला एक धूर्त है  \n(4) राइली एक शूरवीर है  \n(5) हेनरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: क्लोई, जैक, लिली, अलेक्जेंडर, और विलियम। क्लोई ने टिप्पणी की, \"विलियम एक धूर्त है\"। जैक ने कहा, \"अलेक्जेंडर एक धूर्त है।\" लिली के शब्दों में: \"अगर विलियम एक शूरवीर है तो विलियम एक धूर्त है।\" \"लिली एक धूर्त है यदि और केवल यदि जैक एक धूर्त है\" - अलेक्जेंडर। \"अलेक्जेंडर एक शूरवीर है या लिली एक शूरवीर है,\" विलियम ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) क्लोई एक धूर्त है  \n(2) जैक एक धूर्त है  \n(3) लिली एक धूर्त है  \n(4) अलेक्जेंडर एक शूरवीर है  \n(5) विलियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: सोफिया, जैक्सन, नूह, एलिज़ाबेथ, और औरोरा। \"औरोरा एक धूर्त नहीं है\" - सोफिया। जैक्सन को यह कहते हुए सुना गया, \"नूह एक धूर्त है और औरोरा एक धूर्त है\"। नूह के एक बयान में: \"यदि जैक्सन एक धूर्त है तो औरोरा एक धूर्त है\"। \"नूह एक शूरवीर है और नूह एक धूर्त है,\" एलिज़ाबेथ ने घोषणा की। औरोरा ने कहा कि एलिज़ाबेथ एक शूरवीर है यदि और केवल यदि जैक्सन एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) जैक्सन एक धूर्त है  \n(3) नूह एक धूर्त है  \n(4) एलिज़ाबेथ एक धूर्त है  \n(5) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ल्यूक, जेम्स, लिली, सैमुएल, और हेनरी। ल्यूक ने आपको बताया कि अगर ल्यूक एक शूरवीर है तो हेनरी एक धूर्त है। जेम्स के अनुसार, \"हेनरी एक धूर्त नहीं है\"। लिली ने कहा, \"ल्यूक एक शूरवीर है और ल्यूक एक धूर्त है\"। सैमुएल के अनुसार, \"सैमुएल एक शूरवीर है यदि और केवल यदि जेम्स एक धूर्त है\"। हेनरी ने कहा, \"सैमुएल एक धूर्त है यदि और केवल यदि हेनरी एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) जेम्स एक धूर्त है  \n(3) लिली एक धूर्त है  \n(4) सैमुएल एक धूर्त है  \n(5) हेनरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: सोफिया, मेसन, ओवेन, एमिली, और सेबेस्टियन। सोफिया को यह कहते हुए सुना गया, \"मेसन एक शूरवीर है या सेबेस्टियन एक शूरवीर है\"। मेसन ने कहा, \"सेबेस्टियन एक धूर्त है और एमिली एक धूर्त है।\" ओवेन के शब्दों में: \"अगर एमिली एक धूर्त है तो सोफिया एक धूर्त है\"। एमिली के शब्दों में: \"सेबेस्टियन एक धूर्त है या सोफिया एक शूरवीर है\"। सेबेस्टियन के अनुसार, \"सोफिया एक धूर्त है या सेबेस्टियन एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) मेसन एक धूर्त है  \n(3) ओवेन एक शूरवीर है  \n(4) एमिली एक शूरवीर है  \n(5) सेबेस्टियन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: अमेलिया, स्कारलेट, विक्टोरिया, लुकास, और हेनरी। जैसे अमेलिया ने कहा, \"स्कारलेट एक शूरवीर है यदि और केवल यदि स्कारलेट एक धूर्त है\"। स्कारलेट के अनुसार, \"अमेलिया एक धूर्त नहीं है\"। विक्टोरिया के एक बयान में: \"स्कारलेट एक धूर्त है या विक्टोरिया एक शूरवीर है\"। लुकास ने कहा कि यदि हेनरी एक शूरवीर है तो हेनरी एक धूर्त है। \"स्कारलेट एक शूरवीर है और अमेलिया एक शूरवीर है,\" हेनरी ने कहा। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) अमेलिया एक धूर्त है  \n(2) स्कारलेट एक धूर्त है  \n(3) विक्टोरिया एक शूरवीर है  \n(4) लुकास एक शूरवीर है  \n(5) हेनरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एवलिन, क्लोई, सोफिया, अबिगेल, और एमिली। एवलिन ने कहा, \"क्लोई एक शूरवीर है और सोफिया एक शूरवीर है\"। जैसे कि क्लोई ने कहा, \"एमिली एक शूरवीर है यदि और केवल यदि सोफिया एक धूर्त है\"। सोफिया ने कहा, \"अबिगेल एक शूरवीर है या सोफिया एक शूरवीर है\"। अबिगेल के शब्दों में: \"यदि एवलिन एक धूर्त है तो एमिली एक शूरवीर है\"। एमिली ने टिप्पणी की, \"क्लोई एक धूर्त है और अबिगेल एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एवलिन एक शूरवीर है  \n(2) क्लोई एक शूरवीर है  \n(3) सोफिया एक शूरवीर है  \n(4) अबिगेल एक शूरवीर है  \n(5) एमिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: बेंजामिन, अलेक्जेंडर, डैनियल, औरोरा, और यूसुफ। बेंजामिन ने कहा, \"औरोरा एक शूरवीर है\"। अलेक्जेंडर ने आपको बताया कि यदि यूसुफ एक धूर्त है तो यूसुफ एक शूरवीर है। डैनियल के एक बयान में: \"बेंजामिन एक धूर्त है या डैनियल एक शूरवीर है\"। औरोरा को यह कहते हुए सुना गया, \"यूसुफ एक शूरवीर है यदि और केवल यदि बेंजामिन एक शूरवीर है\"। \"डैनियल एक धूर्त है यदि और केवल यदि औरोरा एक धूर्त है\" - यूसुफ। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक शूरवीर है  \n(2) अलेक्जेंडर एक शूरवीर है  \n(3) डैनियल एक शूरवीर है  \n(4) औरोरा एक शूरवीर है  \n(5) यूसुफ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: सोफिया, एला, ओवेन, शार्लट, और क्लोई। जैसे सोफिया ने कहा, \"शार्लट एक शूरवीर है या ओवेन एक शूरवीर है\"। एला को यह कहते हुए सुना गया, \"शार्लट एक धूर्त है और सोफिया एक धूर्त है\"। ओवेन ने कहा, \"शार्लट एक धूर्त है यदि और केवल यदि क्लोई एक शूरवीर है\"। शार्लट को यह कहते हुए सुना गया, \"यदि एला एक शूरवीर है तो शार्लट एक शूरवीर है\"। क्लोई ने कहा, \"क्लोई एक शूरवीर है यदि और केवल यदि एला एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) एला एक शूरवीर है  \n(3) ओवेन एक धूर्त है  \n(4) शार्लट एक धूर्त है  \n(5) क्लोई एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: डेविड, विलियम, औरोरा, लियम, और लोगन। डेविड ने आपको बताया कि विलियम एक धूर्त है या औरोरा एक धूर्त है। विलियम ने आपको बताया कि अगर डेविड एक धूर्त है तो लियम एक शूरवीर है। \"डेविड एक शूरवीर है यदि और केवल यदि औरोरा एक शूरवीर है,\" औरोरा ने दावा किया। लियम ने आपको बताया कि लोगन एक धूर्त है। लोगन ने कहा, \"विलियम एक शूरवीर है यदि और केवल यदि विलियम एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक शूरवीर है  \n(2) विलियम एक शूरवीर है  \n(3) औरोरा एक धूर्त है  \n(4) लियम एक शूरवीर है  \n(5) लोगन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: शार्लट, अबिगेल, ग्रेस, मिया, और स्कारलेट। \"अगर ग्रेस एक धूर्त है तो मिया एक शूरवीर है\" - शार्लट। \"स्कारलेट एक धूर्त है यदि और केवल यदि मिया एक शूरवीर है\" - अबिगेल। ग्रेस के एक बयान में: \"स्कारलेट एक धूर्त है\"। \"ग्रेस एक शूरवीर है यदि और केवल यदि स्कारलेट एक शूरवीर है,\" मिया ने कहा। स्कारलेट ने कहा, \"मिया एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक धूर्त है  \n(2) अबिगेल एक शूरवीर है  \n(3) ग्रेस एक धूर्त है  \n(4) मिया एक धूर्त है  \n(5) स्कारलेट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: यूसुफ, लिली, बेंजामिन, क्लोई, और हार्पर। \"यूसुफ एक शूरवीर है और क्लोई एक धूर्त है,\" यूसुफ ने घोषित किया। \"अगर लिली एक शूरवीर है तो यूसुफ एक धूर्त है,\" लिली ने दावा किया। बेंजामिन ने remarked किया, \"यूसुफ एक धूर्त है यदि और केवल यदि क्लोई एक शूरवीर है\"। क्लोई ने stated किया, \"अगर हार्पर एक धूर्त है तो बेंजामिन एक शूरवीर है\"। हार्पर ने noted किया, \"बेंजामिन एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) यूसुफ एक धूर्त है  \n(2) लिली एक शूरवीर है  \n(3) बेंजामिन एक शूरवीर है  \n(4) क्लोई एक शूरवीर है  \n(5) हार्पर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: सेबेस्टियन, औरोरा, हेनरी, एवा, और एमिली। \"हेनरी एक धूर्त है और सेबेस्टियन एक शूरवीर है,\" सेबेस्टियन ने कहा। औरोरा ने टिप्पणी की, \"अगर हेनरी एक शूरवीर है तो एवा एक धूर्त है।\" हेनरी के शब्दों में: \"एमिली एक शूरवीर नहीं है।\" एवा ने कहा, \"हेनरी एक शूरवीर है यदि और केवल यदि औरोरा एक धूर्त है।\" एमिली ने asserted किया: \"हेनरी एक शूरवीर है यदि और केवल यदि औरोरा एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सेबेस्टियन एक धूर्त है  \n(2) औरोरा एक धूर्त है  \n(3) हेनरी एक शूरवीर है  \n(4) एवा एक शूरवीर है  \n(5) एमिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एला, ज़ोई, लोगन, एमिली, और माइकल। एला ने कहा, \"ज़ोई एक धूर्त है और ज़ोई एक शूरवीर है\"। ज़ोई ने कहा कि एला एक शूरवीर है और ज़ोई एक शूरवीर है। लोगन ने कहा, \"अगर एला एक धूर्त है तो ज़ोई एक धूर्त है\"। एमिली ने कहा कि एला एक धूर्त है और माइकल एक शूरवीर है। \"अगर एमिली एक धूर्त है तो ज़ोई एक धूर्त है,\" माइकल ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक धूर्त है  \n(2) ज़ोई एक धूर्त है  \n(3) लोगन एक शूरवीर है  \n(4) एमिली एक शूरवीर है  \n(5) माइकल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: मैथ्यू, एम्मा, जैक्सन, विलियम, और जैक। \"जैक्सन एक शूरवीर है यदि और केवल यदि विलियम एक धूर्त है,\" मैथ्यू ने कहा। एम्मा को यह कहते हुए सुना गया, \"मैथ्यू एक शूरवीर है\"। जैक्सन ने टिप्पणी की, \"एम्मा एक शूरवीर है और एम्मा एक धूर्त है\"। जैसे विलियम ने कहा, \"यदि जैक एक धूर्त है तो एम्मा एक धूर्त है\"। जैक ने कहा, \"जैक एक शूरवीर है और विलियम एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक शूरवीर है  \n(2) एम्मा एक शूरवीर है  \n(3) जैक्सन एक धूर्त है  \n(4) विलियम एक शूरवीर है  \n(5) जैक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: नूह, आरिया, जैक्सन, अबिगेल, और ज़ोई। नूह को यह कहते हुए सुना गया, \"ज़ोई एक शूरवीर है और नूह एक शूरवीर है\"। आरिया ने आपको बताया कि अगर नूह एक शूरवीर है तो जैक्सन एक शूरवीर है। जैक्सन ने कहा, \"नूह एक धूर्त है और आरिया एक धूर्त है\"। अबिगेल ने नोट किया, \"नूह एक शूरवीर है या आरिया एक शूरवीर है\"। \"आरिया एक शूरवीर है और नूह एक धूर्त है,\" ज़ोई ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक धूर्त है  \n(2) आरिया एक शूरवीर है  \n(3) जैक्सन एक धूर्त है  \n(4) अबिगेल एक शूरवीर है  \n(5) ज़ोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: जैक, मिया, औरोरा, मैथ्यू, और नूह। जैक ने कहा: \"अगर मैथ्यू एक धूर्त है तो नूह एक धूर्त है\"। मिया के अनुसार, \"मिया एक शूरवीर है और औरोरा एक शूरवीर है\"। औरोरा के शब्दों में: \"मिया एक शूरवीर है\"। मैथ्यू ने कहा, \"अगर मैथ्यू एक शूरवीर है तो मिया एक शूरवीर है\"। नूह के शब्दों में: \"अगर जैक एक धूर्त है तो मैथ्यू एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक एक शूरवीर है  \n(2) मिया एक शूरवीर है  \n(3) औरोरा एक शूरवीर है  \n(4) मैथ्यू एक शूरवीर है  \n(5) नूह एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: विक्टोरिया, ओलिवर, हेनरी, ज़ोई, और ओवेन। विक्टोरिया ने टिप्पणी की, \"हेनरी एक धूर्त है\"। ओलिवर ने कहा कि ज़ोई एक धूर्त है या ओवेन एक धूर्त है। हेनरी ने कहा, \"अगर ओवेन एक शूरवीर है तो ज़ोई एक धूर्त है\"। ज़ोई ने कहा कि ओलिवर एक धूर्त है और विक्टोरिया एक शूरवीर है। ओवेन ने कहा, \"अगर ओलिवर एक धूर्त है तो ओलिवर एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विक्टोरिया एक धूर्त है  \n(2) ओलिवर एक शूरवीर है  \n(3) हेनरी एक शूरवीर है  \n(4) ज़ोई एक धूर्त है  \n(5) ओवेन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: मेसन, विक्टोरिया, डेविड, लोगन, और अलेक्जेंडर। मेसन के एक बयान में: \"अलेक्जेंडर एक शूरवीर है और विक्टोरिया एक शूरवीर है\"। विक्टोरिया ने कहा, \"विक्टोरिया एक शूरवीर है और अलेक्जेंडर एक धूर्त है\"। डेविड ने कहा: \"विक्टोरिया एक शूरवीर है या लोगन एक धूर्त है\"। लोगन ने कहा: \"अगर विक्टोरिया एक धूर्त है तो विक्टोरिया एक शूरवीर है\"। अलेक्जेंडर ने आपको बताया कि मेसन एक शूरवीर नहीं है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) विक्टोरिया एक धूर्त है  \n(3) डेविड एक शूरवीर है  \n(4) लोगन एक धूर्त है  \n(5) अलेक्जेंडर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ईथन, सोफिया, डेविड, एवलिन, और माइकल। ईथन ने कहा कि सोफिया एक धूर्त नहीं है। सोफिया ने टिप्पणी की, \"एवलिन एक शूरवीर नहीं है\"। \"ईथन एक शूरवीर है और माइकल एक धूर्त है\" - डेविड। एवलिन के एक बयान में: \"ईथन एक धूर्त है यदि और केवल यदि डेविड एक शूरवीर है\"। माइकल को यह कहते हुए सुना गया, \"ईथन एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक शूरवीर है  \n(2) सोफिया एक शूरवीर है  \n(3) डेविड एक शूरवीर है  \n(4) एवलिन एक धूर्त है  \n(5) माइकल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: राइली, अबिगेल, जेम्स, ओवेन, और नूह। राइली ने आपको बताया कि जेम्स एक शूरवीर है या अबिगेल एक शूरवीर है। अबिगेल ने कहा, \"राइली एक शूरवीर है या राइली एक धूर्त है\"। जेम्स ने कहा, \"नूह एक धूर्त नहीं है\"। \"अबिगेल एक शूरवीर है,\" ओवेन ने घोषणा की। नूह ने कहा, \"अबिगेल एक शूरवीर है और राइली एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक शूरवीर है  \n(2) अबिगेल एक शूरवीर है  \n(3) जेम्स एक शूरवीर है  \n(4) ओवेन एक शूरवीर है  \n(5) नूह एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ओलिविया, लोगन, नूह, लिली, और मिया। ओलिविया को यह कहते हुए सुना गया, \"मिया एक धूर्त है यदि और केवल यदि लिली एक शूरवीर है\"। लोगन ने कहा, \"मिया एक शूरवीर है या लिली एक धूर्त है\"। नूह ने टिप्पणी की, \"ओलिविया एक शूरवीर है या मिया एक शूरवीर है\"। लिली के अनुसार, \"यदि ओलिविया एक धूर्त है तो नूह एक शूरवीर है\"। मिया ने कहा कि लिली एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक शूरवीर है  \n(2) लोगन एक धूर्त है  \n(3) नूह एक शूरवीर है  \n(4) लिली एक शूरवीर है  \n(5) मिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: जैक, एवा, सोफिया, ज़ोई, और डेविड। \"डेविड एक धूर्त है यदि और केवल यदि सोफिया एक शूरवीर है\" - जैक। जैसा कि एवा ने कहा, \"डेविड एक धूर्त है या सोफिया एक शूरवीर है\"। \"यदि जैक एक धूर्त है तो एवा एक शूरवीर है,\" सोफिया ने कहा। ज़ोई ने कहा कि यदि डेविड एक धूर्त है तो डेविड एक शूरवीर है। डेविड को यह कहते हुए सुना गया, \"एवा एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक एक धूर्त है  \n(2) एवा एक शूरवीर है  \n(3) सोफिया एक शूरवीर है  \n(4) ज़ोई एक शूरवीर है  \n(5) डेविड एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एवलिन, ल्यूक, क्लोई, लिली, और एम्मा। एवलिन ने आपको बताया कि ल्यूक एक धूर्त है यदि और केवल यदि ल्यूक एक शूरवीर है। ल्यूक ने कहा कि एवलिन एक धूर्त है यदि और केवल यदि एम्मा एक धूर्त है। क्लोई ने कहा, \"लिली एक धूर्त है\"। लिली ने कहा, \"एम्मा एक धूर्त है या क्लोई एक धूर्त है\"। एम्मा ने कहा कि क्लोई एक धूर्त है और लिली एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक धूर्त है  \n(2) ल्यूक एक धूर्त है  \n(3) क्लोई एक धूर्त है  \n(4) लिली एक शूरवीर है  \n(5) एम्मा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: जैक्सन, एवरी, ओलिवर, राइली, और एलिज़ाबेथ। जैक्सन के अनुसार, \"एलिज़ाबेथ एक धूर्त है यदि और केवल यदि एलिज़ाबेथ एक शूरवीर है\"। एवरी ने कहा कि ओलिवर एक शूरवीर है यदि और केवल यदि जैक्सन एक शूरवीर है। ओलिवर ने कहा, \"राइली एक धूर्त है और एलिज़ाबेथ एक शूरवीर है\"। राइली को यह कहते हुए सुना गया, \"एलिज़ाबेथ एक शूरवीर है या एवरी एक शूरवीर है\"। एलिज़ाबेथ ने कहा, \"जैक्सन एक धूर्त है और ओलिवर एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक धूर्त है  \n(2) एवरी एक शूरवीर है  \n(3) ओलिवर एक धूर्त है  \n(4) राइली एक शूरवीर है  \n(5) एलिज़ाबेथ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एमिली, नूह, एवा, हेनरी, और जेम्स। एमिली ने कहा, \"नूह एक शूरवीर है और जेम्स एक धूर्त है।\" नूह ने कहा: \"हेनरी एक धूर्त है।\" \"एवा एक शूरवीर है या एमिली एक धूर्त है,\" एवा ने दावा किया। हेनरी के शब्दों में: \"हेनरी एक शूरवीर है या नूह एक शूरवीर है।\" जेम्स के अनुसार, \"एमिली एक धूर्त नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक धूर्त है  \n(2) नूह एक धूर्त है  \n(3) एवा एक शूरवीर है  \n(4) हेनरी एक शूरवीर है  \n(5) जेम्स एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एम्मा, ओलिविया, सैमुएल, ग्रेस, और सोफिया। एम्मा ने कहा: \"ग्रेस एक धूर्त है या ग्रेस एक शूरवीर है\"। ओलिविया ने कहा कि सोफिया एक शूरवीर नहीं है। सैमुएल ने कहा, \"ग्रेस एक शूरवीर है और सैमुएल एक शूरवीर है\"। ग्रेस ने कहा, \"सोफिया एक शूरवीर है\"। सोफिया ने कहा: \"सैमुएल एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एम्मा एक शूरवीर है  \n(2) ओलिविया एक धूर्त है  \n(3) सैमुएल एक धूर्त है  \n(4) ग्रेस एक शूरवीर है  \n(5) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ईथन, हेनरी, विलियम, ओलिवर, और एवा। ईथन ने कहा, \"एवा एक शूरवीर है या ओलिवर एक शूरवीर है\"। हेनरी ने कहा, \"ओलिवर एक धूर्त नहीं है\"। विलियम ने asserted: \"ईथन एक शूरवीर है यदि और केवल यदि एवा एक शूरवीर है\"। जैसे ओलिवर ने कहा, \"एवा एक शूरवीर है या हेनरी एक धूर्त है\"। एवा के अनुसार, \"हेनरी एक धूर्त नहीं है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ईथन एक शूरवीर है  \n(2) हेनरी एक शूरवीर है  \n(3) विलियम एक शूरवीर है  \n(4) ओलिवर एक शूरवीर है  \n(5) एवा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: सैमुएल, हार्पर, लुकास, ओवेन, और क्लोई। \"हार्पर एक शूरवीर है\" - सैमुएल। हार्पर ने टिप्पणी की, \"सैमुएल एक धूर्त है या लुकास एक धूर्त है\"। \"सैमुएल एक धूर्त है और क्लोई एक शूरवीर है,\" लुकास ने घोषित किया। \"सैमुएल एक धूर्त है यदि और केवल यदि हार्पर एक धूर्त है,\" ओवेन ने घोषित किया। क्लोई ने कहा, \"लुकास एक धूर्त है या ओवेन एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक शूरवीर है  \n(2) हार्पर एक शूरवीर है  \n(3) लुकास एक धूर्त है  \n(4) ओवेन एक शूरवीर है  \n(5) क्लोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: लोगन, मिया, इसाबेला, माइकल, और ओलिवर। लोगन ने कहा, \"इसाबेला एक धूर्त है और माइकल एक शूरवीर है।\" \"ओलिवर एक शूरवीर नहीं है,\" मिया ने कहा। इसाबेला ने नोट किया, \"ओलिवर एक धूर्त है यदि और केवल यदि ओलिवर एक शूरवीर है।\" माइकल ने आपको बताया कि मिया एक शूरवीर है और इसाबेला एक धूर्त है। ओलिवर के एक बयान में: \"लोगन एक धूर्त है यदि और केवल यदि मिया एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक धूर्त है  \n(2) मिया एक धूर्त है  \n(3) इसाबेला एक धूर्त है  \n(4) माइकल एक धूर्त है  \n(5) ओलिवर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: आरिया, याकूब, मेसन, इसाबेला, और एवलिन। जैसे कि आरिया ने कहा, \"याकूब एक शूरवीर है और एवलिन एक धूर्त है\"। याकूब ने टिप्पणी की, \"मेसन एक धूर्त है और एवलिन एक शूरवीर है\"। मेसन ने कहा: \"अगर इसाबेला एक शूरवीर है तो एवलिन एक धूर्त है\"। \"एवलिन एक शूरवीर है या इसाबेला एक शूरवीर है,\" इसाबेला ने उल्लेख किया। एवलिन ने कहा, \"मेसन एक शूरवीर है यदि और केवल यदि याकूब एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) आरिया एक धूर्त है  \n(2) याकूब एक शूरवीर है  \n(3) मेसन एक धूर्त है  \n(4) इसाबेला एक शूरवीर है  \n(5) एवलिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: सोफिया, विलियम, पेनलोप, मिया, और ओवेन। सोफिया ने कहा, \"ओवेन एक शूरवीर है यदि और केवल यदि पेनलोप एक शूरवीर है।\" विलियम के अनुसार, \"यदि सोफिया एक धूर्त है तो पेनलोप एक धूर्त है।\" पेनलोप ने कहा कि विलियम एक धूर्त नहीं है। मिया ने कहा: \"सोफिया एक धूर्त है या विलियम एक शूरवीर है।\" ओवेन ने कहा, \"विलियम एक धूर्त नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) विलियम एक शूरवीर है  \n(3) पेनलोप एक शूरवीर है  \n(4) मिया एक शूरवीर है  \n(5) ओवेन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: हार्पर, सोफिया, शार्लट, लियम, और मेसन। \"मेसन एक शूरवीर है यदि और केवल यदि लियम एक शूरवीर है,\" हार्पर ने कहा। सोफिया के एक बयान में: \"हार्पर एक शूरवीर है यदि और केवल यदि मेसन एक धूर्त है\"। शार्लट ने टिप्पणी की, \"हार्पर एक धूर्त है या मेसन एक शूरवीर है\"। लियम के शब्दों में: \"मेसन एक धूर्त है और हार्पर एक धूर्त है\"। मेसन ने आपको बताया कि हार्पर एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) हार्पर एक धूर्त है  \n(2) सोफिया एक धूर्त है  \n(3) शार्लट एक शूरवीर है  \n(4) लियम एक शूरवीर है  \n(5) मेसन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: मैथ्यू, एला, राइली, एवा, और ओलिविया। मैथ्यू के एक बयान में: \"एला एक धूर्त है यदि और केवल यदि एवा एक धूर्त है\"। एला ने कहा, \"राइली एक धूर्त नहीं है\"। राइली के शब्दों में: \"ओलिविया एक शूरवीर है\"। एवा के अनुसार, \"एवा एक शूरवीर है यदि और केवल यदि मैथ्यू एक शूरवीर है\"। ओलिविया के अनुसार, \"एला एक धूर्त है या एला एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक शूरवीर है  \n(2) एला एक शूरवीर है  \n(3) राइली एक शूरवीर है  \n(4) एवा एक शूरवीर है  \n(5) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: डेविड, सेबेस्टियन, लोगन, ज़ोई, और एवा। डेविड ने टिप्पणी की, \"ज़ोई एक शूरवीर है और लोगन एक शूरवीर है\"। सेबेस्टियन ने टिप्पणी की, \"ज़ोई एक शूरवीर है यदि और केवल यदि लोगन एक शूरवीर है\"। लोगन ने आपको बताया कि एवा एक शूरवीर है और सेबेस्टियन एक शूरवीर है। \"यदि ज़ोई एक शूरवीर है तो सेबेस्टियन एक शूरवीर है,\" ज़ोई ने कहा। एवा ने व्यक्त किया कि ज़ोई एक शूरवीर है यदि और केवल यदि एवा एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक शूरवीर है  \n(2) सेबेस्टियन एक शूरवीर है  \n(3) लोगन एक शूरवीर है  \n(4) ज़ोई एक शूरवीर है  \n(5) एवा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: यूसुफ, बेंजामिन, एवा, स्कारलेट, और हेनरी। यूसुफ ने आपको बताया कि एवा एक धूर्त है और एवा एक शूरवीर है। बेंजामिन ने कहा: \"यदि हेनरी एक शूरवीर है तो एवा एक धूर्त है\"। जैसा कि एवा ने कहा, \"हेनरी एक शूरवीर है या स्कारलेट एक धूर्त है\"। स्कारलेट ने आपको बताया कि यूसुफ एक धूर्त नहीं है। \"बेंजामिन एक धूर्त है यदि और केवल यदि हेनरी एक शूरवीर है,\" हेनरी ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) यूसुफ एक धूर्त है  \n(2) बेंजामिन एक धूर्त है  \n(3) एवा एक शूरवीर है  \n(4) स्कारलेट एक धूर्त है  \n(5) हेनरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: हार्पर, राइली, लोगन, बेंजामिन, और यूसुफ। हार्पर ने कहा: \"बेंजामिन एक धूर्त है या यूसुफ एक धूर्त है\"। राइली के शब्दों में: \"अगर लोगन एक धूर्त है तो बेंजामिन एक शूरवीर है\"। लोगन ने कहा, \"बेंजामिन एक धूर्त है और लोगन एक शूरवीर है\"। बेंजामिन ने कहा, \"हार्पर एक शूरवीर है\"। यूसुफ के अनुसार, \"लोगन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक शूरवीर है  \n(2) राइली एक शूरवीर है  \n(3) लोगन एक धूर्त है  \n(4) बेंजामिन एक शूरवीर है  \n(5) यूसुफ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: लुकास, विलियम, मेसन, हेनरी, और यूसुफ। लुकास को यह कहते हुए सुना गया, \"यूसुफ एक धूर्त है या मेसन एक धूर्त है\"। विलियम ने कहा, \"यूसुफ एक धूर्त है या मेसन एक शूरवीर है\"। जैसे मेसन ने कहा, \"हेनरी एक शूरवीर नहीं है\"। हेनरी ने कहा कि यूसुफ एक शूरवीर है। यूसुफ ने कहा कि अगर हेनरी एक शूरवीर है तो मेसन एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक शूरवीर है  \n(2) विलियम एक धूर्त है  \n(3) मेसन एक धूर्त है  \n(4) हेनरी एक शूरवीर है  \n(5) यूसुफ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: क्लोई, माइकल, एम्मा, एला, और अलेक्जेंडर। क्लोई ने कहा कि एला एक शूरवीर है या क्लोई एक शूरवीर है। \"अगर अलेक्जेंडर एक धूर्त है तो क्लोई एक धूर्त है\" - माइकल। एम्मा के एक बयान में: \"अलेक्जेंडर एक शूरवीर है या अलेक्जेंडर एक धूर्त है\"। एला ने कहा, \"अगर माइकल एक शूरवीर है तो अलेक्जेंडर एक शूरवीर है\"। अलेक्जेंडर ने आपको बताया कि एम्मा एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) क्लोई एक शूरवीर है  \n(2) माइकल एक शूरवीर है  \n(3) एम्मा एक शूरवीर है  \n(4) एला एक शूरवीर है  \n(5) अलेक्जेंडर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ज़ोई, शार्लट, मिया, याकूब, और ओवेन। \"अगर मिया एक धूर्त है तो शार्लट एक शूरवीर है,\" ज़ोई ने दावा किया। शार्लट के अनुसार, \"याकूब एक शूरवीर है यदि और केवल यदि मिया एक धूर्त है\"। मिया ने कहा, \"ओवेन एक शूरवीर है\"। याकूब ने कहा कि याकूब एक शूरवीर है और ज़ोई एक शूरवीर है। ओवेन ने कहा, \"ज़ोई एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ज़ोई एक शूरवीर है  \n(2) शार्लट एक शूरवीर है  \n(3) मिया एक धूर्त है  \n(4) याकूब एक शूरवीर है  \n(5) ओवेन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: लुकास, एलिज़ाबेथ, औरोरा, ऐडन, और सैमुएल। \"एलिज़ाबेथ शूरवीर नहीं है,\" लुकास ने कहा। एलिज़ाबेथ के शब्दों में: \"औरोरा शूरवीर नहीं है\"। औरोरा के अनुसार, \"यदि औरोरा शूरवीर है तो एलिज़ाबेथ धूर्त है\"। ऐडन ने कहा: \"लुकास धूर्त है या एलिज़ाबेथ शूरवीर है\"। सैमुएल को यह कहते हुए सुना गया, \"एलिज़ाबेथ धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक शूरवीर है  \n(2) एलिज़ाबेथ एक धूर्त है  \n(3) औरोरा एक शूरवीर है  \n(4) ऐडन एक धूर्त है  \n(5) सैमुएल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: डैनियल, विक्टोरिया, बेंजामिन, मिया, और विलियम। डैनियल ने कहा: \"मिया एक शूरवीर है और बेंजामिन एक शूरवीर है\"। \"अगर बेंजामिन एक शूरवीर है तो बेंजामिन एक धूर्त है,\" विक्टोरिया ने दावा किया। बेंजामिन ने कहा, \"डैनियल एक धूर्त नहीं है।\" मिया ने टिप्पणी की, \"विक्टोरिया एक शूरवीर है यदि और केवल यदि डैनियल एक शूरवीर है\"। \"अगर विक्टोरिया एक धूर्त है तो मिया एक धूर्त है,\" विलियम ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक धूर्त है  \n(2) विक्टोरिया एक शूरवीर है  \n(3) बेंजामिन एक धूर्त है  \n(4) मिया एक धूर्त है  \n(5) विलियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: बेंजामिन, एमिली, जेम्स, एवलिन, और लुकास। \"एमिली एक धूर्त है या एवलिन एक शूरवीर है\" - बेंजामिन। एमिली के एक बयान में: \"एवलिन एक धूर्त है या एमिली एक शूरवीर है\"। जेम्स के अनुसार, \"एमिली एक धूर्त है या लुकास एक शूरवीर है\"। एवलिन ने कहा: \"अगर एमिली एक धूर्त है तो एमिली एक शूरवीर है\"। लुकास के शब्दों में: \"एमिली एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक शूरवीर है  \n(2) एमिली एक शूरवीर है  \n(3) जेम्स एक धूर्त है  \n(4) एवलिन एक शूरवीर है  \n(5) लुकास एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: लिली, लोगन, अमेलिया, लियम, और एवा। \"अगर एवा एक शूरवीर है तो अमेलिया एक शूरवीर है,\" लिली ने दावा किया। \"अमेलिया एक शूरवीर है यदि और केवल यदि एवा एक धूर्त है,\" लोगन ने उल्लेख किया। अमेलिया के शब्दों में: \"लोगन एक शूरवीर है यदि और केवल यदि लियम एक धूर्त है\"। लियम ने व्यक्त किया कि लिली एक शूरवीर है और एवा एक शूरवीर है। एवा ने व्यक्त किया कि अगर लोगन एक शूरवीर है तो लिली एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लिली एक शूरवीर है  \n(2) लोगन एक धूर्त है  \n(3) अमेलिया एक शूरवीर है  \n(4) लियम एक शूरवीर है  \n(5) एवा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: मिया, पेनलोप, हार्पर, माइकल, और सोफिया। मिया ने कहा, \"मिया एक शूरवीर है या सोफिया एक शूरवीर है\"। \"अगर मिया एक शूरवीर है तो हार्पर एक शूरवीर है,\" पेनलोप ने घोषणा की। हार्पर के अनुसार, \"अगर माइकल एक शूरवीर है तो मिया एक शूरवीर है\"। जैसे माइकल ने कहा, \"अगर हार्पर एक धूर्त है तो पेनलोप एक शूरवीर है\"। सोफिया ने कहा: \"माइकल एक धूर्त नहीं है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) मिया एक शूरवीर है  \n(2) पेनलोप एक शूरवीर है  \n(3) हार्पर एक शूरवीर है  \n(4) माइकल एक शूरवीर है  \n(5) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एवरी, क्लोई, डैनियल, अबिगेल, और एलिज़ाबेथ। \"अगर क्लोई एक धूर्त है तो डैनियल एक शूरवीर है,\" एवरी ने घोषणा की। \"एवरी एक धूर्त है और डैनियल एक शूरवीर है,\" क्लोई ने दावा किया। \"अगर एलिज़ाबेथ एक धूर्त है तो क्लोई एक शूरवीर है,\" डैनियल ने दावा किया। अबिगेल ने remarked किया, \"डैनियल एक धूर्त है यदि और केवल यदि एवरी एक धूर्त है।\" \"एवरी एक धूर्त है यदि और केवल यदि एलिज़ाबेथ एक शूरवीर है\" - एलिज़ाबेथ। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक धूर्त है  \n(2) क्लोई एक धूर्त है  \n(3) डैनियल एक धूर्त है  \n(4) अबिगेल एक शूरवीर है  \n(5) एलिज़ाबेथ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: सेबेस्टियन, ज़ोई, अलेक्जेंडर, राइली, और नूह। जैसे सेबेस्टियन ने कहा, \"अगर अलेक्जेंडर एक धूर्त है तो ज़ोई एक धूर्त है।\" \"नूह एक शूरवीर है या सेबेस्टियन एक शूरवीर है,\" ज़ोई ने दावा किया। अलेक्जेंडर ने नोट किया, \"अगर सेबेस्टियन एक धूर्त है तो सेबेस्टियन एक शूरवीर है।\" राइली ने टिप्पणी की, \"सेबेस्टियन एक शूरवीर है।\" नूह ने कहा, \"ज़ोई एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सेबेस्टियन एक शूरवीर है  \n(2) ज़ोई एक शूरवीर है  \n(3) अलेक्जेंडर एक शूरवीर है  \n(4) राइली एक शूरवीर है  \n(5) नूह एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एवा, ओलिवर, विक्टोरिया, अमेलिया, और लुकास। एवा ने कहा, \"ओलिवर एक शूरवीर है और विक्टोरिया एक धूर्त है\"। ओलिवर ने कहा, \"लुकास एक शूरवीर है यदि और केवल यदि विक्टोरिया एक शूरवीर है\"। विक्टोरिया ने कहा, \"अमेलिया एक शूरवीर नहीं है\"। अमेलिया ने आपको बताया कि एवा एक शूरवीर है और विक्टोरिया एक धूर्त है। लुकास के शब्दों में: \"यदि लुकास एक शूरवीर है तो विक्टोरिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक धूर्त है  \n(2) ओलिवर एक शूरवीर है  \n(3) विक्टोरिया एक शूरवीर है  \n(4) अमेलिया एक धूर्त है  \n(5) लुकास एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: विक्टोरिया, मेसन, अबिगेल, सैमुएल, और औरोरा। विक्टोरिया ने कहा: \"विक्टोरिया एक शूरवीर है यदि और केवल यदि अबिगेल एक शूरवीर है\"। \"सैमुएल एक धूर्त है यदि और केवल यदि विक्टोरिया एक धूर्त है\" - मेसन। अबिगेल के एक बयान में: \"सैमुएल एक शूरवीर है\"। सैमुएल ने कहा, \"विक्टोरिया एक शूरवीर है और अबिगेल एक शूरवीर है\"। औरोरा ने कहा कि सैमुएल एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विक्टोरिया एक शूरवीर है  \n(2) मेसन एक शूरवीर है  \n(3) अबिगेल एक शूरवीर है  \n(4) सैमुएल एक शूरवीर है  \n(5) औरोरा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: सोफिया, बेंजामिन, यूसुफ, विक्टोरिया, और अलेक्जेंडर। सोफिया ने कहा: \"यूसुफ शूरवीर नहीं है\"। बेंजामिन ने कहा, \"यूसुफ धूर्त है।\" यूसुफ ने आपको बताया कि अगर अलेक्जेंडर धूर्त है तो सोफिया धूर्त है। विक्टोरिया के शब्दों में: \"यूसुफ धूर्त है और बेंजामिन धूर्त है\"। अलेक्जेंडर ने कहा, \"विक्टोरिया शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) बेंजामिन एक धूर्त है  \n(3) यूसुफ एक शूरवीर है  \n(4) विक्टोरिया एक धूर्त है  \n(5) अलेक्जेंडर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: अबिगेल, एलिज़ाबेथ, यूसुफ, बेंजामिन, और सोफिया। अबिगेल ने कहा, \"अबिगेल एक शूरवीर है और सोफिया एक शूरवीर है।\" जैसा कि एलिज़ाबेथ ने कहा, \"अबिगेल एक शूरवीर है यदि और केवल यदि अबिगेल एक धूर्त है।\" यूसुफ ने कहा, \"बेंजामिन एक धूर्त है या अबिगेल एक शूरवीर है।\" \"सोफिया एक धूर्त है और सोफिया एक शूरवीर है,\" बेंजामिन ने घोषणा की। जैसा कि सोफिया ने कहा, \"यूसुफ एक धूर्त है यदि और केवल यदि अबिगेल एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अबिगेल एक धूर्त है  \n(2) एलिज़ाबेथ एक धूर्त है  \n(3) यूसुफ एक शूरवीर है  \n(4) बेंजामिन एक धूर्त है  \n(5) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: इसाबेला, एमिली, एला, सैमुएल, और अमेलिया। इसाबेला ने कहा, \"सैमुएल एक शूरवीर है या सैमुएल एक धूर्त है\"। \"अमेलिया एक धूर्त है या एला एक शूरवीर है,\" एमिली ने घोषणा की। एला ने कहा, \"एमिली एक धूर्त नहीं है\"। सैमुएल को यह कहते हुए सुना गया, \"एला एक धूर्त नहीं है\"। \"सैमुएल एक धूर्त है और एला एक शूरवीर है,\" अमेलिया ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक शूरवीर है  \n(2) एमिली एक शूरवीर है  \n(3) एला एक शूरवीर है  \n(4) सैमुएल एक शूरवीर है  \n(5) अमेलिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: विलियम, मेसन, यूसुफ, लुकास, और विक्टोरिया। विलियम ने कहा, \"लुकास एक धूर्त है या मेसन एक शूरवीर है\"। मेसन ने कहा: \"विक्टोरिया एक शूरवीर है\"। \"अगर मेसन एक धूर्त है तो मेसन एक शूरवीर है,\" यूसुफ ने दावा किया। \"विक्टोरिया एक शूरवीर है और विलियम एक शूरवीर है,\" लुकास ने घोषणा की। विक्टोरिया ने टिप्पणी की, \"अगर लुकास एक शूरवीर है तो विलियम एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) मेसन एक शूरवीर है  \n(3) यूसुफ एक शूरवीर है  \n(4) लुकास एक शूरवीर है  \n(5) विक्टोरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: स्कारलेट, माइकल, ईथन, ग्रेस, और यूसुफ। स्कारलेट के अनुसार, \"यूसुफ एक शूरवीर है यदि और केवल यदि ईथन एक शूरवीर है\"। \"ईथन एक शूरवीर है या यूसुफ एक धूर्त है\" - माइकल। \"स्कारलेट एक शूरवीर नहीं है,\" ईथन ने दावा किया। ग्रेस ने remarked किया, \"माइकल एक शूरवीर नहीं है\"। \"यदि स्कारलेट एक शूरवीर है तो माइकल एक धूर्त है\" - यूसुफ। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) स्कारलेट एक शूरवीर है  \n(2) माइकल एक शूरवीर है  \n(3) ईथन एक धूर्त है  \n(4) ग्रेस एक धूर्त है  \n(5) यूसुफ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा आबाद है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: अलेक्जेंडर, जेम्स, सोफिया, क्लोई, और मिया। अलेक्जेंडर ने कहा, \"मिया एक शूरवीर है\"। जेम्स ने कहा, \"क्लोई एक धूर्त है या अलेक्जेंडर एक धूर्त है\"। \"क्लोई एक धूर्त है,\" सोफिया ने घोषित किया। क्लोई ने कहा, \"जेम्स एक शूरवीर है और अलेक्जेंडर एक शूरवीर है\"। मिया ने कहा कि क्लोई एक शूरवीर है यदि और केवल यदि सोफिया एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अलेक्जेंडर एक धूर्त है  \n(2) जेम्स एक शूरवीर है  \n(3) सोफिया एक शूरवीर है  \n(4) क्लोई एक धूर्त है  \n(5) मिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ज़ोई, सोफिया, माइकल, मैथ्यू, और लोगन। ज़ोई के शब्दों में: \"लोगन एक शूरवीर है\"। सोफिया के शब्दों में: \"लोगन एक शूरवीर है या लोगन एक धूर्त है\"। \"मैथ्यू एक शूरवीर है,\" माइकल ने दावा किया। \"अगर ज़ोई एक शूरवीर है तो सोफिया एक शूरवीर है,\" मैथ्यू ने उल्लेख किया। लोगन ने कहा कि मैथ्यू एक धूर्त है या माइकल एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ज़ोई एक धूर्त है  \n(2) सोफिया एक शूरवीर है  \n(3) माइकल एक शूरवीर है  \n(4) मैथ्यू एक शूरवीर है  \n(5) लोगन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: जेम्स, सोफिया, लियम, ऐडन, और एला। जैसे जेम्स ने कहा, \"सोफिया एक शूरवीर है यदि और केवल यदि सोफिया एक धूर्त है।\" \"एला एक शूरवीर नहीं है,\" सोफिया ने दावा किया। \"ऐडन एक शूरवीर है,\" लियम ने घोषणा की। ऐडन ने कहा कि सोफिया एक शूरवीर है या एला एक धूर्त है। एला ने टिप्पणी की, \"लियम एक धूर्त है और सोफिया एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक धूर्त है  \n(2) सोफिया एक शूरवीर है  \n(3) लियम एक शूरवीर है  \n(4) ऐडन एक शूरवीर है  \n(5) एला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: हार्पर, इसाबेला, मिया, एम्मा, और जेम्स। जैसे हार्पर ने कहा, \"इसाबेला एक धूर्त है या इसाबेला एक शूरवीर है\"। इसाबेला ने कहा, \"हार्पर एक शूरवीर है या जेम्स एक शूरवीर है\"। \"एम्मा एक धूर्त नहीं है,\" मिया ने कहा। \"अगर मिया एक धूर्त है तो हार्पर एक शूरवीर है,\" एम्मा ने दावा किया। जेम्स ने asserted किया: \"अगर इसाबेला एक शूरवीर है तो मिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक शूरवीर है  \n(2) इसाबेला एक शूरवीर है  \n(3) मिया एक शूरवीर है  \n(4) एम्मा एक शूरवीर है  \n(5) जेम्स एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ओवेन, विक्टोरिया, नूह, राइली, और लिली। \"ओवेन एक शूरवीर है यदि और केवल यदि विक्टोरिया एक शूरवीर है,\" ओवेन ने कहा। विक्टोरिया ने कहा कि यदि नूह एक शूरवीर है तो नूह एक धूर्त है। नूह के अनुसार, \"ओवेन एक धूर्त है यदि और केवल यदि राइली एक धूर्त है\"। राइली ने कहा कि राइली एक शूरवीर है और नूह एक शूरवीर है। लिली ने कहा, \"यदि नूह एक शूरवीर है तो ओवेन एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओवेन एक शूरवीर है  \n(2) विक्टोरिया एक शूरवीर है  \n(3) नूह एक धूर्त है  \n(4) राइली एक धूर्त है  \n(5) लिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एम्मा, लियम, लिली, क्लोई, और ज़ोई। एम्मा के शब्दों में: \"लियम एक धूर्त है और क्लोई एक धूर्त है\"। लियम ने कहा कि ज़ोई एक शूरवीर है। लिली ने टिप्पणी की, \"ज़ोई एक धूर्त नहीं है\"। क्लोई के अनुसार, \"लियम एक धूर्त नहीं है\"। \"अगर ज़ोई एक शूरवीर है तो लियम एक शूरवीर है,\" ज़ोई ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एम्मा एक धूर्त है  \n(2) लियम एक शूरवीर है  \n(3) लिली एक शूरवीर है  \n(4) क्लोई एक शूरवीर है  \n(5) ज़ोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एमिली, औरोरा, ज़ोई, ओलिविया, और नूह। एमिली को यह कहते हुए सुना गया, \"यदि औरोरा एक धूर्त है तो ओलिविया एक शूरवीर है\"। औरोरा ने कहा कि ओलिविया एक शूरवीर नहीं है। ज़ोई के एक बयान में: \"औरोरा एक धूर्त है यदि और केवल यदि ओलिविया एक शूरवीर है\"। ओलिविया ने कहा, \"एमिली एक शूरवीर है यदि और केवल यदि नूह एक धूर्त है।\" नूह ने कहा, \"औरोरा एक शूरवीर है या ज़ोई एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक शूरवीर है  \n(2) औरोरा एक शूरवीर है  \n(3) ज़ोई एक शूरवीर है  \n(4) ओलिविया एक धूर्त है  \n(5) नूह एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एमिली, ओलिवर, इसाबेला, ओलिविया, और सेबेस्टियन। एमिली के एक बयान में: \"ओलिविया एक धूर्त है\"। ओलिवर ने कहा, \"इसाबेला एक धूर्त है।\" इसाबेला ने कहा कि एमिली एक शूरवीर है यदि और केवल यदि ओलिवर एक धूर्त है। ओलिविया ने नोट किया, \"ओलिवर एक शूरवीर है\"। \"यदि सेबेस्टियन एक शूरवीर है तो ओलिवर एक धूर्त है,\" सेबेस्टियन ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक शूरवीर है  \n(2) ओलिवर एक धूर्त है  \n(3) इसाबेला एक शूरवीर है  \n(4) ओलिविया एक धूर्त है  \n(5) सेबेस्टियन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: सोफिया, एमिली, एवा, डेविड, और जैक्सन। सोफिया ने कहा: \"एवा एक शूरवीर है और सोफिया एक शूरवीर है\"। एमिली ने नोट किया, \"सोफिया एक धूर्त है यदि और केवल यदि एवा एक धूर्त है\"। एवा के अनुसार, \"एमिली एक शूरवीर है या सोफिया एक शूरवीर है\"। डेविड ने कहा कि सोफिया एक धूर्त है और जैक्सन एक शूरवीर है। जैक्सन को यह कहते हुए सुना गया, \"एमिली एक शूरवीर है यदि और केवल यदि सोफिया एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) एमिली एक शूरवीर है  \n(3) एवा एक शूरवीर है  \n(4) डेविड एक धूर्त है  \n(5) जैक्सन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: लोगन, अबिगेल, लियम, हेनरी, और नूह। लोगन ने कहा, \"नूह एक धूर्त नहीं है\"। अबिगेल ने टिप्पणी की, \"अगर लोगन एक शूरवीर है तो हेनरी एक शूरवीर है\"। लियम ने कहा कि \"अगर हेनरी एक शूरवीर है तो अबिगेल एक शूरवीर है\"। हेनरी के शब्दों में: \"लियम एक शूरवीर है यदि और केवल यदि अबिगेल एक धूर्त है\"। \"अगर लियम एक शूरवीर है तो नूह एक शूरवीर है\" - नूह। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक धूर्त है  \n(2) अबिगेल एक शूरवीर है  \n(3) लियम एक शूरवीर है  \n(4) हेनरी एक धूर्त है  \n(5) नूह एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एवा, इसाबेला, ज़ोई, लिली, और एम्मा। \"एवा एक शूरवीर है या लिली एक शूरवीर है,\" एवा ने कहा। \"लिली एक धूर्त है,\" इसाबेला ने घोषित किया। ज़ोई ने आपको बताया कि इसाबेला एक शूरवीर है यदि और केवल यदि एवा एक धूर्त है। लिली को यह कहते हुए सुना गया, \"एवा एक शूरवीर है या एम्मा एक शूरवीर है।\" \"ज़ोई एक शूरवीर है,\" एम्मा ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक शूरवीर है  \n(2) इसाबेला एक धूर्त है  \n(3) ज़ोई एक शूरवीर है  \n(4) लिली एक शूरवीर है  \n(5) एम्मा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: विलियम, एवा, ऐडन, अलेक्जेंडर, और ल्यूक। विलियम ने कहा कि अगर अलेक्जेंडर एक धूर्त है तो विलियम एक शूरवीर है। एवा ने कहा कि अगर अलेक्जेंडर एक शूरवीर है तो अलेक्जेंडर एक धूर्त है। ऐडन ने टिप्पणी की, \"एवा एक धूर्त है या विलियम एक शूरवीर है\"। जैसे अलेक्जेंडर ने कहा, \"ऐडन एक धूर्त है\"। \"ऐडन एक शूरवीर है,\" ल्यूक ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) एवा एक शूरवीर है  \n(3) ऐडन एक शूरवीर है  \n(4) अलेक्जेंडर एक धूर्त है  \n(5) ल्यूक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: जैक्सन, ल्यूक, एमिली, याकूब, और औरोरा। जैक्सन ने कहा, \"एमिली एक शूरवीर है या ल्यूक एक धूर्त है\"। ल्यूक को यह कहते हुए सुना गया, \"औरोरा एक शूरवीर है और औरोरा एक धूर्त है\"। एमिली के एक बयान में: \"अगर याकूब एक शूरवीर है तो ल्यूक एक धूर्त है\"। याकूब ने कहा, \"अगर एमिली एक शूरवीर है तो जैक्सन एक शूरवीर है\"। औरोरा ने कहा, \"जैक्सन एक शूरवीर है या एमिली एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक शूरवीर है  \n(2) ल्यूक एक धूर्त है  \n(3) एमिली एक शूरवीर है  \n(4) याकूब एक शूरवीर है  \n(5) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: लुकास, सेबेस्टियन, सैमुएल, अमेलिया, और ईथन। लुकास को यह कहते हुए सुना गया, \"ईथन धूर्त नहीं है\"। सेबेस्टियन ने आपको बताया कि ईथन एक शूरवीर है और सेबेस्टियन एक शूरवीर है। सैमुएल ने कहा, \"अगर सैमुएल एक शूरवीर है तो सेबेस्टियन एक धूर्त है\"। अमेलिया के शब्दों में: \"ईथन धूर्त नहीं है\"। \"सेबेस्टियन एक धूर्त है,\" ईथन ने उल्लेख किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक शूरवीर है  \n(2) सेबेस्टियन एक धूर्त है  \n(3) सैमुएल एक शूरवीर है  \n(4) अमेलिया एक शूरवीर है  \n(5) ईथन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: अमेलिया, एवा, शार्लट, एला, और सेबेस्टियन। अमेलिया को यह कहते हुए सुना गया, \"सेबेस्टियन एक धूर्त है यदि और केवल यदि शार्लट एक धूर्त है\"। एवा ने कहा, \"एवा एक शूरवीर है या शार्लट एक धूर्त है\"। शार्लट ने कहा, \"सेबेस्टियन एक शूरवीर नहीं है\"। \"अमेलिया एक धूर्त है और एवा एक शूरवीर है,\" एला ने दावा किया। सेबेस्टियन ने कहा, \"यदि एला एक शूरवीर है तो एवा एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक धूर्त है  \n(2) एवा एक शूरवीर है  \n(3) शार्लट एक धूर्त है  \n(4) एला एक शूरवीर है  \n(5) सेबेस्टियन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: जैक्सन, एलिज़ाबेथ, सेबेस्टियन, विलियम, और लुकास। जैक्सन ने कहा कि विलियम एक धूर्त नहीं है। एलिज़ाबेथ ने कहा, \"विलियम एक शूरवीर है या जैक्सन एक शूरवीर है\"। सेबेस्टियन ने कहा कि जैक्सन एक शूरवीर है यदि और केवल यदि एलिज़ाबेथ एक धूर्त है। विलियम के शब्दों में: \"लुकास एक धूर्त है और जैक्सन एक शूरवीर है\"। लुकास के शब्दों में: \"विलियम एक शूरवीर है और एलिज़ाबेथ एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक धूर्त है  \n(2) एलिज़ाबेथ एक धूर्त है  \n(3) सेबेस्टियन एक धूर्त है  \n(4) विलियम एक धूर्त है  \n(5) लुकास एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एमिली, इसाबेला, सोफिया, सैमुएल, और अमेलिया। जैसे कि एमिली ने कहा, \"सैमुएल एक धूर्त है या इसाबेला एक धूर्त है\"। \"सैमुएल एक धूर्त नहीं है,\" इसाबेला ने उल्लेख किया। सोफिया ने कहा कि एमिली एक धूर्त है और अमेलिया एक धूर्त है। सैमुएल के एक बयान में: \"अगर सैमुएल एक शूरवीर है तो अमेलिया एक धूर्त है\"। अमेलिया के अनुसार, \"अगर एमिली एक धूर्त है तो एमिली एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक धूर्त है  \n(2) इसाबेला एक शूरवीर है  \n(3) सोफिया एक शूरवीर है  \n(4) सैमुएल एक शूरवीर है  \n(5) अमेलिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ओलिविया, इसाबेला, नूह, क्लोई, और एवरी। ओलिविया ने कहा कि क्लोई एक धूर्त है। इसाबेला के एक बयान में: \"नूह एक शूरवीर है यदि और केवल यदि एवरी एक धूर्त है\"। नूह ने कहा, \"एवरी एक धूर्त नहीं है।\" जैसे कि क्लोई ने कहा, \"इसाबेला एक धूर्त है और नूह एक धूर्त है।\" एवरी के शब्दों में: \"ओलिविया एक धूर्त है या क्लोई एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक शूरवीर है  \n(2) इसाबेला एक धूर्त है  \n(3) नूह एक शूरवीर है  \n(4) क्लोई एक धूर्त है  \n(5) एवरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ओलिवर, मेसन, अलेक्जेंडर, इसाबेला, और राइली। ओलिवर ने कहा, \"राइली एक धूर्त है।\" \"अलेक्जेंडर एक शूरवीर नहीं है,\" मेसन ने कहा। \"राइली एक धूर्त है यदि और केवल यदि इसाबेला एक धूर्त है,\" अलेक्जेंडर ने दावा किया। इसाबेला ने asserted: \"ओलिवर एक धूर्त है।\" राइली के एक बयान में: \"ओलिवर एक शूरवीर है और ओलिवर एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिवर एक शूरवीर है  \n(2) मेसन एक धूर्त है  \n(3) अलेक्जेंडर एक शूरवीर है  \n(4) इसाबेला एक धूर्त है  \n(5) राइली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: स्कारलेट, ल्यूक, क्लोई, ग्रेस, और जैक। स्कारलेट ने कहा कि क्लोई एक धूर्त है यदि और केवल यदि क्लोई एक शूरवीर है। ल्यूक ने कहा कि यदि ल्यूक एक शूरवीर है तो ग्रेस एक शूरवीर है। क्लोई ने remarked किया, \"ल्यूक एक शूरवीर है या ग्रेस एक शूरवीर है\"। ग्रेस के एक बयान में: \"जैक एक शूरवीर है या ग्रेस एक शूरवीर है\"। जैक ने कहा, \"ल्यूक एक धूर्त है और ग्रेस एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) स्कारलेट एक धूर्त है  \n(2) ल्यूक एक शूरवीर है  \n(3) क्लोई एक शूरवीर है  \n(4) ग्रेस एक शूरवीर है  \n(5) जैक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: सेबेस्टियन, मैथ्यू, ओलिविया, मेसन, और बेंजामिन। सेबेस्टियन ने कहा, \"अगर मैथ्यू एक शूरवीर है तो ओलिविया एक शूरवीर है।\" \"मेसन एक धूर्त है या बेंजामिन एक धूर्त है,\" मैथ्यू ने दावा किया। ओलिविया के एक बयान में: \"सेबेस्टियन एक शूरवीर है या बेंजामिन एक धूर्त है।\" मेसन ने टिप्पणी की, \"सेबेस्टियन एक धूर्त है।\" \"ओलिविया एक शूरवीर है या ओलिविया एक धूर्त है,\" बेंजामिन ने उल्लेख किया। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सेबेस्टियन एक शूरवीर है  \n(2) मैथ्यू एक शूरवीर है  \n(3) ओलिविया एक शूरवीर है  \n(4) मेसन एक धूर्त है  \n(5) बेंजामिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ल्यूक, ओलिविया, आरिया, हेनरी, और अमेलिया। \"हेनरी एक शूरवीर है और ओलिविया एक शूरवीर है,\" ल्यूक ने दावा किया। \"अमेलिया एक धूर्त है यदि और केवल यदि आरिया एक धूर्त है\" - ओलिविया। आरिया के शब्दों में: \"ल्यूक एक धूर्त है यदि और केवल यदि हेनरी एक धूर्त है\"। हेनरी ने आपको बताया कि यदि ल्यूक एक शूरवीर है तो आरिया एक शूरवीर है। अमेलिया ने नोट किया, \"आरिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) ओलिविया एक शूरवीर है  \n(3) आरिया एक शूरवीर है  \n(4) हेनरी एक शूरवीर है  \n(5) अमेलिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ईथन, मेसन, विलियम, यूसुफ, और अमेलिया। जैसा कि ईथन ने कहा, \"अगर यूसुफ एक धूर्त है तो मेसन एक धूर्त है।\" \"ईथन एक शूरवीर है यदि और केवल यदि ईथन एक धूर्त है,\" मेसन ने उल्लेख किया। \"अमेलिया एक शूरवीर है यदि और केवल यदि विलियम एक शूरवीर है,\" विलियम ने घोषित किया। \"विलियम एक धूर्त नहीं है,\" यूसुफ ने उल्लेख किया। अमेलिया के शब्दों में: \"ईथन एक शूरवीर है और यूसुफ एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक शूरवीर है  \n(2) मेसन एक धूर्त है  \n(3) विलियम एक धूर्त है  \n(4) यूसुफ एक धूर्त है  \n(5) अमेलिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: मेसन, ओलिवर, हेनरी, लिली, और लियम। जैसे मेसन ने कहा, \"लिली धूर्त नहीं है\"। ओलिवर के शब्दों में: \"लिली एक धूर्त है या लियम एक शूरवीर है\"। हेनरी ने कहा: \"लियम एक शूरवीर है और मेसन एक शूरवीर है\"। लिली के बयान में: \"ओलिवर एक धूर्त है\"। जैसे लियम ने कहा, \"हेनरी एक धूर्त है या ओलिवर एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) ओलिवर एक शूरवीर है  \n(3) हेनरी एक धूर्त है  \n(4) लिली एक धूर्त है  \n(5) लियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ऐडन, माइकल, क्लोई, अलेक्जेंडर, और नूह। ऐडन के अनुसार, \"ऐडन एक शूरवीर है या अलेक्जेंडर एक धूर्त है\"। \"ऐडन एक शूरवीर है यदि और केवल यदि क्लोई एक शूरवीर है,\" माइकल ने घोषणा की। क्लोई ने कहा, \"माइकल एक शूरवीर है यदि और केवल यदि नूह एक धूर्त है।\" अलेक्जेंडर के एक बयान में: \"क्लोई एक शूरवीर है और क्लोई एक धूर्त है\"। नूह के अनुसार, \"माइकल एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक शूरवीर है  \n(2) माइकल एक शूरवीर है  \n(3) क्लोई एक शूरवीर है  \n(4) अलेक्जेंडर एक धूर्त है  \n(5) नूह एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: सैमुएल, लिली, मैथ्यू, इसाबेला, और शार्लट। सैमुएल ने कहा: \"मैथ्यू शूरवीर नहीं है\"। लिली के एक बयान में: \"मैथ्यू शूरवीर है और सैमुएल शूरवीर है\"। मैथ्यू ने आपको बताया कि अगर सैमुएल शूरवीर है तो इसाबेला शूरवीर है। इसाबेला को यह कहते हुए सुना गया, \"अगर शार्लट धूर्त है तो मैथ्यू धूर्त है\"। शार्लट ने कहा कि लिली धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक धूर्त है  \n(2) लिली एक धूर्त है  \n(3) मैथ्यू एक शूरवीर है  \n(4) इसाबेला एक शूरवीर है  \n(5) शार्लट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: यूसुफ, एवरी, एला, विक्टोरिया, और एमिली। \"अगर एमिली एक शूरवीर है तो एला एक शूरवीर है,\" यूसुफ ने कहा। जैसे एवरी ने कहा, \"एला एक शूरवीर है और एमिली एक शूरवीर है।\" जैसे एला ने कहा, \"एवरी एक धूर्त है यदि और केवल यदि एवरी एक शूरवीर है।\" \"अगर एमिली एक शूरवीर है तो एवरी एक धूर्त है,\" विक्टोरिया ने दावा किया। एमिली के एक बयान में: \"एवरी एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) यूसुफ एक शूरवीर है  \n(2) एवरी एक धूर्त है  \n(3) एला एक धूर्त है  \n(4) विक्टोरिया एक शूरवीर है  \n(5) एमिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ग्रेस, सोफिया, एवलिन, ओलिवर, और ईथन। ग्रेस ने कहा कि सोफिया एक धूर्त है। सोफिया ने remarked किया, \"ईथन एक शूरवीर है\"। एवलिन ने asserted किया: \"ईथन एक शूरवीर है\"। ओलिवर ने noted किया, \"सोफिया एक शूरवीर है और ओलिवर एक शूरवीर है\"। \"एवलिन एक धूर्त है यदि और केवल यदि ओलिवर एक धूर्त है,\" ईथन ने घोषित किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक धूर्त है  \n(2) सोफिया एक शूरवीर है  \n(3) एवलिन एक शूरवीर है  \n(4) ओलिवर एक शूरवीर है  \n(5) ईथन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: माइकल, जैक्सन, एलिज़ाबेथ, पेनलोप, और ओलिविया। \"ओलिविया शूरवीर नहीं है,\" माइकल ने कहा। \"एलिज़ाबेथ शूरवीर है या ओलिविया शूरवीर है\" - जैक्सन। एलिज़ाबेथ ने कहा, \"एलिज़ाबेथ शूरवीर है और जैक्सन धूर्त है\"। \"अगर माइकल धूर्त है तो ओलिविया शूरवीर है,\" पेनलोप ने कहा। \"पेनलोप धूर्त है या पेनलोप शूरवीर है,\" ओलिविया ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक धूर्त है  \n(2) जैक्सन एक शूरवीर है  \n(3) एलिज़ाबेथ एक धूर्त है  \n(4) पेनलोप एक शूरवीर है  \n(5) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: औरोरा, नूह, डेविड, ऐडन, और शार्लट। औरोरा के अनुसार, \"शार्लट एक धूर्त है या ऐडन एक शूरवीर है\"। नूह ने कहा, \"अगर डेविड एक धूर्त है तो शार्लट एक धूर्त है\"। डेविड ने कहा कि अगर औरोरा एक धूर्त है तो ऐडन एक शूरवीर है। \"ऐडन एक शूरवीर है या शार्लट एक शूरवीर है,\" ऐडन ने घोषणा की। \"ऐडन एक धूर्त है यदि और केवल यदि डेविड एक शूरवीर है,\" शार्लट ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) औरोरा एक शूरवीर है  \n(2) नूह एक शूरवीर है  \n(3) डेविड एक शूरवीर है  \n(4) ऐडन एक शूरवीर है  \n(5) शार्लट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: सोफिया, अमेलिया, लियम, हार्पर, और शार्लट। सोफिया के एक बयान में: \"सोफिया एक शूरवीर है यदि और केवल यदि अमेलिया एक धूर्त है\"। अमेलिया ने कहा, \"हार्पर एक शूरवीर है यदि और केवल यदि लियम एक शूरवीर है\"। लियम के एक बयान में: \"यदि सोफिया एक धूर्त है तो सोफिया एक शूरवीर है\"। हार्पर ने कहा, \"लियम एक शूरवीर है यदि और केवल यदि शार्लट एक शूरवीर है\"। शार्लट ने कहा कि यदि लियम एक शूरवीर है तो हार्पर एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) अमेलिया एक धूर्त है  \n(3) लियम एक शूरवीर है  \n(4) हार्पर एक धूर्त है  \n(5) शार्लट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: लिली, लोगन, ल्यूक, नूह, और ओलिवर। जैसे लिली ने कहा, \"लोगन एक धूर्त है\"। \"लिली एक शूरवीर है यदि और केवल यदि नूह एक धूर्त है,\" लोगन ने कहा। जैसे ल्यूक ने कहा, \"लोगन एक शूरवीर है यदि और केवल यदि नूह एक धूर्त है\"। नूह के अनुसार, \"यदि नूह एक शूरवीर है तो ल्यूक एक शूरवीर है\"। ओलिवर ने कहा कि यदि लोगन एक धूर्त है तो ल्यूक एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लिली एक शूरवीर है  \n(2) लोगन एक धूर्त है  \n(3) ल्यूक एक शूरवीर है  \n(4) नूह एक शूरवीर है  \n(5) ओलिवर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ग्रेस, एलिज़ाबेथ, ल्यूक, शार्लट, और एम्मा। ग्रेस ने कहा, \"अगर एम्मा एक शूरवीर है तो एम्मा एक धूर्त है\"। एलिज़ाबेथ के एक बयान में: \"ल्यूक एक धूर्त है यदि और केवल यदि एम्मा एक शूरवीर है\"। ल्यूक ने टिप्पणी की, \"एम्मा एक शूरवीर नहीं है\"। शार्लट ने कहा: \"शार्लट एक शूरवीर है और एलिज़ाबेथ एक धूर्त है\"। \"शार्लट एक शूरवीर है,\" एम्मा ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक शूरवीर है  \n(2) एलिज़ाबेथ एक शूरवीर है  \n(3) ल्यूक एक शूरवीर है  \n(4) शार्लट एक धूर्त है  \n(5) एम्मा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ऐडन, बेंजामिन, एमिली, डेविड, और ओवेन। ऐडन ने कहा, \"ओवेन एक शूरवीर है यदि और केवल यदि डेविड एक शूरवीर है\"। बेंजामिन ने कहा, \"एमिली एक शूरवीर है यदि और केवल यदि ओवेन एक शूरवीर है\"। एमिली ने कहा, \"बेंजामिन एक शूरवीर नहीं है\"। डेविड को यह कहते हुए सुना गया, \"ओवेन एक शूरवीर है\"। \"एमिली एक शूरवीर है या ओवेन एक शूरवीर है,\" ओवेन ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक शूरवीर है  \n(2) बेंजामिन एक शूरवीर है  \n(3) एमिली एक धूर्त है  \n(4) डेविड एक धूर्त है  \n(5) ओवेन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: लोगन, इसाबेला, ल्यूक, ईथन, और सोफिया। लोगन ने कहा, \"इसाबेला एक शूरवीर है और ल्यूक एक धूर्त है\"। इसाबेला ने कहा, \"ल्यूक एक धूर्त है\"। जैसा कि ल्यूक ने कहा, \"अगर ल्यूक एक शूरवीर है तो ईथन एक शूरवीर है\"। \"ल्यूक एक शूरवीर है और सोफिया एक शूरवीर है,\" ईथन ने दावा किया। सोफिया ने कहा, \"इसाबेला एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक धूर्त है  \n(2) इसाबेला एक धूर्त है  \n(3) ल्यूक एक शूरवीर है  \n(4) ईथन एक शूरवीर है  \n(5) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एवलिन, यूसुफ, सोफिया, ल्यूक, और जेम्स। एवलिन ने कहा, \"यूसुफ एक धूर्त है या एवलिन एक शूरवीर है\"। यूसुफ ने टिप्पणी की, \"अगर ल्यूक एक धूर्त है तो जेम्स एक शूरवीर है\"। \"सोफिया एक शूरवीर है या ल्यूक एक शूरवीर है,\" सोफिया ने घोषणा की। ल्यूक ने asserted किया: \"एवलिन एक धूर्त है और सोफिया एक धूर्त है\"। जेम्स को यह कहते हुए सुना गया, \"अगर एवलिन एक शूरवीर है तो यूसुफ एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक धूर्त है  \n(2) यूसुफ एक शूरवीर है  \n(3) सोफिया एक शूरवीर है  \n(4) ल्यूक एक धूर्त है  \n(5) जेम्स एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: लिली, राइली, विलियम, आरिया, और डेविड। \"राइली शूरवीर नहीं है,\" लिली ने कहा। राइली के शब्दों में: \"डेविड एक शूरवीर है\"। विलियम को यह कहते हुए सुना गया, \"लिली एक शूरवीर है\"। आरिया के शब्दों में: \"लिली एक शूरवीर है यदि और केवल यदि विलियम एक शूरवीर है\"। डेविड ने कहा कि आरिया धूर्त नहीं है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लिली एक धूर्त है  \n(2) राइली एक शूरवीर है  \n(3) विलियम एक धूर्त है  \n(4) आरिया एक शूरवीर है  \n(5) डेविड एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: याकूब, मेसन, लुकास, बेंजामिन, और सेबेस्टियन। \"लुकास एक शूरवीर है यदि और केवल यदि सेबेस्टियन एक धूर्त है\" - याकूब। मेसन ने कहा: \"मेसन एक शूरवीर है या याकूब एक धूर्त है\"। लुकास के अनुसार, \"सेबेस्टियन एक धूर्त है और याकूब एक धूर्त है\"। बेंजामिन ने टिप्पणी की, \"सेबेस्टियन एक शूरवीर नहीं है\"। सेबेस्टियन ने कहा कि मेसन एक शूरवीर है यदि और केवल यदि याकूब एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) याकूब एक शूरवीर है  \n(2) मेसन एक शूरवीर है  \n(3) लुकास एक धूर्त है  \n(4) बेंजामिन एक धूर्त है  \n(5) सेबेस्टियन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: मिया, सैमुएल, अमेलिया, सोफिया, और हेनरी। मिया ने कहा, \"सैमुएल एक धूर्त है यदि और केवल यदि सोफिया एक धूर्त है\"। सैमुएल ने कहा, \"अमेलिया एक शूरवीर है या अमेलिया एक धूर्त है\"। अमेलिया के एक बयान में: \"हेनरी एक धूर्त है\"। सोफिया ने कहा, \"अमेलिया एक धूर्त है और सैमुएल एक शूरवीर है\"। हेनरी ने कहा, \"सोफिया एक शूरवीर है और मिया एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक धूर्त है  \n(2) सैमुएल एक शूरवीर है  \n(3) अमेलिया एक शूरवीर है  \n(4) सोफिया एक धूर्त है  \n(5) हेनरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: औरोरा, डैनियल, बेंजामिन, इसाबेला, और ऐडन। \"ऐडन धूर्त नहीं है,\" औरोरा ने दावा किया। डैनियल को यह कहते हुए सुना गया, \"इसाबेला धूर्त है यदि और केवल यदि इसाबेला शूरवीर है\"। बेंजामिन के अनुसार, \"यदि ऐडन शूरवीर है तो डैनियल शूरवीर है\"। इसाबेला ने कहा कि यदि डैनियल धूर्त है तो बेंजामिन शूरवीर है। ऐडन ने नोट किया, \"डैनियल धूर्त है यदि और केवल यदि डैनियल शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) औरोरा एक धूर्त है  \n(2) डैनियल एक धूर्त है  \n(3) बेंजामिन एक शूरवीर है  \n(4) इसाबेला एक शूरवीर है  \n(5) ऐडन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एम्मा, लोगन, ल्यूक, स्कारलेट, और लुकास। \"लुकास एक धूर्त है और स्कारलेट एक धूर्त है,\" एम्मा ने दावा किया। जैसे लोगन ने कहा, \"एम्मा एक शूरवीर है यदि और केवल यदि एम्मा एक धूर्त है\"। \"लोगन एक धूर्त है यदि और केवल यदि स्कारलेट एक शूरवीर है\" - ल्यूक। स्कारलेट को यह कहते हुए सुना गया, \"यदि एम्मा एक शूरवीर है तो लोगन एक शूरवीर है\"। जैसे लुकास ने कहा, \"एम्मा एक शूरवीर है और स्कारलेट एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एम्मा एक धूर्त है  \n(2) लोगन एक धूर्त है  \n(3) ल्यूक एक शूरवीर है  \n(4) स्कारलेट एक शूरवीर है  \n(5) लुकास एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: माइकल, एला, एलिज़ाबेथ, जैक, और अबिगेल। माइकल ने कहा, \"एलिज़ाबेथ एक धूर्त नहीं है\"। एला के शब्दों में: \"जैक एक शूरवीर है यदि और केवल यदि एला एक शूरवीर है\"। एलिज़ाबेथ ने कहा, \"एलिज़ाबेथ एक शूरवीर है या जैक एक शूरवीर है\"। जैक ने कहा, \"एला एक धूर्त नहीं है\"। अबिगेल के शब्दों में: \"माइकल एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक शूरवीर है  \n(2) एला एक शूरवीर है  \n(3) एलिज़ाबेथ एक शूरवीर है  \n(4) जैक एक शूरवीर है  \n(5) अबिगेल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: विलियम, डेविड, ज़ोई, एवा, और सोफिया। विलियम ने कहा, \"सोफिया एक धूर्त है और सोफिया एक शूरवीर है\"। \"ज़ोई एक शूरवीर है\" - डेविड। ज़ोई ने कहा, \"सोफिया एक शूरवीर है यदि और केवल यदि एवा एक शूरवीर है\"। एवा ने कहा, \"डेविड एक धूर्त है या ज़ोई एक शूरवीर है\"। सोफिया को यह कहते हुए सुना गया, \"यदि एवा एक शूरवीर है तो एवा एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक धूर्त है  \n(2) डेविड एक धूर्त है  \n(3) ज़ोई एक धूर्त है  \n(4) एवा एक शूरवीर है  \n(5) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ओलिविया, एवा, बेंजामिन, यूसुफ, और स्कारलेट। ओलिविया ने कहा, \"बेंजामिन एक शूरवीर है या ओलिविया एक शूरवीर है\"। एवा ने कहा, \"अगर स्कारलेट एक धूर्त है तो एवा एक शूरवीर है\"। बेंजामिन ने कहा कि अगर यूसुफ एक शूरवीर है तो स्कारलेट एक शूरवीर है। यूसुफ ने कहा कि एवा एक शूरवीर है यदि और केवल यदि ओलिविया एक धूर्त है। स्कारलेट को यह कहते हुए सुना गया, \"ओलिविया एक शूरवीर है यदि और केवल यदि एवा एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक शूरवीर है  \n(2) एवा एक शूरवीर है  \n(3) बेंजामिन एक शूरवीर है  \n(4) यूसुफ एक धूर्त है  \n(5) स्कारलेट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ऐडन, डेविड, पेनलोप, सोफिया, और स्कारलेट। ऐडन ने कहा कि पेनलोप एक धूर्त है और स्कारलेट एक धूर्त है। डेविड ने कहा कि अगर स्कारलेट एक धूर्त है तो डेविड एक शूरवीर है। पेनलोप के अनुसार, \"अगर स्कारलेट एक शूरवीर है तो ऐडन एक धूर्त है\"। सोफिया के अनुसार, \"पेनलोप एक धूर्त है और सोफिया एक शूरवीर है\"। स्कारलेट ने कहा, \"अगर डेविड एक शूरवीर है तो डेविड एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक धूर्त है  \n(2) डेविड एक शूरवीर है  \n(3) पेनलोप एक शूरवीर है  \n(4) सोफिया एक धूर्त है  \n(5) स्कारलेट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: मेसन, यूसुफ, एम्मा, जैक्सन, और अलेक्जेंडर। मेसन ने कहा, \"जैक्सन एक शूरवीर है यदि और केवल यदि अलेक्जेंडर एक शूरवीर है\"। \"एम्मा एक शूरवीर है और मेसन एक धूर्त है\" - यूसुफ। एम्मा को यह कहते हुए सुना गया, \"अलेक्जेंडर एक शूरवीर नहीं है\"। \"अलेक्जेंडर एक शूरवीर है यदि और केवल यदि यूसुफ एक शूरवीर है,\" जैक्सन ने दावा किया। अलेक्जेंडर ने कहा कि मेसन एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) यूसुफ एक धूर्त है  \n(3) एम्मा एक धूर्त है  \n(4) जैक्सन एक धूर्त है  \n(5) अलेक्जेंडर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: डैनियल, अबिगेल, यूसुफ, अमेलिया, और ईथन। डैनियल ने कहा, \"यूसुफ शूरवीर नहीं है\"। \"अमेलिया एक शूरवीर है और अबिगेल एक शूरवीर है\" - अबिगेल। यूसुफ ने कहा, \"अमेलिया एक धूर्त है यदि और केवल यदि अबिगेल एक शूरवीर है\"। अमेलिया ने कहा, \"यूसुफ एक धूर्त है और डैनियल एक धूर्त है\"। ईथन के शब्दों में: \"अमेलिया एक शूरवीर है यदि और केवल यदि डैनियल एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक शूरवीर है  \n(2) अबिगेल एक धूर्त है  \n(3) यूसुफ एक धूर्त है  \n(4) अमेलिया एक धूर्त है  \n(5) ईथन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: मैथ्यू, एवा, बेंजामिन, लुकास, और ल्यूक। मैथ्यू के अनुसार, \"एवा एक शूरवीर है यदि और केवल यदि लुकास एक शूरवीर है\"। \"बेंजामिन एक शूरवीर है\" - एवा। बेंजामिन को यह कहते हुए सुना गया, \"एवा एक शूरवीर है या मैथ्यू एक शूरवीर है\"। लुकास के शब्दों में: \"बेंजामिन एक शूरवीर है या मैथ्यू एक शूरवीर है\"। ल्यूक ने कहा: \"बेंजामिन एक धूर्त है यदि और केवल यदि एवा एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक शूरवीर है  \n(2) एवा एक शूरवीर है  \n(3) बेंजामिन एक शूरवीर है  \n(4) लुकास एक शूरवीर है  \n(5) ल्यूक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: शार्लट, हार्पर, एलिज़ाबेथ, विलियम, और पेनलोप। शार्लट ने कहा कि एलिज़ाबेथ एक शूरवीर है यदि और केवल यदि पेनलोप एक शूरवीर है। \"शार्लट एक शूरवीर नहीं है\" - हार्पर। एलिज़ाबेथ ने आपको बताया कि पेनलोप एक शूरवीर है और एलिज़ाबेथ एक शूरवीर है। विलियम को यह कहते हुए सुना गया, \"यदि शार्लट एक धूर्त है तो एलिज़ाबेथ एक शूरवीर है\"। पेनलोप ने कहा, \"शार्लट एक धूर्त है यदि और केवल यदि शार्लट एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक शूरवीर है  \n(2) हार्पर एक धूर्त है  \n(3) एलिज़ाबेथ एक धूर्त है  \n(4) विलियम एक शूरवीर है  \n(5) पेनलोप एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ऐडन, एमिली, लोगन, यूसुफ, और ज़ोई। ऐडन ने कहा, \"ज़ोई एक धूर्त है या लोगन एक धूर्त है\"। \"अगर एमिली एक शूरवीर है तो ज़ोई एक धूर्त है,\" एमिली ने घोषणा की। लोगन के एक बयान में: \"एमिली एक शूरवीर नहीं है\"। यूसुफ ने कहा, \"लोगन एक धूर्त है या लोगन एक शूरवीर है\"। ज़ोई ने आपको बताया कि यूसुफ एक धूर्त है और ज़ोई एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक शूरवीर है  \n(2) एमिली एक शूरवीर है  \n(3) लोगन एक धूर्त है  \n(4) यूसुफ एक शूरवीर है  \n(5) ज़ोई एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एवरी, मेसन, एवलिन, एलिज़ाबेथ, और लोगन। \"अगर एलिज़ाबेथ एक शूरवीर है तो मेसन एक शूरवीर है,\" एवरी ने कहा। मेसन ने आपको बताया कि अगर लोगन एक शूरवीर है तो एवलिन एक धूर्त है। \"मेसन एक शूरवीर है और एलिज़ाबेथ एक धूर्त है\" - एवलिन। एलिज़ाबेथ के शब्दों में: \"मेसन एक शूरवीर है और मेसन एक धूर्त है\"। लोगन के अनुसार, \"एवलिन एक धूर्त है और मेसन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक शूरवीर है  \n(2) मेसन एक शूरवीर है  \n(3) एवलिन एक शूरवीर है  \n(4) एलिज़ाबेथ एक धूर्त है  \n(5) लोगन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: सोफिया, हार्पर, अबिगेल, ओलिवर, और जैक। सोफिया ने कहा कि जैक एक धूर्त नहीं है। हार्पर ने टिप्पणी की, \"ओलिवर एक शूरवीर है और सोफिया एक शूरवीर है\"। अबिगेल के अनुसार, \"हार्पर एक शूरवीर है और सोफिया एक धूर्त है\"। ओलिवर के अनुसार, \"अबिगेल एक शूरवीर नहीं है\"। जैक ने आपको बताया कि जैक एक शूरवीर है और अबिगेल एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) हार्पर एक धूर्त है  \n(3) अबिगेल एक धूर्त है  \n(4) ओलिवर एक शूरवीर है  \n(5) जैक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: आरिया, मिया, एवरी, विलियम, और ऐडन। आरिया ने आपको बताया कि मिया एक धूर्त है या एवरी एक धूर्त है। \"ऐडन एक धूर्त नहीं है,\" मिया ने दावा किया। एवरी ने टिप्पणी की, \"आरिया एक धूर्त नहीं है।\" \"मिया एक धूर्त है और एवरी एक धूर्त है,\" विलियम ने घोषणा की। ऐडन ने कहा, \"अगर आरिया एक शूरवीर है तो विलियम एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) आरिया एक शूरवीर है  \n(2) मिया एक धूर्त है  \n(3) एवरी एक शूरवीर है  \n(4) विलियम एक धूर्त है  \n(5) ऐडन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: लिली, हेनरी, यूसुफ, अमेलिया, और सोफिया। \"अमेलिया शूरवीर नहीं है,\" लिली ने घोषणा की। \"अमेलिया धूर्त है यदि और केवल यदि लिली धूर्त है,\" हेनरी ने दावा किया। यूसुफ ने कहा, \"हेनरी शूरवीर नहीं है\"। अमेलिया ने कहा, \"यदि हेनरी धूर्त है तो सोफिया शूरवीर है\"। जैसे सोफिया ने कहा, \"यूसुफ धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लिली एक शूरवीर है  \n(2) हेनरी एक धूर्त है  \n(3) यूसुफ एक शूरवीर है  \n(4) अमेलिया एक धूर्त है  \n(5) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: जैक्सन, राइली, ऐडन, सोफिया, और सैमुएल। \"सोफिया एक धूर्त है यदि और केवल यदि सैमुएल एक धूर्त है\" - जैक्सन। राइली ने आपको बताया कि जैक्सन एक शूरवीर नहीं है। ऐडन ने कहा कि यदि सोफिया एक धूर्त है तो राइली एक धूर्त है। सोफिया ने कहा कि राइली एक शूरवीर नहीं है। सैमुएल ने आपको बताया कि यदि जैक्सन एक शूरवीर है तो जैक्सन एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक धूर्त है  \n(2) राइली एक शूरवीर है  \n(3) ऐडन एक धूर्त है  \n(4) सोफिया एक धूर्त है  \n(5) सैमुएल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: हार्पर, ओलिवर, एम्मा, ज़ोई, और ल्यूक। हार्पर ने कहा कि ज़ोई एक शूरवीर है और ल्यूक एक शूरवीर है। ओलिवर ने कहा, \"ज़ोई एक शूरवीर है या ल्यूक एक शूरवीर है\"। एम्मा ने आपको बताया कि ल्यूक एक शूरवीर है और एम्मा एक शूरवीर है। जैसे ज़ोई ने कहा, \"हार्पर एक शूरवीर नहीं है\"। ल्यूक ने कहा कि हार्पर एक शूरवीर है और एम्मा एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक धूर्त है  \n(2) ओलिवर एक शूरवीर है  \n(3) एम्मा एक धूर्त है  \n(4) ज़ोई एक शूरवीर है  \n(5) ल्यूक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: डेविड, इसाबेला, माइकल, सेबेस्टियन, और शार्लट। डेविड ने कहा: \"माइकल एक शूरवीर है\"। इसाबेला ने कहा, \"डेविड एक धूर्त है और शार्लट एक धूर्त है।\" माइकल के अनुसार, \"सेबेस्टियन एक शूरवीर है यदि और केवल यदि माइकल एक शूरवीर है\"। सेबेस्टियन ने कहा, \"माइकल एक धूर्त नहीं है\"। शार्लट ने कहा, \"यदि शार्लट एक शूरवीर है तो सेबेस्टियन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक शूरवीर है  \n(2) इसाबेला एक धूर्त है  \n(3) माइकल एक शूरवीर है  \n(4) सेबेस्टियन एक शूरवीर है  \n(5) शार्लट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: याकूब, पेनलोप, ईथन, मैथ्यू, और नूह। याकूब ने टिप्पणी की, \"ईथन एक धूर्त है\"। \"याकूब एक शूरवीर है और ईथन एक धूर्त है,\" पेनलोप ने दावा किया। ईथन को यह कहते हुए सुना गया, \"अगर पेनलोप एक धूर्त है तो मैथ्यू एक धूर्त है\"। मैथ्यू को यह कहते हुए सुना गया, \"याकूब एक शूरवीर है या नूह एक शूरवीर है\"। नूह के शब्दों में: \"याकूब एक शूरवीर है और ईथन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) याकूब एक धूर्त है  \n(2) पेनलोप एक धूर्त है  \n(3) ईथन एक शूरवीर है  \n(4) मैथ्यू एक धूर्त है  \n(5) नूह एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ईथन, औरोरा, सोफिया, स्कारलेट, और जैक। ईथन ने कहा, \"स्कारलेट एक शूरवीर नहीं है\"। औरोरा ने कहा कि ईथन एक शूरवीर है और सोफिया एक शूरवीर है। सोफिया के एक बयान में: \"जैक एक शूरवीर है यदि और केवल यदि औरोरा एक धूर्त है\"। \"स्कारलेट एक शूरवीर है या जैक एक धूर्त है,\" स्कारलेट ने घोषणा की। जैक ने कहा, \"यदि ईथन एक शूरवीर है तो स्कारलेट एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक धूर्त है  \n(2) औरोरा एक धूर्त है  \n(3) सोफिया एक शूरवीर है  \n(4) स्कारलेट एक शूरवीर है  \n(5) जैक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: विलियम, एम्मा, इसाबेला, ईथन, और अमेलिया। \"अगर एम्मा एक शूरवीर है तो ईथन एक धूर्त है,\" विलियम ने दावा किया। \"अगर अमेलिया एक शूरवीर है तो विलियम एक शूरवीर है,\" एम्मा ने घोषणा की। इसाबेला ने कहा, \"विलियम एक धूर्त है और अमेलिया एक शूरवीर है।\" ईथन ने asserted किया: \"ईथन एक शूरवीर है।\" \"ईथन एक शूरवीर है यदि और केवल यदि एम्मा एक शूरवीर है,\" अमेलिया ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) एम्मा एक शूरवीर है  \n(3) इसाबेला एक धूर्त है  \n(4) ईथन एक धूर्त है  \n(5) अमेलिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: क्लोई, सोफिया, ओलिवर, एवरी, और शार्लट। \"शार्लट एक धूर्त है या एवरी एक शूरवीर है,\" क्लोई ने घोषणा की। सोफिया ने कहा, \"एवरी एक धूर्त है और ओलिवर एक धूर्त है\"। ओलिवर ने कहा, \"क्लोई एक शूरवीर है या सोफिया एक शूरवीर है\"। एवरी ने कहा, \"ओलिवर एक धूर्त नहीं है\"। \"ओलिवर एक शूरवीर है\" - शार्लट। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) क्लोई एक शूरवीर है  \n(2) सोफिया एक धूर्त है  \n(3) ओलिवर एक शूरवीर है  \n(4) एवरी एक शूरवीर है  \n(5) शार्लट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: बेंजामिन, मिया, एलिज़ाबेथ, सेबेस्टियन, और डेविड। बेंजामिन ने कहा, \"एलिज़ाबेथ एक धूर्त है या एलिज़ाबेथ एक शूरवीर है।\" मिया ने कहा, \"बेंजामिन एक शूरवीर है और बेंजामिन एक धूर्त है।\" \"सेबेस्टियन एक धूर्त है या डेविड एक शूरवीर है,\" एलिज़ाबेथ ने घोषणा की। सेबेस्टियन ने asserted किया: \"मिया एक धूर्त है या सेबेस्टियन एक शूरवीर है।\" डेविड ने कहा, \"मिया एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक शूरवीर है  \n(2) मिया एक धूर्त है  \n(3) एलिज़ाबेथ एक शूरवीर है  \n(4) सेबेस्टियन एक शूरवीर है  \n(5) डेविड एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: जेम्स, बेंजामिन, सोफिया, मैथ्यू, और जैक। \"जैक एक शूरवीर है या मैथ्यू एक शूरवीर है,\" जेम्स ने दावा किया। \"मैथ्यू एक धूर्त है या जैक एक धूर्त है\" - बेंजामिन। सोफिया ने आपको बताया कि जैक एक धूर्त है। जैसे मैथ्यू ने कहा, \"सोफिया एक धूर्त है यदि और केवल यदि सोफिया एक शूरवीर है\"। जैक के एक बयान में: \"मैथ्यू एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) बेंजामिन एक शूरवीर है  \n(3) सोफिया एक धूर्त है  \n(4) मैथ्यू एक धूर्त है  \n(5) जैक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: अमेलिया, स्कारलेट, मिया, ऐडन, और माइकल। अमेलिया ने आपको बताया कि अगर मिया एक धूर्त है तो स्कारलेट एक धूर्त है। जैसे स्कारलेट ने कहा, \"मिया एक शूरवीर है और स्कारलेट एक शूरवीर है\"। मिया के शब्दों में: \"ऐडन एक शूरवीर नहीं है\"। ऐडन के एक बयान में: \"अगर स्कारलेट एक शूरवीर है तो मिया एक शूरवीर है\"। माइकल ने कहा, \"अगर स्कारलेट एक धूर्त है तो ऐडन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक शूरवीर है  \n(2) स्कारलेट एक धूर्त है  \n(3) मिया एक धूर्त है  \n(4) ऐडन एक शूरवीर है  \n(5) माइकल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एला, सोफिया, जैक, मैथ्यू, और लियम। एला ने कहा: \"जैक शूरवीर नहीं है।\" \"जैक एक शूरवीर है,\" सोफिया ने कहा। \"सोफिया एक शूरवीर है या मैथ्यू एक धूर्त है\" - जैक। \"एला एक धूर्त है,\" मैथ्यू ने घोषणा की। लियम ने कहा कि सोफिया एक धूर्त है और जैक एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक धूर्त है  \n(2) सोफिया एक शूरवीर है  \n(3) जैक एक शूरवीर है  \n(4) मैथ्यू एक शूरवीर है  \n(5) लियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: यूसुफ, डैनियल, ओवेन, याकूब, और एवा। यूसुफ ने कहा, \"अगर एवा एक शूरवीर है तो याकूब एक धूर्त है\"। डैनियल ने कहा, \"अगर यूसुफ एक शूरवीर है तो ओवेन एक धूर्त है\"। ओवेन ने टिप्पणी की, \"यूसुफ एक शूरवीर है या डैनियल एक शूरवीर है\"। याकूब को यह कहते हुए सुना गया, \"डैनियल एक शूरवीर है और यूसुफ एक धूर्त है\"। एवा को यह कहते हुए सुना गया, \"याकूब एक शूरवीर है और डैनियल एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) यूसुफ एक शूरवीर है  \n(2) डैनियल एक धूर्त है  \n(3) ओवेन एक शूरवीर है  \n(4) याकूब एक धूर्त है  \n(5) एवा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: याकूब, ग्रेस, जेम्स, ओलिवर, और एलिज़ाबेथ। याकूब के अनुसार, \"ओलिवर एक शूरवीर है यदि और केवल यदि जेम्स एक शूरवीर है\"। ग्रेस के एक बयान में: \"यदि याकूब एक शूरवीर है तो ओलिवर एक धूर्त है\"। जेम्स ने कहा, \"ओलिवर एक धूर्त है या एलिज़ाबेथ एक धूर्त है\"। ओलिवर को यह कहते हुए सुना गया, \"ग्रेस एक धूर्त नहीं है\"। \"जेम्स एक धूर्त है या ओलिवर एक शूरवीर है,\" एलिज़ाबेथ ने दावा किया। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) याकूब एक धूर्त है  \n(2) ग्रेस एक शूरवीर है  \n(3) जेम्स एक धूर्त है  \n(4) ओलिवर एक शूरवीर है  \n(5) एलिज़ाबेथ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एमिली, पेनलोप, विलियम, स्कारलेट, और एवा। एमिली ने कहा कि विलियम एक शूरवीर नहीं है। पेनलोप ने कहा कि विलियम एक शूरवीर है या स्कारलेट एक धूर्त है। \"पेनलोप एक धूर्त है यदि और केवल यदि विलियम एक शूरवीर है,\" विलियम ने दावा किया। जैसे स्कारलेट ने कहा, \"एवा एक धूर्त है\"। एवा ने नोट किया, \"स्कारलेट एक शूरवीर है यदि और केवल यदि स्कारलेट एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक शूरवीर है  \n(2) पेनलोप एक धूर्त है  \n(3) विलियम एक धूर्त है  \n(4) स्कारलेट एक शूरवीर है  \n(5) एवा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: शार्लट, अलेक्जेंडर, एला, क्लोई, और लिली। \"एला एक धूर्त है यदि और केवल यदि क्लोई एक धूर्त है,\" शार्लट ने घोषणा की। \"क्लोई एक शूरवीर नहीं है,\" अलेक्जेंडर ने दावा किया। एला ने asserted: \"लिली एक शूरवीर है या शार्लट एक शूरवीर है\"। जैसे कि क्लोई ने कहा, \"यदि अलेक्जेंडर एक धूर्त है तो शार्लट एक धूर्त है\"। लिली ने टिप्पणी की, \"क्लोई एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक धूर्त है  \n(2) अलेक्जेंडर एक धूर्त है  \n(3) एला एक धूर्त है  \n(4) क्लोई एक शूरवीर है  \n(5) लिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: हेनरी, एवरी, क्लोई, ओलिवर, और एवलिन। हेनरी को यह कहते हुए सुना गया, \"क्लोई एक शूरवीर है\"। एवरी ने कहा कि एवलिन एक धूर्त है यदि और केवल यदि एवलिन एक शूरवीर है। क्लोई ने कहा कि एवरी एक धूर्त है। ओलिवर ने आपको बताया कि क्लोई एक धूर्त है या एवरी एक शूरवीर है। \"क्लोई एक शूरवीर है,\" एवलिन ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हेनरी एक शूरवीर है  \n(2) एवरी एक धूर्त है  \n(3) क्लोई एक शूरवीर है  \n(4) ओलिवर एक धूर्त है  \n(5) एवलिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: विलियम, अमेलिया, याकूब, ऐडन, और सैमुएल। विलियम ने आपको बताया कि अगर सैमुएल एक धूर्त है तो याकूब एक धूर्त है। अमेलिया ने कहा, \"सैमुएल एक धूर्त है या विलियम एक धूर्त है\"। याकूब ने कहा: \"सैमुएल एक शूरवीर है या सैमुएल एक धूर्त है\"। ऐडन के शब्दों में: \"अगर अमेलिया एक धूर्त है तो ऐडन एक शूरवीर है\"। \"ऐडन एक शूरवीर है\" - सैमुएल। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) अमेलिया एक धूर्त है  \n(3) याकूब एक शूरवीर है  \n(4) ऐडन एक शूरवीर है  \n(5) सैमुएल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: लियम, ओलिविया, एमिली, इसाबेला, और एवलिन। लियम के अनुसार, \"ओलिविया एक धूर्त है\"। ओलिविया ने कहा कि एमिली एक शूरवीर है। एमिली ने आपको बताया कि ओलिविया एक शूरवीर है और एवलिन एक शूरवीर है। इसाबेला ने कहा, \"ओलिविया एक धूर्त है और एमिली एक धूर्त है।\" \"एमिली एक शूरवीर है यदि और केवल यदि एमिली एक धूर्त है,\" एवलिन ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक शूरवीर है  \n(2) ओलिविया एक धूर्त है  \n(3) एमिली एक धूर्त है  \n(4) इसाबेला एक शूरवीर है  \n(5) एवलिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: हेनरी, राइली, एमिली, मेसन, और सैमुएल। हेनरी ने कहा कि मेसन एक शूरवीर है या सैमुएल एक धूर्त है। राइली के एक बयान में: \"हेनरी एक धूर्त है या एमिली एक धूर्त है\"। एमिली ने asserted किया: \"हेनरी एक धूर्त नहीं है\"। मेसन ने कहा, \"एमिली एक शूरवीर है यदि और केवल यदि सैमुएल एक धूर्त है।\" \"राइली एक धूर्त नहीं है\" - सैमुएल। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हेनरी एक शूरवीर है  \n(2) राइली एक धूर्त है  \n(3) एमिली एक शूरवीर है  \n(4) मेसन एक शूरवीर है  \n(5) सैमुएल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ओलिवर, पेनलोप, ओलिविया, एवा, और सैमुएल। ओलिवर के अनुसार, \"पेनलोप एक शूरवीर नहीं है\"। पेनलोप ने आपको बताया कि ओलिविया एक शूरवीर नहीं है। ओलिविया ने कहा: \"एवा एक धूर्त है\"। एवा ने टिप्पणी की, \"ओलिवर एक धूर्त है और ओलिविया एक शूरवीर है\"। सैमुएल ने कहा: \"पेनलोप एक धूर्त है या पेनलोप एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिवर एक शूरवीर है  \n(2) पेनलोप एक धूर्त है  \n(3) ओलिविया एक शूरवीर है  \n(4) एवा एक धूर्त है  \n(5) सैमुएल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: औरोरा, ओलिवर, अबिगेल, ल्यूक, और मेसन। औरोरा ने कहा, \"ओलिवर शूरवीर नहीं है\"। ओलिवर ने टिप्पणी की, \"अगर ल्यूक धूर्त है तो मेसन धूर्त है\"। अबिगेल के अनुसार, \"औरोरा शूरवीर नहीं है\"। ल्यूक ने कहा, \"अगर ओलिवर शूरवीर है तो अबिगेल धूर्त है।\" \"औरोरा एक शूरवीर है,\" मेसन ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) औरोरा एक धूर्त है  \n(2) ओलिवर एक शूरवीर है  \n(3) अबिगेल एक शूरवीर है  \n(4) ल्यूक एक धूर्त है  \n(5) मेसन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एवरी, सेबेस्टियन, लोगन, ईथन, और पेनलोप। जैसे एवरी ने कहा, \"सेबेस्टियन एक शूरवीर है यदि और केवल यदि ईथन एक शूरवीर है\"। सेबेस्टियन ने कहा कि ईथन एक शूरवीर है। \"लोगन एक शूरवीर है और सेबेस्टियन एक शूरवीर है,\" लोगन ने दावा किया। ईथन ने कहा कि लोगन एक धूर्त है यदि और केवल यदि लोगन एक शूरवीर है। पेनलोप ने कहा, \"यदि लोगन एक शूरवीर है तो लोगन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक शूरवीर है  \n(2) सेबेस्टियन एक धूर्त है  \n(3) लोगन एक धूर्त है  \n(4) ईथन एक धूर्त है  \n(5) पेनलोप एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: मिया, एवा, स्कारलेट, एमिली, और लिली। मिया ने कहा, \"अगर एमिली एक शूरवीर है तो एवा एक धूर्त है\"। एवा ने asserted किया: \"मिया एक धूर्त है यदि और केवल यदि एमिली एक धूर्त है\"। स्कारलेट को कहते हुए सुना गया, \"लिली एक धूर्त नहीं है\"। जैसे एमिली ने कहा, \"लिली एक धूर्त नहीं है\"। लिली के एक बयान में: \"एवा एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक शूरवीर है  \n(2) एवा एक धूर्त है  \n(3) स्कारलेट एक धूर्त है  \n(4) एमिली एक धूर्त है  \n(5) लिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: याकूब, क्लोई, पेनलोप, एवरी, और स्कारलेट। याकूब ने टिप्पणी की, \"पेनलोप एक धूर्त है\"। क्लोई ने remarked किया, \"स्कारलेट एक शूरवीर है या एवरी एक धूर्त है\"। पेनलोप ने asserted किया: \"एवरी एक शूरवीर है यदि और केवल यदि क्लोई एक शूरवीर है\"। एवरी को यह कहते हुए सुना गया, \"यदि याकूब एक धूर्त है तो पेनलोप एक धूर्त है\"। जैसे स्कारलेट ने कहा, \"क्लोई एक धूर्त नहीं है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) याकूब एक शूरवीर है  \n(2) क्लोई एक धूर्त है  \n(3) पेनलोप एक धूर्त है  \n(4) एवरी एक शूरवीर है  \n(5) स्कारलेट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ल्यूक, जैक्सन, लुकास, शार्लट, और लोगन। ल्यूक ने कहा, \"शार्लट एक शूरवीर है या ल्यूक एक शूरवीर है।\" \"लोगन एक धूर्त है या लोगन एक शूरवीर है,\" जैक्सन ने कहा। \"लोगन एक शूरवीर है यदि और केवल यदि शार्लट एक धूर्त है,\" लुकास ने कहा। शार्लट को यह कहते हुए सुना गया, \"जैक्सन एक शूरवीर है और ल्यूक एक धूर्त है।\" \"शार्लट एक शूरवीर है,\" लोगन ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) जैक्सन एक शूरवीर है  \n(3) लुकास एक धूर्त है  \n(4) शार्लट एक धूर्त है  \n(5) लोगन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: लुकास, औरोरा, नूह, पेनलोप, और बेंजामिन। \"औरोरा एक शूरवीर है यदि और केवल यदि पेनलोप एक शूरवीर है,\" लुकास ने कहा। औरोरा के एक बयान में: \"औरोरा एक शूरवीर है और पेनलोप एक शूरवीर है\"। नूह ने कहा कि लुकास एक शूरवीर है या पेनलोप एक शूरवीर है। पेनलोप के एक बयान में: \"लुकास एक धूर्त है यदि और केवल यदि लुकास एक शूरवीर है\"। बेंजामिन को यह कहते हुए सुना गया, \"लुकास एक शूरवीर है और नूह एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक शूरवीर है  \n(2) औरोरा एक धूर्त है  \n(3) नूह एक शूरवीर है  \n(4) पेनलोप एक धूर्त है  \n(5) बेंजामिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: क्लोई, राइली, लोगन, एवरी, और एवलिन। जैसे कि क्लोई ने कहा, \"एवलिन एक शूरवीर है यदि और केवल यदि राइली एक शूरवीर है\"। जैसे कि राइली ने कहा, \"लोगन एक शूरवीर है या एवलिन एक धूर्त है\"। लोगन के शब्दों में: \"लोगन एक शूरवीर है यदि और केवल यदि एवरी एक धूर्त है\"। एवरी ने टिप्पणी की, \"राइली एक शूरवीर है और लोगन एक शूरवीर है\"। एवलिन ने कहा, \"यदि लोगन एक शूरवीर है तो एवरी एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) क्लोई एक धूर्त है  \n(2) राइली एक धूर्त है  \n(3) लोगन एक धूर्त है  \n(4) एवरी एक धूर्त है  \n(5) एवलिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एलिज़ाबेथ, एम्मा, विलियम, सेबेस्टियन, और हार्पर। \"एम्मा एक धूर्त है और हार्पर एक धूर्त है,\" एलिज़ाबेथ ने दावा किया। \"एलिज़ाबेथ एक शूरवीर है और विलियम एक धूर्त है,\" एम्मा ने कहा। विलियम ने कहा कि एलिज़ाबेथ एक शूरवीर है। सेबेस्टियन ने कहा, \"एम्मा एक शूरवीर नहीं है।\" हार्पर ने कहा, \"अगर एलिज़ाबेथ एक धूर्त है तो सेबेस्टियन एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक धूर्त है  \n(2) एम्मा एक धूर्त है  \n(3) विलियम एक धूर्त है  \n(4) सेबेस्टियन एक शूरवीर है  \n(5) हार्पर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: जैक्सन, अमेलिया, एवा, विलियम, और जैक। जैक्सन ने कहा, \"अगर एवा एक धूर्त है तो जैक एक शूरवीर है।\" \"जैक एक धूर्त नहीं है,\" अमेलिया ने घोषणा की। एवा ने नोट किया, \"अगर जैक एक शूरवीर है तो एवा एक शूरवीर है।\" विलियम ने कहा कि जैक एक धूर्त है या जैक्सन एक शूरवीर है। जैक के एक बयान में: \"अगर विलियम एक शूरवीर है तो विलियम एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक शूरवीर है  \n(2) अमेलिया एक धूर्त है  \n(3) एवा एक शूरवीर है  \n(4) विलियम एक शूरवीर है  \n(5) जैक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एला, औरोरा, एलिज़ाबेथ, एवलिन, और राइली। \"एलिज़ाबेथ शूरवीर नहीं है,\" एला ने घोषणा की। \"राइली धूर्त है या एला धूर्त है,\" औरोरा ने घोषणा की। \"औरोरा धूर्त है और राइली शूरवीर है\" - एलिज़ाबेथ। एवलिन ने नोट किया, \"एलिज़ाबेथ धूर्त नहीं है\"। राइली ने कहा कि अगर औरोरा शूरवीर है तो एला धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक शूरवीर है  \n(2) औरोरा एक शूरवीर है  \n(3) एलिज़ाबेथ एक धूर्त है  \n(4) एवलिन एक धूर्त है  \n(5) राइली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: मेसन, एवा, विलियम, ल्यूक, और याकूब। मेसन ने कहा, \"विलियम एक धूर्त नहीं है\"। एवा के अनुसार, \"याकूब एक धूर्त है\"। विलियम के एक बयान में: \"याकूब एक शूरवीर है यदि और केवल यदि विलियम एक शूरवीर है\"। ल्यूक के अनुसार, \"विलियम एक शूरवीर है\"। \"मेसन एक धूर्त है,\" याकूब ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) एवा एक धूर्त है  \n(3) विलियम एक धूर्त है  \n(4) ल्यूक एक धूर्त है  \n(5) याकूब एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: यूसुफ, जैक्सन, बेंजामिन, सैमुएल, और अबिगेल। यूसुफ के शब्दों में: \"सैमुएल एक धूर्त है और जैक्सन एक शूरवीर है\"। जैक्सन के अनुसार, \"जैक्सन एक शूरवीर है यदि और केवल यदि यूसुफ एक धूर्त है\"। बेंजामिन ने कहा, \"यदि सैमुएल एक शूरवीर है तो जैक्सन एक शूरवीर है\"। सैमुएल ने कहा, \"जैक्सन एक शूरवीर है और बेंजामिन एक धूर्त है।\" अबिगेल ने आपको बताया कि बेंजामिन एक शूरवीर नहीं है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) यूसुफ एक धूर्त है  \n(2) जैक्सन एक धूर्त है  \n(3) बेंजामिन एक शूरवीर है  \n(4) सैमुएल एक धूर्त है  \n(5) अबिगेल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: विलियम, एला, जैक्सन, हेनरी, और औरोरा। \"जैक्सन एक धूर्त है,\" विलियम ने दावा किया। एला के एक बयान में: \"हेनरी एक शूरवीर नहीं है\"। जैक्सन ने कहा, \"औरोरा एक शूरवीर है और एला एक शूरवीर है\"। हेनरी ने नोट किया, \"विलियम एक शूरवीर है यदि और केवल यदि एला एक शूरवीर है\"। औरोरा ने टिप्पणी की, \"हेनरी एक धूर्त है या जैक्सन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक धूर्त है  \n(2) एला एक शूरवीर है  \n(3) जैक्सन एक शूरवीर है  \n(4) हेनरी एक धूर्त है  \n(5) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: हेनरी, याकूब, जैक्सन, शार्लट, और लिली। हेनरी ने कहा कि याकूब एक शूरवीर है। याकूब के शब्दों में: \"यदि लिली एक शूरवीर है तो जैक्सन एक धूर्त है\"। जैक्सन के शब्दों में: \"शार्लट एक धूर्त है यदि और केवल यदि जैक्सन एक शूरवीर है\"। शार्लट के अनुसार, \"यदि जैक्सन एक धूर्त है तो याकूब एक धूर्त है\"। लिली ने आपको बताया कि हेनरी एक धूर्त है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) हेनरी एक शूरवीर है  \n(2) याकूब एक शूरवीर है  \n(3) जैक्सन एक धूर्त है  \n(4) शार्लट एक धूर्त है  \n(5) लिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एम्मा, डैनियल, एला, यूसुफ, और लोगन। एम्मा ने कहा, \"अगर एला एक शूरवीर है तो एला एक धूर्त है।\" \"एला एक शूरवीर है और एला एक धूर्त है,\" डैनियल ने दावा किया। \"एम्मा एक धूर्त है और एम्मा एक शूरवीर है,\" एला ने घोषित किया। यूसुफ ने आपको बताया कि अगर एम्मा एक शूरवीर है तो लोगन एक शूरवीर है। लोगन के अनुसार, \"एम्मा एक शूरवीर नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एम्मा एक शूरवीर है  \n(2) डैनियल एक धूर्त है  \n(3) एला एक धूर्त है  \n(4) यूसुफ एक धूर्त है  \n(5) लोगन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: सोफिया, अबिगेल, सैमुएल, याकूब, और ग्रेस। सोफिया के एक बयान में: \"अबिगेल एक धूर्त है यदि और केवल यदि अबिगेल एक शूरवीर है\"। जैसा कि अबिगेल ने कहा, \"यदि सैमुएल एक शूरवीर है तो ग्रेस एक शूरवीर है\"। \"अबिगेल एक धूर्त है और सोफिया एक शूरवीर है\" - सैमुएल। याकूब ने कहा, \"यदि अबिगेल एक शूरवीर है तो सोफिया एक शूरवीर है\"। जैसा कि ग्रेस ने कहा, \"अबिगेल एक धूर्त है यदि और केवल यदि सोफिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) अबिगेल एक शूरवीर है  \n(3) सैमुएल एक धूर्त है  \n(4) याकूब एक धूर्त है  \n(5) ग्रेस एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: जेम्स, स्कारलेट, ल्यूक, एला, और याकूब। जेम्स ने कहा: \"स्कारलेट एक धूर्त है\"। \"ल्यूक एक धूर्त है,\" स्कारलेट ने कहा। ल्यूक ने कहा, \"एला एक धूर्त है और स्कारलेट एक शूरवीर है।\" एला ने कहा, \"अगर जेम्स एक धूर्त है तो याकूब एक शूरवीर है।\" याकूब ने कहा, \"ल्यूक एक धूर्त है यदि और केवल यदि जेम्स एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक धूर्त है  \n(2) स्कारलेट एक शूरवीर है  \n(3) ल्यूक एक धूर्त है  \n(4) एला एक शूरवीर है  \n(5) याकूब एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ईथन, लुकास, एवरी, हार्पर, और मिया। ईथन ने कहा, \"लुकास एक शूरवीर है और हार्पर एक शूरवीर है\"। लुकास को यह कहते हुए सुना गया, \"एवरी एक धूर्त है और मिया एक शूरवीर है\"। एवरी ने कहा: \"ईथन एक शूरवीर है यदि और केवल यदि लुकास एक शूरवीर है\"। हार्पर ने कहा, \"मिया एक शूरवीर है या एवरी एक शूरवीर है\"। मिया के एक बयान में: \"ईथन एक धूर्त है या लुकास एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक धूर्त है  \n(2) लुकास एक धूर्त है  \n(3) एवरी एक शूरवीर है  \n(4) हार्पर एक शूरवीर है  \n(5) मिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: मैथ्यू, इसाबेला, एम्मा, अबिगेल, और हेनरी। मैथ्यू ने कहा कि अगर इसाबेला एक धूर्त है तो एम्मा एक धूर्त है। इसाबेला ने कहा, \"हेनरी एक शूरवीर है यदि और केवल यदि अबिगेल एक धूर्त है।\" एम्मा ने कहा कि अबिगेल एक धूर्त है यदि और केवल यदि इसाबेला एक धूर्त है। अबिगेल ने asserted: \"मैथ्यू एक धूर्त नहीं है।\" हेनरी के अनुसार, \"अगर हेनरी एक शूरवीर है तो अबिगेल एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक शूरवीर है  \n(2) इसाबेला एक धूर्त है  \n(3) एम्मा एक धूर्त है  \n(4) अबिगेल एक शूरवीर है  \n(5) हेनरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: पेनलोप, एवा, ग्रेस, ओलिविया, और अमेलिया। \"एवा एक शूरवीर है यदि और केवल यदि ग्रेस एक शूरवीर है,\" पेनलोप ने घोषणा की। एवा ने कहा कि अमेलिया एक शूरवीर है यदि और केवल यदि अमेलिया एक धूर्त है। \"यदि ओलिविया एक शूरवीर है तो अमेलिया एक शूरवीर है,\" ग्रेस ने उल्लेख किया। ओलिविया के शब्दों में: \"ग्रेस एक शूरवीर है या ओलिविया एक शूरवीर है\"। अमेलिया ने कहा, \"ओलिविया एक धूर्त है यदि और केवल यदि एवा एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक शूरवीर है  \n(2) एवा एक धूर्त है  \n(3) ग्रेस एक धूर्त है  \n(4) ओलिविया एक शूरवीर है  \n(5) अमेलिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एवा, हार्पर, एमिली, अबिगेल, और सेबेस्टियन। एवा को यह कहते हुए सुना गया, \"हार्पर एक धूर्त है और अबिगेल एक शूरवीर है\"। हार्पर ने कहा, \"हार्पर एक शूरवीर है\"। एमिली ने कहा: \"अबिगेल एक धूर्त है यदि और केवल यदि हार्पर एक शूरवीर है\"। \"यदि एमिली एक धूर्त है तो हार्पर एक धूर्त है,\" अबिगेल ने घोषणा की। सेबेस्टियन ने कहा कि एमिली एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक शूरवीर है  \n(2) हार्पर एक धूर्त है  \n(3) एमिली एक शूरवीर है  \n(4) अबिगेल एक शूरवीर है  \n(5) सेबेस्टियन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एवरी, ग्रेस, स्कारलेट, माइकल, और एलिज़ाबेथ। एवरी के शब्दों में: \"ग्रेस एक शूरवीर है यदि और केवल यदि एलिज़ाबेथ एक धूर्त है\"। जैसे ग्रेस ने कहा, \"माइकल एक धूर्त है यदि और केवल यदि स्कारलेट एक धूर्त है\"। \"स्कारलेट एक शूरवीर है या एलिज़ाबेथ एक धूर्त है\" - स्कारलेट। माइकल ने कहा, \"ग्रेस एक धूर्त है और स्कारलेट एक शूरवीर है\"। एलिज़ाबेथ को यह कहते हुए सुना गया, \"एवरी एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक धूर्त है  \n(2) ग्रेस एक शूरवीर है  \n(3) स्कारलेट एक धूर्त है  \n(4) माइकल एक धूर्त है  \n(5) एलिज़ाबेथ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एवलिन, अबिगेल, ईथन, लोगन, और सोफिया। एवलिन ने कहा, \"लोगन एक शूरवीर है\"। अबिगेल ने कहा, \"सोफिया एक शूरवीर है और एवलिन एक धूर्त है\"। \"लोगन एक धूर्त है या एवलिन एक धूर्त है,\" ईथन ने घोषणा की। लोगन ने कहा, \"सोफिया एक शूरवीर है यदि और केवल यदि ईथन एक शूरवीर है\"। सोफिया ने आपको बताया कि अबिगेल एक शूरवीर है या लोगन एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक शूरवीर है  \n(2) अबिगेल एक धूर्त है  \n(3) ईथन एक धूर्त है  \n(4) लोगन एक शूरवीर है  \n(5) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: याकूब, जैक, लुकास, एवरी, और लिली। याकूब ने आपको बताया कि लुकास एक शूरवीर है या एवरी एक शूरवीर है। जैक ने कहा: \"जैक एक शूरवीर है और याकूब एक शूरवीर है\"। लुकास के अनुसार, \"जैक एक शूरवीर नहीं है\"। एवरी को यह कहते हुए सुना गया, \"लुकास एक धूर्त है यदि और केवल यदि याकूब एक धूर्त है\"। लिली ने कहा कि एवरी एक शूरवीर है यदि और केवल यदि लुकास एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) याकूब एक शूरवीर है  \n(2) जैक एक धूर्त है  \n(3) लुकास एक शूरवीर है  \n(4) एवरी एक शूरवीर है  \n(5) लिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: अमेलिया, एवरी, सोफिया, औरोरा, और नूह। अमेलिया ने आपको बताया कि अगर अमेलिया एक शूरवीर है तो औरोरा एक धूर्त है। एवरी ने कहा कि नूह एक शूरवीर है या औरोरा एक शूरवीर है। सोफिया को यह कहते हुए सुना गया, \"सोफिया एक शूरवीर है या औरोरा एक धूर्त है\"। औरोरा के अनुसार, \"एवरी एक धूर्त नहीं है\"। नूह के एक बयान में: \"एवरी एक शूरवीर है यदि और केवल यदि अमेलिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक शूरवीर है  \n(2) एवरी एक धूर्त है  \n(3) सोफिया एक शूरवीर है  \n(4) औरोरा एक धूर्त है  \n(5) नूह एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: राइली, नूह, एला, इसाबेला, और एवा। \"नूह एक शूरवीर है और नूह एक धूर्त है\" - राइली। नूह को यह कहते हुए सुना गया, \"अगर इसाबेला एक शूरवीर है तो राइली एक शूरवीर है\"। \"राइली एक शूरवीर नहीं है,\" एला ने कहा। जैसे इसाबेला ने कहा, \"एला एक शूरवीर नहीं है\"। एवा ने कहा: \"इसाबेला एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक धूर्त है  \n(2) नूह एक शूरवीर है  \n(3) एला एक शूरवीर है  \n(4) इसाबेला एक धूर्त है  \n(5) एवा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एलिज़ाबेथ, ल्यूक, एम्मा, राइली, और सोफिया। एलिज़ाबेथ ने कहा, \"राइली एक शूरवीर है और एम्मा एक धूर्त है\"। ल्यूक ने कहा, \"ल्यूक एक शूरवीर है यदि और केवल यदि एलिज़ाबेथ एक धूर्त है\"। एम्मा ने कहा, \"राइली एक धूर्त है यदि और केवल यदि सोफिया एक धूर्त है\"। \"सोफिया एक शूरवीर नहीं है,\" राइली ने घोषणा की। सोफिया ने टिप्पणी की, \"ल्यूक एक धूर्त है या एलिज़ाबेथ एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक धूर्त है  \n(2) ल्यूक एक धूर्त है  \n(3) एम्मा एक धूर्त है  \n(4) राइली एक धूर्त है  \n(5) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: विक्टोरिया, पेनलोप, ईथन, औरोरा, और सेबेस्टियन। विक्टोरिया ने कहा, \"औरोरा एक शूरवीर है\"। पेनलोप ने कहा, \"ईथन एक शूरवीर है या सेबेस्टियन एक धूर्त है\"। ईथन के एक बयान में: \"अगर विक्टोरिया एक शूरवीर है तो पेनलोप एक धूर्त है\"। औरोरा ने कहा, \"पेनलोप एक धूर्त है और ईथन एक धूर्त है\"। \"पेनलोप एक शूरवीर है या ईथन एक धूर्त है,\" सेबेस्टियन ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विक्टोरिया एक धूर्त है  \n(2) पेनलोप एक शूरवीर है  \n(3) ईथन एक शूरवीर है  \n(4) औरोरा एक धूर्त है  \n(5) सेबेस्टियन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एला, डैनियल, हार्पर, बेंजामिन, और मिया। \"हार्पर एक धूर्त है और हार्पर एक शूरवीर है,\" एला ने कहा। डैनियल ने टिप्पणी की, \"अगर एला एक शूरवीर है तो डैनियल एक शूरवीर है।\" \"अगर बेंजामिन एक धूर्त है तो डैनियल एक शूरवीर है,\" हार्पर ने कहा। \"बेंजामिन एक शूरवीर है या हार्पर एक शूरवीर है,\" बेंजामिन ने दावा किया। मिया ने कहा, \"बेंजामिन एक धूर्त है यदि और केवल यदि एला एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक धूर्त है  \n(2) डैनियल एक शूरवीर है  \n(3) हार्पर एक शूरवीर है  \n(4) बेंजामिन एक शूरवीर है  \n(5) मिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एमिली, एम्मा, स्कारलेट, अमेलिया, और औरोरा। एमिली ने कहा, \"औरोरा एक धूर्त है यदि और केवल यदि एम्मा एक शूरवीर है।\" एम्मा ने कहा, \"औरोरा एक शूरवीर है।\" स्कारलेट ने टिप्पणी की, \"अमेलिया एक धूर्त है या अमेलिया एक शूरवीर है।\" अमेलिया के शब्दों में: \"औरोरा एक धूर्त है यदि और केवल यदि एमिली एक शूरवीर है।\" औरोरा के एक बयान में: \"यदि स्कारलेट एक धूर्त है तो एम्मा एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक धूर्त है  \n(2) एम्मा एक शूरवीर है  \n(3) स्कारलेट एक शूरवीर है  \n(4) अमेलिया एक शूरवीर है  \n(5) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: एवरी, विक्टोरिया, एम्मा, हार्पर, और ईथन। एवरी ने कहा, \"विक्टोरिया एक शूरवीर है\"। \"हार्पर एक शूरवीर है और ईथन एक शूरवीर है,\" विक्टोरिया ने दावा किया। एम्मा के अनुसार, \"हार्पर एक शूरवीर है या हार्पर एक धूर्त है\"। हार्पर के एक बयान में: \"विक्टोरिया एक धूर्त है या विक्टोरिया एक शूरवीर है\"। ईथन ने कहा: \"विक्टोरिया एक शूरवीर है या एम्मा एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक शूरवीर है  \n(2) विक्टोरिया एक शूरवीर है  \n(3) एम्मा एक शूरवीर है  \n(4) हार्पर एक शूरवीर है  \n(5) ईथन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: क्लोई, ओवेन, लियम, मेसन, और पेनलोप। जैसा कि क्लोई ने कहा, \"अगर मेसन एक शूरवीर है तो मेसन एक धूर्त है\"। ओवेन के अनुसार, \"लियम एक धूर्त है यदि और केवल यदि मेसन एक धूर्त है\"। लियम ने कहा: \"मेसन एक शूरवीर है\"। मेसन ने कहा, \"अगर क्लोई एक धूर्त है तो ओवेन एक शूरवीर है\"। पेनलोप ने कहा कि मेसन एक शूरवीर है यदि और केवल यदि लियम एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) क्लोई एक धूर्त है  \n(2) ओवेन एक शूरवीर है  \n(3) लियम एक शूरवीर है  \n(4) मेसन एक शूरवीर है  \n(5) पेनलोप एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 5 निवासियों से मिलते हैं: ओलिविया, शार्लट, सेबेस्टियन, मेसन, और एलिज़ाबेथ। ओलिविया ने कहा कि मेसन एक शूरवीर है यदि और केवल यदि सेबेस्टियन एक शूरवीर है। शार्लट के एक बयान में: \"मेसन एक धूर्त है या सेबेस्टियन एक धूर्त है\"। \"यदि शार्लट एक शूरवीर है तो ओलिविया एक धूर्त है,\" सेबेस्टियन ने उल्लेख किया। मेसन ने कहा कि शार्लट एक धूर्त है यदि और केवल यदि एलिज़ाबेथ एक शूरवीर है। एलिज़ाबेथ ने कहा, \"मेसन एक धूर्त है यदि और केवल यदि ओलिविया एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक शूरवीर है  \n(2) शार्लट एक शूरवीर है  \n(3) सेबेस्टियन एक धूर्त है  \n(4) मेसन एक धूर्त है  \n(5) एलिज़ाबेथ एक शूरवीर है"
    }
]