[
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: डैनियल, ओवेन, क्लोई, एवा, यूसुफ, अलेक्जेंडर, राइली, और नूह। डैनियल के एक बयान में: \"यूसुफ एक धूर्त है और ओवेन एक धूर्त है\"। ओवेन को यह कहते हुए सुना गया, \"एवा एक शूरवीर है और डैनियल एक शूरवीर है\"। क्लोई ने टिप्पणी की, \"राइली एक धूर्त नहीं है\"। एवा ने कहा, \"नूह एक शूरवीर है यदि और केवल यदि यूसुफ एक शूरवीर है\"। \"यदि एवा एक शूरवीर है तो अलेक्जेंडर एक शूरवीर है\" - यूसुफ। अलेक्जेंडर ने टिप्पणी की, \"एवा एक शूरवीर है यदि और केवल यदि डैनियल एक धूर्त है\"। राइली ने कहा, \"एवा एक धूर्त नहीं है\"। नूह ने कहा कि ओवेन एक शूरवीर है या डैनियल एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक धूर्त है  \n(2) ओवेन एक धूर्त है  \n(3) क्लोई एक शूरवीर है  \n(4) एवा एक शूरवीर है  \n(5) यूसुफ एक शूरवीर है  \n(6) अलेक्जेंडर एक शूरवीर है  \n(7) राइली एक शूरवीर है  \n(8) नूह एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मैथ्यू, एमिली, अलेक्जेंडर, सोफिया, विक्टोरिया, अबिगेल, इसाबेला, और मेसन। मैथ्यू ने कहा: \"सोफिया एक शूरवीर है और इसाबेला एक धूर्त है\"। एमिली ने कहा कि मेसन एक शूरवीर है या अबिगेल एक शूरवीर है। अलेक्जेंडर ने कहा, \"अगर मेसन एक धूर्त है तो इसाबेला एक धूर्त है\"। सोफिया के अनुसार, \"अगर अबिगेल एक शूरवीर है तो मेसन एक शूरवीर है\"। विक्टोरिया ने आपको बताया कि विक्टोरिया एक शूरवीर है या सोफिया एक धूर्त है। अबिगेल के अनुसार, \"अलेक्जेंडर एक शूरवीर नहीं है\"। इसाबेला के शब्दों में: \"अबिगेल एक धूर्त है या मेसन एक धूर्त है\"। मेसन ने कहा कि विक्टोरिया एक शूरवीर है और विक्टोरिया एक धूर्त है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) मैथ्यू एक धूर्त है  \n(2) एमिली एक शूरवीर है  \n(3) अलेक्जेंडर एक धूर्त है  \n(4) सोफिया एक धूर्त है  \n(5) विक्टोरिया एक शूरवीर है  \n(6) अबिगेल एक शूरवीर है  \n(7) इसाबेला एक शूरवीर है  \n(8) मेसन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ल्यूक, आरिया, अमेलिया, स्कारलेट, बेंजामिन, सोफिया, डेविड, और माइकल। \"सोफिया एक शूरवीर है और बेंजामिन एक शूरवीर है,\" ल्यूक ने दावा किया। आरिया को यह कहते हुए सुना गया, \"माइकल एक शूरवीर है\"। अमेलिया ने कहा, \"माइकल एक धूर्त नहीं है\"। \"बेंजामिन एक धूर्त है,\" स्कारलेट ने दावा किया। बेंजामिन ने कहा, \"माइकल एक धूर्त है और अमेलिया एक धूर्त है\"। सोफिया ने कहा, \"अमेलिया एक धूर्त है\"। डेविड ने टिप्पणी की, \"स्कारलेट एक धूर्त है या ल्यूक एक शूरवीर है\"। \"स्कारलेट एक धूर्त है यदि और केवल यदि डेविड एक शूरवीर है,\" माइकल ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक धूर्त है  \n(2) आरिया एक शूरवीर है  \n(3) अमेलिया एक शूरवीर है  \n(4) स्कारलेट एक शूरवीर है  \n(5) बेंजामिन एक धूर्त है  \n(6) सोफिया एक धूर्त है  \n(7) डेविड एक धूर्त है  \n(8) माइकल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: सैमुएल, ल्यूक, इसाबेला, याकूब, एलिज़ाबेथ, ज़ोई, अलेक्जेंडर, और जैक। सैमुएल ने कहा, \"एलिज़ाबेथ धूर्त नहीं है\"। ल्यूक के अनुसार, \"एलिज़ाबेथ धूर्त नहीं है\"। इसाबेला को यह कहते हुए सुना गया, \"जैक धूर्त है या एलिज़ाबेथ धूर्त है\"। \"ल्यूक एक शूरवीर है\" - याकूब। एलिज़ाबेथ ने कहा, \"इसाबेला धूर्त नहीं है\"। ज़ोई के अनुसार, \"अगर एलिज़ाबेथ एक शूरवीर है तो अलेक्जेंडर एक शूरवीर है\"। अलेक्जेंडर ने कहा कि इसाबेला एक शूरवीर है। जैक ने कहा कि सैमुएल धूर्त है या ल्यूक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक शूरवीर है  \n(2) ल्यूक एक शूरवीर है  \n(3) इसाबेला एक शूरवीर है  \n(4) याकूब एक शूरवीर है  \n(5) एलिज़ाबेथ एक शूरवीर है  \n(6) ज़ोई एक शूरवीर है  \n(7) अलेक्जेंडर एक शूरवीर है  \n(8) जैक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: अलेक्जेंडर, हार्पर, एवलिन, जैक्सन, जेम्स, जैक, अमेलिया, और लुकास। \"जैक एक शूरवीर है\" - अलेक्जेंडर। हार्पर को यह कहते हुए सुना गया, \"लुकास एक शूरवीर है या एवलिन एक धूर्त है\"। एवलिन ने कहा, \"जेम्स एक धूर्त है।\" जैक्सन ने कहा, \"जैक एक शूरवीर है और अमेलिया एक धूर्त है\"। \"लुकास एक शूरवीर नहीं है,\" जेम्स ने दावा किया। जैक ने टिप्पणी की, \"हार्पर एक धूर्त है\"। जैसे अमेलिया ने कहा, \"अलेक्जेंडर एक धूर्त है और जैक एक शूरवीर है\"। लुकास ने कहा, \"अलेक्जेंडर एक धूर्त है यदि और केवल यदि हार्पर एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अलेक्जेंडर एक धूर्त है  \n(2) हार्पर एक शूरवीर है  \n(3) एवलिन एक शूरवीर है  \n(4) जैक्सन एक धूर्त है  \n(5) जेम्स एक धूर्त है  \n(6) जैक एक धूर्त है  \n(7) अमेलिया एक धूर्त है  \n(8) लुकास एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: लियम, एलिज़ाबेथ, औरोरा, ओवेन, ल्यूक, बेंजामिन, सैमुएल, और ग्रेस। लियम ने कहा, \"बेंजामिन एक शूरवीर है या सैमुएल एक शूरवीर है।\" एलिज़ाबेथ ने टिप्पणी की, \"ग्रेस एक शूरवीर है या ओवेन एक शूरवीर है।\" \"बेंजामिन एक शूरवीर है या ल्यूक एक धूर्त है,\" औरोरा ने घोषित किया। ओवेन ने व्यक्त किया कि सैमुएल एक शूरवीर है यदि और केवल यदि ल्यूक एक शूरवीर है। जैसे ल्यूक ने कहा, \"यदि लियम एक धूर्त है तो ग्रेस एक शूरवीर है।\" बेंजामिन ने asserted किया: \"यदि एलिज़ाबेथ एक धूर्त है तो ओवेन एक शूरवीर है।\" सैमुएल के एक बयान में: \"एलिज़ाबेथ एक शूरवीर है।\" ग्रेस ने कहा, \"एलिज़ाबेथ एक शूरवीर है और लियम एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक शूरवीर है  \n(2) एलिज़ाबेथ एक शूरवीर है  \n(3) औरोरा एक शूरवीर है  \n(4) ओवेन एक शूरवीर है  \n(5) ल्यूक एक शूरवीर है  \n(6) बेंजामिन एक शूरवीर है  \n(7) सैमुएल एक शूरवीर है  \n(8) ग्रेस एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एमिली, बेंजामिन, अबिगेल, पेनलोप, सैमुएल, सोफिया, लियम, और नूह। \"सैमुएल एक शूरवीर है और पेनलोप एक शूरवीर है,\" एमिली ने कहा। बेंजामिन ने कहा कि लियम एक शूरवीर है। जैसा कि अबिगेल ने कहा, \"अबिगेल एक शूरवीर है यदि और केवल यदि बेंजामिन एक धूर्त है।\" \"एमिली एक धूर्त नहीं है,\" पेनलोप ने दावा किया। सैमुएल ने कहा कि एमिली एक धूर्त है और पेनलोप एक धूर्त है। \"लियम एक धूर्त नहीं है,\" सोफिया ने कहा। लियम ने आपको बताया कि सैमुएल एक धूर्त है यदि और केवल यदि अबिगेल एक शूरवीर है। नूह ने टिप्पणी की, \"सोफिया एक धूर्त है यदि और केवल यदि सैमुएल एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक धूर्त है  \n(2) बेंजामिन एक धूर्त है  \n(3) अबिगेल एक शूरवीर है  \n(4) पेनलोप एक धूर्त है  \n(5) सैमुएल एक शूरवीर है  \n(6) सोफिया एक धूर्त है  \n(7) लियम एक धूर्त है  \n(8) नूह एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: सेबेस्टियन, डेविड, विक्टोरिया, ईथन, एवा, पेनलोप, लुकास, और अलेक्जेंडर। \"पेनलोप एक शूरवीर है यदि और केवल यदि एवा एक शूरवीर है,\" सेबेस्टियन ने कहा। डेविड के शब्दों में: \"लुकास एक शूरवीर है और एवा एक धूर्त है\"। विक्टोरिया को यह कहते हुए सुना गया, \"एवा एक धूर्त है और डेविड एक धूर्त है\"। \"डेविड एक धूर्त है और लुकास एक धूर्त है,\" ईथन ने दावा किया। एवा ने कहा, \"अलेक्जेंडर एक धूर्त है और ईथन एक शूरवीर है\"। पेनलोप के शब्दों में: \"विक्टोरिया एक धूर्त नहीं है\"। लुकास के शब्दों में: \"अलेक्जेंडर एक धूर्त है और विक्टोरिया एक शूरवीर है\"। अलेक्जेंडर ने कहा, \"ईथन एक शूरवीर है यदि और केवल यदि डेविड एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सेबेस्टियन एक धूर्त है  \n(2) डेविड एक धूर्त है  \n(3) विक्टोरिया एक धूर्त है  \n(4) ईथन एक शूरवीर है  \n(5) एवा एक शूरवीर है  \n(6) पेनलोप एक धूर्त है  \n(7) लुकास एक धूर्त है  \n(8) अलेक्जेंडर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: हेनरी, लोगन, जेम्स, लिली, ज़ोई, स्कारलेट, विक्टोरिया, और मेसन। हेनरी ने टिप्पणी की, \"हेनरी एक शूरवीर है और स्कारलेट एक धूर्त है\"। जैसे लोगन ने कहा, \"जेम्स एक शूरवीर है या ज़ोई एक धूर्त है\"। जेम्स ने आपको बताया कि हेनरी एक शूरवीर है और ज़ोई एक शूरवीर है। लिली ने आपको बताया कि स्कारलेट एक धूर्त है। \"लिली एक धूर्त है और लिली एक शूरवीर है\" - ज़ोई। स्कारलेट ने कहा, \"हेनरी एक धूर्त है या विक्टोरिया एक धूर्त है\"। विक्टोरिया के अनुसार, \"ज़ोई एक धूर्त नहीं है\"। \"लिली एक धूर्त है या स्कारलेट एक धूर्त है,\" मेसन ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हेनरी एक धूर्त है  \n(2) लोगन एक शूरवीर है  \n(3) जेम्स एक धूर्त है  \n(4) लिली एक धूर्त है  \n(5) ज़ोई एक धूर्त है  \n(6) स्कारलेट एक शूरवीर है  \n(7) विक्टोरिया एक धूर्त है  \n(8) मेसन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: सेबेस्टियन, लोगन, मिया, ईथन, राइली, हार्पर, मैथ्यू, और ऐडन। सेबेस्टियन के एक बयान में: \"ऐडन एक शूरवीर है या हार्पर एक धूर्त है\"। लोगन को कहते हुए सुना गया, \"ईथन एक शूरवीर है या ऐडन एक शूरवीर है\"। मिया को कहते हुए सुना गया, \"मैथ्यू एक धूर्त है और हार्पर एक शूरवीर है\"। ईथन ने टिप्पणी की, \"लोगन एक शूरवीर है\"। राइली ने remarked किया, \"अगर हार्पर एक शूरवीर है तो लोगन एक शूरवीर है\"। हार्पर ने टिप्पणी की, \"ईथन एक धूर्त नहीं है\"। मैथ्यू ने नोट किया, \"सेबेस्टियन एक शूरवीर है और मिया एक धूर्त है\"। \"लोगन एक धूर्त है\" - ऐडन। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सेबेस्टियन एक धूर्त है  \n(2) लोगन एक शूरवीर है  \n(3) मिया एक शूरवीर है  \n(4) ईथन एक शूरवीर है  \n(5) राइली एक शूरवीर है  \n(6) हार्पर एक शूरवीर है  \n(7) मैथ्यू एक धूर्त है  \n(8) ऐडन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मैथ्यू, एमिली, औरोरा, याकूब, अमेलिया, लियम, जेम्स, और अलेक्जेंडर। \"एमिली शूरवीर नहीं है\" - मैथ्यू। जैसे कि एमिली ने कहा, \"अगर मैथ्यू शूरवीर है तो अलेक्जेंडर शूरवीर है\"। \"एमिली धूर्त नहीं है,\" औरोरा ने दावा किया। \"अलेक्जेंडर धूर्त है और जेम्स धूर्त है\" - याकूब। अमेलिया ने कहा कि एमिली शूरवीर है या औरोरा शूरवीर है। \"एमिली धूर्त है और अलेक्जेंडर शूरवीर है,\" लियम ने दावा किया। \"लियम शूरवीर है यदि और केवल यदि औरोरा धूर्त है,\" जेम्स ने दावा किया। अलेक्जेंडर ने asserted किया: \"अगर अलेक्जेंडर शूरवीर है तो याकूब धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक धूर्त है  \n(2) एमिली एक शूरवीर है  \n(3) औरोरा एक शूरवीर है  \n(4) याकूब एक धूर्त है  \n(5) अमेलिया एक शूरवीर है  \n(6) लियम एक धूर्त है  \n(7) जेम्स एक शूरवीर है  \n(8) अलेक्जेंडर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एवरी, याकूब, एमिली, ओवेन, क्लोई, सेबेस्टियन, लोगन, और जैक। एवरी के शब्दों में: \"याकूब एक धूर्त नहीं है\"। याकूब ने आपको बताया कि जैक एक शूरवीर है और सेबेस्टियन एक धूर्त है। \"जैक एक धूर्त है और जैक एक शूरवीर है,\" एमिली ने घोषणा की। ओवेन को यह कहते हुए सुना गया, \"एमिली एक धूर्त है\"। क्लोई के एक बयान में: \"सेबेस्टियन एक धूर्त है या लोगन एक शूरवीर है\"। सेबेस्टियन ने कहा कि एवरी एक धूर्त है और एमिली एक शूरवीर है। लोगन ने कहा, \"क्लोई एक धूर्त है या जैक एक शूरवीर है\"। \"क्लोई एक शूरवीर है या सेबेस्टियन एक शूरवीर है,\" जैक ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक शूरवीर है  \n(2) याकूब एक शूरवीर है  \n(3) एमिली एक धूर्त है  \n(4) ओवेन एक शूरवीर है  \n(5) क्लोई एक शूरवीर है  \n(6) सेबेस्टियन एक धूर्त है  \n(7) लोगन एक शूरवीर है  \n(8) जैक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मेसन, एमिली, ल्यूक, जेम्स, राइली, अमेलिया, अलेक्जेंडर, और डैनियल। मेसन ने कहा, \"एमिली एक धूर्त है और डैनियल एक शूरवीर है।\" एमिली के अनुसार, \"मेसन एक शूरवीर है।\" ल्यूक ने asserted किया: \"अगर अमेलिया एक धूर्त है तो अलेक्जेंडर एक शूरवीर है।\" जेम्स ने कहा कि मेसन एक धूर्त है या ल्यूक एक शूरवीर है। राइली ने कहा, \"मेसन एक शूरवीर है या अलेक्जेंडर एक शूरवीर है।\" अमेलिया के एक बयान में: \"एमिली एक धूर्त है यदि और केवल यदि अमेलिया एक शूरवीर है।\" अलेक्जेंडर ने कहा, \"अमेलिया एक धूर्त है यदि और केवल यदि ल्यूक एक शूरवीर है।\" डैनियल ने remarked किया, \"मेसन एक धूर्त है यदि और केवल यदि अलेक्जेंडर एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) एमिली एक धूर्त है  \n(3) ल्यूक एक शूरवीर है  \n(4) जेम्स एक शूरवीर है  \n(5) राइली एक शूरवीर है  \n(6) अमेलिया एक धूर्त है  \n(7) अलेक्जेंडर एक शूरवीर है  \n(8) डैनियल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एवलिन, ज़ोई, लोगन, स्कारलेट, नूह, ल्यूक, मिया, और याकूब। \"याकूब एक धूर्त है\" - एवलिन। \"ल्यूक एक शूरवीर है और एवलिन एक शूरवीर है,\" ज़ोई ने कहा। \"ज़ोई एक धूर्त नहीं है,\" लोगन ने घोषित किया। स्कारलेट ने कहा, \"ल्यूक एक धूर्त है और ज़ोई एक शूरवीर है\"। नूह को यह कहते हुए सुना गया, \"स्कारलेट एक धूर्त है\"। ल्यूक ने व्यक्त किया कि लोगन एक शूरवीर है या ल्यूक एक शूरवीर है। \"ज़ोई एक धूर्त है या मिया एक शूरवीर है,\" मिया ने घोषित किया। याकूब को यह कहते हुए सुना गया, \"ल्यूक एक शूरवीर है और लोगन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक शूरवीर है  \n(2) ज़ोई एक धूर्त है  \n(3) लोगन एक धूर्त है  \n(4) स्कारलेट एक धूर्त है  \n(5) नूह एक शूरवीर है  \n(6) ल्यूक एक धूर्त है  \n(7) मिया एक शूरवीर है  \n(8) याकूब एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: लोगन, इसाबेला, एमिली, विक्टोरिया, यूसुफ, याकूब, हेनरी, और ग्रेस। लोगन ने कहा, \"इसाबेला एक शूरवीर है या याकूब एक धूर्त है\"। इसाबेला ने कहा, \"हेनरी एक धूर्त है या याकूब एक धूर्त है\"। \"एमिली एक शूरवीर है और ग्रेस एक शूरवीर है\" - एमिली। विक्टोरिया को यह कहते हुए सुना गया, \"लोगन एक शूरवीर है और ग्रेस एक धूर्त है\"। यूसुफ ने कहा, \"इसाबेला एक धूर्त है या हेनरी एक शूरवीर है\"। जैसे याकूब ने कहा, \"लोगन एक शूरवीर नहीं है\"। हेनरी ने टिप्पणी की, \"इसाबेला एक शूरवीर है\"। ग्रेस ने कहा, \"एमिली एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक शूरवीर है  \n(2) इसाबेला एक शूरवीर है  \n(3) एमिली एक धूर्त है  \n(4) विक्टोरिया एक धूर्त है  \n(5) यूसुफ एक शूरवीर है  \n(6) याकूब एक धूर्त है  \n(7) हेनरी एक शूरवीर है  \n(8) ग्रेस एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: जैक्सन, डेविड, हार्पर, क्लोई, जेम्स, लोगन, लिली, और ज़ोई। जैक्सन ने कहा, \"ज़ोई एक शूरवीर है\"। डेविड ने कहा, \"जेम्स एक शूरवीर है और डेविड एक शूरवीर है\"। हार्पर ने कहा, \"लिली एक धूर्त है\"। क्लोई ने कहा, \"डेविड एक शूरवीर है यदि और केवल यदि जेम्स एक शूरवीर है\"। जेम्स ने कहा, \"यदि जेम्स एक शूरवीर है तो क्लोई एक धूर्त है\"। लोगन ने कहा, \"डेविड एक धूर्त है या डेविड एक शूरवीर है\"। लिली ने कहा, \"डेविड एक धूर्त नहीं है\"। ज़ोई ने कहा कि लोगन एक शूरवीर है और जेम्स एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) जैक्सन एक शूरवीर है  \n(2) डेविड एक धूर्त है  \n(3) हार्पर एक शूरवीर है  \n(4) क्लोई एक धूर्त है  \n(5) जेम्स एक शूरवीर है  \n(6) लोगन एक शूरवीर है  \n(7) लिली एक धूर्त है  \n(8) ज़ोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: सोफिया, लियम, शार्लट, ज़ोई, विक्टोरिया, एमिली, जैक, और राइली। सोफिया ने कहा कि विक्टोरिया एक धूर्त है या विक्टोरिया एक शूरवीर है। लियम ने कहा, \"अगर विक्टोरिया एक शूरवीर है तो सोफिया एक शूरवीर है\"। शार्लट ने आपको बताया कि राइली एक धूर्त है या जैक एक शूरवीर है। \"लियम एक शूरवीर है और जैक एक धूर्त है\" - ज़ोई। विक्टोरिया ने कहा, \"ज़ोई एक धूर्त नहीं है\"। एमिली ने टिप्पणी की, \"राइली एक धूर्त है और जैक एक शूरवीर है\"। जैक ने आपको बताया कि सोफिया एक शूरवीर नहीं है। राइली के शब्दों में: \"एमिली एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) लियम एक शूरवीर है  \n(3) शार्लट एक शूरवीर है  \n(4) ज़ोई एक शूरवीर है  \n(5) विक्टोरिया एक शूरवीर है  \n(6) एमिली एक धूर्त है  \n(7) जैक एक धूर्त है  \n(8) राइली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: माइकल, एवरी, नूह, जैक, हेनरी, अमेलिया, शार्लट, और पेनलोप। \"शार्लट एक धूर्त है\" - माइकल। एवरी ने आपको बताया कि अगर पेनलोप एक धूर्त है तो नूह एक शूरवीर है। नूह ने कहा कि अमेलिया एक धूर्त नहीं है। \"अगर नूह एक धूर्त है तो हेनरी एक शूरवीर है,\" जैक ने कहा। \"माइकल एक धूर्त है और हेनरी एक शूरवीर है\" - हेनरी। अमेलिया ने कहा कि अगर पेनलोप एक धूर्त है तो एवरी एक शूरवीर है। शार्लट ने नोट किया, \"जैक एक धूर्त है यदि और केवल यदि एवरी एक धूर्त है\"। जैसा कि पेनलोप ने कहा, \"एवरी एक धूर्त है यदि और केवल यदि पेनलोप एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक धूर्त है  \n(2) एवरी एक धूर्त है  \n(3) नूह एक धूर्त है  \n(4) जैक एक धूर्त है  \n(5) हेनरी एक धूर्त है  \n(6) अमेलिया एक धूर्त है  \n(7) शार्लट एक शूरवीर है  \n(8) पेनलोप एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एवरी, औरोरा, सोफिया, माइकल, शार्लट, पेनलोप, ज़ोई, और विक्टोरिया। एवरी ने कहा, \"सोफिया एक धूर्त है और एवरी एक शूरवीर है\"। औरोरा ने कहा, \"माइकल एक शूरवीर है।\" सोफिया ने कहा कि शार्लट एक शूरवीर है या एवरी एक धूर्त है। \"माइकल एक शूरवीर है और पेनलोप एक धूर्त है,\" माइकल ने घोषणा की। शार्लट ने कहा, \"पेनलोप एक धूर्त है या माइकल एक शूरवीर है\"। पेनलोप को यह कहते हुए सुना गया, \"माइकल एक शूरवीर है\"। ज़ोई के शब्दों में: \"अगर ज़ोई एक शूरवीर है तो माइकल एक धूर्त है\"। विक्टोरिया ने कहा, \"शार्लट एक शूरवीर नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक धूर्त है  \n(2) औरोरा एक धूर्त है  \n(3) सोफिया एक शूरवीर है  \n(4) माइकल एक धूर्त है  \n(5) शार्लट एक शूरवीर है  \n(6) पेनलोप एक धूर्त है  \n(7) ज़ोई एक शूरवीर है  \n(8) विक्टोरिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मिया, ईथन, अलेक्जेंडर, नूह, जैक्सन, एवा, अबिगेल, और ऐडन। मिया ने कहा कि अगर ईथन एक धूर्त है तो मिया एक शूरवीर है। ईथन ने टिप्पणी की, \"मिया एक धूर्त है\"। अलेक्जेंडर ने कहा कि ईथन एक शूरवीर है। नूह ने कहा कि मिया एक शूरवीर है। जैक्सन ने कहा, \"नूह एक धूर्त है\"। एवा ने कहा कि अलेक्जेंडर एक शूरवीर है और ईथन एक धूर्त है। \"नूह एक धूर्त है और अबिगेल एक शूरवीर है\" - अबिगेल। \"ईथन एक शूरवीर है या एवा एक धूर्त है\" - ऐडन। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक शूरवीर है  \n(2) ईथन एक धूर्त है  \n(3) अलेक्जेंडर एक धूर्त है  \n(4) नूह एक शूरवीर है  \n(5) जैक्सन एक धूर्त है  \n(6) एवा एक धूर्त है  \n(7) अबिगेल एक धूर्त है  \n(8) ऐडन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: यूसुफ, ल्यूक, हार्पर, सोफिया, माइकल, पेनलोप, हेनरी, और क्लोई। यूसुफ ने कहा, \"क्लोई एक धूर्त है या ल्यूक एक धूर्त है\"। ल्यूक ने कहा, \"पेनलोप एक शूरवीर नहीं है\"। हार्पर ने कहा, \"माइकल एक शूरवीर नहीं है\"। सोफिया को यह कहते हुए सुना गया, \"अगर ल्यूक एक धूर्त है तो हेनरी एक धूर्त है\"। माइकल ने कहा कि यूसुफ एक धूर्त है। \"ल्यूक एक धूर्त है\" - पेनलोप। हेनरी ने कहा कि पेनलोप एक धूर्त है यदि और केवल यदि ल्यूक एक शूरवीर है। \"यूसुफ एक शूरवीर है और हेनरी एक शूरवीर है\" - क्लोई। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) यूसुफ एक शूरवीर है  \n(2) ल्यूक एक धूर्त है  \n(3) हार्पर एक शूरवीर है  \n(4) सोफिया एक धूर्त है  \n(5) माइकल एक धूर्त है  \n(6) पेनलोप एक शूरवीर है  \n(7) हेनरी एक शूरवीर है  \n(8) क्लोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: सैमुएल, अमेलिया, एलिज़ाबेथ, अबिगेल, यूसुफ, मिया, एवलिन, और विलियम। सैमुएल ने कहा: \"यूसुफ एक धूर्त है और मिया एक शूरवीर है\"। अमेलिया के एक बयान में: \"यूसुफ एक शूरवीर है और सैमुएल एक शूरवीर है\"। एलिज़ाबेथ ने टिप्पणी की, \"अमेलिया एक धूर्त है यदि और केवल यदि यूसुफ एक शूरवीर है\"। \"एलिज़ाबेथ एक धूर्त है यदि और केवल यदि एलिज़ाबेथ एक शूरवीर है,\" अबिगेल ने कहा। यूसुफ ने टिप्पणी की, \"यदि मिया एक शूरवीर है तो अमेलिया एक धूर्त है\"। मिया के अनुसार, \"अबिगेल एक धूर्त है\"। एवलिन ने टिप्पणी की, \"एलिज़ाबेथ एक धूर्त है\"। विलियम ने कहा कि विलियम एक शूरवीर है और यूसुफ एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक धूर्त है  \n(2) अमेलिया एक धूर्त है  \n(3) एलिज़ाबेथ एक शूरवीर है  \n(4) अबिगेल एक धूर्त है  \n(5) यूसुफ एक शूरवीर है  \n(6) मिया एक शूरवीर है  \n(7) एवलिन एक धूर्त है  \n(8) विलियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: बेंजामिन, ईथन, अलेक्जेंडर, मिया, ल्यूक, एलिज़ाबेथ, ओलिविया, और हार्पर। \"ओलिविया एक धूर्त है या एलिज़ाबेथ एक शूरवीर है,\" बेंजामिन ने कहा। \"अलेक्जेंडर एक शूरवीर है या मिया एक शूरवीर है,\" ईथन ने घोषित किया। \"अगर ओलिविया एक धूर्त है तो हार्पर एक शूरवीर है,\" अलेक्जेंडर ने कहा। मिया ने कहा, \"ईथन एक शूरवीर है यदि और केवल यदि ईथन एक धूर्त है\"। \"ओलिविया एक शूरवीर है यदि और केवल यदि हार्पर एक शूरवीर है,\" ल्यूक ने दावा किया। जैसा कि एलिज़ाबेथ ने कहा, \"ल्यूक एक शूरवीर है\"। ओलिविया के एक बयान में: \"अगर ईथन एक धूर्त है तो अलेक्जेंडर एक धूर्त है\"। हार्पर के एक बयान में: \"ओलिविया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक शूरवीर है  \n(2) ईथन एक शूरवीर है  \n(3) अलेक्जेंडर एक शूरवीर है  \n(4) मिया एक धूर्त है  \n(5) ल्यूक एक शूरवीर है  \n(6) एलिज़ाबेथ एक शूरवीर है  \n(7) ओलिविया एक शूरवीर है  \n(8) हार्पर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: विलियम, ज़ोई, ईथन, जेम्स, माइकल, हेनरी, पेनलोप, और ओलिवर। \"माइकल एक शूरवीर है,\" विलियम ने घोषणा की। ज़ोई ने कहा, \"ईथन एक शूरवीर है या ओलिवर एक धूर्त है\"। ईथन के अनुसार, \"माइकल एक धूर्त है और ईथन एक शूरवीर है\"। जेम्स के शब्दों में: \"ज़ोई एक धूर्त है या ईथन एक शूरवीर है\"। जैसे माइकल ने कहा, \"विलियम एक शूरवीर है या ओलिवर एक शूरवीर है\"। जैसे हेनरी ने कहा, \"ईथन एक धूर्त नहीं है\"। पेनलोप के अनुसार, \"जेम्स एक शूरवीर है यदि और केवल यदि ओलिवर एक धूर्त है\"। \"ज़ोई एक शूरवीर है या जेम्स एक शूरवीर है\" - ओलिवर। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) ज़ोई एक धूर्त है  \n(3) ईथन एक धूर्त है  \n(4) जेम्स एक शूरवीर है  \n(5) माइकल एक शूरवीर है  \n(6) हेनरी एक धूर्त है  \n(7) पेनलोप एक धूर्त है  \n(8) ओलिवर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: नूह, क्लोई, ज़ोई, ल्यूक, मिया, सेबेस्टियन, जेम्स, और हार्पर। \"मिया एक शूरवीर है,\" नूह ने घोषणा की। क्लोई के एक बयान में: \"ज़ोई एक शूरवीर नहीं है\"। ज़ोई ने कहा, \"जेम्स एक शूरवीर नहीं है\"। ल्यूक के अनुसार, \"मिया एक शूरवीर है और नूह एक धूर्त है\"। मिया ने कहा कि जेम्स एक धूर्त नहीं है। सेबेस्टियन ने asserted: \"नूह एक शूरवीर है यदि और केवल यदि हार्पर एक शूरवीर है\"। \"क्लोई एक धूर्त है यदि और केवल यदि नूह एक धूर्त है\" - जेम्स। हार्पर ने आपको बताया कि ल्यूक एक धूर्त नहीं है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक शूरवीर है  \n(2) क्लोई एक शूरवीर है  \n(3) ज़ोई एक धूर्त है  \n(4) ल्यूक एक धूर्त है  \n(5) मिया एक शूरवीर है  \n(6) सेबेस्टियन एक धूर्त है  \n(7) जेम्स एक शूरवीर है  \n(8) हार्पर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मैथ्यू, मिया, विलियम, सोफिया, सैमुएल, एमिली, एवरी, और इसाबेला। मैथ्यू के शब्दों में: \"इसाबेला एक शूरवीर नहीं है\"। जैसा कि मिया ने कहा, \"मिया एक शूरवीर है या विलियम एक शूरवीर है\"। \"एवरी एक धूर्त है या एवरी एक शूरवीर है,\" विलियम ने उल्लेख किया। सोफिया को यह कहते हुए सुना गया, \"मिया एक धूर्त नहीं है\"। सैमुएल ने टिप्पणी की, \"विलियम एक शूरवीर है या सोफिया एक शूरवीर है\"। एमिली ने आपको बताया कि इसाबेला एक धूर्त नहीं है। एवरी को यह कहते हुए सुना गया, \"अगर मिया एक धूर्त है तो सैमुएल एक शूरवीर है\"। इसाबेला के अनुसार, \"मिया एक शूरवीर है यदि और केवल यदि एवरी एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक शूरवीर है  \n(2) मिया एक शूरवीर है  \n(3) विलियम एक शूरवीर है  \n(4) सोफिया एक शूरवीर है  \n(5) सैमुएल एक शूरवीर है  \n(6) एमिली एक धूर्त है  \n(7) एवरी एक शूरवीर है  \n(8) इसाबेला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: आरिया, एवा, अमेलिया, सेबेस्टियन, जेम्स, लियम, बेंजामिन, और मेसन। आरिया को यह कहते हुए सुना गया, \"एवा एक शूरवीर है या बेंजामिन एक धूर्त है\"। एवा ने कहा, \"बेंजामिन एक धूर्त है या जेम्स एक शूरवीर है।\" अमेलिया ने कहा, \"लियम एक शूरवीर है और बेंजामिन एक शूरवीर है।\" सेबेस्टियन ने कहा, \"मेसेन एक धूर्त है और आरिया एक शूरवीर है।\" जेम्स के अनुसार, \"अगर आरिया एक शूरवीर है तो लियम एक शूरवीर है।\" लियम ने कहा: \"सेबेस्टियन एक धूर्त है या बेंजामिन एक शूरवीर है।\" बेंजामिन ने कहा कि सेबेस्टियन एक धूर्त है या आरिया एक शूरवीर है। \"आरिया एक धूर्त है और आरिया एक शूरवीर है,\" मेसन ने घोषणा की। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) आरिया एक शूरवीर है  \n(2) एवा एक शूरवीर है  \n(3) अमेलिया एक शूरवीर है  \n(4) सेबेस्टियन एक शूरवीर है  \n(5) जेम्स एक शूरवीर है  \n(6) लियम एक शूरवीर है  \n(7) बेंजामिन एक शूरवीर है  \n(8) मेसन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एवरी, एमिली, सैमुएल, अबिगेल, माइकल, नूह, हेनरी, और शार्लट। एवरी ने कहा: \"नूह एक धूर्त है यदि और केवल यदि सैमुएल एक शूरवीर है\"। एमिली के एक बयान में: \"हेनरी एक धूर्त है\"। सैमुएल ने टिप्पणी की, \"अबिगेल एक शूरवीर नहीं है\"। अबिगेल ने व्यक्त किया कि शार्लट एक धूर्त है यदि और केवल यदि नूह एक शूरवीर है। माइकल ने कहा, \"नूह एक शूरवीर नहीं है।\" \"हेनरी एक धूर्त है या सैमुएल एक शूरवीर है,\" नूह ने उल्लेख किया। हेनरी ने कहा कि माइकल एक शूरवीर है यदि और केवल यदि अबिगेल एक धूर्त है। \"यदि माइकल एक शूरवीर है तो हेनरी एक शूरवीर है,\" शार्लट ने दावा किया। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एवरी एक धूर्त है  \n(2) एमिली एक शूरवीर है  \n(3) सैमुएल एक शूरवीर है  \n(4) अबिगेल एक धूर्त है  \n(5) माइकल एक धूर्त है  \n(6) नूह एक शूरवीर है  \n(7) हेनरी एक धूर्त है  \n(8) शार्लट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: लोगन, लुकास, एलिज़ाबेथ, नूह, एवा, हार्पर, शार्लट, और जैक्सन। लोगन ने कहा, \"जैक्सन एक धूर्त है यदि और केवल यदि एलिज़ाबेथ एक धूर्त है\"। लुकास ने asserted किया: \"जैक्सन एक शूरवीर नहीं है\"। एलिज़ाबेथ के एक बयान में: \"एवा एक शूरवीर नहीं है\"। नूह ने कहा, \"शार्लट एक धूर्त है\"। एवा ने कहा, \"यदि एलिज़ाबेथ एक धूर्त है तो नूह एक धूर्त है\"। हार्पर ने कहा, \"जैक्सन एक धूर्त है\"। शार्लट ने asserted किया: \"जैक्सन एक धूर्त है या एलिज़ाबेथ एक शूरवीर है\"। जैक्सन ने कहा, \"जैक्सन एक शूरवीर है यदि और केवल यदि लोगन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक शूरवीर है  \n(2) लुकास एक शूरवीर है  \n(3) एलिज़ाबेथ एक धूर्त है  \n(4) नूह एक धूर्त है  \n(5) एवा एक शूरवीर है  \n(6) हार्पर एक शूरवीर है  \n(7) शार्लट एक शूरवीर है  \n(8) जैक्सन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: लियम, सोफिया, नूह, अलेक्जेंडर, माइकल, ग्रेस, मेसन, और एला। लियम के एक बयान में: \"सोफिया एक शूरवीर नहीं है\"। सोफिया ने कहा, \"अलेक्जेंडर एक धूर्त है\"। नूह ने टिप्पणी की, \"मेसन एक शूरवीर नहीं है\"। अलेक्जेंडर ने कहा, \"मेसन एक शूरवीर है यदि और केवल यदि अलेक्जेंडर एक शूरवीर है\"। माइकल ने asserted किया: \"नूह एक धूर्त है या मेसन एक धूर्त है\"। ग्रेस ने आपको बताया कि लियम एक शूरवीर है यदि और केवल यदि माइकल एक धूर्त है। \"सोफिया एक धूर्त है,\" मेसन ने घोषित किया। एला के शब्दों में: \"यदि अलेक्जेंडर एक शूरवीर है तो मेसन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक शूरवीर है  \n(2) सोफिया एक धूर्त है  \n(3) नूह एक धूर्त है  \n(4) अलेक्जेंडर एक शूरवीर है  \n(5) माइकल एक शूरवीर है  \n(6) ग्रेस एक धूर्त है  \n(7) मेसन एक शूरवीर है  \n(8) एला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: हार्पर, माइकल, मैथ्यू, एवरी, जैक, हेनरी, ओवेन, और लियम। \"माइकल शूरवीर नहीं है,\" हार्पर ने दावा किया। माइकल ने कहा कि मैथ्यू धूर्त है या लियम शूरवीर है। मैथ्यू ने नोट किया, \"जैक शूरवीर है या हेनरी धूर्त है\"। एवरी ने asserted किया: \"यदि ओवेन धूर्त है तो हेनरी धूर्त है\"। \"जैक शूरवीर है यदि और केवल यदि हार्पर शूरवीर है\" - जैक। हेनरी के एक बयान में: \"हार्पर शूरवीर है या जैक शूरवीर है\"। ओवेन के शब्दों में: \"हेनरी शूरवीर नहीं है\"। लियम ने कहा, \"एवरी शूरवीर है और एवरी धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक शूरवीर है  \n(2) माइकल एक धूर्त है  \n(3) मैथ्यू एक शूरवीर है  \n(4) एवरी एक धूर्त है  \n(5) जैक एक शूरवीर है  \n(6) हेनरी एक शूरवीर है  \n(7) ओवेन एक धूर्त है  \n(8) लियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ओलिविया, राइली, विलियम, हेनरी, इसाबेला, शार्लट, एवलिन, और एलिज़ाबेथ। ओलिविया ने कहा कि इसाबेला एक धूर्त है। राइली ने asserted किया: \"इसाबेला एक शूरवीर है या ओलिविया एक धूर्त है\"। विलियम ने remarked किया, \"अगर हेनरी एक धूर्त है तो एवलिन एक धूर्त है\"। हेनरी के शब्दों में: \"राइली एक धूर्त है यदि और केवल यदि हेनरी एक शूरवीर है\"। इसाबेला के शब्दों में: \"अगर हेनरी एक शूरवीर है तो हेनरी एक धूर्त है\"। शार्लट के अनुसार, \"अगर राइली एक शूरवीर है तो शार्लट एक शूरवीर है\"। एवलिन के एक बयान में: \"शार्लट एक धूर्त नहीं है\"। एलिज़ाबेथ के अनुसार, \"ओलिविया एक शूरवीर है और ओलिविया एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ओलिविया एक शूरवीर है  \n(2) राइली एक धूर्त है  \n(3) विलियम एक शूरवीर है  \n(4) हेनरी एक शूरवीर है  \n(5) इसाबेला एक धूर्त है  \n(6) शार्लट एक शूरवीर है  \n(7) एवलिन एक शूरवीर है  \n(8) एलिज़ाबेथ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: सोफिया, विलियम, ओवेन, हेनरी, अबिगेल, पेनलोप, ग्रेस, और क्लोई। सोफिया ने कहा, \"हेनरी एक धूर्त है\"। विलियम ने कहा, \"ओवेन एक शूरवीर नहीं है\"। ओवेन को यह कहते हुए सुना गया, \"क्लोई एक शूरवीर है और अबिगेल एक शूरवीर है\"। हेनरी ने कहा, \"ग्रेस एक शूरवीर नहीं है\"। अबिगेल के अनुसार, \"क्लोई एक शूरवीर है या पेनलोप एक शूरवीर है\"। \"ओवेन एक शूरवीर नहीं है,\" पेनलोप ने कहा। ग्रेस के अनुसार, \"सोफिया एक शूरवीर है या पेनलोप एक शूरवीर है\"। क्लोई के शब्दों में: \"अगर ओवेन एक शूरवीर है तो हेनरी एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) विलियम एक धूर्त है  \n(3) ओवेन एक शूरवीर है  \n(4) हेनरी एक धूर्त है  \n(5) अबिगेल एक शूरवीर है  \n(6) पेनलोप एक धूर्त है  \n(7) ग्रेस एक शूरवीर है  \n(8) क्लोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: जेम्स, यूसुफ, डेविड, एला, आरिया, बेंजामिन, मैथ्यू, और पेनलोप। जेम्स ने कहा, \"बेंजामिन एक धूर्त है यदि और केवल यदि मैथ्यू एक धूर्त है।\" \"आरिया एक धूर्त है यदि और केवल यदि बेंजामिन एक धूर्त है,\" यूसुफ ने घोषित किया। डेविड ने आपको बताया कि यदि डेविड एक शूरवीर है तो पेनलोप एक शूरवीर है। एला ने कहा कि यदि जेम्स एक शूरवीर है तो आरिया एक शूरवीर है। \"यदि एला एक शूरवीर है तो डेविड एक शूरवीर है,\" आरिया ने दावा किया। बेंजामिन ने कहा, \"यूसुफ एक शूरवीर है या पेनलोप एक धूर्त है।\" मैथ्यू ने आपको बताया कि एला एक शूरवीर है और एला एक धूर्त है। पेनलोप ने कहा, \"डेविड एक धूर्त है या जेम्स एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) यूसुफ एक धूर्त है  \n(3) डेविड एक शूरवीर है  \n(4) एला एक शूरवीर है  \n(5) आरिया एक शूरवीर है  \n(6) बेंजामिन एक धूर्त है  \n(7) मैथ्यू एक धूर्त है  \n(8) पेनलोप एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: जैक, एमिली, एवलिन, एला, स्कारलेट, जैक्सन, विलियम, और एवरी। \"एवलिन शूरवीर नहीं है,\" जैक ने कहा। एमिली ने कहा, \"विलियम शूरवीर है यदि और केवल यदि जैक्सन शूरवीर है।\" एवलिन ने कहा, \"यदि स्कारलेट धूर्त है तो एला शूरवीर है।\" एला के अनुसार, \"एवरी धूर्त है।\" स्कारलेट ने कहा, \"विलियम धूर्त नहीं है।\" जैक्सन ने कहा, \"एवलिन धूर्त है और स्कारलेट धूर्त है।\" विलियम ने कहा, \"एमिली धूर्त है या स्कारलेट शूरवीर है।\" एवरी ने आपको बताया कि जैक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक एक धूर्त है  \n(2) एमिली एक धूर्त है  \n(3) एवलिन एक शूरवीर है  \n(4) एला एक धूर्त है  \n(5) स्कारलेट एक शूरवीर है  \n(6) जैक्सन एक धूर्त है  \n(7) विलियम एक शूरवीर है  \n(8) एवरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मेसन, मैथ्यू, क्लोई, औरोरा, लियम, माइकल, विक्टोरिया, और डैनियल। मेसन ने कहा कि औरोरा एक धूर्त है यदि और केवल यदि औरोरा एक शूरवीर है। \"यदि क्लोई एक धूर्त है तो क्लोई एक शूरवीर है,\" मैथ्यू ने दावा किया। \"यदि माइकल एक शूरवीर है तो मैथ्यू एक शूरवीर है,\" क्लोई ने कहा। \"माइकल एक शूरवीर नहीं है,\" औरोरा ने कहा। लियम ने कहा कि विक्टोरिया एक शूरवीर है या माइकल एक शूरवीर है। माइकल को यह कहते हुए सुना गया, \"क्लोई एक धूर्त है और विक्टोरिया एक धूर्त है\"। विक्टोरिया ने कहा, \"मैथ्यू एक धूर्त है यदि और केवल यदि माइकल एक शूरवीर है।\" डैनियल ने कहा: \"यदि माइकल एक धूर्त है तो क्लोई एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) मैथ्यू एक शूरवीर है  \n(3) क्लोई एक शूरवीर है  \n(4) औरोरा एक शूरवीर है  \n(5) लियम एक शूरवीर है  \n(6) माइकल एक धूर्त है  \n(7) विक्टोरिया एक शूरवीर है  \n(8) डैनियल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ग्रेस, लियम, अबिगेल, मेसन, याकूब, हेनरी, एवरी, और इसाबेला। ग्रेस के शब्दों में: \"मेसन एक शूरवीर है और इसाबेला एक शूरवीर है\"। \"अगर एवरी एक शूरवीर है तो हेनरी एक शूरवीर है\" - लियम। अबिगेल के अनुसार, \"अबिगेल एक शूरवीर है या एवरी एक शूरवीर है\"। मेसन ने कहा कि लियम एक धूर्त नहीं है। याकूब ने कहा, \"लियम एक धूर्त है या इसाबेला एक धूर्त है।\" हेनरी ने टिप्पणी की, \"मेसन एक शूरवीर है और अबिगेल एक धूर्त है\"। एवरी ने नोट किया, \"हेनरी एक शूरवीर है यदि और केवल यदि इसाबेला एक धूर्त है\"। इसाबेला ने कहा, \"याकूब एक शूरवीर है यदि और केवल यदि याकूब एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक धूर्त है  \n(2) लियम एक शूरवीर है  \n(3) अबिगेल एक शूरवीर है  \n(4) मेसन एक शूरवीर है  \n(5) याकूब एक शूरवीर है  \n(6) हेनरी एक धूर्त है  \n(7) एवरी एक धूर्त है  \n(8) इसाबेला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: सैमुएल, अमेलिया, अलेक्जेंडर, एवा, जेम्स, ऐडन, माइकल, और ओलिविया। \"जेम्स एक धूर्त है यदि और केवल यदि अलेक्जेंडर एक शूरवीर है,\" सैमुएल ने कहा। अमेलिया ने कहा: \"अलेक्जेंडर एक धूर्त है और ऐडन एक शूरवीर है\"। अलेक्जेंडर के शब्दों में: \"माइकल एक धूर्त है यदि और केवल यदि सैमुएल एक धूर्त है\"। एवा ने आपको बताया कि यदि ऐडन एक शूरवीर है तो अमेलिया एक शूरवीर है। \"अलेक्जेंडर एक शूरवीर नहीं है\" - जेम्स। ऐडन ने नोट किया, \"ओलिविया एक धूर्त है यदि और केवल यदि एवा एक शूरवीर है\"। माइकल ने टिप्पणी की, \"एवा एक शूरवीर है और ओलिविया एक धूर्त है\"। ओलिविया ने कहा कि अलेक्जेंडर एक धूर्त है या जेम्स एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक शूरवीर है  \n(2) अमेलिया एक धूर्त है  \n(3) अलेक्जेंडर एक धूर्त है  \n(4) एवा एक शूरवीर है  \n(5) जेम्स एक शूरवीर है  \n(6) ऐडन एक धूर्त है  \n(7) माइकल एक धूर्त है  \n(8) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: स्कारलेट, क्लोई, एलिज़ाबेथ, औरोरा, अमेलिया, सोफिया, इसाबेला, और आरिया। स्कारलेट ने टिप्पणी की, \"आरिया एक धूर्त है और औरोरा एक धूर्त है\"। क्लोई ने asserted किया: \"अमेलिया एक शूरवीर नहीं है\"। एलिज़ाबेथ को यह कहते हुए सुना गया, \"इसाबेला एक धूर्त है और सोफिया एक धूर्त है\"। औरोरा ने नोट किया, \"क्लोई एक शूरवीर है और आरिया एक शूरवीर है\"। \"औरोरा एक धूर्त है,\" अमेलिया ने दावा किया। सोफिया ने आपको बताया कि औरोरा एक शूरवीर नहीं है। इसाबेला ने टिप्पणी की, \"अमेलिया एक धूर्त है और एलिज़ाबेथ एक शूरवीर है\"। आरिया ने remarked किया, \"सोफिया एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) स्कारलेट एक शूरवीर है  \n(2) क्लोई एक धूर्त है  \n(3) एलिज़ाबेथ एक धूर्त है  \n(4) औरोरा एक धूर्त है  \n(5) अमेलिया एक शूरवीर है  \n(6) सोफिया एक शूरवीर है  \n(7) इसाबेला एक धूर्त है  \n(8) आरिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मिया, ल्यूक, विक्टोरिया, हार्पर, सोफिया, ज़ोई, लिली, और एवरी। \"विक्टोरिया एक धूर्त है या एवरी एक धूर्त है\" - मिया। ल्यूक ने कहा, \"हार्पर एक शूरवीर है या मिया एक शूरवीर है\"। विक्टोरिया ने कहा, \"लिली एक शूरवीर है\"। हार्पर ने आपको बताया कि ज़ोई एक धूर्त नहीं है। सोफिया ने कहा कि ज़ोई एक धूर्त है और विक्टोरिया एक शूरवीर है। \"लिली एक धूर्त नहीं है\" - ज़ोई। लिली के एक बयान में: \"अगर सोफिया एक शूरवीर है तो विक्टोरिया एक शूरवीर है\"। जैसे एवरी ने कहा, \"ज़ोई एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक शूरवीर है  \n(2) ल्यूक एक शूरवीर है  \n(3) विक्टोरिया एक शूरवीर है  \n(4) हार्पर एक शूरवीर है  \n(5) सोफिया एक धूर्त है  \n(6) ज़ोई एक शूरवीर है  \n(7) लिली एक शूरवीर है  \n(8) एवरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: विलियम, एवलिन, सेबेस्टियन, अलेक्जेंडर, मैथ्यू, इसाबेला, ज़ोई, और जैक। विलियम ने कहा, \"मैथ्यू एक शूरवीर है यदि और केवल यदि सेबेस्टियन एक धूर्त है\"। \"जैक एक धूर्त है या ज़ोई एक धूर्त है\" - एवलिन। \"मैथ्यू एक धूर्त है,\" सेबेस्टियन ने कहा। अलेक्जेंडर ने टिप्पणी की, \"एवलिन एक धूर्त नहीं है\"। मैथ्यू ने कहा, \"विलियम एक धूर्त है या अलेक्जेंडर एक धूर्त है\"। इसाबेला ने कहा, \"अलेक्जेंडर एक शूरवीर है या विलियम एक शूरवीर है\"। ज़ोई ने कहा कि विलियम एक शूरवीर है या एवलिन एक धूर्त है। \"सेबेस्टियन एक शूरवीर है और एवलिन एक धूर्त है,\" जैक ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) एवलिन एक शूरवीर है  \n(3) सेबेस्टियन एक शूरवीर है  \n(4) अलेक्जेंडर एक शूरवीर है  \n(5) मैथ्यू एक धूर्त है  \n(6) इसाबेला एक शूरवीर है  \n(7) ज़ोई एक शूरवीर है  \n(8) जैक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: आरिया, लोगन, नूह, लियम, सोफिया, एमिली, यूसुफ, और सोफिया। आरिया के शब्दों में: \"एमिली एक शूरवीर है और यूसुफ एक शूरवीर है\"। लोगन ने कहा, \"आरिया एक शूरवीर है या यूसुफ एक शूरवीर है\"। नूह ने कहा, \"सोफिया एक धूर्त है या सोफिया एक शूरवीर है\"। लियम ने आपको बताया कि नूह एक शूरवीर है। \"लियम एक धूर्त है,\" सोफिया ने कहा। \"नूह एक धूर्त नहीं है\" - एमिली। यूसुफ ने कहा, \"एमिली एक धूर्त है और लोगन एक शूरवीर है\"। सोफिया ने आपको बताया कि अगर लोगन एक धूर्त है तो लोगन एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) आरिया एक धूर्त है  \n(2) लोगन एक धूर्त है  \n(3) नूह एक शूरवीर है  \n(4) लियम एक शूरवीर है  \n(5) सोफिया एक धूर्त है  \n(6) एमिली एक शूरवीर है  \n(7) यूसुफ एक धूर्त है  \n(8) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एवलिन, क्लोई, यूसुफ, हार्पर, ऐडन, आरिया, राइली, और मिया। \"आरिया एक धूर्त है या मिया एक शूरवीर है\" - एवलिन। क्लोई ने कहा कि राइली एक धूर्त नहीं है। \"हार्पर एक धूर्त नहीं है,\" यूसुफ ने दावा किया। हार्पर ने टिप्पणी की, \"अगर राइली एक शूरवीर है तो मिया एक धूर्त है\"। ऐडन के एक बयान में: \"हार्पर एक शूरवीर है या मिया एक शूरवीर है\"। \"अगर राइली एक शूरवीर है तो हार्पर एक धूर्त है,\" आरिया ने कहा। राइली ने नोट किया, \"क्लोई एक शूरवीर है और यूसुफ एक धूर्त है\"। मिया ने कहा, \"आरिया एक शूरवीर नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक धूर्त है  \n(2) क्लोई एक धूर्त है  \n(3) यूसुफ एक शूरवीर है  \n(4) हार्पर एक शूरवीर है  \n(5) ऐडन एक शूरवीर है  \n(6) आरिया एक शूरवीर है  \n(7) राइली एक धूर्त है  \n(8) मिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: सोफिया, हेनरी, लियम, ऐडन, अबिगेल, जैक्सन, मिया, और याकूब। \"सोफिया एक शूरवीर है और याकूब एक शूरवीर है\" - सोफिया। हेनरी ने कहा कि अगर याकूब एक शूरवीर है तो लियम एक धूर्त है। लियम ने कहा, \"अबिगेल एक धूर्त है और मिया एक शूरवीर है\"। ऐडन ने कहा: \"हेनरी एक शूरवीर है यदि और केवल यदि जैक्सन एक धूर्त है\"। अबिगेल ने आपको बताया कि अगर सोफिया एक शूरवीर है तो मिया एक शूरवीर है। जैक्सन के शब्दों में: \"सोफिया एक धूर्त है या ऐडन एक शूरवीर है\"। मिया को यह कहते हुए सुना गया, \"लियम एक शूरवीर है और अबिगेल एक धूर्त है\"। याकूब को यह कहते हुए सुना गया, \"ऐडन एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) हेनरी एक शूरवीर है  \n(3) लियम एक धूर्त है  \n(4) ऐडन एक धूर्त है  \n(5) अबिगेल एक शूरवीर है  \n(6) जैक्सन एक शूरवीर है  \n(7) मिया एक धूर्त है  \n(8) याकूब एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ओलिविया, हार्पर, ऐडन, एला, माइकल, अमेलिया, बेंजामिन, और ओलिवर। ओलिविया ने कहा, \"ओलिवर एक शूरवीर है\"। हार्पर ने asserted किया: \"माइकल एक शूरवीर नहीं है\"। ऐडन के शब्दों में: \"अमेलिया एक शूरवीर है और ओलिविया एक धूर्त है\"। एला के शब्दों में: \"हार्पर एक शूरवीर है या ओलिविया एक शूरवीर है\"। माइकल के बयान में: \"ऐडन एक धूर्त है यदि और केवल यदि ओलिवर एक शूरवीर है\"। अमेलिया के शब्दों में: \"एला एक शूरवीर नहीं है\"। बेंजामिन ने कहा कि एला एक धूर्त है और ओलिविया एक शूरवीर है। \"ओलिवर एक शूरवीर है यदि और केवल यदि ऐडन एक शूरवीर है,\" ओलिवर ने दावा किया। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ओलिविया एक धूर्त है  \n(2) हार्पर एक धूर्त है  \n(3) ऐडन एक शूरवीर है  \n(4) एला एक धूर्त है  \n(5) माइकल एक शूरवीर है  \n(6) अमेलिया एक शूरवीर है  \n(7) बेंजामिन एक धूर्त है  \n(8) ओलिवर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: अलेक्जेंडर, ल्यूक, हेनरी, अबिगेल, एलिज़ाबेथ, माइकल, इसाबेला, और ग्रेस। अलेक्जेंडर ने कहा, \"ग्रेस एक शूरवीर है या इसाबेला एक धूर्त है।\" ल्यूक के एक बयान में: \"हेनरी एक शूरवीर है\"। हेनरी ने कहा: \"अगर ग्रेस एक शूरवीर है तो अबिगेल एक शूरवीर है\"। अबिगेल ने टिप्पणी की, \"एलिज़ाबेथ एक धूर्त है और हेनरी एक धूर्त है\"। एलिज़ाबेथ ने आपको बताया कि इसाबेला एक शूरवीर है। माइकल ने व्यक्त किया कि ल्यूक एक शूरवीर है यदि और केवल यदि ग्रेस एक धूर्त है। इसाबेला ने टिप्पणी की, \"माइकल एक शूरवीर है या इसाबेला एक शूरवीर है\"। ग्रेस ने कहा, \"माइकल एक शूरवीर है या अबिगेल एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अलेक्जेंडर एक शूरवीर है  \n(2) ल्यूक एक धूर्त है  \n(3) हेनरी एक धूर्त है  \n(4) अबिगेल एक धूर्त है  \n(5) एलिज़ाबेथ एक शूरवीर है  \n(6) माइकल एक शूरवीर है  \n(7) इसाबेला एक शूरवीर है  \n(8) ग्रेस एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ग्रेस, ज़ोई, शार्लट, राइली, एवलिन, माइकल, यूसुफ, और जेम्स। ग्रेस ने कहा कि अगर जेम्स एक शूरवीर है तो शार्लट एक धूर्त है। ज़ोई के अनुसार, \"यूसुफ एक शूरवीर है या जेम्स एक धूर्त है\"। शार्लट को यह कहते हुए सुना गया, \"ज़ोई एक शूरवीर है\"। राइली ने कहा, \"ज़ोई एक शूरवीर है या माइकल एक धूर्त है\"। एवलिन ने कहा कि जेम्स एक धूर्त नहीं है। माइकल के एक बयान में: \"राइली एक धूर्त है यदि और केवल यदि शार्लट एक शूरवीर है\"। यूसुफ ने आपको बताया कि माइकल एक धूर्त है और जेम्स एक शूरवीर है। जेम्स को यह कहते हुए सुना गया, \"ज़ोई एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक धूर्त है  \n(2) ज़ोई एक शूरवीर है  \n(3) शार्लट एक शूरवीर है  \n(4) राइली एक शूरवीर है  \n(5) एवलिन एक शूरवीर है  \n(6) माइकल एक धूर्त है  \n(7) यूसुफ एक शूरवीर है  \n(8) जेम्स एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: राइली, एवलिन, एवरी, इसाबेला, ऐडन, ईथन, ग्रेस, और शार्लट। राइली के एक बयान में: \"ग्रेस धूर्त नहीं है\"। एवलिन ने कहा, \"इसाबेला शूरवीर नहीं है\"। एवरी ने आपको बताया कि एवलिन शूरवीर नहीं है। \"अगर शार्लट शूरवीर है तो ईथन धूर्त है,\" इसाबेला ने घोषित किया। ऐडन ने asserted किया: \"एवरी धूर्त है यदि और केवल यदि शार्लट धूर्त है\"। ईथन ने टिप्पणी की, \"अगर राइली धूर्त है तो ग्रेस शूरवीर है\"। ग्रेस ने remarked किया, \"ईथन शूरवीर है और एवलिन शूरवीर है\"। शार्लट ने stated किया, \"अगर ईथन शूरवीर है तो ईथन धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक धूर्त है  \n(2) एवलिन एक धूर्त है  \n(3) एवरी एक शूरवीर है  \n(4) इसाबेला एक शूरवीर है  \n(5) ऐडन एक शूरवीर है  \n(6) ईथन एक धूर्त है  \n(7) ग्रेस एक धूर्त है  \n(8) शार्लट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: लियम, विलियम, पेनलोप, ल्यूक, सोफिया, डेविड, यूसुफ, और लिली। लियम ने टिप्पणी की, \"ल्यूक शूरवीर नहीं है\"। विलियम के एक बयान में: \"लियम शूरवीर है यदि और केवल यदि डेविड धूर्त है\"। पेनलोप ने कहा कि सोफिया धूर्त है यदि और केवल यदि यूसुफ धूर्त है। \"पेनलोप शूरवीर है और डेविड शूरवीर है,\" ल्यूक ने दावा किया। सोफिया को यह कहते हुए सुना गया, \"यदि पेनलोप शूरवीर है तो लिली धूर्त है\"। डेविड ने कहा, \"यदि लियम धूर्त है तो डेविड शूरवीर है।\" यूसुफ ने कहा कि सोफिया शूरवीर नहीं है। \"यदि विलियम धूर्त है तो यूसुफ धूर्त है\" - लिली। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक शूरवीर है  \n(2) विलियम एक धूर्त है  \n(3) पेनलोप एक धूर्त है  \n(4) ल्यूक एक धूर्त है  \n(5) सोफिया एक शूरवीर है  \n(6) डेविड एक शूरवीर है  \n(7) यूसुफ एक धूर्त है  \n(8) लिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: स्कारलेट, विलियम, अलेक्जेंडर, जैक, जेम्स, जैक्सन, एला, और ओलिविया। स्कारलेट ने टिप्पणी की, \"जैक एक शूरवीर है या एला एक धूर्त है\"। विलियम के अनुसार, \"विलियम एक शूरवीर है और एला एक शूरवीर है\"। अलेक्जेंडर को यह कहते हुए सुना गया, \"जैक्सन एक धूर्त है और जेम्स एक धूर्त है\"। जैक के शब्दों में: \"अगर एला एक शूरवीर है तो जैक्सन एक धूर्त है\"। जेम्स ने टिप्पणी की, \"जैक एक धूर्त नहीं है\"। जैक्सन ने कहा कि विलियम एक धूर्त नहीं है। एला ने आपको बताया कि जैक एक धूर्त नहीं है। ओलिविया के एक बयान में: \"जेम्स एक धूर्त है और विलियम एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) स्कारलेट एक शूरवीर है  \n(2) विलियम एक धूर्त है  \n(3) अलेक्जेंडर एक धूर्त है  \n(4) जैक एक शूरवीर है  \n(5) जेम्स एक शूरवीर है  \n(6) जैक्सन एक धूर्त है  \n(7) एला एक शूरवीर है  \n(8) ओलिविया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ग्रेस, राइली, ल्यूक, मैथ्यू, पेनलोप, मिया, शार्लट, और लुकास। ग्रेस को कहते हुए सुना गया, \"शार्लट एक शूरवीर है यदि और केवल यदि शार्लट एक धूर्त है\"। राइली ने कहा, \"पेनलोप एक धूर्त है और लुकास एक धूर्त है\"। ल्यूक को कहते हुए सुना गया, \"राइली एक धूर्त है यदि और केवल यदि लुकास एक शूरवीर है\"। \"शार्लट एक शूरवीर नहीं है,\" मैथ्यू ने घोषणा की। \"यदि ल्यूक एक धूर्त है तो मिया एक धूर्त है,\" पेनलोप ने दावा किया। \"राइली एक शूरवीर है यदि और केवल यदि मैथ्यू एक धूर्त है,\" मिया ने दावा किया। शार्लट ने कहा, \"लुकास एक शूरवीर नहीं है\"। \"शार्लट एक धूर्त है और शार्लट एक शूरवीर है,\" लुकास ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक धूर्त है  \n(2) राइली एक धूर्त है  \n(3) ल्यूक एक धूर्त है  \n(4) मैथ्यू एक धूर्त है  \n(5) पेनलोप एक शूरवीर है  \n(6) मिया एक धूर्त है  \n(7) शार्लट एक शूरवीर है  \n(8) लुकास एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: नूह, राइली, यूसुफ, एम्मा, माइकल, जैक्सन, लुकास, और हार्पर। जैसे नूह ने कहा, \"माइकल एक शूरवीर है\"। राइली को यह कहते सुना गया, \"हार्पर एक शूरवीर है यदि और केवल यदि माइकल एक शूरवीर है\"। यूसुफ के शब्दों में: \"एम्मा एक धूर्त है या एम्मा एक शूरवीर है\"। एम्मा ने टिप्पणी की, \"यदि जैक्सन एक शूरवीर है तो जैक्सन एक धूर्त है\"। \"राइली एक शूरवीर है या लुकास एक धूर्त है\" - माइकल। \"लुकास एक धूर्त है या हार्पर एक धूर्त है,\" जैक्सन ने दावा किया। लुकास के एक बयान में: \"यूसुफ एक शूरवीर नहीं है\"। हार्पर ने remarked किया, \"यूसुफ एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक शूरवीर है  \n(2) राइली एक धूर्त है  \n(3) यूसुफ एक शूरवीर है  \n(4) एम्मा एक धूर्त है  \n(5) माइकल एक शूरवीर है  \n(6) जैक्सन एक शूरवीर है  \n(7) लुकास एक धूर्त है  \n(8) हार्पर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: माइकल, याकूब, यूसुफ, अबिगेल, अलेक्जेंडर, एवा, सोफिया, और एवरी। जैसे माइकल ने कहा, \"सोफिया एक शूरवीर नहीं है\"। जैसे याकूब ने कहा, \"अबिगेल एक शूरवीर है या माइकल एक धूर्त है\"। \"माइकल एक धूर्त है और एवरी एक धूर्त है,\" यूसुफ ने घोषित किया। अबिगेल ने remarked किया, \"एवरी एक धूर्त है\"। अलेक्जेंडर ने नोट किया, \"सोफिया एक शूरवीर है या यूसुफ एक शूरवीर है\"। \"अगर अलेक्जेंडर एक शूरवीर है तो एवरी एक शूरवीर है\" - एवा। सोफिया ने टिप्पणी की, \"अलेक्जेंडर एक धूर्त है यदि और केवल यदि याकूब एक शूरवीर है\"। एवरी के एक बयान में: \"अलेक्जेंडर एक धूर्त है या सोफिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक शूरवीर है  \n(2) याकूब एक धूर्त है  \n(3) यूसुफ एक धूर्त है  \n(4) अबिगेल एक धूर्त है  \n(5) अलेक्जेंडर एक धूर्त है  \n(6) एवा एक शूरवीर है  \n(7) सोफिया एक धूर्त है  \n(8) एवरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: विलियम, एम्मा, सेबेस्टियन, ज़ोई, लोगन, सैमुएल, पेनलोप, और ईथन। विलियम के शब्दों में: \"सैमुएल एक शूरवीर है और सेबेस्टियन एक धूर्त है\"। एम्मा ने कहा, \"लोगन एक धूर्त नहीं है।\" \"सैमुएल एक शूरवीर है यदि और केवल यदि ज़ोई एक धूर्त है,\" सेबेस्टियन ने घोषित किया। \"एम्मा एक धूर्त है और विलियम एक धूर्त है,\" ज़ोई ने घोषित किया। लोगन को यह कहते हुए सुना गया, \"सेबेस्टियन एक धूर्त है\"। जैसे सैमुएल ने कहा, \"लोगन एक धूर्त है यदि और केवल यदि ईथन एक शूरवीर है\"। जैसे पेनलोप ने कहा, \"विलियम एक शूरवीर है या एम्मा एक धूर्त है\"। ईथन ने आपको बताया कि पेनलोप एक शूरवीर है और एम्मा एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) विलियम एक धूर्त है  \n(2) एम्मा एक धूर्त है  \n(3) सेबेस्टियन एक शूरवीर है  \n(4) ज़ोई एक शूरवीर है  \n(5) लोगन एक धूर्त है  \n(6) सैमुएल एक धूर्त है  \n(7) पेनलोप एक शूरवीर है  \n(8) ईथन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ज़ोई, एवरी, अलेक्जेंडर, सेबेस्टियन, नूह, लोगन, एम्मा, और सैमुएल। ज़ोई ने कहा, \"नूह एक धूर्त है और सेबेस्टियन एक धूर्त है\"। \"ज़ोई एक धूर्त है या सैमुएल एक धूर्त है,\" एवरी ने दावा किया। \"ज़ोई एक शूरवीर है यदि और केवल यदि सेबेस्टियन एक धूर्त है,\" अलेक्जेंडर ने उल्लेख किया। सेबेस्टियन ने कहा कि यदि एवरी एक धूर्त है तो सैमुएल एक शूरवीर है। नूह ने कहा, \"ज़ोई एक धूर्त नहीं है\"। \"अलेक्जेंडर एक धूर्त है या एवरी एक शूरवीर है,\" लोगन ने घोषणा की। एम्मा को यह कहते हुए सुना गया, \"यदि एवरी एक धूर्त है तो सैमुएल एक धूर्त है\"। सैमुएल ने कहा, \"एम्मा एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ज़ोई एक धूर्त है  \n(2) एवरी एक शूरवीर है  \n(3) अलेक्जेंडर एक शूरवीर है  \n(4) सेबेस्टियन एक शूरवीर है  \n(5) नूह एक धूर्त है  \n(6) लोगन एक शूरवीर है  \n(7) एम्मा एक शूरवीर है  \n(8) सैमुएल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ग्रेस, ज़ोई, एलिज़ाबेथ, विक्टोरिया, यूसुफ, सेबेस्टियन, नूह, और मिया। ग्रेस ने कहा, \"एलिज़ाबेथ एक धूर्त है और नूह एक धूर्त है\"। ज़ोई ने कहा कि अगर मिया एक शूरवीर है तो विक्टोरिया एक शूरवीर है। एलिज़ाबेथ को यह कहते हुए सुना गया, \"विक्टोरिया एक धूर्त है\"। विक्टोरिया को यह कहते हुए सुना गया, \"यूसुफ एक शूरवीर है और ग्रेस एक शूरवीर है\"। यूसुफ ने कहा: \"ग्रेस एक शूरवीर है और एलिज़ाबेथ एक शूरवीर है\"। \"नूह एक शूरवीर है,\" सेबेस्टियन ने घोषणा की। नूह ने कहा, \"ज़ोई एक शूरवीर है या एलिज़ाबेथ एक शूरवीर है\"। मिया ने कहा: \"विक्टोरिया एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक धूर्त है  \n(2) ज़ोई एक धूर्त है  \n(3) एलिज़ाबेथ एक शूरवीर है  \n(4) विक्टोरिया एक धूर्त है  \n(5) यूसुफ एक धूर्त है  \n(6) सेबेस्टियन एक शूरवीर है  \n(7) नूह एक शूरवीर है  \n(8) मिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एला, ल्यूक, क्लोई, ऐडन, हार्पर, एम्मा, मेसन, और औरोरा। जैसे एला ने कहा, \"ऐडन एक धूर्त है और मेसन एक शूरवीर है\"। ल्यूक को यह कहते हुए सुना गया, \"हार्पर एक शूरवीर नहीं है\"। क्लोई ने कहा, \"मेसेन एक शूरवीर नहीं है\"। \"एम्मा एक शूरवीर है यदि और केवल यदि मेसन एक धूर्त है,\" ऐडन ने घोषणा की। हार्पर के एक बयान में: \"क्लोई एक शूरवीर नहीं है\"। एम्मा को यह कहते हुए सुना गया, \"ल्यूक एक धूर्त है\"। मेसन ने कहा, \"क्लोई एक धूर्त है या एला एक धूर्त है\"। औरोरा के शब्दों में: \"मेसेन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक शूरवीर है  \n(2) ल्यूक एक धूर्त है  \n(3) क्लोई एक धूर्त है  \n(4) ऐडन एक धूर्त है  \n(5) हार्पर एक शूरवीर है  \n(6) एम्मा एक शूरवीर है  \n(7) मेसन एक शूरवीर है  \n(8) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: लिली, एवलिन, सोफिया, ऐडन, ओलिवर, मेसन, जैक, और हेनरी। \"ऐडन एक शूरवीर है और हेनरी एक धूर्त है,\" लिली ने कहा। एवलिन ने कहा: \"यदि एवलिन एक शूरवीर है तो सोफिया एक शूरवीर है।\" सोफिया ने कहा कि लिली एक धूर्त है या लिली एक शूरवीर है। ऐडन ने कहा: \"ओलिवर एक शूरवीर है या ऐडन एक शूरवीर है।\" ओलिवर ने टिप्पणी की, \"यदि एवलिन एक शूरवीर है तो ओलिवर एक शूरवीर है।\" \"सोफिया एक शूरवीर है,\" मेसन ने कहा। जैक के अनुसार, \"ओलिवर एक शूरवीर है यदि और केवल यदि एवलिन एक शूरवीर है।\" हेनरी ने कहा, \"लिली एक शूरवीर है।\" तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) लिली एक धूर्त है  \n(2) एवलिन एक शूरवीर है  \n(3) सोफिया एक शूरवीर है  \n(4) ऐडन एक धूर्त है  \n(5) ओलिवर एक धूर्त है  \n(6) मेसन एक शूरवीर है  \n(7) जैक एक धूर्त है  \n(8) हेनरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: जैक्सन, सोफिया, लिली, राइली, ईथन, अबिगेल, हेनरी, और जेम्स। जैक्सन ने आपको बताया कि अगर राइली एक शूरवीर है तो जेम्स एक धूर्त है। सोफिया ने कहा: \"राइली एक शूरवीर है और अबिगेल एक शूरवीर है\"। \"हेनरी एक धूर्त है या जैक्सन एक शूरवीर है,\" लिली ने दावा किया। राइली को यह कहते हुए सुना गया, \"हेनरी एक शूरवीर नहीं है\"। ईथन के एक बयान में: \"जैक्सन एक शूरवीर है या लिली एक धूर्त है\"। \"अगर ईथन एक शूरवीर है तो सोफिया एक धूर्त है,\" अबिगेल ने उल्लेख किया। हेनरी ने कहा कि राइली एक शूरवीर है या ईथन एक शूरवीर है। जेम्स ने टिप्पणी की, \"अगर अबिगेल एक धूर्त है तो जैक्सन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक शूरवीर है  \n(2) सोफिया एक धूर्त है  \n(3) लिली एक शूरवीर है  \n(4) राइली एक धूर्त है  \n(5) ईथन एक शूरवीर है  \n(6) अबिगेल एक शूरवीर है  \n(7) हेनरी एक शूरवीर है  \n(8) जेम्स एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ग्रेस, राइली, सैमुएल, अलेक्जेंडर, नूह, ओवेन, ओलिविया, और जेम्स। ग्रेस ने कहा, \"ओलिविया एक शूरवीर है और ओवेन एक धूर्त है।\" \"अगर नूह एक शूरवीर है तो सैमुएल एक शूरवीर है,\" राइली ने घोषणा की। सैमुएल को यह कहते हुए सुना गया, \"अगर जेम्स एक धूर्त है तो राइली एक शूरवीर है।\" \"सैमुएल एक धूर्त है यदि और केवल यदि अलेक्जेंडर एक शूरवीर है\" - अलेक्जेंडर। नूह ने नोट किया, \"अगर नूह एक शूरवीर है तो अलेक्जेंडर एक शूरवीर है।\" \"अगर जेम्स एक धूर्त है तो राइली एक शूरवीर है,\" ओवेन ने दावा किया। ओलिविया को यह कहते हुए सुना गया, \"अगर अलेक्जेंडर एक धूर्त है तो जेम्स एक धूर्त है।\" \"जेम्स एक शूरवीर है या अलेक्जेंडर एक धूर्त है,\" जेम्स ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक शूरवीर है  \n(2) राइली एक धूर्त है  \n(3) सैमुएल एक धूर्त है  \n(4) अलेक्जेंडर एक शूरवीर है  \n(5) नूह एक शूरवीर है  \n(6) ओवेन एक धूर्त है  \n(7) ओलिविया एक शूरवीर है  \n(8) जेम्स एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ओलिविया, मैथ्यू, एला, ओवेन, एम्मा, याकूब, मिया, और डेविड। ओलिविया ने आपको बताया कि मिया एक शूरवीर है यदि और केवल यदि एला एक शूरवीर है। मैथ्यू के शब्दों में: \"याकूब एक धूर्त है और मिया एक शूरवीर है\"। \"एला एक शूरवीर है यदि और केवल यदि एम्मा एक शूरवीर है,\" एला ने घोषणा की। \"एला एक शूरवीर है\" - ओवेन। \"मैथ्यू एक धूर्त नहीं है,\" एम्मा ने उल्लेख किया। याकूब ने आपको बताया कि ओलिविया एक शूरवीर है। मिया ने कहा कि यदि ओलिविया एक शूरवीर है तो याकूब एक शूरवीर है। डेविड ने कहा कि ओवेन एक धूर्त है यदि और केवल यदि एम्मा एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक धूर्त है  \n(2) मैथ्यू एक शूरवीर है  \n(3) एला एक धूर्त है  \n(4) ओवेन एक धूर्त है  \n(5) एम्मा एक शूरवीर है  \n(6) याकूब एक धूर्त है  \n(7) मिया एक शूरवीर है  \n(8) डेविड एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: सोफिया, एवा, लिली, पेनलोप, अमेलिया, सेबेस्टियन, ईथन, और ल्यूक। \"अमेलिया एक धूर्त है और पेनलोप एक धूर्त है,\" सोफिया ने दावा किया। एवा ने नोट किया, \"सोफिया एक शूरवीर है या लिली एक धूर्त है\"। लिली ने आपको बताया कि सोफिया एक शूरवीर है। \"अमेलिया एक धूर्त है या सोफिया एक शूरवीर है,\" पेनलोप ने उल्लेख किया। \"अगर ल्यूक एक धूर्त है तो सोफिया एक धूर्त है,\" अमेलिया ने घोषित किया। सेबेस्टियन ने नोट किया, \"लिली एक शूरवीर है\"। \"सेबेस्टियन एक धूर्त नहीं है,\" ईथन ने उल्लेख किया। ल्यूक के एक बयान में: \"लिली एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) एवा एक शूरवीर है  \n(3) लिली एक धूर्त है  \n(4) पेनलोप एक धूर्त है  \n(5) अमेलिया एक शूरवीर है  \n(6) सेबेस्टियन एक धूर्त है  \n(7) ईथन एक धूर्त है  \n(8) ल्यूक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: माइकल, एम्मा, सोफिया, आरिया, हेनरी, क्लोई, ग्रेस, और यूसुफ। \"अगर क्लोई एक धूर्त है तो क्लोई एक शूरवीर है\" - माइकल। \"अगर यूसुफ एक धूर्त है तो आरिया एक धूर्त है,\" एम्मा ने कहा। सोफिया ने कहा कि एम्मा एक धूर्त है यदि और केवल यदि ग्रेस एक धूर्त है। आरिया ने कहा कि आरिया एक शूरवीर है या यूसुफ एक शूरवीर है। हेनरी ने कहा: \"माइकल एक शूरवीर नहीं है\"। क्लोई ने कहा, \"अगर क्लोई एक शूरवीर है तो आरिया एक शूरवीर है।\" जैसे ग्रेस ने कहा, \"अगर हेनरी एक धूर्त है तो आरिया एक शूरवीर है\"। यूसुफ ने कहा, \"अगर हेनरी एक धूर्त है तो क्लोई एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक शूरवीर है  \n(2) एम्मा एक शूरवीर है  \n(3) सोफिया एक शूरवीर है  \n(4) आरिया एक शूरवीर है  \n(5) हेनरी एक धूर्त है  \n(6) क्लोई एक शूरवीर है  \n(7) ग्रेस एक शूरवीर है  \n(8) यूसुफ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: आरिया, डैनियल, विक्टोरिया, औरोरा, एम्मा, लोगन, सोफिया, और ज़ोई। \"विक्टोरिया एक धूर्त है,\" आरिया ने घोषणा की। डैनियल के एक बयान में: \"ज़ोई एक धूर्त है\"। विक्टोरिया ने आपको बताया कि अगर आरिया एक शूरवीर है तो लोगन एक शूरवीर है। \"ज़ोई एक धूर्त है और डैनियल एक धूर्त है\" - औरोरा। एम्मा के एक बयान में: \"आरिया एक शूरवीर है यदि और केवल यदि लोगन एक शूरवीर है\"। \"विक्टोरिया एक शूरवीर है यदि और केवल यदि ज़ोई एक शूरवीर है,\" लोगन ने दावा किया। सोफिया को यह कहते हुए सुना गया, \"औरोरा एक धूर्त है या डैनियल एक धूर्त है\"। ज़ोई ने टिप्पणी की, \"औरोरा एक शूरवीर है यदि और केवल यदि आरिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) आरिया एक धूर्त है  \n(2) डैनियल एक धूर्त है  \n(3) विक्टोरिया एक शूरवीर है  \n(4) औरोरा एक धूर्त है  \n(5) एम्मा एक धूर्त है  \n(6) लोगन एक शूरवीर है  \n(7) सोफिया एक शूरवीर है  \n(8) ज़ोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: नूह, लुकास, क्लोई, ओलिविया, सोफिया, माइकल, जेम्स, और राइली। नूह के शब्दों में: \"ओलिविया एक धूर्त है और जेम्स एक धूर्त है\"। \"जेम्स एक धूर्त है या माइकल एक धूर्त है,\" लुकास ने कहा। जैसे कि क्लोई ने कहा, \"नूह एक शूरवीर नहीं है\"। \"अगर माइकल एक शूरवीर है तो नूह एक धूर्त है\" - ओलिविया। सोफिया को यह कहते हुए सुना गया, \"लुकास एक शूरवीर है यदि और केवल यदि ओलिविया एक धूर्त है\"। \"अगर क्लोई एक शूरवीर है तो माइकल एक शूरवीर है,\" माइकल ने कहा। जेम्स ने कहा, \"माइकल एक धूर्त है या लुकास एक शूरवीर है।\" राइली ने टिप्पणी की, \"सोफिया एक शूरवीर है या लुकास एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक धूर्त है  \n(2) लुकास एक शूरवीर है  \n(3) क्लोई एक शूरवीर है  \n(4) ओलिविया एक शूरवीर है  \n(5) सोफिया एक धूर्त है  \n(6) माइकल एक धूर्त है  \n(7) जेम्स एक शूरवीर है  \n(8) राइली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एम्मा, याकूब, ओलिविया, सेबेस्टियन, जेम्स, स्कारलेट, ओवेन, और मिया। एम्मा ने remarked किया, \"स्कारलेट एक शूरवीर है यदि और केवल यदि जेम्स एक धूर्त है\"। याकूब ने कहा कि ओवेन एक शूरवीर है। ओलिविया ने टिप्पणी की, \"यदि ओवेन एक धूर्त है तो मिया एक शूरवीर है\"। सेबेस्टियन ने टिप्पणी की, \"जेम्स एक शूरवीर है\"। जेम्स के शब्दों में: \"मिया एक शूरवीर है और मिया एक धूर्त है\"। \"मिया एक धूर्त है और स्कारलेट एक शूरवीर है,\" स्कारलेट ने दावा किया। ओवेन के एक बयान में: \"यदि मिया एक धूर्त है तो सेबेस्टियन एक धूर्त है\"। मिया ने asserted किया: \"याकूब एक शूरवीर है और सेबेस्टियन एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एम्मा एक धूर्त है  \n(2) याकूब एक शूरवीर है  \n(3) ओलिविया एक शूरवीर है  \n(4) सेबेस्टियन एक धूर्त है  \n(5) जेम्स एक धूर्त है  \n(6) स्कारलेट एक धूर्त है  \n(7) ओवेन एक शूरवीर है  \n(8) मिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: पेनलोप, ईथन, एवा, इसाबेला, औरोरा, सैमुएल, हार्पर, और एम्मा। पेनलोप ने कहा, \"पेनलोप एक शूरवीर है\"। ईथन ने कहा, \"अगर एवा एक धूर्त है तो ईथन एक शूरवीर है।\" \"हार्पर एक शूरवीर है या एम्मा एक शूरवीर है\" - एवा। इसाबेला ने नोट किया, \"अगर औरोरा एक शूरवीर है तो पेनलोप एक शूरवीर है\"। औरोरा ने कहा, \"हार्पर एक धूर्त है या इसाबेला एक शूरवीर है\"। सैमुएल ने नोट किया, \"इसाबेला एक शूरवीर है या एम्मा एक धूर्त है\"। \"औरोरा एक शूरवीर है या पेनलोप एक धूर्त है,\" हार्पर ने दावा किया। एम्मा के शब्दों में: \"ईथन एक धूर्त है और हार्पर एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) पेनलोप एक शूरवीर है  \n(2) ईथन एक शूरवीर है  \n(3) एवा एक शूरवीर है  \n(4) इसाबेला एक शूरवीर है  \n(5) औरोरा एक शूरवीर है  \n(6) सैमुएल एक शूरवीर है  \n(7) हार्पर एक शूरवीर है  \n(8) एम्मा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ग्रेस, ऐडन, क्लोई, मैथ्यू, जैक, लुकास, अमेलिया, और मिया। ग्रेस के एक बयान में: \"अगर लुकास एक धूर्त है तो अमेलिया एक धूर्त है\"। ऐडन ने नोट किया, \"लुकास एक धूर्त है यदि और केवल यदि ऐडन एक शूरवीर है\"। क्लोई के एक बयान में: \"जैक एक शूरवीर है\"। मैथ्यू के अनुसार, \"क्लोई एक धूर्त है और ऐडन एक शूरवीर है\"। जैक ने कहा, \"अगर लुकास एक धूर्त है तो अमेलिया एक शूरवीर है\"। लुकास ने नोट किया, \"मैथ्यू एक धूर्त नहीं है\"। \"अगर ऐडन एक धूर्त है तो ग्रेस एक शूरवीर है,\" अमेलिया ने कहा। मिया को यह कहते सुना गया, \"अमेलिया एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक धूर्त है  \n(2) ऐडन एक शूरवीर है  \n(3) क्लोई एक शूरवीर है  \n(4) मैथ्यू एक धूर्त है  \n(5) जैक एक शूरवीर है  \n(6) लुकास एक धूर्त है  \n(7) अमेलिया एक शूरवीर है  \n(8) मिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: अबिगेल, शार्लट, विलियम, एवलिन, विक्टोरिया, सोफिया, इसाबेला, और औरोरा। अबिगेल के अनुसार, \"अगर इसाबेला एक शूरवीर है तो अबिगेल एक शूरवीर है\"। शार्लट ने टिप्पणी की, \"विलियम एक धूर्त है और इसाबेला एक धूर्त है\"। विलियम ने कहा कि अबिगेल एक धूर्त है। एवलिन ने remarked किया, \"अगर विलियम एक शूरवीर है तो सोफिया एक शूरवीर है\"। विक्टोरिया ने कहा कि अबिगेल एक शूरवीर नहीं है। सोफिया ने कहा, \"इसाबेला एक धूर्त है और विलियम एक शूरवीर है।\" इसाबेला ने remarked किया, \"सोफिया एक शूरवीर है और अबिगेल एक धूर्त है\"। औरोरा ने कहा, \"एवलिन एक शूरवीर है या इसाबेला एक शूरवीर है।\" तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) अबिगेल एक शूरवीर है  \n(2) शार्लट एक शूरवीर है  \n(3) विलियम एक धूर्त है  \n(4) एवलिन एक शूरवीर है  \n(5) विक्टोरिया एक धूर्त है  \n(6) सोफिया एक धूर्त है  \n(7) इसाबेला एक धूर्त है  \n(8) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: हेनरी, एलिज़ाबेथ, सैमुएल, एमिली, सोफिया, बेंजामिन, मेसन, और जेम्स। हेनरी ने आपको बताया कि मेसन एक शूरवीर है और सोफिया एक धूर्त है। एलिज़ाबेथ ने कहा, \"हेनरी एक धूर्त नहीं है।\" सैमुएल ने नोट किया, \"सोफिया एक शूरवीर है।\" एमिली के शब्दों में: \"जेम्स एक शूरवीर है या एलिज़ाबेथ एक धूर्त है।\" सोफिया के एक बयान में: \"एलिज़ाबेथ एक धूर्त है और बेंजामिन एक धूर्त है।\" बेंजामिन ने कहा कि हेनरी एक शूरवीर है। मेसन ने कहा, \"सोफिया एक धूर्त है यदि और केवल यदि एलिज़ाबेथ एक धूर्त है।\" जेम्स ने टिप्पणी की, \"मेसेन एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हेनरी एक धूर्त है  \n(2) एलिज़ाबेथ एक धूर्त है  \n(3) सैमुएल एक शूरवीर है  \n(4) एमिली एक शूरवीर है  \n(5) सोफिया एक शूरवीर है  \n(6) बेंजामिन एक धूर्त है  \n(7) मेसन एक धूर्त है  \n(8) जेम्स एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ग्रेस, सोफिया, एवा, डेविड, इसाबेला, हेनरी, विलियम, और एलिज़ाबेथ। ग्रेस के अनुसार, \"एवा एक शूरवीर है यदि और केवल यदि हेनरी एक शूरवीर है\"। सोफिया ने आपको बताया कि यदि एवा एक शूरवीर है तो एवा एक धूर्त है। \"डेविड एक धूर्त है और ग्रेस एक शूरवीर है,\" एवा ने दावा किया। डेविड ने asserted किया: \"सोफिया एक शूरवीर नहीं है\"। \"यदि सोफिया एक शूरवीर है तो ग्रेस एक धूर्त है,\" इसाबेला ने घोषित किया। हेनरी ने कहा कि यदि सोफिया एक धूर्त है तो एवा एक शूरवीर है। जैसे विलियम ने कहा, \"एलिज़ाबेथ एक धूर्त है और इसाबेला एक धूर्त है\"। एलिज़ाबेथ ने कहा, \"हेनरी एक शूरवीर है या एलिज़ाबेथ एक शूरवीर है।\" तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ग्रेस एक धूर्त है  \n(2) सोफिया एक शूरवीर है  \n(3) एवा एक धूर्त है  \n(4) डेविड एक धूर्त है  \n(5) इसाबेला एक शूरवीर है  \n(6) हेनरी एक शूरवीर है  \n(7) विलियम एक धूर्त है  \n(8) एलिज़ाबेथ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: जेम्स, एलिज़ाबेथ, पेनलोप, लुकास, मेसन, ओलिवर, ज़ोई, और एम्मा। जेम्स के अनुसार, \"ओलिवर एक धूर्त है\"। एलिज़ाबेथ ने कहा कि पेनलोप एक धूर्त है या मेसन एक धूर्त है। \"एम्मा एक धूर्त नहीं है,\" पेनलोप ने कहा। लुकास ने कहा: \"एलिज़ाबेथ एक धूर्त है या मेसन एक धूर्त है\"। मेसन ने कहा: \"यदि एलिज़ाबेथ एक धूर्त है तो एलिज़ाबेथ एक शूरवीर है\"। \"पेनलोप एक शूरवीर नहीं है,\" ओलिवर ने घोषणा की। ज़ोई ने कहा, \"मेसन एक धूर्त है\"। एम्मा ने कहा, \"पेनलोप एक धूर्त है और लुकास एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक धूर्त है  \n(2) एलिज़ाबेथ एक शूरवीर है  \n(3) पेनलोप एक धूर्त है  \n(4) लुकास एक धूर्त है  \n(5) मेसन एक शूरवीर है  \n(6) ओलिवर एक शूरवीर है  \n(7) ज़ोई एक धूर्त है  \n(8) एम्मा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: सैमुएल, विलियम, एवरी, विक्टोरिया, मेसन, नूह, ओलिवर, और ओलिविया। सैमुएल के एक बयान में: \"ओलिविया एक धूर्त नहीं है\"। विलियम ने कहा, \"अगर ओलिवर एक शूरवीर है तो मेसन एक शूरवीर है\"। \"ओलिविया एक धूर्त है या ओलिवर एक धूर्त है,\" एवरी ने उल्लेख किया। \"ओलिवर एक धूर्त नहीं है,\" विक्टोरिया ने दावा किया। \"नूह एक शूरवीर है और ओलिविया एक शूरवीर है,\" मेसन ने दावा किया। \"मेसन एक शूरवीर है,\" नूह ने दावा किया। ओलिवर ने कहा, \"ओलिविया एक धूर्त है\"। ओलिविया ने टिप्पणी की, \"विक्टोरिया एक शूरवीर है और विक्टोरिया एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक धूर्त है  \n(2) विलियम एक धूर्त है  \n(3) एवरी एक शूरवीर है  \n(4) विक्टोरिया एक शूरवीर है  \n(5) मेसन एक धूर्त है  \n(6) नूह एक धूर्त है  \n(7) ओलिवर एक शूरवीर है  \n(8) ओलिविया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ओलिवर, ल्यूक, हेनरी, लिली, जैक्सन, नूह, यूसुफ, और सोफिया। \"जैक्सन एक शूरवीर है या ल्यूक एक धूर्त है,\" ओलिवर ने दावा किया। ल्यूक ने asserted किया: \"जैक्सन एक शूरवीर है या यूसुफ एक शूरवीर है\"। हेनरी को कहते हुए सुना गया, \"ओलिवर एक धूर्त नहीं है\"। लिली के शब्दों में: \"नूह एक शूरवीर है यदि और केवल यदि सोफिया एक शूरवीर है\"। जैक्सन ने टिप्पणी की, \"लिली एक शूरवीर नहीं है\"। नूह को कहते हुए सुना गया, \"यदि ओलिवर एक शूरवीर है तो यूसुफ एक शूरवीर है\"। यूसुफ ने stated किया, \"सोफिया एक शूरवीर है यदि और केवल यदि नूह एक धूर्त है\"। सोफिया ने noted किया, \"लिली एक धूर्त है यदि और केवल यदि ओलिवर एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ओलिवर एक शूरवीर है  \n(2) ल्यूक एक धूर्त है  \n(3) हेनरी एक शूरवीर है  \n(4) लिली एक शूरवीर है  \n(5) जैक्सन एक धूर्त है  \n(6) नूह एक धूर्त है  \n(7) यूसुफ एक धूर्त है  \n(8) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: बेंजामिन, अलेक्जेंडर, हार्पर, एवलिन, एम्मा, एला, एवा, और राइली। बेंजामिन ने कहा, \"एम्मा एक धूर्त है यदि और केवल यदि हार्पर एक धूर्त है।\" अलेक्जेंडर ने कहा, \"एवा एक धूर्त है या एम्मा एक शूरवीर है।\" हार्पर के अनुसार, \"एवा एक धूर्त है और एवा एक शूरवीर है।\" \"यदि एवा एक धूर्त है तो एला एक धूर्त है,\" एवलिन ने घोषित किया। एम्मा ने कहा, \"अलेक्जेंडर एक शूरवीर है यदि और केवल यदि बेंजामिन एक धूर्त है।\" एला को यह कहते हुए सुना गया, \"यदि राइली एक शूरवीर है तो एला एक शूरवीर है।\" एवा के शब्दों में: \"बेंजामिन एक धूर्त नहीं है।\" राइली के शब्दों में: \"हार्पर एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक धूर्त है  \n(2) अलेक्जेंडर एक शूरवीर है  \n(3) हार्पर एक धूर्त है  \n(4) एवलिन एक धूर्त है  \n(5) एम्मा एक शूरवीर है  \n(6) एला एक शूरवीर है  \n(7) एवा एक धूर्त है  \n(8) राइली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: अबिगेल, मेसन, राइली, विक्टोरिया, ईथन, याकूब, शार्लट, और लुकास। अबिगेल को कहते हुए सुना गया, \"विक्टोरिया एक धूर्त है\"। मेसन को कहते हुए सुना गया, \"लुकास एक शूरवीर है यदि और केवल यदि शार्लट एक शूरवीर है\"। राइली को कहते हुए सुना गया, \"विक्टोरिया एक धूर्त है या विक्टोरिया एक शूरवीर है\"। \"मेसन एक धूर्त है\" - विक्टोरिया। ईथन ने नोट किया, \"अबिगेल एक शूरवीर है और अबिगेल एक धूर्त है\"। याकूब ने टिप्पणी की, \"ईथन एक धूर्त है\"। शार्लट ने नोट किया, \"यदि ईथन एक शूरवीर है तो लुकास एक शूरवीर है\"। लुकास ने कहा, \"यदि मेसन एक शूरवीर है तो याकूब एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अबिगेल एक शूरवीर है  \n(2) मेसन एक शूरवीर है  \n(3) राइली एक शूरवीर है  \n(4) विक्टोरिया एक धूर्त है  \n(5) ईथन एक धूर्त है  \n(6) याकूब एक शूरवीर है  \n(7) शार्लट एक शूरवीर है  \n(8) लुकास एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: अमेलिया, विलियम, मेसन, लुकास, जेम्स, विक्टोरिया, डैनियल, और राइली। अमेलिया ने कहा कि विक्टोरिया एक शूरवीर है यदि और केवल यदि लुकास एक शूरवीर है। विलियम ने आपको बताया कि यदि डैनियल एक धूर्त है तो जेम्स एक धूर्त है। मेसन को यह कहते हुए सुना गया, \"यदि अमेलिया एक शूरवीर है तो लुकास एक शूरवीर है\"। लुकास के एक बयान में: \"जेम्स एक शूरवीर है या डैनियल एक शूरवीर है\"। जेम्स के अनुसार, \"मेसेन एक धूर्त है या विक्टोरिया एक धूर्त है\"। विक्टोरिया ने कहा, \"राइली एक शूरवीर नहीं है।\" जैसा कि डैनियल ने कहा, \"विलियम एक शूरवीर है\"। \"अमेलिया एक धूर्त है यदि और केवल यदि विलियम एक धूर्त है,\" राइली ने उल्लेख किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक धूर्त है  \n(2) विलियम एक धूर्त है  \n(3) मेसन एक शूरवीर है  \n(4) लुकास एक शूरवीर है  \n(5) जेम्स एक शूरवीर है  \n(6) विक्टोरिया एक धूर्त है  \n(7) डैनियल एक धूर्त है  \n(8) राइली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एम्मा, लिली, एवरी, औरोरा, एवलिन, नूह, अबिगेल, और ग्रेस। एम्मा ने कहा, \"नूह एक धूर्त है\"। लिली के अनुसार, \"यदि अबिगेल एक शूरवीर है तो नूह एक धूर्त है\"। एवरी ने आपको बताया कि यदि ग्रेस एक धूर्त है तो एवरी एक शूरवीर है। औरोरा ने कहा कि ग्रेस एक शूरवीर है और एवलिन एक शूरवीर है। एवलिन ने कहा, \"लिली एक धूर्त है या औरोरा एक धूर्त है।\" नूह ने टिप्पणी की, \"एवलिन एक शूरवीर है और एवलिन एक धूर्त है\"। अबिगेल के शब्दों में: \"एवरी एक शूरवीर है यदि और केवल यदि लिली एक धूर्त है\"। ग्रेस ने कहा, \"एवलिन एक धूर्त है यदि और केवल यदि एवरी एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एम्मा एक शूरवीर है  \n(2) लिली एक शूरवीर है  \n(3) एवरी एक धूर्त है  \n(4) औरोरा एक धूर्त है  \n(5) एवलिन एक शूरवीर है  \n(6) नूह एक धूर्त है  \n(7) अबिगेल एक शूरवीर है  \n(8) ग्रेस एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: जैक, जेम्स, डैनियल, ल्यूक, ऐडन, विलियम, डेविड, और ओलिविया। \"ल्यूक एक शूरवीर है,\" जैक ने घोषणा की। जेम्स को यह कहते हुए सुना गया, \"विलियम एक शूरवीर है और ओलिविया एक शूरवीर है\"। डैनियल ने टिप्पणी की, \"विलियम एक शूरवीर है या विलियम एक धूर्त है\"। \"जेम्स एक धूर्त है या डैनियल एक शूरवीर है,\" ल्यूक ने घोषणा की। ऐडन ने कहा, \"डैनियल एक शूरवीर है या जेम्स एक शूरवीर है।\" विलियम ने व्यक्त किया कि यदि जेम्स एक शूरवीर है तो ऐडन एक धूर्त है। डेविड ने नोट किया, \"यदि विलियम एक धूर्त है तो जैक एक धूर्त है\"। ओलिविया ने कहा, \"विलियम एक धूर्त है और डेविड एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक एक शूरवीर है  \n(2) जेम्स एक धूर्त है  \n(3) डैनियल एक शूरवीर है  \n(4) ल्यूक एक शूरवीर है  \n(5) ऐडन एक शूरवीर है  \n(6) विलियम एक शूरवीर है  \n(7) डेविड एक शूरवीर है  \n(8) ओलिविया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ओवेन, अमेलिया, एमिली, जैक, माइकल, यूसुफ, सेबेस्टियन, और एला। ओवेन के एक बयान में: \"एला एक शूरवीर है या यूसुफ एक शूरवीर है\"। \"सेबेस्टियन एक धूर्त है या अमेलिया एक शूरवीर है,\" अमेलिया ने कहा। \"ओवेन एक धूर्त है,\" एमिली ने कहा। जैक के अनुसार, \"माइकल एक शूरवीर है और यूसुफ एक धूर्त है\"। माइकल ने कहा कि माइकल एक शूरवीर है यदि और केवल यदि जैक एक शूरवीर है। यूसुफ ने आपको बताया कि सेबेस्टियन एक धूर्त है यदि और केवल यदि जैक एक धूर्त है। जैसे सेबेस्टियन ने कहा, \"सेबेस्टियन एक शूरवीर है या एला एक धूर्त है\"। एला ने कहा, \"ओवेन एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओवेन एक शूरवीर है  \n(2) अमेलिया एक शूरवीर है  \n(3) एमिली एक धूर्त है  \n(4) जैक एक शूरवीर है  \n(5) माइकल एक शूरवीर है  \n(6) यूसुफ एक धूर्त है  \n(7) सेबेस्टियन एक धूर्त है  \n(8) एला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ऐडन, राइली, शार्लट, विलियम, माइकल, ज़ोई, इसाबेला, और सैमुएल। ऐडन ने कहा, \"ऐडन एक शूरवीर है या माइकल एक शूरवीर है।\" राइली को यह कहते हुए सुना गया, \"अगर सैमुएल एक शूरवीर है तो ऐडन एक धूर्त है।\" शार्लट के अनुसार, \"सैमुएल एक धूर्त है या ऐडन एक धूर्त है।\" विलियम ने कहा, \"राइली एक धूर्त नहीं है।\" \"सैमुएल एक धूर्त है यदि और केवल यदि इसाबेला एक धूर्त है,\" माइकल ने कहा। ज़ोई ने कहा कि विलियम एक धूर्त है यदि और केवल यदि राइली एक धूर्त है। इसाबेला ने कहा: \"विलियम एक शूरवीर है।\" सैमुएल ने कहा, \"ऐडन एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक शूरवीर है  \n(2) राइली एक शूरवीर है  \n(3) शार्लट एक शूरवीर है  \n(4) विलियम एक शूरवीर है  \n(5) माइकल एक धूर्त है  \n(6) ज़ोई एक शूरवीर है  \n(7) इसाबेला एक शूरवीर है  \n(8) सैमुएल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: जेम्स, औरोरा, माइकल, स्कारलेट, अमेलिया, बेंजामिन, हेनरी, और शार्लट। जेम्स के शब्दों में: \"शार्लट एक धूर्त है यदि और केवल यदि अमेलिया एक शूरवीर है\"। औरोरा के शब्दों में: \"माइकल एक शूरवीर है या बेंजामिन एक धूर्त है\"। \"जेम्स एक शूरवीर है यदि और केवल यदि स्कारलेट एक शूरवीर है,\" माइकल ने घोषणा की। स्कारलेट ने आपको बताया कि औरोरा एक धूर्त नहीं है। अमेलिया के शब्दों में: \"औरोरा एक शूरवीर है यदि और केवल यदि स्कारलेट एक शूरवीर है\"। बेंजामिन के अनुसार, \"माइकल एक शूरवीर है और औरोरा एक धूर्त है\"। हेनरी को यह कहते हुए सुना गया, \"अमेलिया एक शूरवीर नहीं है\"। शार्लट ने कहा, \"यदि माइकल एक धूर्त है तो अमेलिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक धूर्त है  \n(2) औरोरा एक शूरवीर है  \n(3) माइकल एक धूर्त है  \n(4) स्कारलेट एक शूरवीर है  \n(5) अमेलिया एक शूरवीर है  \n(6) बेंजामिन एक धूर्त है  \n(7) हेनरी एक धूर्त है  \n(8) शार्लट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: बेंजामिन, लियम, अलेक्जेंडर, एवा, याकूब, मैथ्यू, मेसन, और एम्मा। बेंजामिन के अनुसार, \"एवा एक शूरवीर है यदि और केवल यदि बेंजामिन एक शूरवीर है\"। \"यदि एम्मा एक शूरवीर है तो बेंजामिन एक धूर्त है,\" लियम ने दावा किया। \"यदि बेंजामिन एक धूर्त है तो लियम एक धूर्त है,\" अलेक्जेंडर ने दावा किया। एवा के शब्दों में: \"अलेक्जेंडर एक शूरवीर है और लियम एक धूर्त है\"। \"एम्मा एक धूर्त है और मेसन एक धूर्त है\" - याकूब। मैथ्यू ने कहा कि एम्मा एक धूर्त नहीं है। मेसन ने कहा, \"यदि बेंजामिन एक धूर्त है तो लियम एक धूर्त है\"। एम्मा ने कहा, \"एवा एक शूरवीर है यदि और केवल यदि याकूब एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक शूरवीर है  \n(2) लियम एक धूर्त है  \n(3) अलेक्जेंडर एक शूरवीर है  \n(4) एवा एक शूरवीर है  \n(5) याकूब एक धूर्त है  \n(6) मैथ्यू एक शूरवीर है  \n(7) मेसन एक शूरवीर है  \n(8) एम्मा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: डेविड, अबिगेल, लुकास, ज़ोई, ईथन, विलियम, हार्पर, और इसाबेला। \"अबिगेल एक शूरवीर है और विलियम एक शूरवीर है\" - डेविड। अबिगेल ने आपको बताया कि हार्पर एक धूर्त नहीं है। लुकास ने कहा, \"यदि विलियम एक शूरवीर है तो ज़ोई एक शूरवीर है\"। ज़ोई के अनुसार, \"डेविड एक धूर्त है यदि और केवल यदि विलियम एक शूरवीर है\"। \"लुकास एक धूर्त नहीं है,\" ईथन ने दावा किया। जैसे विलियम ने कहा, \"हार्पर एक धूर्त है और अबिगेल एक धूर्त है\"। हार्पर ने asserted किया: \"ईथन एक धूर्त है\"। \"हार्पर एक शूरवीर नहीं है,\" इसाबेला ने उल्लेख किया। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) डेविड एक धूर्त है  \n(2) अबिगेल एक धूर्त है  \n(3) लुकास एक शूरवीर है  \n(4) ज़ोई एक शूरवीर है  \n(5) ईथन एक शूरवीर है  \n(6) विलियम एक शूरवीर है  \n(7) हार्पर एक धूर्त है  \n(8) इसाबेला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ज़ोई, ओलिवर, अलेक्जेंडर, सोफिया, जैक, एम्मा, ल्यूक, और एमिली। ज़ोई को यह कहते हुए सुना गया, \"सोफिया एक शूरवीर है\"। ओलिवर के शब्दों में: \"एम्मा एक शूरवीर नहीं है\"। अलेक्जेंडर ने टिप्पणी की, \"सोफिया एक धूर्त है या सोफिया एक शूरवीर है\"। सोफिया ने कहा, \"जैक एक शूरवीर नहीं है\"। जैक ने कहा कि ओलिवर एक शूरवीर है। एम्मा ने नोट किया, \"ल्यूक एक शूरवीर नहीं है\"। ल्यूक ने कहा, \"सोफिया एक शूरवीर है यदि और केवल यदि ज़ोई एक धूर्त है\"। \"सोफिया एक धूर्त है यदि और केवल यदि जैक एक शूरवीर है\" - एमिली। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ज़ोई एक शूरवीर है  \n(2) ओलिवर एक धूर्त है  \n(3) अलेक्जेंडर एक शूरवीर है  \n(4) सोफिया एक शूरवीर है  \n(5) जैक एक धूर्त है  \n(6) एम्मा एक शूरवीर है  \n(7) ल्यूक एक धूर्त है  \n(8) एमिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ल्यूक, ओवेन, जैक्सन, एवलिन, हेनरी, सोफिया, नूह, और यूसुफ। \"जैक्सन एक शूरवीर है यदि और केवल यदि ओवेन एक शूरवीर है\" - ल्यूक। \"जैक्सन एक धूर्त है यदि और केवल यदि सोफिया एक धूर्त है,\" ओवेन ने दावा किया। जैक्सन ने कहा कि यूसुफ एक धूर्त है। जैसा कि एवलिन ने कहा, \"ओवेन एक शूरवीर नहीं है\"। हेनरी के एक बयान में: \"ओवेन एक शूरवीर नहीं है\"। सोफिया के शब्दों में: \"ओवेन एक शूरवीर है और ओवेन एक धूर्त है\"। नूह को यह कहते हुए सुना गया, \"ल्यूक एक धूर्त है या यूसुफ एक धूर्त है\"। यूसुफ ने कहा, \"नूह एक धूर्त है यदि और केवल यदि सोफिया एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक धूर्त है  \n(2) ओवेन एक शूरवीर है  \n(3) जैक्सन एक धूर्त है  \n(4) एवलिन एक धूर्त है  \n(5) हेनरी एक धूर्त है  \n(6) सोफिया एक धूर्त है  \n(7) नूह एक शूरवीर है  \n(8) यूसुफ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ऐडन, अमेलिया, यूसुफ, एमिली, एवा, बेंजामिन, ओलिविया, और औरोरा। ऐडन के अनुसार, \"ओलिविया एक शूरवीर है और बेंजामिन एक शूरवीर है\"। अमेलिया के अनुसार, \"एवा एक शूरवीर नहीं है\"। यूसुफ ने आपको बताया कि यूसुफ एक शूरवीर है या ओलिविया एक शूरवीर है। एमिली ने कहा, \"ओलिविया एक शूरवीर नहीं है\"। \"बेंजामिन एक धूर्त है यदि और केवल यदि औरोरा एक शूरवीर है,\" एवा ने घोषणा की। \"यदि एमिली एक धूर्त है तो ऐडन एक शूरवीर है,\" बेंजामिन ने घोषणा की। \"बेंजामिन एक शूरवीर है,\" ओलिविया ने उल्लेख किया। \"एमिली एक धूर्त है,\" औरोरा ने उल्लेख किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक शूरवीर है  \n(2) अमेलिया एक शूरवीर है  \n(3) यूसुफ एक शूरवीर है  \n(4) एमिली एक धूर्त है  \n(5) एवा एक धूर्त है  \n(6) बेंजामिन एक शूरवीर है  \n(7) ओलिविया एक शूरवीर है  \n(8) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मिया, क्लोई, यूसुफ, एलिज़ाबेथ, सेबेस्टियन, औरोरा, अलेक्जेंडर, और सोफिया। \"एलिज़ाबेथ एक धूर्त है या सेबेस्टियन एक शूरवीर है,\" मिया ने कहा। \"सोफिया एक धूर्त है यदि और केवल यदि अलेक्जेंडर एक शूरवीर है\" - क्लोई। यूसुफ के एक बयान में: \"यदि क्लोई एक धूर्त है तो क्लोई एक शूरवीर है\"। एलिज़ाबेथ के शब्दों में: \"यदि अलेक्जेंडर एक धूर्त है तो क्लोई एक शूरवीर है\"। सेबेस्टियन के एक बयान में: \"एलिज़ाबेथ एक शूरवीर है\"। औरोरा ने कहा, \"अलेक्जेंडर एक शूरवीर नहीं है\"। अलेक्जेंडर के अनुसार, \"क्लोई एक धूर्त है या मिया एक धूर्त है\"। सोफिया ने कहा, \"क्लोई एक शूरवीर नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक शूरवीर है  \n(2) क्लोई एक धूर्त है  \n(3) यूसुफ एक धूर्त है  \n(4) एलिज़ाबेथ एक शूरवीर है  \n(5) सेबेस्टियन एक शूरवीर है  \n(6) औरोरा एक धूर्त है  \n(7) अलेक्जेंडर एक शूरवीर है  \n(8) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: डेविड, क्लोई, एवलिन, बेंजामिन, जैक्सन, मैथ्यू, जेम्स, और ईथन। डेविड ने कहा: \"ईथन एक धूर्त है\"। क्लोई ने कहा कि ईथन एक शूरवीर है यदि और केवल यदि जेम्स एक शूरवीर है। एवलिन के एक बयान में: \"एवलिन एक शूरवीर है या बेंजामिन एक शूरवीर है\"। बेंजामिन ने कहा, \"यदि जेम्स एक शूरवीर है तो क्लोई एक धूर्त है\"। \"डेविड एक धूर्त है और क्लोई एक धूर्त है,\" जैक्सन ने दावा किया। जैसे मैथ्यू ने कहा, \"बेंजामिन एक धूर्त है यदि और केवल यदि डेविड एक धूर्त है\"। जेम्स के अनुसार, \"एवलिन एक धूर्त है यदि और केवल यदि डेविड एक धूर्त है\"। ईथन ने कहा, \"डेविड एक धूर्त है यदि और केवल यदि बेंजामिन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक धूर्त है  \n(2) क्लोई एक शूरवीर है  \n(3) एवलिन एक धूर्त है  \n(4) बेंजामिन एक धूर्त है  \n(5) जैक्सन एक धूर्त है  \n(6) मैथ्यू एक शूरवीर है  \n(7) जेम्स एक शूरवीर है  \n(8) ईथन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: राइली, एलिज़ाबेथ, मैथ्यू, एवा, शार्लट, अलेक्जेंडर, एमिली, और अबिगेल। राइली ने टिप्पणी की, \"अलेक्जेंडर एक शूरवीर है\"। एलिज़ाबेथ ने नोट किया, \"शार्लट एक शूरवीर है या मैथ्यू एक धूर्त है\"। मैथ्यू ने कहा कि शार्लट एक धूर्त है और मैथ्यू एक शूरवीर है। एवा के शब्दों में: \"एवा एक शूरवीर है या एमिली एक शूरवीर है\"। शार्लट ने आपको बताया कि अलेक्जेंडर एक शूरवीर है या मैथ्यू एक शूरवीर है। अलेक्जेंडर ने asserted किया: \"मैथ्यू एक धूर्त है\"। एमिली के अनुसार, \"एवा एक धूर्त है या एलिज़ाबेथ एक शूरवीर है\"। अबिगेल के शब्दों में: \"शार्लट एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक शूरवीर है  \n(2) एलिज़ाबेथ एक शूरवीर है  \n(3) मैथ्यू एक धूर्त है  \n(4) एवा एक शूरवीर है  \n(5) शार्लट एक शूरवीर है  \n(6) अलेक्जेंडर एक शूरवीर है  \n(7) एमिली एक शूरवीर है  \n(8) अबिगेल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ग्रेस, एवरी, बेंजामिन, इसाबेला, माइकल, ओलिविया, ऐडन, और ओवेन। ग्रेस ने टिप्पणी की, \"ओलिविया एक धूर्त है और बेंजामिन एक धूर्त है\"। एवरी ने asserted किया: \"अगर ओलिविया एक धूर्त है तो बेंजामिन एक धूर्त है\"। बेंजामिन ने कहा, \"अगर इसाबेला एक धूर्त है तो इसाबेला एक शूरवीर है\"। \"बेंजामिन एक धूर्त है यदि और केवल यदि ग्रेस एक शूरवीर है\" - इसाबेला। माइकल ने asserted किया: \"बेंजामिन एक शूरवीर है यदि और केवल यदि एवरी एक धूर्त है\"। ओलिविया ने कहा कि ऐडन एक धूर्त है और माइकल एक शूरवीर है। \"अगर बेंजामिन एक शूरवीर है तो इसाबेला एक शूरवीर है\" - ऐडन। ओवेन ने टिप्पणी की, \"माइकल एक शूरवीर है यदि और केवल यदि एवरी एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक धूर्त है  \n(2) एवरी एक धूर्त है  \n(3) बेंजामिन एक शूरवीर है  \n(4) इसाबेला एक शूरवीर है  \n(5) माइकल एक शूरवीर है  \n(6) ओलिविया एक धूर्त है  \n(7) ऐडन एक शूरवीर है  \n(8) ओवेन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: राइली, सोफिया, बेंजामिन, अमेलिया, डैनियल, इसाबेला, माइकल, और क्लोई। राइली के शब्दों में: \"इसाबेला एक धूर्त नहीं है\"। \"क्लोई एक शूरवीर है और डैनियल एक शूरवीर है\" - सोफिया। बेंजामिन के अनुसार, \"इसाबेला एक धूर्त है\"। अमेलिया ने कहा, \"डैनियल एक धूर्त नहीं है\"। डैनियल के अनुसार, \"क्लोई एक धूर्त है यदि और केवल यदि माइकल एक धूर्त है\"। इसाबेला के एक बयान में: \"बेंजामिन एक शूरवीर है या डैनियल एक धूर्त है\"। \"क्लोई एक शूरवीर नहीं है\" - माइकल। क्लोई के शब्दों में: \"बेंजामिन एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक शूरवीर है  \n(2) सोफिया एक धूर्त है  \n(3) बेंजामिन एक धूर्त है  \n(4) अमेलिया एक धूर्त है  \n(5) डैनियल एक धूर्त है  \n(6) इसाबेला एक शूरवीर है  \n(7) माइकल एक धूर्त है  \n(8) क्लोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा आबाद है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: अबिगेल, एला, शार्लट, सेबेस्टियन, स्कारलेट, एवा, राइली, और ओलिवर। अबिगेल को यह कहते हुए सुना गया, \"एवा धूर्त नहीं है\"। जैसा कि एला ने कहा, \"एवा शूरवीर है यदि और केवल यदि अबिगेल धूर्त है\"। \"यदि एला शूरवीर है तो अबिगेल धूर्त है\" - शार्लट। \"राइली धूर्त है और राइली शूरवीर है\" - सेबेस्टियन। \"यदि और केवल यदि ओलिवर धूर्त है, तो शार्लट शूरवीर है,\" स्कारलेट ने दावा किया। एवा के अनुसार, \"स्कारलेट शूरवीर नहीं है\"। राइली ने कहा, \"यदि एला शूरवीर है तो स्कारलेट शूरवीर है\"। ओलिवर ने कहा, \"एला शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अबिगेल एक शूरवीर है  \n(2) एला एक धूर्त है  \n(3) शार्लट एक शूरवीर है  \n(4) सेबेस्टियन एक धूर्त है  \n(5) स्कारलेट एक धूर्त है  \n(6) एवा एक शूरवीर है  \n(7) राइली एक शूरवीर है  \n(8) ओलिवर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: सेबेस्टियन, एवलिन, याकूब, औरोरा, अमेलिया, हार्पर, मिया, और ग्रेस। सेबेस्टियन ने कहा, \"मिया एक शूरवीर है यदि और केवल यदि ग्रेस एक शूरवीर है\"। एवलिन ने कहा कि याकूब एक शूरवीर है या ग्रेस एक शूरवीर है। याकूब ने कहा, \"हार्पर एक धूर्त है यदि और केवल यदि सेबेस्टियन एक शूरवीर है\"। औरोरा ने कहा, \"एवलिन एक धूर्त है\"। अमेलिया ने टिप्पणी की, \"यदि सेबेस्टियन एक धूर्त है तो मिया एक शूरवीर है\"। हार्पर ने कहा, \"अमेलिया एक शूरवीर है या सेबेस्टियन एक धूर्त है\"। \"यदि हार्पर एक शूरवीर है तो सेबेस्टियन एक धूर्त है,\" मिया ने कहा। ग्रेस के शब्दों में: \"यदि एवलिन एक धूर्त है तो एवलिन एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सेबेस्टियन एक शूरवीर है  \n(2) एवलिन एक धूर्त है  \n(3) याकूब एक धूर्त है  \n(4) औरोरा एक शूरवीर है  \n(5) अमेलिया एक शूरवीर है  \n(6) हार्पर एक शूरवीर है  \n(7) मिया एक धूर्त है  \n(8) ग्रेस एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: अबिगेल, एवा, याकूब, पेनलोप, ईथन, सैमुएल, ल्यूक, और अलेक्जेंडर। अबिगेल ने कहा: \"अगर ईथन एक शूरवीर है तो ईथन एक धूर्त है\"। एवा ने कहा कि अलेक्जेंडर एक धूर्त है और अबिगेल एक शूरवीर है। \"ईथन एक धूर्त है यदि और केवल यदि याकूब एक शूरवीर है,\" याकूब ने दावा किया। \"ईथन एक धूर्त नहीं है\" - पेनलोप। ईथन ने आपको बताया कि एवा एक शूरवीर है। \"अलेक्जेंडर एक शूरवीर है\" - सैमुएल। जैसा कि ल्यूक ने कहा, \"याकूब एक शूरवीर है यदि और केवल यदि सैमुएल एक धूर्त है\"। अलेक्जेंडर ने कहा: \"ल्यूक एक शूरवीर है और पेनलोप एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अबिगेल एक शूरवीर है  \n(2) एवा एक धूर्त है  \n(3) याकूब एक धूर्त है  \n(4) पेनलोप एक धूर्त है  \n(5) ईथन एक धूर्त है  \n(6) सैमुएल एक शूरवीर है  \n(7) ल्यूक एक शूरवीर है  \n(8) अलेक्जेंडर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एलिज़ाबेथ, जैक, एमिली, एवरी, जेम्स, ज़ोई, लियम, और शार्लट। एलिज़ाबेथ के एक बयान में: \"एवरी एक धूर्त है\"। जैक के एक बयान में: \"एलिज़ाबेथ एक धूर्त है और एमिली एक शूरवीर है\"। एमिली ने कहा, \"शार्लट एक शूरवीर है या लियम एक शूरवीर है\"। एवरी के अनुसार, \"अगर एलिज़ाबेथ एक धूर्त है तो एमिली एक शूरवीर है\"। जेम्स ने कहा, \"लियम एक धूर्त है\"। \"अगर लियम एक धूर्त है तो शार्लट एक शूरवीर है,\" ज़ोई ने घोषणा की। लियम के अनुसार, \"एलिज़ाबेथ एक धूर्त है या शार्लट एक धूर्त है\"। शार्लट ने कहा कि अगर जैक एक धूर्त है तो जेम्स एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक धूर्त है  \n(2) जैक एक शूरवीर है  \n(3) एमिली एक शूरवीर है  \n(4) एवरी एक शूरवीर है  \n(5) जेम्स एक धूर्त है  \n(6) ज़ोई एक शूरवीर है  \n(7) लियम एक शूरवीर है  \n(8) शार्लट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त निवास करते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: जैक्सन, मेसन, लुकास, हेनरी, जेम्स, माइकल, विलियम, और एम्मा। जैक्सन ने टिप्पणी की, \"माइकल एक धूर्त है या हेनरी एक शूरवीर है\"। मेसन के अनुसार, \"जेम्स एक धूर्त है यदि और केवल यदि विलियम एक धूर्त है\"। \"एम्मा एक शूरवीर है और माइकल एक शूरवीर है,\" लुकास ने दावा किया। \"यदि माइकल एक धूर्त है तो विलियम एक शूरवीर है\" - हेनरी। जेम्स ने कहा कि जैक्सन एक शूरवीर है या हेनरी एक धूर्त है। माइकल के अनुसार, \"मेसन एक धूर्त है और जेम्स एक धूर्त है\"। विलियम के एक बयान में: \"माइकल एक धूर्त है या मेसन एक धूर्त है\"। एम्मा ने टिप्पणी की, \"जेम्स एक धूर्त है और माइकल एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक शूरवीर है  \n(2) मेसन एक शूरवीर है  \n(3) लुकास एक धूर्त है  \n(4) हेनरी एक शूरवीर है  \n(5) जेम्स एक शूरवीर है  \n(6) माइकल एक धूर्त है  \n(7) विलियम एक शूरवीर है  \n(8) एम्मा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: आरिया, ओवेन, ऐडन, ओलिवर, क्लोई, ओलिविया, याकूब, और ईथन। जैसे कि आरिया ने कहा, \"क्लोई शूरवीर नहीं है\"। ओवेन ने asserted किया: \"अगर क्लोई धूर्त है तो याकूब धूर्त है\"। ऐडन ने कहा, \"ईथन शूरवीर है या ओवेन शूरवीर है\"। ओलिवर ने कहा, \"अगर ओलिविया धूर्त है तो ईथन शूरवीर है\"। \"ईथन शूरवीर है यदि और केवल यदि ओवेन धूर्त है,\" क्लोई ने कहा। \"ऐडन धूर्त नहीं है,\" ओलिविया ने दावा किया। याकूब ने आपको बताया कि ईथन शूरवीर नहीं है। ईथन के अनुसार, \"ओवेन शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) आरिया एक धूर्त है  \n(2) ओवेन एक शूरवीर है  \n(3) ऐडन एक शूरवीर है  \n(4) ओलिवर एक शूरवीर है  \n(5) क्लोई एक शूरवीर है  \n(6) ओलिविया एक शूरवीर है  \n(7) याकूब एक शूरवीर है  \n(8) ईथन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: जैक्सन, एम्मा, लोगन, आरिया, ग्रेस, लियम, पेनलोप, और मैथ्यू। जैक्सन ने कहा, \"अगर मैथ्यू एक शूरवीर है तो लियम एक धूर्त है।\" एम्मा ने कहा, \"अगर मैथ्यू एक धूर्त है तो लियम एक धूर्त है।\" \"मैथ्यू एक धूर्त है और जैक्सन एक धूर्त है,\" लोगन ने कहा। आरिया के अनुसार, \"एम्मा एक धूर्त है और लियम एक शूरवीर है।\" ग्रेस के शब्दों में: \"जैक्सन एक धूर्त है और लियम एक शूरवीर है।\" लियम ने कहा, \"मैथ्यू एक धूर्त है और पेनलोप एक शूरवीर है।\" \"एम्मा एक शूरवीर है यदि और केवल यदि मैथ्यू एक धूर्त है,\" पेनलोप ने कहा। जैसे मैथ्यू ने कहा, \"अगर आरिया एक शूरवीर है तो ग्रेस एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक शूरवीर है  \n(2) एम्मा एक शूरवीर है  \n(3) लोगन एक धूर्त है  \n(4) आरिया एक धूर्त है  \n(5) ग्रेस एक धूर्त है  \n(6) लियम एक धूर्त है  \n(7) पेनलोप एक धूर्त है  \n(8) मैथ्यू एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: यूसुफ, ओलिविया, अमेलिया, ग्रेस, एमिली, माइकल, नूह, और ल्यूक। यूसुफ ने कहा, \"एमिली एक धूर्त है या अमेलिया एक शूरवीर है\"। ओलिविया ने कहा, \"नूह एक धूर्त है यदि और केवल यदि ओलिविया एक शूरवीर है\"। अमेलिया ने कहा, \"ओलिविया एक धूर्त है और ल्यूक एक धूर्त है\"। ग्रेस ने कहा कि यूसुफ एक धूर्त है और नूह एक धूर्त है। जैसे कि एमिली ने कहा, \"ओलिविया एक धूर्त नहीं है\"। माइकल ने आपको बताया कि यूसुफ एक शूरवीर है और यूसुफ एक धूर्त है। नूह ने कहा, \"यूसुफ एक शूरवीर है\"। ल्यूक ने कहा, \"अमेलिया एक धूर्त है और माइकल एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) यूसुफ एक धूर्त है  \n(2) ओलिविया एक शूरवीर है  \n(3) अमेलिया एक धूर्त है  \n(4) ग्रेस एक शूरवीर है  \n(5) एमिली एक शूरवीर है  \n(6) माइकल एक धूर्त है  \n(7) नूह एक धूर्त है  \n(8) ल्यूक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: बेंजामिन, ओलिविया, जेम्स, औरोरा, माइकल, जैक्सन, मेसन, और इसाबेला। बेंजामिन के अनुसार, \"इसाबेला एक शूरवीर है यदि और केवल यदि जैक्सन एक शूरवीर है\"। ओलिविया के एक बयान में: \"यदि बेंजामिन एक शूरवीर है तो ओलिविया एक शूरवीर है\"। जेम्स के शब्दों में: \"बेंजामिन एक धूर्त नहीं है\"। औरोरा ने कहा, \"मेसेन एक शूरवीर नहीं है\"। माइकल ने कहा, \"ओलिविया एक धूर्त है\"। जैक्सन के एक बयान में: \"यदि इसाबेला एक शूरवीर है तो औरोरा एक शूरवीर है\"। मेसन ने कहा, \"यदि बेंजामिन एक शूरवीर है तो बेंजामिन एक धूर्त है\"। इसाबेला ने कहा: \"बेंजामिन एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक धूर्त है  \n(2) ओलिविया एक शूरवीर है  \n(3) जेम्स एक धूर्त है  \n(4) औरोरा एक धूर्त है  \n(5) माइकल एक धूर्त है  \n(6) जैक्सन एक धूर्त है  \n(7) मेसन एक शूरवीर है  \n(8) इसाबेला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एवा, लोगन, जैक, लिली, माइकल, पेनलोप, सोफिया, और जैक्सन। एवा को कहते हुए सुना गया, \"लिली एक शूरवीर है\"। लोगन को कहते हुए सुना गया, \"जैक एक धूर्त नहीं है\"। जैक ने कहा: \"एवा एक शूरवीर नहीं है\"। लिली ने कहा कि पेनलोप एक धूर्त है। माइकल के शब्दों में: \"अगर जैक एक शूरवीर है तो लोगन एक धूर्त है\"। पेनलोप ने कहा, \"लोगन एक शूरवीर है या एवा एक शूरवीर है\"। सोफिया को कहते हुए सुना गया, \"अगर लोगन एक शूरवीर है तो एवा एक धूर्त है\"। जैक्सन ने कहा, \"सोफिया एक शूरवीर है और एवा एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एवा एक धूर्त है  \n(2) लोगन एक शूरवीर है  \n(3) जैक एक शूरवीर है  \n(4) लिली एक धूर्त है  \n(5) माइकल एक धूर्त है  \n(6) पेनलोप एक शूरवीर है  \n(7) सोफिया एक शूरवीर है  \n(8) जैक्सन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: सेबेस्टियन, ओलिविया, हार्पर, सैमुएल, अलेक्जेंडर, सोफिया, लियम, और विलियम। सेबेस्टियन ने कहा कि सोफिया एक शूरवीर है या सोफिया एक धूर्त है। \"लियम एक धूर्त नहीं है,\" ओलिविया ने घोषणा की। \"अलेक्जेंडर एक धूर्त है या विलियम एक शूरवीर है,\" हार्पर ने घोषणा की। \"सेबेस्टियन एक शूरवीर है,\" सैमुएल ने दावा किया। अलेक्जेंडर के शब्दों में: \"सेबेस्टियन एक शूरवीर है\"। सोफिया ने remarked किया, \"लियम एक धूर्त है या लियम एक शूरवीर है\"। \"ओलिविया एक धूर्त है और हार्पर एक शूरवीर है,\" लियम ने दावा किया। विलियम ने कहा कि हार्पर एक धूर्त नहीं है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सेबेस्टियन एक शूरवीर है  \n(2) ओलिविया एक धूर्त है  \n(3) हार्पर एक धूर्त है  \n(4) सैमुएल एक शूरवीर है  \n(5) अलेक्जेंडर एक शूरवीर है  \n(6) सोफिया एक शूरवीर है  \n(7) लियम एक धूर्त है  \n(8) विलियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ल्यूक, एवा, सोफिया, एम्मा, आरिया, मैथ्यू, शार्लट, और मेसन। \"मैथ्यू एक शूरवीर है,\" ल्यूक ने दावा किया। एवा ने कहा, \"मेसन एक धूर्त है या आरिया एक धूर्त है।\" जैसे सोफिया ने कहा, \"शार्लट एक धूर्त नहीं है।\" एम्मा को यह कहते हुए सुना गया, \"अगर मेसन एक धूर्त है तो सोफिया एक शूरवीर है।\" जैसे आरिया ने कहा, \"मैथ्यू एक शूरवीर है यदि और केवल यदि ल्यूक एक शूरवीर है।\" मैथ्यू ने कहा कि सोफिया एक धूर्त है। शार्लट ने कहा: \"एम्मा एक शूरवीर है।\" मेसन ने कहा, \"मैथ्यू एक शूरवीर है और आरिया एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक धूर्त है  \n(2) एवा एक शूरवीर है  \n(3) सोफिया एक शूरवीर है  \n(4) एम्मा एक शूरवीर है  \n(5) आरिया एक शूरवीर है  \n(6) मैथ्यू एक धूर्त है  \n(7) शार्लट एक शूरवीर है  \n(8) मेसन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: लोगन, आरिया, मिया, इसाबेला, जैक, विक्टोरिया, एवलिन, और नूह। \"एवलिन एक शूरवीर है और लोगन एक शूरवीर है,\" लोगन ने घोषणा की। आरिया ने asserted किया: \"अगर नूह एक धूर्त है तो जैक एक शूरवीर है\"। \"आरिया एक धूर्त है,\" मिया ने दावा किया। \"मिया एक धूर्त है यदि और केवल यदि आरिया एक धूर्त है,\" इसाबेला ने दावा किया। जैक के शब्दों में: \"अगर आरिया एक धूर्त है तो लोगन एक शूरवीर है\"। \"आरिया एक शूरवीर है,\" विक्टोरिया ने उल्लेख किया। एवलिन ने टिप्पणी की, \"अगर इसाबेला एक धूर्त है तो लोगन एक धूर्त है\"। नूह ने asserted किया: \"अगर जैक एक शूरवीर है तो आरिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक धूर्त है  \n(2) आरिया एक शूरवीर है  \n(3) मिया एक धूर्त है  \n(4) इसाबेला एक धूर्त है  \n(5) जैक एक शूरवीर है  \n(6) विक्टोरिया एक शूरवीर है  \n(7) एवलिन एक शूरवीर है  \n(8) नूह एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: लोगन, ऐडन, यूसुफ, डैनियल, अबिगेल, इसाबेला, लुकास, और आरिया। लोगन ने कहा, \"डैनियल धूर्त नहीं है\"। ऐडन ने नोट किया, \"अबिगेल धूर्त है यदि और केवल यदि लोगन धूर्त है\"। \"लोगन एक शूरवीर है और इसाबेला एक धूर्त है,\" यूसुफ ने घोषित किया। \"यदि आरिया एक शूरवीर है तो लोगन एक धूर्त है,\" डैनियल ने घोषित किया। अबिगेल को यह कहते हुए सुना गया, \"लोगन एक धूर्त है और लुकास एक धूर्त है\"। \"डैनियल एक शूरवीर है\" - इसाबेला। लुकास ने कहा, \"यूसुफ एक शूरवीर है\"। \"ऐडन एक धूर्त है और यूसुफ एक शूरवीर है,\" आरिया ने उल्लेख किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक शूरवीर है  \n(2) ऐडन एक धूर्त है  \n(3) यूसुफ एक धूर्त है  \n(4) डैनियल एक शूरवीर है  \n(5) अबिगेल एक धूर्त है  \n(6) इसाबेला एक शूरवीर है  \n(7) लुकास एक धूर्त है  \n(8) आरिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: इसाबेला, जैक, जैक्सन, ओवेन, नूह, ईथन, अमेलिया, और डेविड। इसाबेला के एक बयान में: \"जैक्सन एक शूरवीर है या जैक्सन एक धूर्त है\"। जैक ने कहा, \"नूह एक शूरवीर है\"। जैक्सन ने नोट किया, \"ओवेन एक शूरवीर है या इसाबेला एक शूरवीर है\"। ओवेन के शब्दों में: \"अगर ओवेन एक शूरवीर है तो अमेलिया एक धूर्त है\"। नूह ने आपको बताया कि अगर अमेलिया एक शूरवीर है तो ओवेन एक धूर्त है। ईथन के एक बयान में: \"अमेलिया एक धूर्त है और नूह एक शूरवीर है\"। अमेलिया के अनुसार, \"डेविड एक शूरवीर है और ईथन एक शूरवीर है\"। डेविड ने कहा कि अगर अमेलिया एक धूर्त है तो इसाबेला एक धूर्त है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) इसाबेला एक शूरवीर है  \n(2) जैक एक शूरवीर है  \n(3) जैक्सन एक शूरवीर है  \n(4) ओवेन एक शूरवीर है  \n(5) नूह एक शूरवीर है  \n(6) ईथन एक शूरवीर है  \n(7) अमेलिया एक धूर्त है  \n(8) डेविड एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: जेम्स, बेंजामिन, नूह, एलिज़ाबेथ, एवरी, ऐडन, पेनलोप, और जैक्सन। जेम्स ने कहा कि नूह एक धूर्त है। बेंजामिन ने कहा कि जेम्स एक शूरवीर है। नूह ने कहा, \"जैक्सन एक धूर्त है और एवरी एक शूरवीर है\"। एलिज़ाबेथ ने कहा कि पेनलोप एक शूरवीर है। एवरी ने कहा, \"एवरी एक शूरवीर है या जेम्स एक शूरवीर है\"। ऐडन को यह कहते हुए सुना गया, \"बेंजामिन एक धूर्त है या नूह एक धूर्त है\"। पेनलोप के अनुसार, \"ऐडन एक शूरवीर नहीं है\"। जैक्सन के एक बयान में: \"नूह एक शूरवीर है या नूह एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) बेंजामिन एक शूरवीर है  \n(3) नूह एक धूर्त है  \n(4) एलिज़ाबेथ एक धूर्त है  \n(5) एवरी एक शूरवीर है  \n(6) ऐडन एक शूरवीर है  \n(7) पेनलोप एक धूर्त है  \n(8) जैक्सन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: विक्टोरिया, जैक्सन, मेसन, एवरी, डैनियल, एम्मा, इसाबेला, और अमेलिया। विक्टोरिया ने कहा, \"एम्मा एक शूरवीर है\"। जैक्सन ने कहा, \"डैनियल एक धूर्त है या इसाबेला एक शूरवीर है\"। मेसन ने कहा कि अगर अमेलिया एक धूर्त है तो डैनियल एक शूरवीर है। एवरी ने कहा कि अगर इसाबेला एक शूरवीर है तो जैक्सन एक धूर्त है। डैनियल को यह कहते हुए सुना गया, \"इसाबेला एक धूर्त है\"। एम्मा ने आपको बताया कि अगर मेसन एक शूरवीर है तो इसाबेला एक धूर्त है। इसाबेला के अनुसार, \"अगर एम्मा एक धूर्त है तो एवरी एक शूरवीर है\"। अमेलिया ने कहा, \"एवरी एक शूरवीर है या डैनियल एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विक्टोरिया एक शूरवीर है  \n(2) जैक्सन एक शूरवीर है  \n(3) मेसन एक धूर्त है  \n(4) एवरी एक धूर्त है  \n(5) डैनियल एक धूर्त है  \n(6) एम्मा एक शूरवीर है  \n(7) इसाबेला एक शूरवीर है  \n(8) अमेलिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: इसाबेला, क्लोई, विक्टोरिया, बेंजामिन, माइकल, अलेक्जेंडर, एमिली, और सोफिया। इसाबेला ने कहा, \"माइकल एक शूरवीर है यदि और केवल यदि माइकल एक धूर्त है\"। क्लोई ने कहा, \"बेंजामिन एक धूर्त है या माइकल एक शूरवीर है\"। विक्टोरिया ने कहा कि यदि बेंजामिन एक शूरवीर है तो माइकल एक शूरवीर है। बेंजामिन ने कहा, \"विक्टोरिया एक शूरवीर नहीं है।\" \"यदि इसाबेला एक शूरवीर है तो अलेक्जेंडर एक शूरवीर है\" - माइकल। \"यदि सोफिया एक शूरवीर है तो इसाबेला एक शूरवीर है\" - अलेक्जेंडर। एमिली ने कहा: \"इसाबेला एक शूरवीर है यदि और केवल यदि विक्टोरिया एक शूरवीर है\"। सोफिया ने कहा, \"विक्टोरिया एक शूरवीर है यदि और केवल यदि इसाबेला एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक धूर्त है  \n(2) क्लोई एक शूरवीर है  \n(3) विक्टोरिया एक शूरवीर है  \n(4) बेंजामिन एक धूर्त है  \n(5) माइकल एक शूरवीर है  \n(6) अलेक्जेंडर एक धूर्त है  \n(7) एमिली एक धूर्त है  \n(8) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मेसन, ओलिविया, डेविड, ग्रेस, एला, इसाबेला, सोफिया, और ऐडन। मेसन ने कहा: \"डेविड धूर्त नहीं है\"। ओलिविया के शब्दों में: \"एला शूरवीर नहीं है\"। डेविड के अनुसार, \"डेविड शूरवीर है\"। ग्रेस ने कहा, \"इसाबेला शूरवीर है और ऐडन धूर्त है\"। एला के एक बयान में: \"इसाबेला शूरवीर है और सोफिया धूर्त है\"। इसाबेला ने आपको बताया कि अगर ओलिविया शूरवीर है तो सोफिया धूर्त है। सोफिया ने कहा, \"अगर मेसन शूरवीर है तो एला शूरवीर है\"। ऐडन के अनुसार, \"मेसन धूर्त है यदि और केवल यदि ग्रेस धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) ओलिविया एक शूरवीर है  \n(3) डेविड एक धूर्त है  \n(4) ग्रेस एक धूर्त है  \n(5) एला एक धूर्त है  \n(6) इसाबेला एक धूर्त है  \n(7) सोफिया एक शूरवीर है  \n(8) ऐडन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मेसन, अलेक्जेंडर, औरोरा, ओवेन, अबिगेल, सोफिया, एम्मा, और एवलिन। \"मेसन एक शूरवीर है,\" मेसन ने घोषणा की। अलेक्जेंडर ने asserted किया: \"ओवेन एक शूरवीर है या मेसन एक शूरवीर है\"। औरोरा के एक बयान में: \"अलेक्जेंडर एक शूरवीर है यदि और केवल यदि एम्मा एक धूर्त है\"। ओवेन के एक बयान में: \"मेसन एक धूर्त है और एवलिन एक शूरवीर है\"। \"मेसन एक शूरवीर है या एवलिन एक शूरवीर है,\" अबिगेल ने दावा किया। सोफिया को यह कहते हुए सुना गया, \"यदि औरोरा एक शूरवीर है तो मेसन एक धूर्त है\"। एम्मा के शब्दों में: \"ओवेन एक धूर्त है या औरोरा एक शूरवीर है\"। एवलिन ने asserted किया: \"यदि सोफिया एक धूर्त है तो अलेक्जेंडर एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक शूरवीर है  \n(2) अलेक्जेंडर एक शूरवीर है  \n(3) औरोरा एक धूर्त है  \n(4) ओवेन एक धूर्त है  \n(5) अबिगेल एक शूरवीर है  \n(6) सोफिया एक शूरवीर है  \n(7) एम्मा एक शूरवीर है  \n(8) एवलिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ल्यूक, लियम, स्कारलेट, सेबेस्टियन, जैक, सोफिया, एला, और यूसुफ। \"एला एक धूर्त है,\" ल्यूक ने दावा किया। लियम ने asserted किया: \"सेबेस्टियन एक शूरवीर है या एला एक शूरवीर है\"। स्कारलेट ने कहा कि यूसुफ एक धूर्त है यदि और केवल यदि एला एक शूरवीर है। सेबेस्टियन ने stated किया, \"जैक एक धूर्त है\"। जैक ने asserted किया: \"यूसुफ एक शूरवीर है या स्कारलेट एक धूर्त है\"। \"जैक एक शूरवीर है,\" सोफिया ने दावा किया। \"लियम एक शूरवीर है और स्कारलेट एक शूरवीर है,\" एला ने दावा किया। यूसुफ को यह कहते हुए सुना गया, \"जैक एक शूरवीर नहीं है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) लियम एक धूर्त है  \n(3) स्कारलेट एक धूर्त है  \n(4) सेबेस्टियन एक धूर्त है  \n(5) जैक एक शूरवीर है  \n(6) सोफिया एक शूरवीर है  \n(7) एला एक धूर्त है  \n(8) यूसुफ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ओलिविया, डैनियल, सैमुएल, जैक्सन, मेसन, ज़ोई, शार्लट, और जेम्स। ओलिविया ने कहा: \"अगर शार्लट एक धूर्त है तो सैमुएल एक शूरवीर है\"। डैनियल ने कहा, \"जैक्सन एक धूर्त है\"। सैमुएल ने कहा: \"ज़ोई एक धूर्त है या मेसन एक धूर्त है\"। जैक्सन के अनुसार, \"ओलिविया एक धूर्त है\"। मेसन ने कहा, \"जेम्स एक शूरवीर है यदि और केवल यदि मेसन एक शूरवीर है।\" ज़ोई ने आपको बताया कि मेसन एक धूर्त नहीं है। शार्लट ने कहा: \"सैमुएल एक शूरवीर है या ओलिविया एक शूरवीर है\"। जेम्स ने कहा, \"जैक्सन एक धूर्त है और सैमुएल एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक शूरवीर है  \n(2) डैनियल एक शूरवीर है  \n(3) सैमुएल एक शूरवीर है  \n(4) जैक्सन एक धूर्त है  \n(5) मेसन एक धूर्त है  \n(6) ज़ोई एक धूर्त है  \n(7) शार्लट एक शूरवीर है  \n(8) जेम्स एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: राइली, लोगन, बेंजामिन, पेनलोप, हार्पर, आरिया, हेनरी, और ओलिविया। राइली ने आपको बताया कि पेनलोप एक धूर्त है। लोगन ने कहा, \"अगर हार्पर एक धूर्त है तो बेंजामिन एक धूर्त है\"। \"ओलिविया एक धूर्त है\" - बेंजामिन। पेनलोप ने आपको बताया कि अगर हार्पर एक शूरवीर है तो हेनरी एक धूर्त है। हार्पर ने कहा, \"अगर बेंजामिन एक शूरवीर है तो पेनलोप एक धूर्त है\"। आरिया के शब्दों में: \"हार्पर एक शूरवीर है यदि और केवल यदि बेंजामिन एक धूर्त है\"। हेनरी के शब्दों में: \"आरिया एक धूर्त है यदि और केवल यदि राइली एक धूर्त है\"। ओलिविया के शब्दों में: \"हेनरी एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक धूर्त है  \n(2) लोगन एक शूरवीर है  \n(3) बेंजामिन एक धूर्त है  \n(4) पेनलोप एक शूरवीर है  \n(5) हार्पर एक शूरवीर है  \n(6) आरिया एक शूरवीर है  \n(7) हेनरी एक धूर्त है  \n(8) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: राइली, विलियम, बेंजामिन, इसाबेला, ज़ोई, लिली, मेसन, और ईथन। \"अगर लिली एक धूर्त है तो ज़ोई एक धूर्त है\" - राइली। विलियम ने कहा कि बेंजामिन एक धूर्त नहीं है। बेंजामिन ने कहा कि अगर ज़ोई एक शूरवीर है तो विलियम एक शूरवीर है। इसाबेला ने कहा, \"विलियम एक धूर्त नहीं है\"। ज़ोई ने कहा, \"बेंजामिन एक शूरवीर है या विलियम एक शूरवीर है\"। लिली ने कहा कि मेसन एक शूरवीर है या राइली एक शूरवीर है। \"ज़ोई एक धूर्त है या राइली एक धूर्त है,\" मेसन ने कहा। ईथन ने कहा, \"मेसन एक शूरवीर है और ज़ोई एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) राइली एक शूरवीर है  \n(2) विलियम एक शूरवीर है  \n(3) बेंजामिन एक शूरवीर है  \n(4) इसाबेला एक शूरवीर है  \n(5) ज़ोई एक शूरवीर है  \n(6) लिली एक शूरवीर है  \n(7) मेसन एक धूर्त है  \n(8) ईथन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: लियम, माइकल, इसाबेला, शार्लट, औरोरा, हार्पर, मैथ्यू, और मेसन। लियम ने टिप्पणी की, \"इसाबेला एक शूरवीर है\"। माइकल ने कहा, \"इसाबेला एक शूरवीर है।\" इसाबेला ने आपको बताया कि माइकल एक धूर्त है यदि और केवल यदि माइकल एक शूरवीर है। शार्लट ने कहा, \"मेसेन एक धूर्त नहीं है।\" औरोरा ने remarked किया, \"हार्पर एक धूर्त है यदि और केवल यदि माइकल एक धूर्त है\"। हार्पर के शब्दों में: \"मेसेन एक धूर्त है यदि और केवल यदि मैथ्यू एक शूरवीर है\"। मैथ्यू ने remarked किया, \"शार्लट एक धूर्त है और माइकल एक धूर्त है\"। मेसन ने व्यक्त किया कि माइकल एक शूरवीर है यदि और केवल यदि औरोरा एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक धूर्त है  \n(2) माइकल एक धूर्त है  \n(3) इसाबेला एक धूर्त है  \n(4) शार्लट एक शूरवीर है  \n(5) औरोरा एक धूर्त है  \n(6) हार्पर एक शूरवीर है  \n(7) मैथ्यू एक धूर्त है  \n(8) मेसन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ज़ोई, एम्मा, सोफिया, औरोरा, हेनरी, नूह, जैक, और अबिगेल। ज़ोई ने कहा कि औरोरा एक शूरवीर है और सोफिया एक धूर्त है। एम्मा को यह कहते हुए सुना गया, \"ज़ोई एक धूर्त नहीं है\"। सोफिया ने कहा, \"अगर ज़ोई एक शूरवीर है तो सोफिया एक शूरवीर है\"। औरोरा ने कहा: \"अबिगेल एक शूरवीर है\"। हेनरी के शब्दों में: \"अगर अबिगेल एक शूरवीर है तो ज़ोई एक धूर्त है\"। नूह ने कहा: \"अगर औरोरा एक धूर्त है तो सोफिया एक शूरवीर है\"। जैक के अनुसार, \"एम्मा एक धूर्त नहीं है\"। अबिगेल के अनुसार, \"नूह एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ज़ोई एक धूर्त है  \n(2) एम्मा एक धूर्त है  \n(3) सोफिया एक शूरवीर है  \n(4) औरोरा एक धूर्त है  \n(5) हेनरी एक शूरवीर है  \n(6) नूह एक शूरवीर है  \n(7) जैक एक धूर्त है  \n(8) अबिगेल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ओवेन, सैमुएल, ओलिवर, जेम्स, इसाबेला, अमेलिया, विक्टोरिया, और आरिया। ओवेन ने टिप्पणी की, \"इसाबेला धूर्त नहीं है\"। सैमुएल ने कहा कि अगर इसाबेला धूर्त है तो विक्टोरिया शूरवीर है। ओलिवर ने आपको बताया कि आरिया धूर्त है। जेम्स ने कहा कि इसाबेला शूरवीर है यदि और केवल यदि आरिया शूरवीर है। इसाबेला के शब्दों में: \"विक्टोरिया शूरवीर है या अमेलिया धूर्त है\"। \"विक्टोरिया धूर्त है या सैमुएल धूर्त है\" - अमेलिया। जैसे विक्टोरिया ने कहा, \"अमेलिया धूर्त है यदि और केवल यदि अमेलिया शूरवीर है\"। आरिया ने कहा कि जेम्स शूरवीर है यदि और केवल यदि आरिया शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओवेन एक धूर्त है  \n(2) सैमुएल एक धूर्त है  \n(3) ओलिवर एक शूरवीर है  \n(4) जेम्स एक शूरवीर है  \n(5) इसाबेला एक धूर्त है  \n(6) अमेलिया एक शूरवीर है  \n(7) विक्टोरिया एक धूर्त है  \n(8) आरिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एवरी, सोफिया, राइली, ऐडन, ओलिवर, एमिली, विक्टोरिया, और माइकल। एवरी ने कहा कि अगर विक्टोरिया एक शूरवीर है तो सोफिया एक धूर्त है। सोफिया ने कहा कि ऐडन एक शूरवीर है यदि और केवल यदि ओलिवर एक धूर्त है। राइली के एक बयान में: \"एमिली एक धूर्त नहीं है\"। ऐडन ने कहा, \"माइकल एक धूर्त है या राइली एक शूरवीर है\"। ओलिवर ने कहा, \"एवरी एक शूरवीर है या राइली एक धूर्त है\"। एमिली ने कहा, \"विक्टोरिया एक शूरवीर है या राइली एक शूरवीर है\"। विक्टोरिया को यह कहते हुए सुना गया, \"ओलिवर एक शूरवीर है या एवरी एक शूरवीर है\"। माइकल ने कहा कि एवरी एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एवरी एक शूरवीर है  \n(2) सोफिया एक धूर्त है  \n(3) राइली एक शूरवीर है  \n(4) ऐडन एक शूरवीर है  \n(5) ओलिवर एक शूरवीर है  \n(6) एमिली एक शूरवीर है  \n(7) विक्टोरिया एक शूरवीर है  \n(8) माइकल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: बेंजामिन, ग्रेस, ईथन, एलिज़ाबेथ, औरोरा, हेनरी, स्कारलेट, और लिली। \"अगर ईथन एक धूर्त है तो ईथन एक शूरवीर है\" - बेंजामिन। ग्रेस ने कहा कि हेनरी एक धूर्त है यदि और केवल यदि लिली एक धूर्त है। \"एलिज़ाबेथ एक धूर्त नहीं है,\" ईथन ने कहा। एलिज़ाबेथ ने कहा: \"बेंजामिन एक शूरवीर है या स्कारलेट एक धूर्त है\"। \"बेंजामिन एक धूर्त है\" - औरोरा। हेनरी के अनुसार, \"एलिज़ाबेथ एक शूरवीर है\"। स्कारलेट के शब्दों में: \"ईथन एक शूरवीर है\"। \"हेनरी एक धूर्त नहीं है,\" लिली ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक शूरवीर है  \n(2) ग्रेस एक शूरवीर है  \n(3) ईथन एक शूरवीर है  \n(4) एलिज़ाबेथ एक शूरवीर है  \n(5) औरोरा एक धूर्त है  \n(6) हेनरी एक शूरवीर है  \n(7) स्कारलेट एक शूरवीर है  \n(8) लिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: पेनलोप, लियम, अमेलिया, अबिगेल, ओलिविया, एमिली, मिया, और लोगन। पेनलोप ने कहा, \"ओलिविया एक धूर्त नहीं है।\" लियम ने asserted किया: \"ओलिविया एक धूर्त है।\" \"अबिगेल एक शूरवीर है और लियम एक शूरवीर है,\" अमेलिया ने उल्लेख किया। अबिगेल के अनुसार, \"लियम एक धूर्त है।\" ओलिविया ने टिप्पणी की, \"लोगन एक धूर्त नहीं है।\" \"अमेलिया एक शूरवीर है और मिया एक शूरवीर है,\" एमिली ने घोषित किया। मिया ने टिप्पणी की, \"अगर अबिगेल एक धूर्त है तो लियम एक धूर्त है।\" लोगन ने आपको बताया कि अमेलिया एक शूरवीर नहीं है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक शूरवीर है  \n(2) लियम एक धूर्त है  \n(3) अमेलिया एक धूर्त है  \n(4) अबिगेल एक शूरवीर है  \n(5) ओलिविया एक शूरवीर है  \n(6) एमिली एक धूर्त है  \n(7) मिया एक शूरवीर है  \n(8) लोगन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: जेम्स, मेसन, नूह, जैक्सन, जैक, एला, लिली, और औरोरा। \"अगर लिली एक शूरवीर है तो जैक्सन एक शूरवीर है,\" जेम्स ने घोषणा की। \"जेम्स एक शूरवीर है\" - मेसन। नूह ने आपको बताया कि एला एक धूर्त नहीं है। जैक्सन ने कहा, \"अगर लिली एक शूरवीर है तो जैक एक धूर्त है\"। \"अगर नूह एक धूर्त है तो औरोरा एक धूर्त है\" - जैक। एला ने कहा, \"मेसन एक धूर्त है\"। \"एला एक धूर्त नहीं है\" - लिली। औरोरा ने नोट किया, \"अगर औरोरा एक शूरवीर है तो जैक्सन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक धूर्त है  \n(2) मेसन एक धूर्त है  \n(3) नूह एक शूरवीर है  \n(4) जैक्सन एक धूर्त है  \n(5) जैक एक शूरवीर है  \n(6) एला एक शूरवीर है  \n(7) लिली एक शूरवीर है  \n(8) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: जेम्स, विलियम, लुकास, डेविड, बेंजामिन, एलिज़ाबेथ, डैनियल, और लियम। जेम्स के एक बयान में: \"डैनियल एक शूरवीर है यदि और केवल यदि डैनियल एक धूर्त है\"। विलियम ने कहा कि डैनियल एक शूरवीर है यदि और केवल यदि बेंजामिन एक शूरवीर है। लुकास ने कहा, \"लुकास एक शूरवीर है और एलिज़ाबेथ एक धूर्त है\"। डेविड ने कहा: \"जेम्स एक धूर्त नहीं है\"। बेंजामिन ने कहा, \"जेम्स एक धूर्त है\"। एलिज़ाबेथ ने नोट किया, \"यदि डेविड एक धूर्त है तो जेम्स एक धूर्त है\"। डैनियल ने आपको बताया कि यदि लुकास एक शूरवीर है तो विलियम एक धूर्त है। लियम ने कहा: \"डेविड एक शूरवीर है या एलिज़ाबेथ एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक धूर्त है  \n(2) विलियम एक शूरवीर है  \n(3) लुकास एक धूर्त है  \n(4) डेविड एक धूर्त है  \n(5) बेंजामिन एक शूरवीर है  \n(6) एलिज़ाबेथ एक शूरवीर है  \n(7) डैनियल एक शूरवीर है  \n(8) लियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: जैक्सन, यूसुफ, मैथ्यू, नूह, औरोरा, शार्लट, डेविड, और याकूब। जैक्सन ने कहा कि डेविड शूरवीर नहीं है। यूसुफ के शब्दों में: \"अगर नूह शूरवीर है तो डेविड शूरवीर है\"। मैथ्यू के शब्दों में: \"नूह धूर्त है यदि और केवल यदि नूह शूरवीर है\"। नूह ने कहा, \"अगर शार्लट शूरवीर है तो जैक्सन शूरवीर है\"। औरोरा ने कहा कि जैक्सन शूरवीर नहीं है। शार्लट ने कहा, \"याकूब धूर्त है और डेविड शूरवीर है\"। डेविड के शब्दों में: \"नूह धूर्त है या मैथ्यू शूरवीर है\"। याकूब ने नोट किया, \"शार्लट शूरवीर है और डेविड शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) जैक्सन एक शूरवीर है  \n(2) यूसुफ एक धूर्त है  \n(3) मैथ्यू एक धूर्त है  \n(4) नूह एक शूरवीर है  \n(5) औरोरा एक धूर्त है  \n(6) शार्लट एक धूर्त है  \n(7) डेविड एक धूर्त है  \n(8) याकूब एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त निवास करते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एमिली, शार्लट, एम्मा, नूह, यूसुफ, लुकास, स्कारलेट, और जैक। एमिली ने कहा कि स्कारलेट एक शूरवीर है या जैक एक शूरवीर है। शार्लट ने कहा, \"एम्मा एक शूरवीर है।\" एम्मा ने कहा कि अगर एम्मा एक शूरवीर है तो नूह एक धूर्त है। \"शार्लट एक शूरवीर है यदि और केवल यदि लुकास एक धूर्त है,\" नूह ने घोषणा की। यूसुफ ने कहा, \"एमिली एक शूरवीर है या जैक एक धूर्त है।\" लुकास के शब्दों में: \"एमिली एक शूरवीर है।\" \"लुकास एक शूरवीर है या लुकास एक धूर्त है,\" स्कारलेट ने दावा किया। जैक के एक बयान में: \"नूह एक शूरवीर नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक शूरवीर है  \n(2) शार्लट एक शूरवीर है  \n(3) एम्मा एक शूरवीर है  \n(4) नूह एक धूर्त है  \n(5) यूसुफ एक शूरवीर है  \n(6) लुकास एक शूरवीर है  \n(7) स्कारलेट एक शूरवीर है  \n(8) जैक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: जैक, शार्लट, ओलिवर, ल्यूक, माइकल, लोगन, ऐडन, और अलेक्जेंडर। जैक के अनुसार, \"अलेक्जेंडर शूरवीर नहीं है\"। शार्लट ने कहा, \"ओलिवर शूरवीर है\"। ओलिवर ने नोट किया, \"ऐडन धूर्त है और लोगन धूर्त है\"। ल्यूक के शब्दों में: \"माइकल शूरवीर नहीं है\"। माइकल ने कहा, \"लोगन धूर्त है या शार्लट धूर्त है\"। लोगन के एक बयान में: \"ऐडन धूर्त नहीं है\"। ऐडन ने asserted किया: \"लोगन शूरवीर है यदि और केवल यदि शार्लट धूर्त है\"। अलेक्जेंडर ने remarked किया, \"ओलिवर शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक एक धूर्त है  \n(2) शार्लट एक धूर्त है  \n(3) ओलिवर एक धूर्त है  \n(4) ल्यूक एक धूर्त है  \n(5) माइकल एक शूरवीर है  \n(6) लोगन एक शूरवीर है  \n(7) ऐडन एक शूरवीर है  \n(8) अलेक्जेंडर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ईथन, आरिया, जेम्स, याकूब, लुकास, ल्यूक, स्कारलेट, और इसाबेला। ईथन के अनुसार, \"लुकास एक धूर्त है\"। \"इसाबेला एक धूर्त है और ल्यूक एक शूरवीर है\" - आरिया। जेम्स ने कहा कि इसाबेला एक शूरवीर है। याकूब के अनुसार, \"अगर आरिया एक शूरवीर है तो जेम्स एक शूरवीर है\"। लुकास ने कहा, \"इसाबेला एक धूर्त है\"। \"ईथन एक शूरवीर है या स्कारलेट एक धूर्त है\" - ल्यूक। स्कारलेट ने कहा: \"आरिया एक शूरवीर है\"। \"याकूब एक शूरवीर है या ल्यूक एक शूरवीर है,\" इसाबेला ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक शूरवीर है  \n(2) आरिया एक धूर्त है  \n(3) जेम्स एक शूरवीर है  \n(4) याकूब एक शूरवीर है  \n(5) लुकास एक धूर्त है  \n(6) ल्यूक एक शूरवीर है  \n(7) स्कारलेट एक धूर्त है  \n(8) इसाबेला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: जेम्स, ऐडन, ईथन, शार्लट, आरिया, मैथ्यू, एलिज़ाबेथ, और हेनरी। जेम्स ने कहा, \"एलिज़ाबेथ एक शूरवीर नहीं है\"। ऐडन ने कहा, \"मैथ्यू एक धूर्त है या मैथ्यू एक शूरवीर है\"। ईथन के एक बयान में: \"यदि एलिज़ाबेथ एक शूरवीर है तो मैथ्यू एक शूरवीर है\"। शार्लट ने टिप्पणी की, \"यदि ऐडन एक धूर्त है तो मैथ्यू एक धूर्त है\"। आरिया ने कहा कि जेम्स एक शूरवीर है। मैथ्यू ने कहा कि जेम्स एक शूरवीर है या हेनरी एक धूर्त है। \"मैथ्यू एक धूर्त है और ईथन एक शूरवीर है\" - एलिज़ाबेथ। \"यदि आरिया एक धूर्त है तो जेम्स एक धूर्त है,\" हेनरी ने घोषणा की। तो कौन एक शूरवीर है और कौन एक धूर्त है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) ऐडन एक शूरवीर है  \n(3) ईथन एक शूरवीर है  \n(4) शार्लट एक शूरवीर है  \n(5) आरिया एक शूरवीर है  \n(6) मैथ्यू एक शूरवीर है  \n(7) एलिज़ाबेथ एक धूर्त है  \n(8) हेनरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मैथ्यू, राइली, नूह, आरिया, विक्टोरिया, लिली, जेम्स, और इसाबेला। \"राइली धूर्त नहीं है,\" मैथ्यू ने घोषणा की। \"अगर राइली शूरवीर है तो लिली धूर्त है,\" राइली ने घोषणा की। \"अगर आरिया धूर्त है तो राइली शूरवीर है,\" नूह ने घोषणा की। आरिया ने कहा कि अगर मैथ्यू शूरवीर है तो राइली धूर्त है। विक्टोरिया के अनुसार, \"मैथ्यू धूर्त है या इसाबेला शूरवीर है\"। \"नूह शूरवीर नहीं है,\" लिली ने कहा। \"नूह धूर्त नहीं है,\" जेम्स ने घोषणा की। \"आरिया धूर्त है और राइली धूर्त है,\" इसाबेला ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक शूरवीर है  \n(2) राइली एक शूरवीर है  \n(3) नूह एक शूरवीर है  \n(4) आरिया एक धूर्त है  \n(5) विक्टोरिया एक धूर्त है  \n(6) लिली एक धूर्त है  \n(7) जेम्स एक शूरवीर है  \n(8) इसाबेला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एलिज़ाबेथ, लिली, अमेलिया, मेसन, शार्लट, हेनरी, एम्मा, और जैक्सन। एलिज़ाबेथ ने कहा: \"हेनरी एक धूर्त है\"। \"शार्लट एक धूर्त है या एलिज़ाबेथ एक धूर्त है,\" लिली ने कहा। अमेलिया ने कहा: \"मेसन एक शूरवीर है या शार्लट एक धूर्त है\"। मेसन ने कहा, \"अगर हेनरी एक धूर्त है तो अमेलिया एक शूरवीर है\"। शार्लट ने आपको बताया कि एम्मा एक शूरवीर नहीं है। हेनरी ने कहा, \"एलिज़ाबेथ एक शूरवीर है या एम्मा एक शूरवीर है\"। एम्मा ने कहा, \"लिली एक धूर्त है या अमेलिया एक शूरवीर है।\" \"मेसन एक धूर्त नहीं है\" - जैक्सन। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक धूर्त है  \n(2) लिली एक शूरवीर है  \n(3) अमेलिया एक शूरवीर है  \n(4) मेसन एक शूरवीर है  \n(5) शार्लट एक धूर्त है  \n(6) हेनरी एक शूरवीर है  \n(7) एम्मा एक शूरवीर है  \n(8) जैक्सन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मिया, एलिज़ाबेथ, बेंजामिन, ज़ोई, ल्यूक, क्लोई, लुकास, और हार्पर। \"अगर एलिज़ाबेथ एक धूर्त है तो ज़ोई एक शूरवीर है\" - मिया। \"अगर ज़ोई एक शूरवीर है तो हार्पर एक शूरवीर है,\" एलिज़ाबेथ ने दावा किया। बेंजामिन के एक बयान में: \"अगर एलिज़ाबेथ एक धूर्त है तो क्लोई एक शूरवीर है\"। ज़ोई ने कहा: \"हार्पर एक शूरवीर है या ज़ोई एक शूरवीर है\"। ल्यूक ने कहा, \"एलिज़ाबेथ एक शूरवीर है\"। \"अगर मिया एक शूरवीर है तो ज़ोई एक शूरवीर है,\" क्लोई ने दावा किया। लुकास ने कहा, \"क्लोई एक शूरवीर है या ज़ोई एक धूर्त है\"। \"मिया एक शूरवीर है,\" हार्पर ने उल्लेख किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक शूरवीर है  \n(2) एलिज़ाबेथ एक शूरवीर है  \n(3) बेंजामिन एक शूरवीर है  \n(4) ज़ोई एक शूरवीर है  \n(5) ल्यूक एक शूरवीर है  \n(6) क्लोई एक शूरवीर है  \n(7) लुकास एक शूरवीर है  \n(8) हार्पर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मेसन, जैक, माइकल, लिली, शार्लट, सेबेस्टियन, नूह, और यूसुफ। जैसे मेसन ने कहा, \"माइकल एक धूर्त है यदि और केवल यदि सेबेस्टियन एक धूर्त है\"। जैक के शब्दों में: \"नूह एक धूर्त है और मेसन एक शूरवीर है\"। माइकल के एक बयान में: \"लिली एक धूर्त है यदि और केवल यदि लिली एक शूरवीर है\"। लिली ने कहा, \"मेसन एक धूर्त नहीं है\"। शार्लट ने कहा, \"जैक एक शूरवीर है या लिली एक शूरवीर है\"। सेबेस्टियन ने कहा कि नूह एक धूर्त है यदि और केवल यदि माइकल एक शूरवीर है। नूह ने कहा, \"शार्लट एक शूरवीर है यदि और केवल यदि मेसन एक शूरवीर है\"। यूसुफ ने कहा कि मेसन एक धूर्त है या शार्लट एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) जैक एक धूर्त है  \n(3) माइकल एक धूर्त है  \n(4) लिली एक धूर्त है  \n(5) शार्लट एक धूर्त है  \n(6) सेबेस्टियन एक शूरवीर है  \n(7) नूह एक शूरवीर है  \n(8) यूसुफ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: सोफिया, एम्मा, जेम्स, अमेलिया, ओलिवर, आरिया, स्कारलेट, और एला। सोफिया ने कहा, \"अगर एला एक शूरवीर है तो एम्मा एक शूरवीर है।\" एम्मा ने कहा, \"सोफिया एक धूर्त है यदि और केवल यदि जेम्स एक शूरवीर है।\" जेम्स ने asserted किया: \"आरिया एक शूरवीर नहीं है।\" जैसा कि अमेलिया ने कहा, \"स्कारलेट एक शूरवीर है यदि और केवल यदि ओलिवर एक शूरवीर है।\" ओलिवर ने आपको बताया कि स्कारलेट एक धूर्त है यदि और केवल यदि एम्मा एक धूर्त है। आरिया ने आपको बताया कि सोफिया एक शूरवीर है। स्कारलेट के एक बयान में: \"आरिया एक शूरवीर है और जेम्स एक शूरवीर है।\" \"अगर एम्मा एक धूर्त है तो स्कारलेट एक शूरवीर है,\" एला ने दावा किया। तो कौन एक शूरवीर है और कौन एक धूर्त है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) एम्मा एक शूरवीर है  \n(3) जेम्स एक धूर्त है  \n(4) अमेलिया एक शूरवीर है  \n(5) ओलिवर एक धूर्त है  \n(6) आरिया एक शूरवीर है  \n(7) स्कारलेट एक धूर्त है  \n(8) एला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: अबिगेल, ल्यूक, एवरी, एमिली, लुकास, अलेक्जेंडर, ओलिवर, और सेबेस्टियन। अबिगेल के एक बयान में: \"यदि एवरी एक शूरवीर है तो लुकास एक धूर्त है\"। ल्यूक ने कहा कि सेबेस्टियन एक धूर्त है या अबिगेल एक शूरवीर है। \"यदि अलेक्जेंडर एक धूर्त है तो ल्यूक एक धूर्त है\" - एवरी। एमिली के एक बयान में: \"लुकास एक धूर्त है और ल्यूक एक शूरवीर है\"। लुकास ने कहा, \"एवरी एक शूरवीर है और अलेक्जेंडर एक धूर्त है।\" अलेक्जेंडर ने आपको बताया कि ल्यूक एक शूरवीर है या सेबेस्टियन एक शूरवीर है। \"लुकास एक शूरवीर है और एमिली एक शूरवीर है\" - ओलिवर। सेबेस्टियन के शब्दों में: \"अलेक्जेंडर एक शूरवीर है और ल्यूक एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) अबिगेल एक शूरवीर है  \n(2) ल्यूक एक शूरवीर है  \n(3) एवरी एक शूरवीर है  \n(4) एमिली एक शूरवीर है  \n(5) लुकास एक धूर्त है  \n(6) अलेक्जेंडर एक शूरवीर है  \n(7) ओलिवर एक धूर्त है  \n(8) सेबेस्टियन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त निवास करते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एवा, नूह, विलियम, सोफिया, ईथन, ल्यूक, पेनलोप, और ग्रेस। \"नूह एक धूर्त नहीं है,\" एवा ने घोषणा की। नूह ने कहा, \"पेनलोप एक धूर्त नहीं है।\" विलियम के एक बयान में: \"सोफिया एक शूरवीर है यदि और केवल यदि पेनलोप एक धूर्त है।\" सोफिया ने आपको बताया कि ल्यूक एक धूर्त नहीं है। \"सोफिया एक धूर्त है यदि और केवल यदि सोफिया एक शूरवीर है,\" ईथन ने दावा किया। ल्यूक के शब्दों में: \"एवा एक शूरवीर है या पेनलोप एक शूरवीर है।\" पेनलोप ने नोट किया, \"विलियम एक शूरवीर है और सोफिया एक शूरवीर है।\" ग्रेस ने आपको बताया कि पेनलोप एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक धूर्त है  \n(2) नूह एक धूर्त है  \n(3) विलियम एक धूर्त है  \n(4) सोफिया एक धूर्त है  \n(5) ईथन एक धूर्त है  \n(6) ल्यूक एक धूर्त है  \n(7) पेनलोप एक धूर्त है  \n(8) ग्रेस एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मैथ्यू, एवा, ज़ोई, ओलिविया, शार्लट, लियम, एला, और जेम्स। \"लियम एक धूर्त है,\" मैथ्यू ने दावा किया। एवा ने कहा कि ओलिविया एक धूर्त है यदि और केवल यदि लियम एक धूर्त है। ज़ोई ने कहा कि यदि मैथ्यू एक शूरवीर है तो लियम एक धूर्त है। ओलिविया ने कहा: \"जेम्स एक शूरवीर है यदि और केवल यदि जेम्स एक धूर्त है\"। शार्लट ने कहा, \"एवा एक शूरवीर है और एला एक शूरवीर है\"। लियम ने कहा कि शार्लट एक धूर्त है और ओलिविया एक शूरवीर है। जैसे एला ने कहा, \"जेम्स एक शूरवीर है और जेम्स एक धूर्त है\"। जेम्स ने कहा, \"एला एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक शूरवीर है  \n(2) एवा एक शूरवीर है  \n(3) ज़ोई एक शूरवीर है  \n(4) ओलिविया एक धूर्त है  \n(5) शार्लट एक धूर्त है  \n(6) लियम एक धूर्त है  \n(7) एला एक धूर्त है  \n(8) जेम्स एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: आरिया, डेविड, जैक, ओलिविया, लिली, एला, सोफिया, और पेनलोप। \"सोफिया एक धूर्त है यदि और केवल यदि लिली एक शूरवीर है,\" आरिया ने कहा। डेविड ने नोट किया, \"यदि लिली एक शूरवीर है तो लिली एक धूर्त है\"। \"पेनलोप एक शूरवीर है या पेनलोप एक धूर्त है,\" जैक ने दावा किया। ओलिविया के अनुसार, \"लिली एक शूरवीर है\"। लिली ने कहा, \"आरिया एक शूरवीर है\"। जैसे एला ने कहा, \"आरिया एक धूर्त नहीं है\"। सोफिया ने व्यक्त किया कि डेविड एक शूरवीर है या जैक एक धूर्त है। पेनलोप ने आपको बताया कि एला एक धूर्त है और आरिया एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) आरिया एक शूरवीर है  \n(2) डेविड एक धूर्त है  \n(3) जैक एक शूरवीर है  \n(4) ओलिविया एक शूरवीर है  \n(5) लिली एक शूरवीर है  \n(6) एला एक शूरवीर है  \n(7) सोफिया एक धूर्त है  \n(8) पेनलोप एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: सोफिया, बेंजामिन, मैथ्यू, जैक, एम्मा, आरिया, लोगन, और एवलिन। सोफिया के एक बयान में: \"अगर जैक एक शूरवीर है तो लोगन एक शूरवीर है\"। बेंजामिन ने कहा कि आरिया एक धूर्त है या एम्मा एक शूरवीर है। \"एम्मा एक धूर्त है यदि और केवल यदि सोफिया एक शूरवीर है\" - मैथ्यू। जैक ने आपको बताया कि एम्मा एक शूरवीर है। एम्मा ने कहा, \"लोगन एक धूर्त है या आरिया एक शूरवीर है\"। आरिया के शब्दों में: \"बेंजामिन एक धूर्त है\"। \"मैथ्यू एक धूर्त नहीं है,\" लोगन ने कहा। \"मैथ्यू एक धूर्त है या मैथ्यू एक शूरवीर है,\" एवलिन ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) बेंजामिन एक शूरवीर है  \n(3) मैथ्यू एक शूरवीर है  \n(4) जैक एक धूर्त है  \n(5) एम्मा एक धूर्त है  \n(6) आरिया एक धूर्त है  \n(7) लोगन एक शूरवीर है  \n(8) एवलिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: बेंजामिन, अलेक्जेंडर, क्लोई, एमिली, राइली, ईथन, मैथ्यू, और डैनियल। \"अगर ईथन एक शूरवीर है तो मैथ्यू एक धूर्त है,\" बेंजामिन ने कहा। अलेक्जेंडर के शब्दों में: \"एमिली एक धूर्त है यदि और केवल यदि डैनियल एक शूरवीर है\"। क्लोई ने कहा: \"बेंजामिन एक शूरवीर है\"। एमिली ने कहा कि अगर राइली एक धूर्त है तो अलेक्जेंडर एक धूर्त है। राइली ने कहा, \"अलेक्जेंडर एक धूर्त है या ईथन एक धूर्त है।\" ईथन ने कहा कि अलेक्जेंडर एक शूरवीर नहीं है। मैथ्यू को यह कहते हुए सुना गया, \"डैनियल एक शूरवीर है यदि और केवल यदि मैथ्यू एक शूरवीर है\"। डैनियल ने कहा कि मैथ्यू एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक शूरवीर है  \n(2) अलेक्जेंडर एक धूर्त है  \n(3) क्लोई एक शूरवीर है  \n(4) एमिली एक शूरवीर है  \n(5) राइली एक शूरवीर है  \n(6) ईथन एक शूरवीर है  \n(7) मैथ्यू एक धूर्त है  \n(8) डैनियल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: विलियम, आरिया, अमेलिया, ओलिविया, शार्लट, विक्टोरिया, एवा, और राइली। विलियम ने कहा, \"आरिया एक धूर्त है या ओलिविया एक धूर्त है\"। आरिया ने कहा कि शार्लट एक शूरवीर है। \"ओलिविया एक शूरवीर है\" - अमेलिया। ओलिविया ने कहा, \"विलियम एक शूरवीर है और शार्लट एक धूर्त है।\" शार्लट ने कहा कि अमेलिया एक शूरवीर है यदि और केवल यदि ओलिविया एक धूर्त है। \"ओलिविया एक धूर्त है और विक्टोरिया एक शूरवीर है,\" विक्टोरिया ने घोषणा की। \"ओलिविया एक धूर्त है और आरिया एक धूर्त है,\" एवा ने घोषणा की। राइली ने टिप्पणी की, \"विलियम एक शूरवीर है और अमेलिया एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) आरिया एक धूर्त है  \n(3) अमेलिया एक शूरवीर है  \n(4) ओलिविया एक शूरवीर है  \n(5) शार्लट एक धूर्त है  \n(6) विक्टोरिया एक धूर्त है  \n(7) एवा एक धूर्त है  \n(8) राइली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: विलियम, आरिया, डैनियल, हार्पर, ग्रेस, लुकास, एमिली, और जेम्स। \"अगर आरिया एक शूरवीर है तो लुकास एक धूर्त है,\" विलियम ने घोषणा की। \"लुकास एक धूर्त है या ग्रेस एक शूरवीर है,\" आरिया ने घोषणा की। डैनियल ने कहा, \"हार्पर एक शूरवीर है यदि और केवल यदि लुकास एक धूर्त है।\" \"ग्रेस एक धूर्त है या ग्रेस एक शूरवीर है,\" हार्पर ने उल्लेख किया। ग्रेस ने कहा, \"आरिया एक शूरवीर है या लुकास एक शूरवीर है।\" लुकास ने टिप्पणी की, \"अगर डैनियल एक शूरवीर है तो ग्रेस एक शूरवीर है।\" एमिली ने आपको बताया कि विलियम एक धूर्त है यदि और केवल यदि ग्रेस एक धूर्त है। जेम्स ने asserted किया: \"आरिया एक शूरवीर है और डैनियल एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक धूर्त है  \n(2) आरिया एक शूरवीर है  \n(3) डैनियल एक धूर्त है  \n(4) हार्पर एक शूरवीर है  \n(5) ग्रेस एक शूरवीर है  \n(6) लुकास एक शूरवीर है  \n(7) एमिली एक धूर्त है  \n(8) जेम्स एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ज़ोई, याकूब, जैक, राइली, माइकल, ल्यूक, लियम, और पेनलोप। ज़ोई ने कहा, \"पेनलोप एक धूर्त है या राइली एक शूरवीर है।\" याकूब के अनुसार, \"पेनलोप एक धूर्त है और लियम एक शूरवीर है।\" जैक ने आपको बताया कि याकूब एक धूर्त नहीं है। राइली ने कहा कि माइकल एक शूरवीर है। माइकल ने कहा, \"पेनलोप एक धूर्त है और लियम एक शूरवीर है।\" ल्यूक के अनुसार, \"राइली एक शूरवीर है यदि और केवल यदि लियम एक शूरवीर है।\" लियम के एक बयान में: \"ज़ोई एक शूरवीर नहीं है।\" पेनलोप के अनुसार, \"याकूब एक शूरवीर है और पेनलोप एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ज़ोई एक शूरवीर है  \n(2) याकूब एक धूर्त है  \n(3) जैक एक धूर्त है  \n(4) राइली एक धूर्त है  \n(5) माइकल एक धूर्त है  \n(6) ल्यूक एक शूरवीर है  \n(7) लियम एक धूर्त है  \n(8) पेनलोप एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: हेनरी, याकूब, मिया, लोगन, बेंजामिन, एमिली, औरोरा, और सोफिया। \"मिया एक शूरवीर है या सोफिया एक धूर्त है,\" हेनरी ने घोषणा की। \"मिया एक शूरवीर है या औरोरा एक धूर्त है,\" याकूब ने उल्लेख किया। मिया ने कहा, \"अगर हेनरी एक धूर्त है तो लोगन एक शूरवीर है।\" लोगन के एक बयान में: \"अगर हेनरी एक धूर्त है तो हेनरी एक शूरवीर है।\" बेंजामिन ने नोट किया, \"अगर बेंजामिन एक शूरवीर है तो सोफिया एक धूर्त है।\" \"औरोरा एक धूर्त है,\" एमिली ने घोषणा की। \"बेंजामिन एक धूर्त है और हेनरी एक धूर्त है,\" औरोरा ने उल्लेख किया। सोफिया ने कहा, \"एमिली एक धूर्त है यदि और केवल यदि बेंजामिन एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हेनरी एक शूरवीर है  \n(2) याकूब एक शूरवीर है  \n(3) मिया एक शूरवीर है  \n(4) लोगन एक शूरवीर है  \n(5) बेंजामिन एक शूरवीर है  \n(6) एमिली एक शूरवीर है  \n(7) औरोरा एक धूर्त है  \n(8) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: याकूब, एलिज़ाबेथ, यूसुफ, हार्पर, सेबेस्टियन, अलेक्जेंडर, पेनलोप, और लुकास। \"सेबेस्टियन एक शूरवीर है या अलेक्जेंडर एक शूरवीर है,\" याकूब ने घोषणा की। एलिज़ाबेथ के अनुसार, \"हार्पर एक शूरवीर है यदि और केवल यदि पेनलोप एक धूर्त है\"। यूसुफ ने कहा कि याकूब एक धूर्त है और याकूब एक शूरवीर है। \"यूसुफ एक शूरवीर है,\" हार्पर ने दावा किया। सेबेस्टियन के अनुसार, \"एलिज़ाबेथ एक धूर्त है यदि और केवल यदि सेबेस्टियन एक शूरवीर है\"। अलेक्जेंडर के शब्दों में: \"हार्पर एक शूरवीर है या याकूब एक धूर्त है\"। पेनलोप के एक बयान में: \"सेबेस्टियन एक शूरवीर नहीं है\"। लुकास ने कहा, \"अलेक्जेंडर एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) याकूब एक शूरवीर है  \n(2) एलिज़ाबेथ एक धूर्त है  \n(3) यूसुफ एक धूर्त है  \n(4) हार्पर एक धूर्त है  \n(5) सेबेस्टियन एक शूरवीर है  \n(6) अलेक्जेंडर एक धूर्त है  \n(7) पेनलोप एक धूर्त है  \n(8) लुकास एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: सोफिया, विलियम, बेंजामिन, जैक, याकूब, शार्लट, सैमुएल, और इसाबेला। सोफिया ने कहा: \"विलियम एक धूर्त है यदि और केवल यदि याकूब एक शूरवीर है\"। विलियम ने कहा, \"सैमुएल एक धूर्त है यदि और केवल यदि जैक एक शूरवीर है\"। \"विलियम एक धूर्त है,\" बेंजामिन ने कहा। जैक के शब्दों में: \"शार्लट एक धूर्त नहीं है\"। याकूब ने कहा, \"बेंजामिन एक शूरवीर है या शार्लट एक शूरवीर है।\" शार्लट को यह कहते हुए सुना गया, \"यदि विलियम एक धूर्त है तो जैक एक शूरवीर है\"। \"सोफिया एक शूरवीर है और शार्लट एक धूर्त है\" - सैमुएल। \"बेंजामिन एक शूरवीर है यदि और केवल यदि बेंजामिन एक धूर्त है,\" इसाबेला ने कहा। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) विलियम एक शूरवीर है  \n(3) बेंजामिन एक धूर्त है  \n(4) जैक एक शूरवीर है  \n(5) याकूब एक शूरवीर है  \n(6) शार्लट एक शूरवीर है  \n(7) सैमुएल एक धूर्त है  \n(8) इसाबेला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: बेंजामिन, राइली, विलियम, याकूब, मैथ्यू, डेविड, ल्यूक, और हार्पर। बेंजामिन ने आपको बताया कि याकूब एक धूर्त नहीं है। राइली ने कहा: \"राइली एक शूरवीर है या याकूब एक शूरवीर है\"। विलियम को यह कहते हुए सुना गया, \"बेंजामिन एक शूरवीर है यदि और केवल यदि डेविड एक शूरवीर है\"। याकूब के शब्दों में: \"यदि हार्पर एक धूर्त है तो बेंजामिन एक शूरवीर है\"। जैसे मैथ्यू ने कहा, \"ल्यूक एक शूरवीर है यदि और केवल यदि राइली एक धूर्त है\"। \"मैथ्यू एक धूर्त है और बेंजामिन एक धूर्त है,\" डेविड ने कहा। ल्यूक ने कहा: \"याकूब एक धूर्त है\"। \"मैथ्यू एक शूरवीर है या मैथ्यू एक धूर्त है\" - हार्पर। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक शूरवीर है  \n(2) राइली एक शूरवीर है  \n(3) विलियम एक धूर्त है  \n(4) याकूब एक शूरवीर है  \n(5) मैथ्यू एक शूरवीर है  \n(6) डेविड एक धूर्त है  \n(7) ल्यूक एक धूर्त है  \n(8) हार्पर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ईथन, विक्टोरिया, जैक, ओवेन, ज़ोई, स्कारलेट, याकूब, और लोगन। जैसे कि ईथन ने कहा, \"ज़ोई एक शूरवीर है और स्कारलेट एक शूरवीर है\"। विक्टोरिया ने कहा कि ज़ोई एक शूरवीर है और लोगन एक शूरवीर है। जैक ने कहा कि ज़ोई एक शूरवीर है। \"स्कारलेट एक शूरवीर है या याकूब एक शूरवीर है,\" ओवेन ने दावा किया। ज़ोई ने कहा कि अगर जैक एक शूरवीर है तो लोगन एक धूर्त है। \"ईथन एक धूर्त है यदि और केवल यदि याकूब एक शूरवीर है,\" स्कारलेट ने उल्लेख किया। याकूब ने कहा, \"स्कारलेट एक शूरवीर नहीं है।\" \"ईथन एक धूर्त है,\" लोगन ने घोषित किया। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ईथन एक शूरवीर है  \n(2) विक्टोरिया एक धूर्त है  \n(3) जैक एक शूरवीर है  \n(4) ओवेन एक शूरवीर है  \n(5) ज़ोई एक शूरवीर है  \n(6) स्कारलेट एक शूरवीर है  \n(7) याकूब एक धूर्त है  \n(8) लोगन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ईथन, क्लोई, एम्मा, ल्यूक, आरिया, पेनलोप, यूसुफ, और लुकास। ईथन ने कहा, \"क्लोई एक धूर्त है\"। क्लोई को यह कहते हुए सुना गया, \"पेनलोप एक धूर्त नहीं है\"। एम्मा के अनुसार, \"लुकास एक शूरवीर है या पेनलोप एक धूर्त है\"। \"आरिया एक शूरवीर है और पेनलोप एक शूरवीर है,\" ल्यूक ने कहा। आरिया के शब्दों में: \"क्लोई एक शूरवीर है या पेनलोप एक धूर्त है\"। \"लुकास एक धूर्त है,\" पेनलोप ने दावा किया। यूसुफ ने कहा कि एम्मा एक धूर्त है यदि और केवल यदि यूसुफ एक शूरवीर है। लुकास ने asserted किया: \"यूसुफ एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक धूर्त है  \n(2) क्लोई एक शूरवीर है  \n(3) एम्मा एक धूर्त है  \n(4) ल्यूक एक शूरवीर है  \n(5) आरिया एक शूरवीर है  \n(6) पेनलोप एक शूरवीर है  \n(7) यूसुफ एक धूर्त है  \n(8) लुकास एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ओलिवर, मेसन, हेनरी, इसाबेला, शार्लट, अलेक्जेंडर, लिली, और जैक्सन। ओलिवर के एक बयान में: \"अलेक्जेंडर एक धूर्त नहीं है\"। मेसन ने आपको बताया कि हेनरी एक शूरवीर है। हेनरी ने कहा, \"शार्लट एक धूर्त है या लिली एक धूर्त है।\" इसाबेला के अनुसार, \"अलेक्जेंडर एक धूर्त है\"। शार्लट ने कहा कि हेनरी एक धूर्त है यदि और केवल यदि लिली एक धूर्त है। अलेक्जेंडर के अनुसार, \"लिली एक धूर्त है\"। लिली के एक बयान में: \"इसाबेला एक शूरवीर है या अलेक्जेंडर एक धूर्त है\"। जैक्सन ने टिप्पणी की, \"शार्लट एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिवर एक शूरवीर है  \n(2) मेसन एक शूरवीर है  \n(3) हेनरी एक शूरवीर है  \n(4) इसाबेला एक धूर्त है  \n(5) शार्लट एक धूर्त है  \n(6) अलेक्जेंडर एक शूरवीर है  \n(7) लिली एक धूर्त है  \n(8) जैक्सन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: डेविड, एवा, डैनियल, सैमुएल, नूह, एमिली, सोफिया, और एलिज़ाबेथ। डेविड ने कहा, \"सोफिया एक धूर्त है या सोफिया एक शूरवीर है\"। \"डैनियल एक धूर्त है यदि और केवल यदि सैमुएल एक शूरवीर है,\" एवा ने कहा। डैनियल ने कहा कि सैमुएल एक धूर्त है या एवा एक धूर्त है। सैमुएल ने कहा, \"डेविड एक धूर्त है\"। नूह ने आपको बताया कि यदि डेविड एक शूरवीर है तो एमिली एक धूर्त है। एमिली ने कहा, \"सोफिया एक धूर्त नहीं है\"। \"सैमुएल एक धूर्त है यदि और केवल यदि डैनियल एक धूर्त है,\" सोफिया ने कहा। एलिज़ाबेथ को यह कहते हुए सुना गया, \"सैमुएल एक धूर्त है और एवा एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक शूरवीर है  \n(2) एवा एक शूरवीर है  \n(3) डैनियल एक शूरवीर है  \n(4) सैमुएल एक धूर्त है  \n(5) नूह एक शूरवीर है  \n(6) एमिली एक धूर्त है  \n(7) सोफिया एक धूर्त है  \n(8) एलिज़ाबेथ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: जैक्सन, जैक, सेबेस्टियन, एवा, यूसुफ, पेनलोप, एला, और एलिज़ाबेथ। जैक्सन के अनुसार, \"एलिज़ाबेथ एक शूरवीर है या एला एक शूरवीर है\"। \"जैक्सन एक धूर्त है या जैक एक शूरवीर है,\" जैक ने दावा किया। सेबेस्टियन को यह कहते हुए सुना गया, \"पेनलोप एक धूर्त नहीं है\"। \"सेबेस्टियन एक धूर्त नहीं है,\" एवा ने दावा किया। यूसुफ ने आपको बताया कि अगर एवा एक धूर्त है तो एलिज़ाबेथ एक धूर्त है। पेनलोप के अनुसार, \"अगर जैक्सन एक शूरवीर है तो एला एक धूर्त है\"। एला ने कहा कि एवा एक धूर्त है यदि और केवल यदि जैक्सन एक धूर्त है। \"जैक एक शूरवीर है और यूसुफ एक धूर्त है,\" एलिज़ाबेथ ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक धूर्त है  \n(2) जैक एक शूरवीर है  \n(3) सेबेस्टियन एक शूरवीर है  \n(4) एवा एक शूरवीर है  \n(5) यूसुफ एक शूरवीर है  \n(6) पेनलोप एक शूरवीर है  \n(7) एला एक धूर्त है  \n(8) एलिज़ाबेथ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मेसन, विलियम, पेनलोप, मिया, बेंजामिन, एम्मा, ओलिवर, और ईथन। मेसन ने टिप्पणी की, \"ईथन एक धूर्त है और पेनलोप एक धूर्त है\"। विलियम ने आपको बताया कि बेंजामिन एक धूर्त है और विलियम एक शूरवीर है। पेनलोप ने आपको बताया कि अगर ओलिवर एक धूर्त है तो एम्मा एक शूरवीर है। मिया ने कहा कि एम्मा एक धूर्त है। बेंजामिन ने कहा कि अगर ओलिवर एक शूरवीर है तो पेनलोप एक शूरवीर है। \"अगर विलियम एक शूरवीर है तो मेसन एक शूरवीर है,\" एम्मा ने घोषित किया। ओलिवर ने कहा, \"ईथन एक शूरवीर नहीं है।\" \"पेनलोप एक शूरवीर है यदि और केवल यदि मेसन एक शूरवीर है,\" ईथन ने घोषित किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) विलियम एक धूर्त है  \n(3) पेनलोप एक शूरवीर है  \n(4) मिया एक धूर्त है  \n(5) बेंजामिन एक शूरवीर है  \n(6) एम्मा एक शूरवीर है  \n(7) ओलिवर एक शूरवीर है  \n(8) ईथन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: सोफिया, शार्लट, एलिज़ाबेथ, ओलिवर, ओलिविया, राइली, औरोरा, और ग्रेस। जैसे सोफिया ने कहा, \"राइली एक शूरवीर है यदि और केवल यदि ओलिवर एक धूर्त है\"। शार्लट के अनुसार, \"ओलिवर एक शूरवीर है और एलिज़ाबेथ एक शूरवीर है\"। \"ओलिविया एक शूरवीर है यदि और केवल यदि औरोरा एक धूर्त है,\" एलिज़ाबेथ ने घोषित किया। \"शार्लट एक शूरवीर है\" - ओलिवर। ओलिविया ने asserted किया: \"ओलिवर एक धूर्त है\"। राइली ने asserted किया: \"यदि ग्रेस एक धूर्त है तो ओलिविया एक शूरवीर है\"। औरोरा के शब्दों में: \"शार्लट एक शूरवीर नहीं है\"। ग्रेस ने व्यक्त किया कि शार्लट एक धूर्त है या औरोरा एक धूर्त है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) शार्लट एक धूर्त है  \n(3) एलिज़ाबेथ एक धूर्त है  \n(4) ओलिवर एक धूर्त है  \n(5) ओलिविया एक शूरवीर है  \n(6) राइली एक शूरवीर है  \n(7) औरोरा एक शूरवीर है  \n(8) ग्रेस एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: लिली, जैक्सन, जेम्स, औरोरा, एमिली, शार्लट, सैमुएल, और विलियम। लिली ने कहा, \"अगर विलियम एक धूर्त है तो औरोरा एक धूर्त है।\" जैक्सन को कहते हुए सुना गया, \"शार्लट एक शूरवीर है।\" जेम्स ने कहा, \"एमिली एक शूरवीर नहीं है।\" \"अगर लिली एक धूर्त है तो शार्लट एक शूरवीर है,\" औरोरा ने दावा किया। \"अगर एमिली एक शूरवीर है तो औरोरा एक शूरवीर है,\" एमिली ने घोषित किया। जैसे शार्लट ने कहा, \"औरोरा एक शूरवीर है यदि और केवल यदि लिली एक धूर्त है।\" सैमुएल को कहते हुए सुना गया, \"अगर शार्लट एक शूरवीर है तो जैक्सन एक धूर्त है।\" \"लिली एक शूरवीर है और एमिली एक धूर्त है,\" विलियम ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लिली एक धूर्त है  \n(2) जैक्सन एक शूरवीर है  \n(3) जेम्स एक धूर्त है  \n(4) औरोरा एक शूरवीर है  \n(5) एमिली एक शूरवीर है  \n(6) शार्लट एक शूरवीर है  \n(7) सैमुएल एक धूर्त है  \n(8) विलियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: शार्लट, सोफिया, एमिली, सेबेस्टियन, जेम्स, विक्टोरिया, सैमुएल, और एवरी। शार्लट ने कहा कि अगर एमिली एक शूरवीर है तो सेबेस्टियन एक शूरवीर है। सोफिया ने कहा, \"सैमुएल एक शूरवीर नहीं है\"। एमिली ने कहा कि विक्टोरिया एक शूरवीर है। \"अगर सैमुएल एक शूरवीर है तो शार्लट एक धूर्त है,\" सेबेस्टियन ने घोषणा की। \"अगर जेम्स एक शूरवीर है तो सैमुएल एक धूर्त है,\" जेम्स ने कहा। विक्टोरिया ने कहा कि सैमुएल एक धूर्त नहीं है। सैमुएल ने कहा, \"शार्लट एक धूर्त है और सोफिया एक शूरवीर है।\" एवरी ने कहा, \"विक्टोरिया एक धूर्त है या सेबेस्टियन एक धूर्त है।\" तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) शार्लट एक शूरवीर है  \n(2) सोफिया एक शूरवीर है  \n(3) एमिली एक धूर्त है  \n(4) सेबेस्टियन एक शूरवीर है  \n(5) जेम्स एक शूरवीर है  \n(6) विक्टोरिया एक धूर्त है  \n(7) सैमुएल एक धूर्त है  \n(8) एवरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एला, सोफिया, डेविड, लिली, विलियम, स्कारलेट, बेंजामिन, और अबिगेल। एला ने कहा, \"विलियम एक धूर्त नहीं है\"। \"स्कारलेट एक शूरवीर है या सोफिया एक शूरवीर है\" - सोफिया। डेविड ने कहा, \"अगर अबिगेल एक शूरवीर है तो अबिगेल एक धूर्त है\"। \"अगर विलियम एक धूर्त है तो एला एक धूर्त है,\" लिली ने घोषणा की। विलियम ने कहा: \"बेंजामिन एक शूरवीर है और एला एक शूरवीर है\"। स्कारलेट को यह कहते हुए सुना गया, \"अगर स्कारलेट एक शूरवीर है तो डेविड एक धूर्त है\"। \"एला एक शूरवीर है और स्कारलेट एक धूर्त है\" - बेंजामिन। \"डेविड एक शूरवीर नहीं है,\" अबिगेल ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक धूर्त है  \n(2) सोफिया एक शूरवीर है  \n(3) डेविड एक धूर्त है  \n(4) लिली एक शूरवीर है  \n(5) विलियम एक धूर्त है  \n(6) स्कारलेट एक शूरवीर है  \n(7) बेंजामिन एक धूर्त है  \n(8) अबिगेल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: लुकास, एवरी, याकूब, लियम, माइकल, ओवेन, सेबेस्टियन, और विक्टोरिया। लुकास ने कहा, \"ओवेन एक धूर्त है यदि और केवल यदि ओवेन एक शूरवीर है\"। एवरी के अनुसार, \"माइकल एक धूर्त है\"। याकूब ने कहा, \"यदि लियम एक धूर्त है तो लियम एक शूरवीर है\"। लियम के अनुसार, \"लियम एक शूरवीर है या एवरी एक धूर्त है\"। जैसे माइकल ने कहा, \"याकूब एक शूरवीर नहीं है\"। ओवेन ने कहा, \"सेबेस्टियन एक धूर्त है और लुकास एक शूरवीर है\"। सेबेस्टियन ने कहा, \"एवरी एक शूरवीर है या लुकास एक धूर्त है\"। विक्टोरिया ने आपको बताया कि लियम एक धूर्त है या एवरी एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक धूर्त है  \n(2) एवरी एक शूरवीर है  \n(3) याकूब एक शूरवीर है  \n(4) लियम एक शूरवीर है  \n(5) माइकल एक धूर्त है  \n(6) ओवेन एक धूर्त है  \n(7) सेबेस्टियन एक शूरवीर है  \n(8) विक्टोरिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एमिली, ऐडन, जेम्स, ज़ोई, एवा, राइली, औरोरा, और एलिज़ाबेथ। जैसे कि एमिली ने कहा, \"जेम्स एक धूर्त है यदि और केवल यदि औरोरा एक शूरवीर है\"। ऐडन ने कहा, \"एलिज़ाबेथ एक शूरवीर है और ऐडन एक शूरवीर है\"। \"एलिज़ाबेथ एक शूरवीर है और राइली एक धूर्त है,\" जेम्स ने घोषित किया। ज़ोई ने आपको बताया कि एमिली एक शूरवीर है और औरोरा एक शूरवीर है। एवा ने टिप्पणी की, \"जेम्स एक शूरवीर नहीं है\"। राइली के अनुसार, \"ऐडन एक शूरवीर नहीं है\"। औरोरा ने व्यक्त किया कि एमिली एक धूर्त है और एलिज़ाबेथ एक शूरवीर है। एलिज़ाबेथ ने आपको बताया कि एमिली एक धूर्त है या औरोरा एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एमिली एक धूर्त है  \n(2) ऐडन एक शूरवीर है  \n(3) जेम्स एक शूरवीर है  \n(4) ज़ोई एक धूर्त है  \n(5) एवा एक धूर्त है  \n(6) राइली एक धूर्त है  \n(7) औरोरा एक शूरवीर है  \n(8) एलिज़ाबेथ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: डैनियल, जैक, ल्यूक, मैथ्यू, स्कारलेट, मेसन, मिया, और औरोरा। डैनियल को यह कहते हुए सुना गया, \"मिया एक शूरवीर है या मैथ्यू एक शूरवीर है\"। जैक ने कहा: \"अगर औरोरा एक धूर्त है तो मैथ्यू एक शूरवीर है\"। ल्यूक ने आपको बताया कि मिया एक धूर्त है या स्कारलेट एक धूर्त है। मैथ्यू ने कहा कि मेसन एक धूर्त है यदि और केवल यदि ल्यूक एक शूरवीर है। \"अगर ल्यूक एक शूरवीर है तो डैनियल एक शूरवीर है,\" स्कारलेट ने कहा। मेसन ने आपको बताया कि मिया एक शूरवीर है यदि और केवल यदि ल्यूक एक धूर्त है। मिया ने कहा: \"ल्यूक एक धूर्त है या डैनियल एक धूर्त है\"। औरोरा के अनुसार, \"मेसन एक धूर्त है यदि और केवल यदि मिया एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) डैनियल एक शूरवीर है  \n(2) जैक एक शूरवीर है  \n(3) ल्यूक एक धूर्त है  \n(4) मैथ्यू एक शूरवीर है  \n(5) स्कारलेट एक शूरवीर है  \n(6) मेसन एक शूरवीर है  \n(7) मिया एक शूरवीर है  \n(8) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: माइकल, एला, जैक्सन, नूह, पेनलोप, ओलिवर, इसाबेला, और डेविड। जैसे कि माइकल ने कहा, \"अगर नूह एक धूर्त है तो डेविड एक शूरवीर है।\" \"अगर जैक्सन एक धूर्त है तो नूह एक धूर्त है\" - एला। \"ओलिवर एक शूरवीर है यदि और केवल यदि पेनलोप एक शूरवीर है\" - जैक्सन। \"ओलिवर एक शूरवीर है यदि और केवल यदि इसाबेला एक शूरवीर है\" - नूह। पेनलोप ने कहा, \"ओलिवर एक शूरवीर है।\" ओलिवर ने आपको बताया कि अगर एला एक धूर्त है तो डेविड एक शूरवीर है। इसाबेला ने कहा कि ओलिवर एक धूर्त है या पेनलोप एक धूर्त है। डेविड ने नोट किया, \"इसाबेला एक शूरवीर है और पेनलोप एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक धूर्त है  \n(2) एला एक शूरवीर है  \n(3) जैक्सन एक शूरवीर है  \n(4) नूह एक धूर्त है  \n(5) पेनलोप एक शूरवीर है  \n(6) ओलिवर एक शूरवीर है  \n(7) इसाबेला एक धूर्त है  \n(8) डेविड एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एवरी, एवलिन, एम्मा, ओलिवर, मैथ्यू, जैक्सन, ग्रेस, और जेम्स। एवरी के शब्दों में: \"एवलिन एक शूरवीर है यदि और केवल यदि एवरी एक शूरवीर है\"। जैसे एवलिन ने कहा, \"एवरी एक शूरवीर है यदि और केवल यदि मैथ्यू एक धूर्त है\"। \"एवलिन एक धूर्त है या ग्रेस एक शूरवीर है,\" एम्मा ने दावा किया। \"यदि एवरी एक शूरवीर है तो एवलिन एक शूरवीर है,\" ओलिवर ने दावा किया। मैथ्यू ने कहा कि एवलिन एक धूर्त है और जैक्सन एक धूर्त है। जैक्सन के अनुसार, \"एवलिन एक धूर्त है या एवरी एक शूरवीर है\"। ग्रेस के शब्दों में: \"एवलिन एक शूरवीर है और मैथ्यू एक धूर्त है\"। \"यदि मैथ्यू एक धूर्त है तो जैक्सन एक धूर्त है,\" जेम्स ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक शूरवीर है  \n(2) एवलिन एक शूरवीर है  \n(3) एम्मा एक शूरवीर है  \n(4) ओलिवर एक शूरवीर है  \n(5) मैथ्यू एक धूर्त है  \n(6) जैक्सन एक शूरवीर है  \n(7) ग्रेस एक शूरवीर है  \n(8) जेम्स एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: सोफिया, ओवेन, हेनरी, ग्रेस, एमिली, हार्पर, लोगन, और लिली। \"हार्पर एक धूर्त है और हार्पर एक शूरवीर है\" - सोफिया। ओवेन के शब्दों में: \"ग्रेस एक धूर्त है और हार्पर एक शूरवीर है\"। हेनरी के अनुसार, \"लोगन एक शूरवीर है या ओवेन एक शूरवीर है\"। \"लोगन एक शूरवीर है और हेनरी एक शूरवीर है,\" ग्रेस ने घोषित किया। एमिली ने कहा कि ओवेन एक शूरवीर है और ओवेन एक धूर्त है। हार्पर ने टिप्पणी की, \"हेनरी एक शूरवीर नहीं है\"। लोगन ने कहा, \"हेनरी एक शूरवीर है यदि और केवल यदि एमिली एक धूर्त है\"। लिली को यह कहते हुए सुना गया, \"ग्रेस एक शूरवीर है यदि और केवल यदि सोफिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) ओवेन एक धूर्त है  \n(3) हेनरी एक शूरवीर है  \n(4) ग्रेस एक शूरवीर है  \n(5) एमिली एक धूर्त है  \n(6) हार्पर एक धूर्त है  \n(7) लोगन एक शूरवीर है  \n(8) लिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: बेंजामिन, हार्पर, अबिगेल, जैक, एलिज़ाबेथ, सोफिया, ओवेन, और विलियम। बेंजामिन ने कहा कि जैक एक शूरवीर है और जैक एक धूर्त है। \"ओवेन एक धूर्त है यदि और केवल यदि अबिगेल एक धूर्त है,\" हार्पर ने कहा। अबिगेल के एक बयान में: \"यदि जैक एक धूर्त है तो विलियम एक शूरवीर है\"। जैक ने कहा: \"अबिगेल एक शूरवीर है यदि और केवल यदि अबिगेल एक धूर्त है\"। एलिज़ाबेथ ने नोट किया, \"बेंजामिन एक शूरवीर नहीं है\"। सोफिया के एक बयान में: \"जैक एक धूर्त है और ओवेन एक शूरवीर है\"। ओवेन ने कहा कि बेंजामिन एक धूर्त है और एलिज़ाबेथ एक धूर्त है। विलियम ने कहा कि अबिगेल एक धूर्त है या एलिज़ाबेथ एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक धूर्त है  \n(2) हार्पर एक धूर्त है  \n(3) अबिगेल एक शूरवीर है  \n(4) जैक एक धूर्त है  \n(5) एलिज़ाबेथ एक शूरवीर है  \n(6) सोफिया एक धूर्त है  \n(7) ओवेन एक धूर्त है  \n(8) विलियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: इसाबेला, ओवेन, माइकल, लियम, मेसन, हेनरी, ओलिविया, और ऐडन। इसाबेला के शब्दों में: \"लियम एक धूर्त है या मेसन एक धूर्त है\"। \"मेसेन एक धूर्त है\" - ओवेन। \"हेनरी एक धूर्त है यदि और केवल यदि इसाबेला एक शूरवीर है,\" माइकल ने दावा किया। लियम ने आपको बताया कि ऐडन एक धूर्त है या ओवेन एक शूरवीर है। मेसन ने नोट किया, \"हेनरी एक धूर्त है\"। हेनरी ने remarked किया, \"माइकल एक धूर्त है और इसाबेला एक धूर्त है\"। ओलिविया ने remarked किया, \"मेसेन एक धूर्त है और माइकल एक शूरवीर है\"। जैसे ऐडन ने कहा, \"यदि ओलिविया एक धूर्त है तो इसाबेला एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक शूरवीर है  \n(2) ओवेन एक धूर्त है  \n(3) माइकल एक शूरवीर है  \n(4) लियम एक धूर्त है  \n(5) मेसन एक शूरवीर है  \n(6) हेनरी एक धूर्त है  \n(7) ओलिविया एक धूर्त है  \n(8) ऐडन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मेसन, डेविड, ओवेन, अमेलिया, हार्पर, जेम्स, माइकल, और सेबेस्टियन। मेसन ने टिप्पणी की, \"ओवेन एक धूर्त है\"। \"हार्पर एक शूरवीर है और मेसन एक शूरवीर है,\" डेविड ने घोषित किया। ओवेन के अनुसार, \"डेविड एक धूर्त है या सेबेस्टियन एक शूरवीर है\"। जैसा कि अमेलिया ने कहा, \"ओवेन एक शूरवीर है\"। हार्पर ने remarked किया, \"जेम्स एक धूर्त है यदि और केवल यदि जेम्स एक शूरवीर है\"। जेम्स ने आपको बताया कि माइकल एक शूरवीर है या डेविड एक धूर्त है। माइकल ने कहा कि अमेलिया एक शूरवीर है या मेसन एक शूरवीर है। सेबेस्टियन ने stated किया, \"मेसन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) डेविड एक धूर्त है  \n(3) ओवेन एक शूरवीर है  \n(4) अमेलिया एक शूरवीर है  \n(5) हार्पर एक धूर्त है  \n(6) जेम्स एक शूरवीर है  \n(7) माइकल एक शूरवीर है  \n(8) सेबेस्टियन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मिया, एमिली, ओवेन, एला, औरोरा, एवा, ओलिविया, और डेविड। मिया के अनुसार, \"ओवेन एक धूर्त है और एवा एक शूरवीर है\"। जैसा कि एमिली ने कहा, \"एवा एक धूर्त है यदि और केवल यदि डेविड एक धूर्त है\"। ओवेन ने कहा: \"एमिली एक शूरवीर है यदि और केवल यदि ओलिविया एक धूर्त है\"। एला ने टिप्पणी की, \"ओलिविया एक शूरवीर है यदि और केवल यदि एवा एक शूरवीर है\"। औरोरा ने टिप्पणी की, \"एमिली एक धूर्त है\"। एवा ने आपको बताया कि यदि एला एक शूरवीर है तो औरोरा एक शूरवीर है। ओलिविया ने कहा कि यदि ओवेन एक धूर्त है तो मिया एक शूरवीर है। डेविड ने कहा, \"औरोरा एक धूर्त है या एमिली एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक धूर्त है  \n(2) एमिली एक धूर्त है  \n(3) ओवेन एक शूरवीर है  \n(4) एला एक शूरवीर है  \n(5) औरोरा एक शूरवीर है  \n(6) एवा एक शूरवीर है  \n(7) ओलिविया एक शूरवीर है  \n(8) डेविड एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एवलिन, औरोरा, अलेक्जेंडर, डेविड, ओलिवर, यूसुफ, मेसन, और आरिया। एवलिन ने टिप्पणी की, \"औरोरा एक धूर्त है या अलेक्जेंडर एक शूरवीर है\"। \"ओलिवर एक शूरवीर है यदि और केवल यदि एवलिन एक शूरवीर है,\" औरोरा ने कहा। अलेक्जेंडर ने कहा कि यूसुफ एक शूरवीर है और आरिया एक शूरवीर है। डेविड ने नोट किया, \"औरोरा एक धूर्त नहीं है\"। ओलिवर ने नोट किया, \"डेविड एक शूरवीर नहीं है\"। यूसुफ ने कहा, \"डेविड एक धूर्त है और मेसन एक शूरवीर है।\" मेसन ने कहा: \"यदि आरिया एक धूर्त है तो यूसुफ एक धूर्त है\"। \"औरोरा एक शूरवीर है यदि और केवल यदि डेविड एक शूरवीर है,\" आरिया ने घोषणा की। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एवलिन एक धूर्त है  \n(2) औरोरा एक शूरवीर है  \n(3) अलेक्जेंडर एक धूर्त है  \n(4) डेविड एक शूरवीर है  \n(5) ओलिवर एक धूर्त है  \n(6) यूसुफ एक धूर्त है  \n(7) मेसन एक शूरवीर है  \n(8) आरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: सोफिया, आरिया, जैक्सन, ईथन, जेम्स, याकूब, लोगन, और नूह। सोफिया ने टिप्पणी की, \"लोगन एक धूर्त है और याकूब एक धूर्त है\"। \"याकूब एक शूरवीर नहीं है\" - आरिया। जैक्सन ने कहा कि सोफिया एक शूरवीर है यदि और केवल यदि नूह एक धूर्त है। ईथन ने आपको बताया कि जेम्स एक धूर्त नहीं है। जेम्स ने कहा, \"यदि जैक्सन एक शूरवीर है तो याकूब एक शूरवीर है\"। याकूब ने कहा, \"जेम्स एक धूर्त है या जैक्सन एक शूरवीर है\"। \"ईथन एक धूर्त नहीं है,\" लोगन ने उल्लेख किया। नूह ने कहा, \"लोगन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) आरिया एक शूरवीर है  \n(3) जैक्सन एक धूर्त है  \n(4) ईथन एक शूरवीर है  \n(5) जेम्स एक शूरवीर है  \n(6) याकूब एक धूर्त है  \n(7) लोगन एक शूरवीर है  \n(8) नूह एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मैथ्यू, विलियम, एला, जेम्स, माइकल, एवा, सैमुएल, और ग्रेस। \"अगर माइकल एक धूर्त है तो एवा एक धूर्त है,\" मैथ्यू ने घोषणा की। विलियम ने कहा, \"माइकल एक शूरवीर नहीं है\"। एला ने remarked किया, \"ग्रेस एक शूरवीर है यदि और केवल यदि एला एक शूरवीर है\"। जेम्स ने remarked किया, \"ग्रेस एक धूर्त है या एला एक शूरवीर है\"। माइकल को यह कहते हुए सुना गया, \"अगर एवा एक शूरवीर है तो ग्रेस एक धूर्त है\"। एवा ने टिप्पणी की, \"अगर माइकल एक शूरवीर है तो ग्रेस एक शूरवीर है\"। सैमुएल ने व्यक्त किया कि ग्रेस एक शूरवीर है और एवा एक शूरवीर है। जैसे ग्रेस ने कहा, \"एला एक शूरवीर है यदि और केवल यदि विलियम एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक धूर्त है  \n(2) विलियम एक शूरवीर है  \n(3) एला एक धूर्त है  \n(4) जेम्स एक धूर्त है  \n(5) माइकल एक धूर्त है  \n(6) एवा एक शूरवीर है  \n(7) सैमुएल एक शूरवीर है  \n(8) ग्रेस एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: जैक, अलेक्जेंडर, डेविड, सोफिया, पेनलोप, एला, ज़ोई, और डैनियल। जैक ने आपको बताया कि डेविड एक धूर्त है यदि और केवल यदि पेनलोप एक धूर्त है। अलेक्जेंडर के शब्दों में: \"यदि डेविड एक धूर्त है तो जैक एक धूर्त है\"। डेविड ने कहा, \"डैनियल एक धूर्त है या पेनलोप एक शूरवीर है\"। सोफिया ने कहा कि जैक एक शूरवीर नहीं है। पेनलोप ने कहा, \"अलेक्जेंडर एक शूरवीर नहीं है।\" एला ने कहा कि एला एक शूरवीर है और पेनलोप एक शूरवीर है। ज़ोई ने कहा, \"यदि सोफिया एक शूरवीर है तो एला एक शूरवीर है।\" डैनियल को यह कहते हुए सुना गया, \"डैनियल एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक एक धूर्त है  \n(2) अलेक्जेंडर एक शूरवीर है  \n(3) डेविड एक शूरवीर है  \n(4) सोफिया एक शूरवीर है  \n(5) पेनलोप एक धूर्त है  \n(6) एला एक धूर्त है  \n(7) ज़ोई एक धूर्त है  \n(8) डैनियल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: लोगन, ओवेन, अमेलिया, आरिया, विक्टोरिया, जेम्स, यूसुफ, और याकूब। लोगन ने कहा: \"अगर आरिया एक धूर्त है तो अमेलिया एक धूर्त है\"। ओवेन ने कहा, \"लोगन एक शूरवीर है\"। \"ओवेन एक धूर्त है या यूसुफ एक धूर्त है,\" अमेलिया ने कहा। आरिया के एक बयान में: \"ओवेन एक शूरवीर है\"। विक्टोरिया ने कहा कि अगर अमेलिया एक धूर्त है तो विक्टोरिया एक शूरवीर है। जेम्स ने कहा, \"आरिया एक शूरवीर है और अमेलिया एक धूर्त है।\" यूसुफ ने कहा: \"जेम्स एक धूर्त है यदि और केवल यदि आरिया एक शूरवीर है\"। याकूब ने कहा, \"विक्टोरिया एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक धूर्त है  \n(2) ओवेन एक धूर्त है  \n(3) अमेलिया एक शूरवीर है  \n(4) आरिया एक धूर्त है  \n(5) विक्टोरिया एक शूरवीर है  \n(6) जेम्स एक धूर्त है  \n(7) यूसुफ एक धूर्त है  \n(8) याकूब एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: शार्लट, अलेक्जेंडर, नूह, यूसुफ, अमेलिया, जैक्सन, एवरी, और बेंजामिन। शार्लट ने कहा कि यूसुफ एक धूर्त है यदि और केवल यदि शार्लट एक शूरवीर है। अलेक्जेंडर के एक बयान में: \"जैक्सन एक शूरवीर नहीं है\"। नूह के एक बयान में: \"शार्लट एक धूर्त नहीं है\"। यूसुफ के अनुसार, \"अलेक्जेंडर एक शूरवीर है\"। अमेलिया ने कहा कि एवरी एक शूरवीर है और नूह एक शूरवीर है। जैक्सन को यह कहते हुए सुना गया, \"यदि अलेक्जेंडर एक धूर्त है तो शार्लट एक शूरवीर है\"। \"बेंजामिन एक धूर्त है और जैक्सन एक धूर्त है,\" एवरी ने घोषणा की। बेंजामिन के शब्दों में: \"अलेक्जेंडर एक शूरवीर है और नूह एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक शूरवीर है  \n(2) अलेक्जेंडर एक धूर्त है  \n(3) नूह एक शूरवीर है  \n(4) यूसुफ एक धूर्त है  \n(5) अमेलिया एक धूर्त है  \n(6) जैक्सन एक शूरवीर है  \n(7) एवरी एक धूर्त है  \n(8) बेंजामिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: नूह, याकूब, सोफिया, स्कारलेट, ओवेन, हेनरी, ऐडन, और ग्रेस। नूह के एक बयान में: \"हेनरी एक धूर्त है\"। याकूब ने कहा कि ओवेन एक शूरवीर नहीं है। \"सोफिया एक शूरवीर है यदि और केवल यदि ऐडन एक शूरवीर है,\" सोफिया ने घोषणा की। स्कारलेट ने कहा, \"ग्रेस एक धूर्त है यदि और केवल यदि हेनरी एक धूर्त है\"। \"ग्रेस एक शूरवीर है या नूह एक धूर्त है\" - ओवेन। जैसे हेनरी ने कहा, \"यदि ओवेन एक धूर्त है तो सोफिया एक शूरवीर है\"। \"सोफिया एक धूर्त नहीं है,\" ऐडन ने उल्लेख किया। \"याकूब एक धूर्त है या याकूब एक शूरवीर है,\" ग्रेस ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक धूर्त है  \n(2) याकूब एक धूर्त है  \n(3) सोफिया एक शूरवीर है  \n(4) स्कारलेट एक शूरवीर है  \n(5) ओवेन एक शूरवीर है  \n(6) हेनरी एक शूरवीर है  \n(7) ऐडन एक शूरवीर है  \n(8) ग्रेस एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एवरी, एला, लुकास, इसाबेला, एम्मा, एमिली, ल्यूक, और ओलिविया। एवरी ने कहा, \"इसाबेला एक शूरवीर है और ल्यूक एक धूर्त है\"। एला ने टिप्पणी की, \"एवरी एक शूरवीर है या इसाबेला एक धूर्त है\"। लुकास ने कहा, \"एला एक धूर्त है और इसाबेला एक धूर्त है\"। इसाबेला ने नोट किया, \"इसाबेला एक शूरवीर है और एमिली एक धूर्त है\"। एम्मा के अनुसार, \"ओलिविया एक धूर्त है\"। \"अगर एवरी एक शूरवीर है तो इसाबेला एक शूरवीर है,\" एमिली ने घोषित किया। ल्यूक को यह कहते हुए सुना गया, \"इसाबेला एक धूर्त है\"। ओलिविया ने कहा, \"अगर एवरी एक शूरवीर है तो लुकास एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक धूर्त है  \n(2) एला एक शूरवीर है  \n(3) लुकास एक धूर्त है  \n(4) इसाबेला एक धूर्त है  \n(5) एम्मा एक धूर्त है  \n(6) एमिली एक शूरवीर है  \n(7) ल्यूक एक शूरवीर है  \n(8) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: माइकल, एवा, सेबेस्टियन, ग्रेस, लोगन, बेंजामिन, विलियम, और इसाबेला। माइकल ने कहा, \"विलियम एक धूर्त है या एवा एक धूर्त है।\" एवा ने कहा कि ग्रेस एक धूर्त है। सेबेस्टियन ने कहा, \"विलियम एक धूर्त नहीं है।\" ग्रेस ने कहा कि सेबेस्टियन एक धूर्त नहीं है। जैसे लोगन ने कहा, \"विलियम एक धूर्त है और सेबेस्टियन एक धूर्त है।\" बेंजामिन ने कहा, \"सेबेस्टियन एक धूर्त नहीं है।\" \"विलियम एक शूरवीर है यदि और केवल यदि लोगन एक धूर्त है,\" विलियम ने दावा किया। इसाबेला ने टिप्पणी की, \"यदि लोगन एक धूर्त है तो बेंजामिन एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक शूरवीर है  \n(2) एवा एक धूर्त है  \n(3) सेबेस्टियन एक शूरवीर है  \n(4) ग्रेस एक शूरवीर है  \n(5) लोगन एक धूर्त है  \n(6) बेंजामिन एक शूरवीर है  \n(7) विलियम एक शूरवीर है  \n(8) इसाबेला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: सेबेस्टियन, हेनरी, यूसुफ, ओवेन, ऐडन, डेविड, एवरी, और एमिली। \"ऐडन एक धूर्त है या डेविड एक शूरवीर है,\" सेबेस्टियन ने कहा। हेनरी को यह कहते हुए सुना गया, \"हेनरी एक शूरवीर है या ओवेन एक शूरवीर है\"। यूसुफ को यह कहते हुए सुना गया, \"डेविड एक धूर्त है यदि और केवल यदि सेबेस्टियन एक धूर्त है\"। ओवेन के शब्दों में: \"डेविड एक शूरवीर है यदि और केवल यदि एमिली एक शूरवीर है\"। ऐडन ने कहा, \"सेबेस्टियन एक धूर्त नहीं है\"। डेविड के अनुसार, \"सेबेस्टियन एक धूर्त है या डेविड एक शूरवीर है\"। एवरी के शब्दों में: \"ऐडन एक शूरवीर है या सेबेस्टियन एक धूर्त है\"। \"डेविड एक धूर्त है यदि और केवल यदि एवरी एक धूर्त है\" - एमिली। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सेबेस्टियन एक शूरवीर है  \n(2) हेनरी एक शूरवीर है  \n(3) यूसुफ एक शूरवीर है  \n(4) ओवेन एक शूरवीर है  \n(5) ऐडन एक शूरवीर है  \n(6) डेविड एक शूरवीर है  \n(7) एवरी एक शूरवीर है  \n(8) एमिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: जैक, एवा, ऐडन, सोफिया, आरिया, इसाबेला, डैनियल, और लोगन। जैक के अनुसार, \"अगर डैनियल एक धूर्त है तो आरिया एक शूरवीर है\"। एवा के शब्दों में: \"एवा एक शूरवीर है या ऐडन एक शूरवीर है\"। \"जैक एक धूर्त है या इसाबेला एक शूरवीर है,\" ऐडन ने घोषणा की। सोफिया को यह कहते हुए सुना गया, \"आरिया एक धूर्त है या डैनियल एक धूर्त है\"। आरिया ने नोट किया, \"ऐडन एक धूर्त है यदि और केवल यदि एवा एक धूर्त है\"। इसाबेला ने asserted किया: \"अगर लोगन एक शूरवीर है तो डैनियल एक धूर्त है\"। डैनियल ने asserted किया: \"जैक एक शूरवीर है या लोगन एक शूरवीर है\"। लोगन ने नोट किया, \"सोफिया एक शूरवीर है या ऐडन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक एक शूरवीर है  \n(2) एवा एक शूरवीर है  \n(3) ऐडन एक धूर्त है  \n(4) सोफिया एक शूरवीर है  \n(5) आरिया एक धूर्त है  \n(6) इसाबेला एक धूर्त है  \n(7) डैनियल एक शूरवीर है  \n(8) लोगन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: डेविड, आरिया, लोगन, मैथ्यू, अलेक्जेंडर, ओवेन, बेंजामिन, और एमिली। डेविड के शब्दों में: \"बेंजामिन एक शूरवीर है या मैथ्यू एक शूरवीर है\"। आरिया ने कहा, \"ओवेन एक धूर्त है या अलेक्जेंडर एक शूरवीर है\"। \"डेविड एक धूर्त नहीं है,\" लोगन ने घोषित किया। मैथ्यू ने कहा, \"आरिया एक शूरवीर है और बेंजामिन एक धूर्त है।\" अलेक्जेंडर ने कहा, \"बेंजामिन एक शूरवीर है और डेविड एक शूरवीर है।\" \"बेंजामिन एक शूरवीर है और डेविड एक शूरवीर है,\" ओवेन ने घोषित किया। बेंजामिन ने कहा: \"मैथ्यू एक शूरवीर है यदि और केवल यदि अलेक्जेंडर एक धूर्त है\"। एमिली ने कहा, \"यदि मैथ्यू एक धूर्त है तो अलेक्जेंडर एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक शूरवीर है  \n(2) आरिया एक शूरवीर है  \n(3) लोगन एक शूरवीर है  \n(4) मैथ्यू एक धूर्त है  \n(5) अलेक्जेंडर एक शूरवीर है  \n(6) ओवेन एक शूरवीर है  \n(7) बेंजामिन एक शूरवीर है  \n(8) एमिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मेसन, डेविड, एवरी, इसाबेला, हार्पर, सोफिया, ओलिवर, और यूसुफ। मेसन ने कहा: \"अगर डेविड एक शूरवीर है तो यूसुफ एक शूरवीर है\"। डेविड ने कहा, \"सोफिया एक धूर्त है\"। एवरी ने कहा कि इसाबेला एक धूर्त है और यूसुफ एक धूर्त है। इसाबेला ने कहा: \"अगर सोफिया एक धूर्त है तो डेविड एक शूरवीर है\"। हार्पर ने कहा, \"डेविड एक शूरवीर नहीं है।\" सोफिया ने आपको बताया कि मेसन एक धूर्त है और इसाबेला एक धूर्त है। ओलिवर ने कहा, \"अगर सोफिया एक शूरवीर है तो सोफिया एक धूर्त है\"। \"इसाबेला एक शूरवीर है या डेविड एक धूर्त है,\" यूसुफ ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक शूरवीर है  \n(2) डेविड एक शूरवीर है  \n(3) एवरी एक धूर्त है  \n(4) इसाबेला एक शूरवीर है  \n(5) हार्पर एक धूर्त है  \n(6) सोफिया एक धूर्त है  \n(7) ओलिवर एक शूरवीर है  \n(8) यूसुफ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: जेम्स, डेविड, हार्पर, मैथ्यू, ल्यूक, डैनियल, एवरी, और सोफिया। \"डैनियल एक शूरवीर है,\" जेम्स ने घोषणा की। डेविड ने आपको बताया कि सोफिया एक धूर्त है यदि और केवल यदि जेम्स एक धूर्त है। हार्पर ने कहा, \"डैनियल एक शूरवीर नहीं है\"। मैथ्यू ने आपको बताया कि यदि जेम्स एक शूरवीर है तो जेम्स एक धूर्त है। \"यदि सोफिया एक शूरवीर है तो एवरी एक धूर्त है,\" ल्यूक ने दावा किया। डैनियल ने कहा कि सोफिया एक धूर्त है। एवरी के अनुसार, \"हार्पर एक शूरवीर नहीं है\"। सोफिया ने कहा कि ल्यूक एक शूरवीर नहीं है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) डेविड एक धूर्त है  \n(3) हार्पर एक धूर्त है  \n(4) मैथ्यू एक धूर्त है  \n(5) ल्यूक एक शूरवीर है  \n(6) डैनियल एक शूरवीर है  \n(7) एवरी एक शूरवीर है  \n(8) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एला, याकूब, मैथ्यू, एम्मा, एमिली, हार्पर, लिली, और एवरी। एला ने कहा, \"लिली एक शूरवीर है या याकूब एक शूरवीर है\"। याकूब ने टिप्पणी की, \"एम्मा एक धूर्त है या हार्पर एक शूरवीर है\"। मैथ्यू ने कहा: \"एला एक शूरवीर है और याकूब एक शूरवीर है\"। जैसे एम्मा ने कहा, \"लिली एक धूर्त है यदि और केवल यदि लिली एक शूरवीर है\"। एमिली के शब्दों में: \"एला एक शूरवीर नहीं है\"। \"एला एक शूरवीर नहीं है\" - हार्पर। लिली को यह कहते हुए सुना गया, \"यदि एम्मा एक शूरवीर है तो एमिली एक धूर्त है\"। एवरी ने कहा, \"याकूब एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक शूरवीर है  \n(2) याकूब एक शूरवीर है  \n(3) मैथ्यू एक शूरवीर है  \n(4) एम्मा एक धूर्त है  \n(5) एमिली एक धूर्त है  \n(6) हार्पर एक धूर्त है  \n(7) लिली एक शूरवीर है  \n(8) एवरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: स्कारलेट, पेनलोप, ल्यूक, सोफिया, क्लोई, डैनियल, यूसुफ, और अलेक्जेंडर। स्कारलेट ने कहा, \"स्कारलेट एक शूरवीर है और क्लोई एक धूर्त है।\" पेनलोप ने आपको बताया कि अलेक्जेंडर एक शूरवीर है या यूसुफ एक धूर्त है। ल्यूक के शब्दों में: \"स्कारलेट एक शूरवीर है यदि और केवल यदि सोफिया एक शूरवीर है।\" सोफिया ने आपको बताया कि अलेक्जेंडर एक शूरवीर है और ल्यूक एक शूरवीर है। जैसे क्लोई ने कहा, \"स्कारलेट एक धूर्त है या स्कारलेट एक शूरवीर है।\" डैनियल के एक बयान में: \"यदि डैनियल एक शूरवीर है तो अलेक्जेंडर एक धूर्त है।\" यूसुफ ने कहा, \"सोफिया एक शूरवीर है और पेनलोप एक शूरवीर है।\" अलेक्जेंडर ने कहा, \"सोफिया एक शूरवीर है या ल्यूक एक धूर्त है।\" तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) स्कारलेट एक धूर्त है  \n(2) पेनलोप एक शूरवीर है  \n(3) ल्यूक एक शूरवीर है  \n(4) सोफिया एक धूर्त है  \n(5) क्लोई एक शूरवीर है  \n(6) डैनियल एक शूरवीर है  \n(7) यूसुफ एक धूर्त है  \n(8) अलेक्जेंडर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मेसन, एवरी, मिया, नूह, डैनियल, ओलिवर, यूसुफ, और एला। मेसन के अनुसार, \"अगर मिया एक शूरवीर है तो एला एक धूर्त है\"। एवरी के शब्दों में: \"मेसन एक धूर्त है या एला एक शूरवीर है\"। मिया ने कहा, \"नूह एक शूरवीर है\"। नूह के शब्दों में: \"यूसुफ एक धूर्त है और नूह एक शूरवीर है\"। डैनियल ने कहा कि अगर यूसुफ एक धूर्त है तो ओलिवर एक धूर्त है। ओलिवर के शब्दों में: \"एला एक शूरवीर है\"। यूसुफ ने टिप्पणी की, \"डैनियल एक शूरवीर है\"। \"मिया एक धूर्त है यदि और केवल यदि ओलिवर एक धूर्त है,\" एला ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) एवरी एक शूरवीर है  \n(3) मिया एक शूरवीर है  \n(4) नूह एक शूरवीर है  \n(5) डैनियल एक धूर्त है  \n(6) ओलिवर एक शूरवीर है  \n(7) यूसुफ एक धूर्त है  \n(8) एला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ईथन, लुकास, अलेक्जेंडर, अमेलिया, लोगन, मेसन, विलियम, और लियम। ईथन ने कहा कि अमेलिया एक शूरवीर है यदि और केवल यदि अलेक्जेंडर एक धूर्त है। लुकास ने आपको बताया कि ईथन एक शूरवीर है या मेसन एक धूर्त है। अलेक्जेंडर ने कहा, \"लोगन एक शूरवीर है और ईथन एक शूरवीर है\"। अमेलिया ने कहा, \"मेसन एक धूर्त है और विलियम एक धूर्त है\"। \"अलेक्जेंडर एक शूरवीर नहीं है,\" लोगन ने घोषणा की। मेसन ने आपको बताया कि लुकास एक शूरवीर नहीं है। विलियम ने कहा, \"मेसन एक शूरवीर है या लोगन एक धूर्त है\"। लियम के एक बयान में: \"ईथन एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ईथन एक धूर्त है  \n(2) लुकास एक धूर्त है  \n(3) अलेक्जेंडर एक धूर्त है  \n(4) अमेलिया एक धूर्त है  \n(5) लोगन एक शूरवीर है  \n(6) मेसन एक शूरवीर है  \n(7) विलियम एक शूरवीर है  \n(8) लियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: इसाबेला, एम्मा, पेनलोप, अलेक्जेंडर, ईथन, लोगन, हार्पर, और सैमुएल। इसाबेला के शब्दों में: \"ईथन एक शूरवीर है और अलेक्जेंडर एक धूर्त है\"। एम्मा ने टिप्पणी की, \"इसाबेला एक धूर्त है\"। पेनलोप ने कहा: \"अलेक्जेंडर एक शूरवीर है और हार्पर एक शूरवीर है\"। अलेक्जेंडर को यह कहते हुए सुना गया, \"सैमुएल एक शूरवीर है यदि और केवल यदि अलेक्जेंडर एक शूरवीर है\"। ईथन ने नोट किया, \"लोगन एक शूरवीर है यदि और केवल यदि इसाबेला एक धूर्त है\"। लोगन ने टिप्पणी की, \"इसाबेला एक शूरवीर है\"। हार्पर के एक बयान में: \"अलेक्जेंडर एक धूर्त है यदि और केवल यदि ईथन एक शूरवीर है\"। सैमुएल ने नोट किया, \"लोगन एक शूरवीर है या पेनलोप एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक धूर्त है  \n(2) एम्मा एक शूरवीर है  \n(3) पेनलोप एक शूरवीर है  \n(4) अलेक्जेंडर एक शूरवीर है  \n(5) ईथन एक धूर्त है  \n(6) लोगन एक धूर्त है  \n(7) हार्पर एक शूरवीर है  \n(8) सैमुएल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: डेविड, मैथ्यू, लोगन, स्कारलेट, ओलिविया, एवा, एवलिन, और बेंजामिन। डेविड ने आपको बताया कि लोगन एक धूर्त नहीं है। मैथ्यू ने आपको बताया कि स्कारलेट एक शूरवीर है यदि और केवल यदि डेविड एक धूर्त है। लोगन के अनुसार, \"स्कारलेट एक धूर्त नहीं है\"। स्कारलेट ने कहा कि एवलिन एक शूरवीर है या एवा एक शूरवीर है। ओलिविया को यह कहते हुए सुना गया, \"यदि बेंजामिन एक धूर्त है तो ओलिविया एक शूरवीर है\"। \"डेविड एक शूरवीर है,\" एवा ने दावा किया। एवलिन के एक बयान में: \"मैथ्यू एक धूर्त है यदि और केवल यदि स्कारलेट एक धूर्त है\"। बेंजामिन के अनुसार, \"लोगन एक शूरवीर है और डेविड एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक शूरवीर है  \n(2) मैथ्यू एक धूर्त है  \n(3) लोगन एक शूरवीर है  \n(4) स्कारलेट एक शूरवीर है  \n(5) ओलिविया एक शूरवीर है  \n(6) एवा एक शूरवीर है  \n(7) एवलिन एक धूर्त है  \n(8) बेंजामिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: लुकास, जैक्सन, एवलिन, माइकल, सेबेस्टियन, मिया, एवा, और लिली। \"मिया एक धूर्त है,\" लुकास ने दावा किया। \"लुकास एक धूर्त है और लुकास एक शूरवीर है,\" जैक्सन ने उल्लेख किया। \"जैक्सन एक शूरवीर नहीं है,\" एवलिन ने उल्लेख किया। माइकल ने कहा, \"लुकास एक धूर्त है या माइकल एक शूरवीर है\"। सेबेस्टियन के अनुसार, \"लिली एक शूरवीर है\"। \"अगर जैक्सन एक शूरवीर है तो मिया एक शूरवीर है,\" मिया ने उल्लेख किया। \"लिली एक धूर्त है या लुकास एक शूरवीर है,\" एवा ने घोषणा की। \"अगर एवलिन एक शूरवीर है तो जैक्सन एक शूरवीर है,\" लिली ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक धूर्त है  \n(2) जैक्सन एक धूर्त है  \n(3) एवलिन एक शूरवीर है  \n(4) माइकल एक शूरवीर है  \n(5) सेबेस्टियन एक धूर्त है  \n(6) मिया एक शूरवीर है  \n(7) एवा एक शूरवीर है  \n(8) लिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: सोफिया, नूह, स्कारलेट, जैक्सन, एवरी, डैनियल, अबिगेल, और ग्रेस। सोफिया को यह कहते हुए सुना गया, \"सोफिया एक शूरवीर है या अबिगेल एक धूर्त है\"। नूह ने नोट किया, \"सोफिया एक धूर्त है यदि और केवल यदि ग्रेस एक धूर्त है\"। स्कारलेट ने कहा कि ग्रेस एक धूर्त है और जैक्सन एक धूर्त है। \"सोफिया एक शूरवीर नहीं है,\" जैक्सन ने दावा किया। \"यदि ग्रेस एक धूर्त है तो डैनियल एक धूर्त है,\" एवरी ने घोषित किया। डैनियल ने कहा कि स्कारलेट एक शूरवीर है। अबिगेल ने नोट किया, \"स्कारलेट एक शूरवीर है\"। जैसे ग्रेस ने कहा, \"जैक्सन एक धूर्त नहीं है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) नूह एक धूर्त है  \n(3) स्कारलेट एक शूरवीर है  \n(4) जैक्सन एक धूर्त है  \n(5) एवरी एक धूर्त है  \n(6) डैनियल एक शूरवीर है  \n(7) अबिगेल एक शूरवीर है  \n(8) ग्रेस एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एवलिन, याकूब, अलेक्जेंडर, हेनरी, एलिज़ाबेथ, आरिया, लिली, और ईथन। एवलिन ने कहा कि याकूब एक शूरवीर नहीं है। याकूब के एक बयान में: \"ईथन एक धूर्त नहीं है\"। अलेक्जेंडर के एक बयान में: \"याकूब एक शूरवीर है यदि और केवल यदि याकूब एक धूर्त है\"। हेनरी ने कहा कि एलिज़ाबेथ एक शूरवीर है। एलिज़ाबेथ के शब्दों में: \"एवलिन एक शूरवीर है यदि और केवल यदि ईथन एक धूर्त है\"। आरिया ने टिप्पणी की, \"ईथन एक धूर्त है\"। \"ईथन एक धूर्त है यदि और केवल यदि एवलिन एक धूर्त है,\" लिली ने कहा। ईथन के एक बयान में: \"यदि लिली एक शूरवीर है तो अलेक्जेंडर एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक धूर्त है  \n(2) याकूब एक शूरवीर है  \n(3) अलेक्जेंडर एक धूर्त है  \n(4) हेनरी एक शूरवीर है  \n(5) एलिज़ाबेथ एक शूरवीर है  \n(6) आरिया एक धूर्त है  \n(7) लिली एक धूर्त है  \n(8) ईथन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मैथ्यू, सेबेस्टियन, नूह, ज़ोई, एलिज़ाबेथ, अमेलिया, लिली, और सोफिया। मैथ्यू ने कहा कि अमेलिया एक शूरवीर है और सोफिया एक धूर्त है। सेबेस्टियन ने कहा, \"नूह एक धूर्त है या नूह एक शूरवीर है।\" नूह ने कहा, \"अमेलिया एक शूरवीर है यदि और केवल यदि सोफिया एक धूर्त है।\" ज़ोई के एक बयान में: \"लिली एक धूर्त है यदि और केवल यदि सोफिया एक शूरवीर है।\" एलिज़ाबेथ ने कहा, \"सोफिया एक शूरवीर है और नूह एक शूरवीर है।\" \"नूह एक धूर्त है और नूह एक शूरवीर है\" - अमेलिया। लिली ने कहा, \"नूह एक धूर्त है यदि और केवल यदि ज़ोई एक शूरवीर है।\" सोफिया ने कहा, \"नूह एक धूर्त है या लिली एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक धूर्त है  \n(2) सेबेस्टियन एक शूरवीर है  \n(3) नूह एक शूरवीर है  \n(4) ज़ोई एक शूरवीर है  \n(5) एलिज़ाबेथ एक शूरवीर है  \n(6) अमेलिया एक धूर्त है  \n(7) लिली एक धूर्त है  \n(8) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: बेंजामिन, सोफिया, लियम, डेविड, यूसुफ, ओलिवर, सोफिया, और नूह। बेंजामिन के शब्दों में: \"अगर सोफिया एक शूरवीर है तो नूह एक धूर्त है।\" सोफिया ने कहा, \"डेविड एक धूर्त नहीं है।\" लियम के अनुसार, \"यूसुफ एक धूर्त है यदि और केवल यदि नूह एक धूर्त है।\" \"लियम एक शूरवीर है\" - डेविड। यूसुफ ने टिप्पणी की, \"बेंजामिन एक शूरवीर नहीं है।\" ओलिवर के शब्दों में: \"यूसुफ एक धूर्त है या लियम एक धूर्त है।\" सोफिया ने कहा कि ओलिवर एक धूर्त है और सोफिया एक धूर्त है। नूह ने कहा, \"ओलिवर एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक शूरवीर है  \n(2) सोफिया एक शूरवीर है  \n(3) लियम एक शूरवीर है  \n(4) डेविड एक शूरवीर है  \n(5) यूसुफ एक धूर्त है  \n(6) ओलिवर एक शूरवीर है  \n(7) सोफिया एक धूर्त है  \n(8) नूह एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: लिली, नूह, एवलिन, लुकास, विक्टोरिया, क्लोई, मेसन, और एवरी। जैसे लिली ने कहा, \"क्लोई एक धूर्त है या क्लोई एक शूरवीर है\"। \"विक्टोरिया एक धूर्त नहीं है,\" नूह ने दावा किया। एवलिन ने नोट किया, \"मेसन एक धूर्त नहीं है\"। लुकास को यह कहते हुए सुना गया, \"क्लोई एक धूर्त है और मेसन एक शूरवीर है\"। \"एवलिन एक धूर्त है यदि और केवल यदि लिली एक शूरवीर है,\" विक्टोरिया ने घोषित किया। क्लोई ने टिप्पणी की, \"एवलिन एक शूरवीर है और नूह एक शूरवीर है\"। जैसे मेसन ने कहा, \"एवरी एक शूरवीर है और मेसन एक शूरवीर है\"। \"मेसन एक शूरवीर है और एवलिन एक धूर्त है,\" एवरी ने दावा किया। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) लिली एक शूरवीर है  \n(2) नूह एक शूरवीर है  \n(3) एवलिन एक धूर्त है  \n(4) लुकास एक धूर्त है  \n(5) विक्टोरिया एक शूरवीर है  \n(6) क्लोई एक धूर्त है  \n(7) मेसन एक धूर्त है  \n(8) एवरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: इसाबेला, सोफिया, अबिगेल, आरिया, एम्मा, डैनियल, स्कारलेट, और ओवेन। इसाबेला ने टिप्पणी की, \"सोफिया एक शूरवीर है या आरिया एक धूर्त है\"। सोफिया ने कहा कि अबिगेल एक शूरवीर है और एम्मा एक धूर्त है। अबिगेल ने कहा कि स्कारलेट एक धूर्त है यदि और केवल यदि आरिया एक धूर्त है। आरिया ने asserted किया: \"यदि स्कारलेट एक शूरवीर है तो सोफिया एक धूर्त है\"। एम्मा ने टिप्पणी की, \"ओवेन एक शूरवीर है और इसाबेला एक धूर्त है\"। डैनियल के एक बयान में: \"इसाबेला एक धूर्त है\"। स्कारलेट को यह कहते हुए सुना गया, \"आरिया एक शूरवीर है या सोफिया एक शूरवीर है\"। ओवेन को यह कहते हुए सुना गया, \"स्कारलेट एक शूरवीर है और आरिया एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) इसाबेला एक धूर्त है  \n(2) सोफिया एक धूर्त है  \n(3) अबिगेल एक शूरवीर है  \n(4) आरिया एक शूरवीर है  \n(5) एम्मा एक शूरवीर है  \n(6) डैनियल एक शूरवीर है  \n(7) स्कारलेट एक शूरवीर है  \n(8) ओवेन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: लिली, यूसुफ, जैक्सन, याकूब, सोफिया, ऐडन, ईथन, और डेविड। लिली ने कहा कि जैक्सन एक शूरवीर है। \"जैक्सन एक धूर्त नहीं है,\" यूसुफ ने दावा किया। जैक्सन ने टिप्पणी की, \"ईथन एक शूरवीर है या ईथन एक धूर्त है\"। \"सोफिया एक धूर्त है और ऐडन एक शूरवीर है,\" याकूब ने दावा किया। सोफिया ने नोट किया, \"यूसुफ एक शूरवीर है\"। ऐडन ने कहा कि जैक्सन एक धूर्त है और जैक्सन एक शूरवीर है। ईथन के शब्दों में: \"लिली एक धूर्त है या ऐडन एक शूरवीर है\"। \"ऐडन एक धूर्त है और ऐडन एक शूरवीर है,\" डेविड ने उल्लेख किया। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) लिली एक शूरवीर है  \n(2) यूसुफ एक शूरवीर है  \n(3) जैक्सन एक शूरवीर है  \n(4) याकूब एक धूर्त है  \n(5) सोफिया एक शूरवीर है  \n(6) ऐडन एक धूर्त है  \n(7) ईथन एक धूर्त है  \n(8) डेविड एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: मिया, माइकल, एवरी, अबिगेल, लुकास, शार्लट, हार्पर, और अलेक्जेंडर। \"अगर मिया एक शूरवीर है तो अलेक्जेंडर एक शूरवीर है,\" मिया ने दावा किया। माइकल ने कहा कि अबिगेल एक धूर्त है और हार्पर एक शूरवीर है। एवरी के शब्दों में: \"लुकास एक धूर्त है यदि और केवल यदि माइकल एक शूरवीर है\"। \"माइकल एक धूर्त है,\" अबिगेल ने उल्लेख किया। लुकास ने कहा कि शार्लट एक शूरवीर नहीं है। शार्लट के एक बयान में: \"हार्पर एक शूरवीर है या माइकल एक धूर्त है\"। \"अबिगेल एक धूर्त नहीं है,\" हार्पर ने उल्लेख किया। अलेक्जेंडर ने कहा, \"लुकास एक धूर्त है और शार्लट एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) मिया एक शूरवीर है  \n(2) माइकल एक धूर्त है  \n(3) एवरी एक धूर्त है  \n(4) अबिगेल एक शूरवीर है  \n(5) लुकास एक धूर्त है  \n(6) शार्लट एक शूरवीर है  \n(7) हार्पर एक शूरवीर है  \n(8) अलेक्जेंडर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एला, लुकास, बेंजामिन, क्लोई, माइकल, याकूब, एम्मा, और यूसुफ। एला ने आपको बताया कि माइकल एक शूरवीर है। लुकास ने कहा, \"माइकल एक धूर्त है या एम्मा एक शूरवीर है\"। बेंजामिन को यह कहते हुए सुना गया, \"एला एक धूर्त है यदि और केवल यदि याकूब एक धूर्त है\"। \"यूसुफ एक शूरवीर है यदि और केवल यदि माइकल एक धूर्त है,\" क्लोई ने घोषणा की। माइकल ने कहा कि यदि याकूब एक शूरवीर है तो क्लोई एक शूरवीर है। याकूब के एक बयान में: \"क्लोई एक धूर्त है और लुकास एक धूर्त है\"। एम्मा को यह कहते हुए सुना गया, \"क्लोई एक शूरवीर नहीं है\"। \"यदि एम्मा एक शूरवीर है तो माइकल एक शूरवीर है,\" यूसुफ ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक शूरवीर है  \n(2) लुकास एक शूरवीर है  \n(3) बेंजामिन एक धूर्त है  \n(4) क्लोई एक धूर्त है  \n(5) माइकल एक शूरवीर है  \n(6) याकूब एक धूर्त है  \n(7) एम्मा एक शूरवीर है  \n(8) यूसुफ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: एम्मा, एवा, सोफिया, लुकास, आरिया, पेनलोप, ऐडन, और यूसुफ। \"ऐडन एक शूरवीर है,\" एम्मा ने घोषणा की। एवा के शब्दों में: \"पेनलोप एक धूर्त है यदि और केवल यदि एम्मा एक शूरवीर है\"। सोफिया ने नोट किया, \"एवा एक शूरवीर है और पेनलोप एक धूर्त है\"। लुकास के एक बयान में: \"सोफिया एक शूरवीर नहीं है\"। आरिया ने कहा कि यदि ऐडन एक धूर्त है तो लुकास एक शूरवीर है। \"आरिया एक धूर्त है,\" पेनलोप ने उल्लेख किया। \"यदि एम्मा एक धूर्त है तो पेनलोप एक धूर्त है,\" ऐडन ने दावा किया। \"एवा एक धूर्त है और सोफिया एक शूरवीर है,\" यूसुफ ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एम्मा एक शूरवीर है  \n(2) एवा एक शूरवीर है  \n(3) सोफिया एक शूरवीर है  \n(4) लुकास एक धूर्त है  \n(5) आरिया एक शूरवीर है  \n(6) पेनलोप एक धूर्त है  \n(7) ऐडन एक शूरवीर है  \n(8) यूसुफ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ल्यूक, आरिया, एम्मा, लियम, सोफिया, ग्रेस, ऐडन, और ओलिवर। ल्यूक के अनुसार, \"अगर सोफिया एक शूरवीर है तो एम्मा एक शूरवीर है\"। आरिया ने कहा कि ऐडन एक धूर्त है और लियम एक शूरवीर है। एम्मा ने कहा: \"ल्यूक एक धूर्त नहीं है\"। \"आरिया एक धूर्त है या सोफिया एक शूरवीर है,\" लियम ने कहा। सोफिया के अनुसार, \"लियम एक शूरवीर है यदि और केवल यदि ओलिवर एक धूर्त है\"। ग्रेस ने कहा: \"ग्रेस एक शूरवीर है और ओलिवर एक धूर्त है\"। ऐडन ने नोट किया, \"लियम एक शूरवीर है या ग्रेस एक धूर्त है\"। ओलिवर को यह कहते हुए सुना गया, \"लियम एक शूरवीर है या ल्यूक एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) आरिया एक धूर्त है  \n(3) एम्मा एक शूरवीर है  \n(4) लियम एक शूरवीर है  \n(5) सोफिया एक धूर्त है  \n(6) ग्रेस एक धूर्त है  \n(7) ऐडन एक शूरवीर है  \n(8) ओलिवर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 8 निवासियों से मिलते हैं: ओलिविया, जेम्स, यूसुफ, सैमुएल, सोफिया, ईथन, एमिली, और जैक्सन। ओलिविया के एक बयान में: \"एमिली एक धूर्त नहीं है\"। जेम्स ने कहा: \"एमिली एक शूरवीर है और सैमुएल एक शूरवीर है\"। यूसुफ ने कहा कि सैमुएल एक शूरवीर है या एमिली एक धूर्त है। सैमुएल को यह कहते हुए सुना गया, \"जेम्स एक धूर्त है\"। सोफिया को यह कहते हुए सुना गया, \"ओलिविया एक धूर्त है और एमिली एक धूर्त है\"। ईथन ने कहा कि एमिली एक धूर्त है यदि और केवल यदि सैमुएल एक धूर्त है। एमिली ने कहा कि यूसुफ एक धूर्त है और सैमुएल एक शूरवीर है। जैक्सन के अनुसार, \"यदि जैक्सन एक शूरवीर है तो यूसुफ एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिविया एक धूर्त है  \n(2) जेम्स एक धूर्त है  \n(3) यूसुफ एक शूरवीर है  \n(4) सैमुएल एक शूरवीर है  \n(5) सोफिया एक शूरवीर है  \n(6) ईथन एक धूर्त है  \n(7) एमिली एक धूर्त है  \n(8) जैक्सन एक शूरवीर है"
    }
]