[
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: अलेक्जेंडर, ईथन, एलिज़ाबेथ, ल्यूक, नूह, और मैथ्यू। अलेक्जेंडर के अनुसार, \"नूह एक धूर्त है\"। ईथन ने आपको बताया कि अगर ल्यूक एक धूर्त है तो मैथ्यू एक धूर्त है। एलिज़ाबेथ ने कहा कि नूह एक शूरवीर है यदि और केवल यदि मैथ्यू एक धूर्त है। \"नूह एक शूरवीर नहीं है,\" ल्यूक ने उल्लेख किया। नूह के एक बयान में: \"मैथ्यू एक धूर्त नहीं है\"। मैथ्यू को यह कहते सुना गया, \"अलेक्जेंडर एक शूरवीर है या ल्यूक एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अलेक्जेंडर एक धूर्त है  \n(2) ईथन एक धूर्त है  \n(3) एलिज़ाबेथ एक धूर्त है  \n(4) ल्यूक एक धूर्त है  \n(5) नूह एक शूरवीर है  \n(6) मैथ्यू एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: राइली, मेसन, सोफिया, अबिगेल, डैनियल, और माइकल। \"सोफिया एक शूरवीर है,\" राइली ने दावा किया। मेसन के एक बयान में: \"डैनियल एक धूर्त है या माइकल एक शूरवीर है\"। जैसा कि सोफिया ने कहा, \"मेसन एक शूरवीर है यदि और केवल यदि मेसन एक धूर्त है\"। अबिगेल ने कहा कि डैनियल एक शूरवीर है या राइली एक धूर्त है। डैनियल ने asserted किया: \"राइली एक शूरवीर है\"। माइकल ने व्यक्त किया कि राइली एक धूर्त है यदि और केवल यदि अबिगेल एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक धूर्त है  \n(2) मेसन एक शूरवीर है  \n(3) सोफिया एक धूर्त है  \n(4) अबिगेल एक शूरवीर है  \n(5) डैनियल एक धूर्त है  \n(6) माइकल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा आबाद है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: अमेलिया, ओलिवर, लुकास, बेंजामिन, माइकल, और लोगन। अमेलिया ने कहा, \"माइकल एक शूरवीर है यदि और केवल यदि लोगन एक शूरवीर है\"। ओलिवर ने कहा, \"अमेलिया एक धूर्त है या माइकल एक धूर्त है\"। लुकास ने आपको बताया कि माइकल एक धूर्त नहीं है। \"लुकास एक धूर्त है और अमेलिया एक धूर्त है\" - बेंजामिन। \"बेंजामिन एक धूर्त है या बेंजामिन एक शूरवीर है,\" माइकल ने दावा किया। लोगन को यह कहते सुना गया, \"अमेलिया एक शूरवीर है और बेंजामिन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक धूर्त है  \n(2) ओलिवर एक शूरवीर है  \n(3) लुकास एक शूरवीर है  \n(4) बेंजामिन एक धूर्त है  \n(5) माइकल एक शूरवीर है  \n(6) लोगन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: विलियम, याकूब, औरोरा, मैथ्यू, लोगन, और ग्रेस। विलियम ने कहा, \"याकूब एक शूरवीर है या लोगन एक शूरवीर है।\" याकूब ने आपको बताया कि विलियम एक शूरवीर है यदि और केवल यदि मैथ्यू एक शूरवीर है। औरोरा ने कहा, \"यदि याकूब एक शूरवीर है तो ग्रेस एक शूरवीर है।\" मैथ्यू ने कहा, \"याकूब एक धूर्त है या ग्रेस एक धूर्त है।\" लोगन ने कहा, \"यदि विलियम एक धूर्त है तो याकूब एक शूरवीर है।\" ग्रेस के अनुसार, \"लोगन एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक धूर्त है  \n(2) याकूब एक धूर्त है  \n(3) औरोरा एक शूरवीर है  \n(4) मैथ्यू एक शूरवीर है  \n(5) लोगन एक धूर्त है  \n(6) ग्रेस एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: हेनरी, लुकास, पेनलोप, ग्रेस, एला, और अलेक्जेंडर। जैसा कि हेनरी ने कहा, \"पेनलोप एक शूरवीर है या एला एक धूर्त है\"। \"हेनरी एक धूर्त नहीं है,\" लुकास ने घोषित किया। पेनलोप ने asserted किया: \"यदि अलेक्जेंडर एक शूरवीर है तो एला एक शूरवीर है\"। ग्रेस के शब्दों में: \"लुकास एक शूरवीर है\"। \"लुकास एक शूरवीर है यदि और केवल यदि ग्रेस एक धूर्त है\" - एला। अलेक्जेंडर को यह कहते हुए सुना गया, \"हेनरी एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हेनरी एक शूरवीर है  \n(2) लुकास एक शूरवीर है  \n(3) पेनलोप एक शूरवीर है  \n(4) ग्रेस एक शूरवीर है  \n(5) एला एक धूर्त है  \n(6) अलेक्जेंडर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप पर केवल शूरवीर और धूर्त रहते हैं। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: बेंजामिन, ज़ोई, सैमुएल, मैथ्यू, क्लोई, और डेविड। बेंजामिन को यह कहते हुए सुना गया, \"ज़ोई एक शूरवीर है यदि और केवल यदि क्लोई एक धूर्त है।\" ज़ोई ने घोषणा की, \"सैमुएल एक शूरवीर नहीं है।\" सैमुएल ने कहा, \"सैमुएल एक शूरवीर है यदि और केवल यदि क्लोई एक धूर्त है।\" मैथ्यू ने कहा कि यदि सैमुएल एक धूर्त है तो क्लोई एक धूर्त है। क्लोई ने कहा, \"मैथ्यू एक शूरवीर है यदि और केवल यदि बेंजामिन एक शूरवीर है।\" डेविड ने टिप्पणी की, \"बेंजामिन एक शूरवीर है और क्लोई एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक धूर्त है  \n(2) ज़ोई एक धूर्त है  \n(3) सैमुएल एक शूरवीर है  \n(4) मैथ्यू एक शूरवीर है  \n(5) क्लोई एक धूर्त है  \n(6) डेविड एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: डैनियल, माइकल, मेसन, मैथ्यू, बेंजामिन, और लियम। \"बेंजामिन धूर्त नहीं है\" - डैनियल। माइकल ने कहा, \"अगर मैथ्यू धूर्त है तो मेसन धूर्त है।\" \"माइकल शूरवीर है\" - मेसन। \"डैनियल शूरवीर नहीं है,\" मैथ्यू ने घोषणा की। \"मेसन धूर्त है और मेसन शूरवीर है,\" बेंजामिन ने उल्लेख किया। लियम ने कहा कि मेसन धूर्त है और डैनियल धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक धूर्त है  \n(2) माइकल एक शूरवीर है  \n(3) मेसन एक शूरवीर है  \n(4) मैथ्यू एक शूरवीर है  \n(5) बेंजामिन एक धूर्त है  \n(6) लियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ईथन, अबिगेल, हार्पर, स्कारलेट, एवा, और ओलिवर। ईथन के अनुसार, \"अगर ओलिवर एक धूर्त है तो हार्पर एक शूरवीर है\"। \"स्कारलेट एक धूर्त है यदि और केवल यदि ईथन एक धूर्त है,\" अबिगेल ने दावा किया। हार्पर ने आपको बताया कि अबिगेल एक धूर्त है। स्कारलेट ने नोट किया, \"ईथन एक शूरवीर नहीं है\"। \"ईथन एक धूर्त है या हार्पर एक धूर्त है,\" एवा ने उल्लेख किया। ओलिवर के शब्दों में: \"अबिगेल एक शूरवीर है यदि और केवल यदि एवा एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक शूरवीर है  \n(2) अबिगेल एक धूर्त है  \n(3) हार्पर एक शूरवीर है  \n(4) स्कारलेट एक धूर्त है  \n(5) एवा एक धूर्त है  \n(6) ओलिवर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एवलिन, जैक, मेसन, औरोरा, जैक्सन, और जेम्स। एवलिन ने कहा कि मेसन एक शूरवीर नहीं है। जैक के शब्दों में: \"औरोरा एक शूरवीर है या जेम्स एक शूरवीर है\"। मेसन ने टिप्पणी की, \"जेम्स एक शूरवीर है और औरोरा एक धूर्त है\"। औरोरा के एक बयान में: \"एवलिन एक धूर्त है यदि और केवल यदि जैक्सन एक धूर्त है\"। जैक्सन ने टिप्पणी की, \"औरोरा एक धूर्त है\"। जैसे जेम्स ने कहा, \"मेसन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक धूर्त है  \n(2) जैक एक शूरवीर है  \n(3) मेसन एक शूरवीर है  \n(4) औरोरा एक धूर्त है  \n(5) जैक्सन एक शूरवीर है  \n(6) जेम्स एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: हार्पर, यूसुफ, मैथ्यू, क्लोई, एवरी, और ईथन। \"अगर एवरी एक शूरवीर है तो यूसुफ एक शूरवीर है,\" हार्पर ने घोषणा की। यूसुफ को यह कहते हुए सुना गया, \"ईथन एक शूरवीर है\"। \"अगर हार्पर एक धूर्त है तो मैथ्यू एक शूरवीर है,\" मैथ्यू ने कहा। क्लोई ने टिप्पणी की, \"मैथ्यू एक शूरवीर है और ईथन एक शूरवीर है\"। एवरी के एक बयान में: \"क्लोई एक शूरवीर नहीं है\"। ईथन को यह कहते हुए सुना गया, \"क्लोई एक धूर्त है या हार्पर एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक शूरवीर है  \n(2) यूसुफ एक शूरवीर है  \n(3) मैथ्यू एक शूरवीर है  \n(4) क्लोई एक शूरवीर है  \n(5) एवरी एक धूर्त है  \n(6) ईथन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: सोफिया, ज़ोई, लियम, अबिगेल, आरिया, और शार्लट। सोफिया के अनुसार, \"लियम एक धूर्त है या ज़ोई एक धूर्त है\"। ज़ोई ने आपको बताया कि अबिगेल एक शूरवीर नहीं है। लियम के शब्दों में: \"सोफिया एक धूर्त नहीं है\"। अबिगेल ने कहा, \"लियम एक शूरवीर है\"। \"लियम एक धूर्त है यदि और केवल यदि लियम एक शूरवीर है\" - आरिया। जैसे शार्लट ने कहा, \"अबिगेल एक शूरवीर है यदि और केवल यदि सोफिया एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) ज़ोई एक धूर्त है  \n(3) लियम एक शूरवीर है  \n(4) अबिगेल एक शूरवीर है  \n(5) आरिया एक धूर्त है  \n(6) शार्लट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: जैक्सन, सैमुएल, सोफिया, एवरी, डैनियल, और ओवेन। जैक्सन ने कहा: \"एवरी एक धूर्त है यदि और केवल यदि सैमुएल एक शूरवीर है\"। \"यदि सोफिया एक धूर्त है तो डैनियल एक शूरवीर है,\" सैमुएल ने घोषणा की। सोफिया ने कहा कि सैमुएल एक शूरवीर नहीं है। एवरी ने कहा कि डैनियल एक धूर्त है यदि और केवल यदि सोफिया एक धूर्त है। डैनियल के शब्दों में: \"एवरी एक धूर्त है या जैक्सन एक धूर्त है\"। ओवेन ने आपको बताया कि जैक्सन एक शूरवीर नहीं है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक शूरवीर है  \n(2) सैमुएल एक शूरवीर है  \n(3) सोफिया एक धूर्त है  \n(4) एवरी एक धूर्त है  \n(5) डैनियल एक शूरवीर है  \n(6) ओवेन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: मैथ्यू, अबिगेल, एलिज़ाबेथ, डैनियल, लुकास, और आरिया। मैथ्यू के शब्दों में: \"यदि आरिया एक शूरवीर है तो लुकास एक धूर्त है।\" अबिगेल ने कहा, \"एलिज़ाबेथ एक धूर्त है यदि और केवल यदि मैथ्यू एक शूरवीर है।\" एलिज़ाबेथ ने कहा: \"मैथ्यू एक शूरवीर नहीं है।\" डैनियल ने आपको बताया कि लुकास एक धूर्त है या अबिगेल एक शूरवीर है। लुकास ने कहा, \"मैथ्यू एक शूरवीर है और लुकास एक शूरवीर है।\" आरिया के अनुसार, \"डैनियल एक शूरवीर है यदि और केवल यदि एलिज़ाबेथ एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक शूरवीर है  \n(2) अबिगेल एक शूरवीर है  \n(3) एलिज़ाबेथ एक धूर्त है  \n(4) डैनियल एक शूरवीर है  \n(5) लुकास एक धूर्त है  \n(6) आरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ग्रेस, सोफिया, जेम्स, नूह, अलेक्जेंडर, और डेविड। ग्रेस के अनुसार, \"जेम्स एक शूरवीर है या डेविड एक धूर्त है\"। \"अलेक्जेंडर एक शूरवीर नहीं है,\" सोफिया ने घोषणा की। \"ग्रेस एक धूर्त है और डेविड एक शूरवीर है,\" जेम्स ने घोषणा की। नूह ने कहा, \"ग्रेस एक धूर्त नहीं है\"। \"नूह एक शूरवीर है और ग्रेस एक धूर्त है\" - अलेक्जेंडर। \"सोफिया एक धूर्त है,\" डेविड ने उल्लेख किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक शूरवीर है  \n(2) सोफिया एक शूरवीर है  \n(3) जेम्स एक धूर्त है  \n(4) नूह एक शूरवीर है  \n(5) अलेक्जेंडर एक धूर्त है  \n(6) डेविड एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ल्यूक, सोफिया, राइली, क्लोई, विलियम, और एवलिन। \"राइली एक शूरवीर है यदि और केवल यदि विलियम एक धूर्त है,\" ल्यूक ने दावा किया। सोफिया के अनुसार, \"क्लोई एक धूर्त नहीं है\"। राइली के शब्दों में: \"राइली एक शूरवीर है यदि और केवल यदि क्लोई एक धूर्त है\"। क्लोई के शब्दों में: \"एवलिन एक शूरवीर नहीं है\"। विलियम ने नोट किया, \"एवलिन एक धूर्त है\"। एवलिन ने नोट किया, \"एवलिन एक शूरवीर है यदि और केवल यदि ल्यूक एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक धूर्त है  \n(2) सोफिया एक धूर्त है  \n(3) राइली एक धूर्त है  \n(4) क्लोई एक धूर्त है  \n(5) विलियम एक धूर्त है  \n(6) एवलिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: पेनलोप, जैक्सन, एवरी, विक्टोरिया, शार्लट, और औरोरा। पेनलोप ने कहा, \"विक्टोरिया एक शूरवीर है या जैक्सन एक धूर्त है\"। \"अगर एवरी एक शूरवीर है तो औरोरा एक धूर्त है\" - जैक्सन। एवरी के अनुसार, \"पेनलोप एक शूरवीर है यदि और केवल यदि औरोरा एक धूर्त है\"। विक्टोरिया ने कहा, \"विक्टोरिया एक शूरवीर है\"। शार्लट ने कहा, \"एवरी एक धूर्त है यदि और केवल यदि पेनलोप एक धूर्त है\"। जैसे औरोरा ने कहा, \"एवरी एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक धूर्त है  \n(2) जैक्सन एक शूरवीर है  \n(3) एवरी एक धूर्त है  \n(4) विक्टोरिया एक धूर्त है  \n(5) शार्लट एक शूरवीर है  \n(6) औरोरा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: डैनियल, ग्रेस, पेनलोप, राइली, लियम, और बेंजामिन। डैनियल के एक बयान में: \"राइली एक धूर्त है या राइली एक शूरवीर है\"। \"पेनलोप एक धूर्त नहीं है,\" ग्रेस ने घोषणा की। पेनलोप के अनुसार, \"राइली एक धूर्त है और राइली एक शूरवीर है\"। राइली ने नोट किया, \"पेनलोप एक शूरवीर है और बेंजामिन एक धूर्त है\"। लियम ने कहा कि अगर ग्रेस एक धूर्त है तो डैनियल एक शूरवीर है। बेंजामिन ने कहा, \"लियम एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक शूरवीर है  \n(2) ग्रेस एक धूर्त है  \n(3) पेनलोप एक धूर्त है  \n(4) राइली एक धूर्त है  \n(5) लियम एक शूरवीर है  \n(6) बेंजामिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: शार्लट, जैक्सन, एवलिन, ऐडन, एमिली, और अमेलिया। शार्लट ने कहा, \"एवलिन शूरवीर नहीं है\"। \"शार्लट धूर्त है या एवलिन शूरवीर है,\" जैक्सन ने दावा किया। एवलिन ने कहा कि अगर जैक्सन धूर्त है तो शार्लट शूरवीर है। ऐडन ने कहा कि ऐडन शूरवीर है और जैक्सन धूर्त है। \"शार्लट धूर्त नहीं है\" - एमिली। अमेलिया ने आपको बताया कि एमिली शूरवीर है और अमेलिया शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक धूर्त है  \n(2) जैक्सन एक शूरवीर है  \n(3) एवलिन एक शूरवीर है  \n(4) ऐडन एक धूर्त है  \n(5) एमिली एक धूर्त है  \n(6) अमेलिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: जैक्सन, ज़ोई, एमिली, पेनलोप, शार्लट, और सैमुएल। \"पेनलोप एक शूरवीर नहीं है\" - जैक्सन। ज़ोई ने कहा: \"एमिली एक धूर्त है\"। एमिली के अनुसार, \"पेनलोप एक शूरवीर है\"। पेनलोप ने आपको बताया कि जैक्सन एक धूर्त है या शार्लट एक धूर्त है। शार्लट ने कहा, \"जैक्सन एक शूरवीर है यदि और केवल यदि एमिली एक शूरवीर है\"। सैमुएल ने कहा, \"जैक्सन एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक धूर्त है  \n(2) ज़ोई एक धूर्त है  \n(3) एमिली एक शूरवीर है  \n(4) पेनलोप एक शूरवीर है  \n(5) शार्लट एक धूर्त है  \n(6) सैमुएल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: माइकल, अबिगेल, जेम्स, नूह, एवा, और ओवेन। माइकल ने कहा, \"अगर एवा एक शूरवीर है तो जेम्स एक धूर्त है।\" अबिगेल ने कहा: \"ओवेन एक धूर्त है यदि और केवल यदि एवा एक धूर्त है।\" जेम्स के अनुसार, \"माइकल एक शूरवीर नहीं है।\" \"जेम्स एक धूर्त है या एवा एक धूर्त है\" - नूह। एवा ने कहा कि माइकल एक शूरवीर है यदि और केवल यदि माइकल एक धूर्त है। ओवेन ने टिप्पणी की, \"माइकल एक शूरवीर नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक शूरवीर है  \n(2) अबिगेल एक शूरवीर है  \n(3) जेम्स एक धूर्त है  \n(4) नूह एक शूरवीर है  \n(5) एवा एक धूर्त है  \n(6) ओवेन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ल्यूक, ओवेन, हेनरी, एमिली, मेसन, और पेनलोप। ल्यूक के शब्दों में: \"एमिली एक धूर्त है या ओवेन एक धूर्त है\"। \"मेसन एक शूरवीर है यदि और केवल यदि ल्यूक एक शूरवीर है\" - ओवेन। हेनरी के अनुसार, \"मेसन एक धूर्त है\"। एमिली के अनुसार, \"मेसन एक शूरवीर है यदि और केवल यदि मेसन एक धूर्त है\"। मेसन ने कहा, \"ल्यूक एक शूरवीर है और एमिली एक शूरवीर है\"। पेनलोप ने कहा, \"ल्यूक एक शूरवीर है या पेनलोप एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) ओवेन एक धूर्त है  \n(3) हेनरी एक शूरवीर है  \n(4) एमिली एक धूर्त है  \n(5) मेसन एक धूर्त है  \n(6) पेनलोप एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ल्यूक, राइली, अलेक्जेंडर, जेम्स, लुकास, और माइकल। \"अलेक्जेंडर एक धूर्त है,\" ल्यूक ने दावा किया। राइली के शब्दों में: \"जेम्स एक शूरवीर है\"। अलेक्जेंडर ने कहा, \"राइली एक शूरवीर है यदि और केवल यदि राइली एक धूर्त है।\" जेम्स ने कहा कि माइकल एक शूरवीर है। लुकास ने asserted: \"राइली एक धूर्त है और माइकल एक शूरवीर है\"। माइकल के एक बयान में: \"जेम्स एक धूर्त है यदि और केवल यदि राइली एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) राइली एक शूरवीर है  \n(3) अलेक्जेंडर एक धूर्त है  \n(4) जेम्स एक शूरवीर है  \n(5) लुकास एक धूर्त है  \n(6) माइकल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: डेविड, हेनरी, अबिगेल, अमेलिया, सोफिया, और याकूब। डेविड ने कहा, \"हेनरी एक शूरवीर है और अमेलिया एक धूर्त है\"। हेनरी ने कहा, \"सोफिया एक शूरवीर है और अबिगेल एक धूर्त है\"। अबिगेल के अनुसार, \"हेनरी एक शूरवीर है और सोफिया एक शूरवीर है\"। \"हेनरी एक शूरवीर नहीं है,\" अमेलिया ने दावा किया। \"अगर हेनरी एक धूर्त है तो डेविड एक शूरवीर है,\" सोफिया ने कहा। \"अगर याकूब एक शूरवीर है तो सोफिया एक धूर्त है,\" याकूब ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक धूर्त है  \n(2) हेनरी एक धूर्त है  \n(3) अबिगेल एक धूर्त है  \n(4) अमेलिया एक शूरवीर है  \n(5) सोफिया एक धूर्त है  \n(6) याकूब एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: माइकल, हेनरी, विलियम, सोफिया, एवलिन, और जेम्स। माइकल के एक बयान में: \"अगर सोफिया एक शूरवीर है तो एवलिन एक धूर्त है।\" हेनरी के शब्दों में: \"माइकल एक शूरवीर नहीं है।\" विलियम ने कहा कि एवलिन एक शूरवीर है या विलियम एक शूरवीर है। सोफिया ने कहा, \"माइकल एक धूर्त है और हेनरी एक धूर्त है।\" \"माइकल एक शूरवीर है,\" एवलिन ने घोषणा की। जेम्स ने कहा, \"सोफिया एक धूर्त नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक शूरवीर है  \n(2) हेनरी एक धूर्त है  \n(3) विलियम एक शूरवीर है  \n(4) सोफिया एक धूर्त है  \n(5) एवलिन एक शूरवीर है  \n(6) जेम्स एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: पेनलोप, डेविड, जेम्स, मिया, नूह, और स्कारलेट। पेनलोप ने कहा, \"जेम्स एक शूरवीर है या स्कारलेट एक धूर्त है\"। \"अगर नूह एक शूरवीर है तो पेनलोप एक शूरवीर है,\" डेविड ने कहा। \"अगर मिया एक शूरवीर है तो पेनलोप एक धूर्त है\" - जेम्स। मिया ने कहा, \"नूह एक धूर्त नहीं है\"। \"स्कारलेट एक धूर्त है और मिया एक धूर्त है,\" नूह ने घोषित किया। स्कारलेट के एक बयान में: \"मिया एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक शूरवीर है  \n(2) डेविड एक शूरवीर है  \n(3) जेम्स एक शूरवीर है  \n(4) मिया एक धूर्त है  \n(5) नूह एक धूर्त है  \n(6) स्कारलेट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: यूसुफ, इसाबेला, एला, डैनियल, लोगन, और जेम्स। यूसुफ ने टिप्पणी की, \"डैनियल एक धूर्त है या लोगन एक धूर्त है\"। इसाबेला के एक बयान में: \"डैनियल एक धूर्त है\"। एला के अनुसार, \"लोगन एक धूर्त है यदि और केवल यदि लोगन एक शूरवीर है\"। डैनियल के एक बयान में: \"लोगन एक धूर्त है और एला एक शूरवीर है\"। लोगन के शब्दों में: \"डैनियल एक शूरवीर है\"। जेम्स ने कहा, \"यदि यूसुफ एक शूरवीर है तो लोगन एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) यूसुफ एक शूरवीर है  \n(2) इसाबेला एक शूरवीर है  \n(3) एला एक धूर्त है  \n(4) डैनियल एक धूर्त है  \n(5) लोगन एक धूर्त है  \n(6) जेम्स एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: जैक, लुकास, मेसन, ईथन, अमेलिया, और लियम। जैक के एक बयान में: \"मेसन शूरवीर नहीं है\"। लुकास के बयान में: \"लियम शूरवीर है या जैक शूरवीर है\"। मेसन के शब्दों में: \"अमेलिया शूरवीर है\"। \"अगर लियम शूरवीर है तो अमेलिया शूरवीर है,\" ईथन ने घोषणा की। अमेलिया को यह कहते हुए सुना गया, \"मेसन शूरवीर है यदि और केवल यदि जैक धूर्त है\"। लियम ने कहा, \"मेसन शूरवीर है यदि और केवल यदि जैक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक एक धूर्त है  \n(2) लुकास एक धूर्त है  \n(3) मेसन एक शूरवीर है  \n(4) ईथन एक शूरवीर है  \n(5) अमेलिया एक शूरवीर है  \n(6) लियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: हेनरी, जैक्सन, एमिली, डैनियल, माइकल, और मैथ्यू। हेनरी ने टिप्पणी की, \"जैक्सन एक शूरवीर है\"। जैक्सन को यह कहते हुए सुना गया, \"एमिली एक शूरवीर नहीं है\"। एमिली ने कहा, \"अगर मैथ्यू एक धूर्त है तो मैथ्यू एक शूरवीर है\"। डैनियल ने व्यक्त किया कि हेनरी एक शूरवीर है और माइकल एक शूरवीर है। माइकल ने asserted किया: \"माइकल एक शूरवीर है और डैनियल एक शूरवीर है\"। मैथ्यू के एक बयान में: \"डैनियल एक शूरवीर है और एमिली एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) हेनरी एक शूरवीर है  \n(2) जैक्सन एक शूरवीर है  \n(3) एमिली एक धूर्त है  \n(4) डैनियल एक धूर्त है  \n(5) माइकल एक धूर्त है  \n(6) मैथ्यू एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एवा, हार्पर, याकूब, शार्लट, एला, और नूह। एवा को यह कहते हुए सुना गया, \"शार्लट एक धूर्त है या याकूब एक धूर्त है।\" \"याकूब एक शूरवीर है या शार्लट एक धूर्त है,\" हार्पर ने कहा। \"एला एक शूरवीर है और शार्लट एक शूरवीर है,\" याकूब ने दावा किया। शार्लट के एक बयान में: \"एवा एक शूरवीर नहीं है।\" एला ने नोट किया, \"एवा एक शूरवीर है और हार्पर एक शूरवीर है।\" नूह ने asserted किया: \"अगर एवा एक धूर्त है तो याकूब एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक शूरवीर है  \n(2) हार्पर एक शूरवीर है  \n(3) याकूब एक धूर्त है  \n(4) शार्लट एक धूर्त है  \n(5) एला एक शूरवीर है  \n(6) नूह एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: इसाबेला, लियम, एमिली, अबिगेल, क्लोई, और सोफिया। इसाबेला ने कहा, \"अबिगेल धूर्त नहीं है\"। लियम के अनुसार, \"अबिगेल शूरवीर है या अबिगेल धूर्त है\"। एमिली ने कहा: \"अबिगेल शूरवीर है या अबिगेल धूर्त है\"। अबिगेल ने कहा, \"अगर एमिली धूर्त है तो क्लोई धूर्त है।\" क्लोई के एक बयान में: \"लियम धूर्त नहीं है\"। सोफिया ने कहा, \"इसाबेला शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक शूरवीर है  \n(2) लियम एक शूरवीर है  \n(3) एमिली एक शूरवीर है  \n(4) अबिगेल एक शूरवीर है  \n(5) क्लोई एक शूरवीर है  \n(6) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: विक्टोरिया, ग्रेस, जैक्सन, लियम, हेनरी, और यूसुफ। \"लियम धूर्त नहीं है,\" विक्टोरिया ने दावा किया। ग्रेस ने नोट किया, \"अगर हेनरी शूरवीर है तो विक्टोरिया शूरवीर है।\" जैक्सन ने asserted किया: \"अगर विक्टोरिया धूर्त है तो हेनरी धूर्त है।\" लियम ने कहा, \"यूसुफ शूरवीर है।\" \"जैक्सन शूरवीर नहीं है,\" हेनरी ने दावा किया। यूसुफ ने कहा कि लियम धूर्त है या ग्रेस शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विक्टोरिया एक शूरवीर है  \n(2) ग्रेस एक शूरवीर है  \n(3) जैक्सन एक शूरवीर है  \n(4) लियम एक शूरवीर है  \n(5) हेनरी एक धूर्त है  \n(6) यूसुफ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: याकूब, आरिया, अलेक्जेंडर, इसाबेला, ओलिविया, और बेंजामिन। याकूब के शब्दों में: \"ओलिविया एक शूरवीर है और ओलिविया एक धूर्त है\"। \"अगर बेंजामिन एक धूर्त है तो ओलिविया एक शूरवीर है,\" आरिया ने कहा। \"बेंजामिन एक धूर्त है यदि और केवल यदि अलेक्जेंडर एक शूरवीर है,\" अलेक्जेंडर ने कहा। इसाबेला ने कहा: \"अलेक्जेंडर एक धूर्त है\"। ओलिविया ने कहा कि अगर अलेक्जेंडर एक धूर्त है तो याकूब एक धूर्त है। बेंजामिन ने कहा: \"अगर इसाबेला एक धूर्त है तो इसाबेला एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) याकूब एक धूर्त है  \n(2) आरिया एक शूरवीर है  \n(3) अलेक्जेंडर एक शूरवीर है  \n(4) इसाबेला एक धूर्त है  \n(5) ओलिविया एक शूरवीर है  \n(6) बेंजामिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: अबिगेल, विलियम, एवलिन, सैमुएल, विक्टोरिया, और सोफिया। अबिगेल ने टिप्पणी की, \"विक्टोरिया एक धूर्त है यदि और केवल यदि विक्टोरिया एक शूरवीर है\"। विलियम ने asserted किया: \"सोफिया एक धूर्त है\"। एवलिन ने व्यक्त किया कि विक्टोरिया एक धूर्त है यदि और केवल यदि सैमुएल एक धूर्त है। सैमुएल ने कहा, \"एवलिन एक धूर्त है और विलियम एक शूरवीर है।\" विक्टोरिया ने कहा, \"सैमुएल एक धूर्त है और विक्टोरिया एक शूरवीर है\"। सोफिया ने remarked किया, \"एवलिन एक धूर्त है या विलियम एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अबिगेल एक धूर्त है  \n(2) विलियम एक धूर्त है  \n(3) एवलिन एक धूर्त है  \n(4) सैमुएल एक धूर्त है  \n(5) विक्टोरिया एक शूरवीर है  \n(6) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ल्यूक, सेबेस्टियन, यूसुफ, लिली, स्कारलेट, और जेम्स। \"अगर जेम्स एक धूर्त है तो यूसुफ एक शूरवीर है,\" ल्यूक ने कहा। सेबेस्टियन ने कहा कि लिली एक शूरवीर नहीं है। यूसुफ ने टिप्पणी की, \"अगर स्कारलेट एक धूर्त है तो लिली एक धूर्त है।\" लिली ने कहा, \"यूसुफ एक धूर्त है और ल्यूक एक शूरवीर है।\" स्कारलेट ने कहा, \"जेम्स एक धूर्त है और यूसुफ एक धूर्त है।\" \"स्कारलेट एक शूरवीर है और सेबेस्टियन एक शूरवीर है,\" जेम्स ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) सेबेस्टियन एक शूरवीर है  \n(3) यूसुफ एक शूरवीर है  \n(4) लिली एक धूर्त है  \n(5) स्कारलेट एक धूर्त है  \n(6) जेम्स एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ग्रेस, जैक, डैनियल, एवलिन, एला, और मिया। ग्रेस ने आपको बताया कि अगर एवलिन एक शूरवीर है तो एला एक धूर्त है। \"एला एक शूरवीर नहीं है,\" जैक ने दावा किया। डैनियल ने नोट किया, \"डैनियल एक शूरवीर है यदि और केवल यदि जैक एक धूर्त है।\" \"मिया एक धूर्त है यदि और केवल यदि मिया एक शूरवीर है,\" एवलिन ने दावा किया। \"डैनियल एक शूरवीर नहीं है,\" एला ने उल्लेख किया। मिया ने कहा, \"जैक एक धूर्त है या डैनियल एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक शूरवीर है  \n(2) जैक एक धूर्त है  \n(3) डैनियल एक धूर्त है  \n(4) एवलिन एक धूर्त है  \n(5) एला एक शूरवीर है  \n(6) मिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: लियम, यूसुफ, माइकल, याकूब, एलिज़ाबेथ, और मेसन। लियम ने कहा, \"यूसुफ एक शूरवीर है और माइकल एक शूरवीर है\"। \"अगर लियम एक धूर्त है तो लियम एक शूरवीर है,\" यूसुफ ने दावा किया। माइकल ने कहा, \"यूसुफ एक शूरवीर है यदि और केवल यदि याकूब एक धूर्त है\"। याकूब के शब्दों में: \"याकूब एक शूरवीर है यदि और केवल यदि माइकल एक धूर्त है\"। एलिज़ाबेथ ने कहा कि लियम एक शूरवीर नहीं है। \"यूसुफ एक शूरवीर है यदि और केवल यदि याकूब एक धूर्त है,\" मेसन ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक धूर्त है  \n(2) यूसुफ एक धूर्त है  \n(3) माइकल एक धूर्त है  \n(4) याकूब एक धूर्त है  \n(5) एलिज़ाबेथ एक शूरवीर है  \n(6) मेसन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: लियम, एवलिन, इसाबेला, जैक्सन, ऐडन, और सोफिया। लियम ने कहा कि एवलिन एक शूरवीर है। एवलिन ने remarked किया, \"एवलिन एक शूरवीर है और इसाबेला एक धूर्त है\"। जैसे इसाबेला ने कहा, \"अगर सोफिया एक धूर्त है तो लियम एक शूरवीर है\"। जैसे जैक्सन ने कहा, \"एवलिन एक धूर्त है और सोफिया एक शूरवीर है\"। ऐडन के शब्दों में: \"जैक्सन एक धूर्त है और एवलिन एक शूरवीर है\"। \"अगर लियम एक शूरवीर है तो जैक्सन एक शूरवीर है\" - सोफिया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक धूर्त है  \n(2) एवलिन एक धूर्त है  \n(3) इसाबेला एक शूरवीर है  \n(4) जैक्सन एक शूरवीर है  \n(5) ऐडन एक धूर्त है  \n(6) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: अलेक्जेंडर, राइली, एवा, शार्लट, अमेलिया, और ओलिविया। अलेक्जेंडर के अनुसार, \"अगर राइली एक धूर्त है तो अमेलिया एक धूर्त है\"। राइली ने कहा: \"एवा एक शूरवीर है यदि और केवल यदि शार्लट एक शूरवीर है\"। जैसा कि एवा ने कहा, \"शार्लट एक धूर्त नहीं है\"। शार्लट के एक बयान में: \"अमेलिया एक शूरवीर नहीं है\"। \"ओलिविया एक शूरवीर है या एवा एक धूर्त है,\" अमेलिया ने कहा। ओलिविया ने कहा: \"राइली एक धूर्त है या अलेक्जेंडर एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अलेक्जेंडर एक शूरवीर है  \n(2) राइली एक शूरवीर है  \n(3) एवा एक धूर्त है  \n(4) शार्लट एक धूर्त है  \n(5) अमेलिया एक शूरवीर है  \n(6) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ओवेन, ज़ोई, ग्रेस, लिली, लुकास, और सोफिया। \"अगर लिली एक धूर्त है तो लिली एक शूरवीर है,\" ओवेन ने घोषणा की। ज़ोई ने टिप्पणी की, \"लिली एक धूर्त है\"। ग्रेस के शब्दों में: \"लुकास एक धूर्त है या ज़ोई एक धूर्त है\"। \"लुकास एक धूर्त है यदि और केवल यदि लिली एक शूरवीर है,\" लिली ने कहा। लुकास ने टिप्पणी की, \"अगर ओवेन एक धूर्त है तो ओवेन एक शूरवीर है\"। सोफिया ने asserted किया: \"लिली एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओवेन एक धूर्त है  \n(2) ज़ोई एक शूरवीर है  \n(3) ग्रेस एक शूरवीर है  \n(4) लिली एक धूर्त है  \n(5) लुकास एक धूर्त है  \n(6) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: जेम्स, सोफिया, राइली, हेनरी, जैक्सन, और पेनलोप। जेम्स के शब्दों में: \"अगर सोफिया एक शूरवीर है तो राइली एक धूर्त है।\" \"पेनलोप एक शूरवीर नहीं है\" - सोफिया। \"जेम्स एक धूर्त नहीं है,\" राइली ने दावा किया। \"राइली एक शूरवीर है\" - हेनरी। \"हेनरी एक धूर्त है और सोफिया एक शूरवीर है\" - जैक्सन। पेनलोप ने कहा, \"सोफिया एक शूरवीर है यदि और केवल यदि राइली एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) सोफिया एक धूर्त है  \n(3) राइली एक शूरवीर है  \n(4) हेनरी एक शूरवीर है  \n(5) जैक्सन एक धूर्त है  \n(6) पेनलोप एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: स्कारलेट, इसाबेला, ऐडन, अलेक्जेंडर, विलियम, और यूसुफ। स्कारलेट के शब्दों में: \"अलेक्जेंडर एक शूरवीर है यदि और केवल यदि विलियम एक धूर्त है\"। \"विलियम एक धूर्त है यदि और केवल यदि विलियम एक शूरवीर है\" - इसाबेला। \"इसाबेला एक शूरवीर है,\" ऐडन ने दावा किया। अलेक्जेंडर के एक बयान में: \"स्कारलेट एक धूर्त है या विलियम एक धूर्त है\"। विलियम ने नोट किया, \"ऐडन एक धूर्त नहीं है\"। \"ऐडन एक शूरवीर नहीं है\" - यूसुफ। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) स्कारलेट एक शूरवीर है  \n(2) इसाबेला एक धूर्त है  \n(3) ऐडन एक धूर्त है  \n(4) अलेक्जेंडर एक शूरवीर है  \n(5) विलियम एक धूर्त है  \n(6) यूसुफ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: डैनियल, लिली, सोफिया, ल्यूक, नूह, और एवरी। डैनियल के एक बयान में: \"ल्यूक एक शूरवीर है या नूह एक धूर्त है\"। \"डैनियल एक धूर्त है या सोफिया एक धूर्त है,\" लिली ने घोषणा की। सोफिया ने कहा कि नूह एक शूरवीर है या ल्यूक एक शूरवीर है। ल्यूक ने नोट किया, \"एवरी एक शूरवीर है और नूह एक धूर्त है\"। नूह के शब्दों में: \"ल्यूक एक शूरवीर है\"। जैसे एवरी ने कहा, \"डैनियल एक धूर्त है या सोफिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक शूरवीर है  \n(2) लिली एक शूरवीर है  \n(3) सोफिया एक धूर्त है  \n(4) ल्यूक एक धूर्त है  \n(5) नूह एक धूर्त है  \n(6) एवरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: विक्टोरिया, हार्पर, अलेक्जेंडर, जेम्स, लिली, और ओलिवर। विक्टोरिया ने कहा, \"अलेक्जेंडर एक धूर्त है या जेम्स एक शूरवीर है\"। हार्पर के अनुसार, \"लिली एक धूर्त है\"। अलेक्जेंडर ने कहा, \"ओलिवर एक धूर्त है\"। जेम्स ने कहा, \"जेम्स एक शूरवीर है और ओलिवर एक शूरवीर है\"। \"ओलिवर एक शूरवीर है और विक्टोरिया एक धूर्त है\" - लिली। ओलिवर ने कहा कि अलेक्जेंडर एक शूरवीर है या जेम्स एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विक्टोरिया एक शूरवीर है  \n(2) हार्पर एक शूरवीर है  \n(3) अलेक्जेंडर एक धूर्त है  \n(4) जेम्स एक शूरवीर है  \n(5) लिली एक धूर्त है  \n(6) ओलिवर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: लियम, एला, सोफिया, ओवेन, माइकल, और मेसन। लियम के शब्दों में: \"सोफिया एक धूर्त है या लियम एक शूरवीर है\"। एला के शब्दों में: \"सोफिया एक शूरवीर है\"। सोफिया के अनुसार, \"लियम एक धूर्त नहीं है\"। ओवेन ने कहा: \"माइकल एक शूरवीर नहीं है\"। \"लियम एक धूर्त नहीं है\" - माइकल। मेसन ने कहा कि माइकल एक धूर्त है या माइकल एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लियम एक शूरवीर है  \n(2) एला एक शूरवीर है  \n(3) सोफिया एक शूरवीर है  \n(4) ओवेन एक धूर्त है  \n(5) माइकल एक शूरवीर है  \n(6) मेसन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ओलिवर, हेनरी, ओलिविया, ओवेन, सेबेस्टियन, और अमेलिया। ओलिवर के एक बयान में: \"ओलिविया एक धूर्त नहीं है\"। हेनरी ने कहा कि ओलिविया एक धूर्त है। \"अमेलिया एक धूर्त है और ओलिवर एक धूर्त है,\" ओलिविया ने कहा। ओवेन ने आपको बताया कि अमेलिया एक शूरवीर नहीं है। सेबेस्टियन ने कहा, \"ओवेन एक शूरवीर है यदि और केवल यदि ओलिविया एक शूरवीर है\"। अमेलिया ने कहा: \"अमेलिया एक शूरवीर है यदि और केवल यदि सेबेस्टियन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिवर एक धूर्त है  \n(2) हेनरी एक शूरवीर है  \n(3) ओलिविया एक धूर्त है  \n(4) ओवेन एक धूर्त है  \n(5) सेबेस्टियन एक शूरवीर है  \n(6) अमेलिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: अबिगेल, क्लोई, माइकल, डेविड, एवलिन, और सोफिया। अबिगेल ने कहा, \"डेविड एक धूर्त नहीं है\"। क्लोई के शब्दों में: \"अबिगेल एक शूरवीर है यदि और केवल यदि सोफिया एक शूरवीर है\"। माइकल ने टिप्पणी की, \"सोफिया एक शूरवीर है या क्लोई एक धूर्त है\"। \"क्लोई एक धूर्त नहीं है,\" डेविड ने दावा किया। एवलिन ने कहा, \"डेविड एक धूर्त है यदि और केवल यदि सोफिया एक धूर्त है।\" सोफिया के एक बयान में: \"डेविड एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अबिगेल एक धूर्त है  \n(2) क्लोई एक धूर्त है  \n(3) माइकल एक शूरवीर है  \n(4) डेविड एक धूर्त है  \n(5) एवलिन एक धूर्त है  \n(6) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ल्यूक, एमिली, अलेक्जेंडर, बेंजामिन, आरिया, और एवलिन। ल्यूक के एक बयान में: \"बेंजामिन एक शूरवीर है\"। एमिली को यह कहते हुए सुना गया, \"एवलिन एक शूरवीर है या अलेक्जेंडर एक धूर्त है\"। \"अगर ल्यूक एक शूरवीर है तो ल्यूक एक धूर्त है\" - अलेक्जेंडर। बेंजामिन के अनुसार, \"अगर ल्यूक एक शूरवीर है तो एमिली एक शूरवीर है\"। आरिया ने कहा कि ल्यूक एक धूर्त नहीं है। जैसे एवलिन ने कहा, \"एमिली एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) एमिली एक शूरवीर है  \n(3) अलेक्जेंडर एक धूर्त है  \n(4) बेंजामिन एक शूरवीर है  \n(5) आरिया एक शूरवीर है  \n(6) एवलिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ईथन, एला, क्लोई, आरिया, ओवेन, और शार्लट। ईथन ने कहा, \"आरिया एक शूरवीर है या ईथन एक शूरवीर है\"। एला को यह कहते हुए सुना गया, \"शार्लट एक धूर्त नहीं है\"। क्लोई ने कहा, \"ईथन एक शूरवीर है या आरिया एक शूरवीर है\"। आरिया के शब्दों में: \"क्लोई एक धूर्त है और एला एक धूर्त है\"। ओवेन के एक बयान में: \"क्लोई एक शूरवीर नहीं है\"। जैसे शार्लट ने कहा, \"क्लोई एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक शूरवीर है  \n(2) एला एक शूरवीर है  \n(3) क्लोई एक शूरवीर है  \n(4) आरिया एक धूर्त है  \n(5) ओवेन एक धूर्त है  \n(6) शार्लट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: औरोरा, विलियम, लियम, लोगन, ल्यूक, और पेनलोप। \"लियम धूर्त नहीं है,\" औरोरा ने दावा किया। विलियम ने आपको बताया कि लोगन धूर्त है या ल्यूक शूरवीर है। लियम ने कहा, \"ल्यूक धूर्त है या औरोरा धूर्त है।\" लोगन ने asserted किया: \"औरोरा शूरवीर है या लियम शूरवीर है।\" ल्यूक ने टिप्पणी की, \"ल्यूक शूरवीर है यदि और केवल यदि लियम शूरवीर है।\" पेनलोप के एक बयान में: \"लियम शूरवीर नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) औरोरा एक शूरवीर है  \n(2) विलियम एक धूर्त है  \n(3) लियम एक शूरवीर है  \n(4) लोगन एक शूरवीर है  \n(5) ल्यूक एक धूर्त है  \n(6) पेनलोप एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ग्रेस, शार्लट, जैक, सेबेस्टियन, अबिगेल, और मिया। ग्रेस के एक बयान में: \"अगर जैक एक धूर्त है तो अबिगेल एक धूर्त है\"। \"सेबेस्टियन एक धूर्त नहीं है,\" शार्लट ने उल्लेख किया। जैक ने कहा, \"मिया एक शूरवीर है\"। सेबेस्टियन ने कहा कि अबिगेल एक शूरवीर है यदि और केवल यदि ग्रेस एक शूरवीर है। अबिगेल ने टिप्पणी की, \"शार्लट एक धूर्त है या शार्लट एक शूरवीर है\"। मिया के अनुसार, \"अबिगेल एक शूरवीर है या ग्रेस एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक शूरवीर है  \n(2) शार्लट एक शूरवीर है  \n(3) जैक एक शूरवीर है  \n(4) सेबेस्टियन एक शूरवीर है  \n(5) अबिगेल एक शूरवीर है  \n(6) मिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ऐडन, बेंजामिन, लुकास, यूसुफ, आरिया, और जेम्स। ऐडन ने कहा, \"जेम्स एक शूरवीर है या बेंजामिन एक शूरवीर है\"। बेंजामिन ने कहा, \"ऐडन एक धूर्त है\"। लुकास ने कहा, \"जेम्स एक शूरवीर है या जेम्स एक धूर्त है\"। \"बेंजामिन एक धूर्त नहीं है\" - यूसुफ। आरिया को यह कहते हुए सुना गया, \"अगर लुकास एक शूरवीर है तो यूसुफ एक धूर्त है\"। जेम्स ने कहा, \"यूसुफ एक धूर्त है यदि और केवल यदि ऐडन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक शूरवीर है  \n(2) बेंजामिन एक धूर्त है  \n(3) लुकास एक शूरवीर है  \n(4) यूसुफ एक धूर्त है  \n(5) आरिया एक शूरवीर है  \n(6) जेम्स एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एवा, एमिली, ल्यूक, लुकास, हार्पर, और एला। एवा के शब्दों में: \"ल्यूक एक शूरवीर है यदि और केवल यदि एला एक धूर्त है\"। एमिली ने कहा, \"यदि एमिली एक शूरवीर है तो ल्यूक एक धूर्त है\"। ल्यूक ने asserted किया: \"एला एक शूरवीर है और एला एक धूर्त है\"। \"हार्पर एक धूर्त है और ल्यूक एक धूर्त है,\" लुकास ने दावा किया। जैसे हार्पर ने कहा, \"लुकास एक धूर्त है यदि और केवल यदि एवा एक शूरवीर है\"। एला को यह कहते हुए सुना गया, \"यदि एमिली एक शूरवीर है तो हार्पर एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक शूरवीर है  \n(2) एमिली एक शूरवीर है  \n(3) ल्यूक एक धूर्त है  \n(4) लुकास एक धूर्त है  \n(5) हार्पर एक शूरवीर है  \n(6) एला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: अबिगेल, लिली, एला, एमिली, सोफिया, और लोगन। अबिगेल ने कहा, \"सोफिया एक धूर्त नहीं है\"। लिली ने कहा कि एला एक शूरवीर है या लोगन एक शूरवीर है। \"सोफिया एक धूर्त है और सोफिया एक शूरवीर है,\" एला ने दावा किया। एमिली के शब्दों में: \"अबिगेल एक शूरवीर है\"। जैसा कि सोफिया ने कहा, \"अगर सोफिया एक शूरवीर है तो लिली एक शूरवीर है\"। जैसा कि लोगन ने कहा, \"सोफिया एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अबिगेल एक शूरवीर है  \n(2) लिली एक शूरवीर है  \n(3) एला एक धूर्त है  \n(4) एमिली एक शूरवीर है  \n(5) सोफिया एक शूरवीर है  \n(6) लोगन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एम्मा, एवरी, विलियम, मैथ्यू, स्कारलेट, और ईथन। एम्मा ने टिप्पणी की, \"एम्मा एक शूरवीर है या विलियम एक शूरवीर है\"। जैसे एवरी ने कहा, \"एम्मा एक धूर्त है और विलियम एक धूर्त है\"। विलियम ने कहा, \"ईथन एक धूर्त है।\" \"एवरी एक धूर्त है या विलियम एक धूर्त है,\" मैथ्यू ने दावा किया। स्कारलेट के शब्दों में: \"मैथ्यू एक धूर्त है और ईथन एक शूरवीर है\"। ईथन ने कहा, \"एम्मा एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एम्मा एक शूरवीर है  \n(2) एवरी एक धूर्त है  \n(3) विलियम एक धूर्त है  \n(4) मैथ्यू एक शूरवीर है  \n(5) स्कारलेट एक धूर्त है  \n(6) ईथन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: जैक्सन, अबिगेल, एला, नूह, एवरी, और मैथ्यू। जैक्सन ने कहा, \"अबिगेल एक धूर्त है और अबिगेल एक शूरवीर है\"। अबिगेल ने कहा, \"एवरी एक धूर्त है और एवरी एक शूरवीर है\"। \"मैथ्यू एक धूर्त है या मैथ्यू एक शूरवीर है,\" एला ने घोषणा की। \"अगर एवरी एक शूरवीर है तो एला एक शूरवीर है\" - नूह। एवरी ने कहा, \"मैथ्यू एक शूरवीर है\"। \"अगर जैक्सन एक शूरवीर है तो एला एक शूरवीर है,\" मैथ्यू ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक धूर्त है  \n(2) अबिगेल एक धूर्त है  \n(3) एला एक शूरवीर है  \n(4) नूह एक शूरवीर है  \n(5) एवरी एक शूरवीर है  \n(6) मैथ्यू एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: स्कारलेट, ल्यूक, पेनलोप, मिया, राइली, और नूह। स्कारलेट के शब्दों में: \"ल्यूक एक शूरवीर है यदि और केवल यदि स्कारलेट एक शूरवीर है\"। ल्यूक ने कहा, \"स्कारलेट एक शूरवीर है\"। पेनलोप के शब्दों में: \"राइली एक धूर्त है या ल्यूक एक धूर्त है\"। मिया ने कहा, \"नूह एक शूरवीर है या ल्यूक एक धूर्त है\"। राइली ने नोट किया, \"मिया एक शूरवीर है यदि और केवल यदि ल्यूक एक धूर्त है\"। नूह ने व्यक्त किया कि मिया एक शूरवीर है यदि और केवल यदि राइली एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) स्कारलेट एक शूरवीर है  \n(2) ल्यूक एक शूरवीर है  \n(3) पेनलोप एक धूर्त है  \n(4) मिया एक धूर्त है  \n(5) राइली एक शूरवीर है  \n(6) नूह एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: हार्पर, मेसन, डेविड, ओवेन, क्लोई, और ज़ोई। हार्पर ने कहा, \"ज़ोई एक धूर्त नहीं है\"। मेसन ने कहा कि ओवेन एक धूर्त है या ज़ोई एक शूरवीर है। डेविड ने कहा, \"अगर क्लोई एक शूरवीर है तो हार्पर एक शूरवीर है\"। ओवेन ने कहा, \"हार्पर एक शूरवीर है और क्लोई एक शूरवीर है\"। जैसे कि क्लोई ने कहा, \"मेसन एक शूरवीर है और हार्पर एक धूर्त है\"। ज़ोई को यह कहते हुए सुना गया, \"ज़ोई एक शूरवीर है और क्लोई एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) हार्पर एक धूर्त है  \n(2) मेसन एक शूरवीर है  \n(3) डेविड एक धूर्त है  \n(4) ओवेन एक धूर्त है  \n(5) क्लोई एक शूरवीर है  \n(6) ज़ोई एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एवलिन, अलेक्जेंडर, औरोरा, ओवेन, मेसन, और लोगन। एवलिन ने कहा: \"मेसन एक शूरवीर है और लोगन एक धूर्त है\"। अलेक्जेंडर ने कहा: \"लोगन एक धूर्त है और एवलिन एक शूरवीर है\"। औरोरा ने आपको बताया कि अगर अलेक्जेंडर एक शूरवीर है तो लोगन एक शूरवीर है। \"लोगन एक धूर्त है और औरोरा एक धूर्त है,\" ओवेन ने दावा किया। \"अलेक्जेंडर एक धूर्त है यदि और केवल यदि ओवेन एक शूरवीर है,\" मेसन ने उल्लेख किया। लोगन ने कहा: \"औरोरा एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक धूर्त है  \n(2) अलेक्जेंडर एक धूर्त है  \n(3) औरोरा एक शूरवीर है  \n(4) ओवेन एक धूर्त है  \n(5) मेसन एक धूर्त है  \n(6) लोगन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: माइकल, आरिया, एवलिन, ईथन, सोफिया, और औरोरा। \"औरोरा एक शूरवीर है या एवलिन एक धूर्त है\" - माइकल। आरिया के एक बयान में: \"सोफिया एक शूरवीर है और ईथन एक शूरवीर है\"। एवलिन को यह कहते हुए सुना गया, \"माइकल एक शूरवीर है\"। \"सोफिया एक शूरवीर है और आरिया एक शूरवीर है\" - ईथन। सोफिया ने आपको बताया कि अगर माइकल एक शूरवीर है तो औरोरा एक धूर्त है। औरोरा ने कहा: \"सोफिया एक धूर्त है या माइकल एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक शूरवीर है  \n(2) आरिया एक धूर्त है  \n(3) एवलिन एक शूरवीर है  \n(4) ईथन एक धूर्त है  \n(5) सोफिया एक धूर्त है  \n(6) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: पेनलोप, जेम्स, नूह, सैमुएल, क्लोई, और अबिगेल। पेनलोप ने कहा, \"नूह शूरवीर नहीं है\"। \"सैमुएल धूर्त है या सैमुएल शूरवीर है,\" जेम्स ने घोषणा की। नूह ने कहा, \"क्लोई शूरवीर नहीं है।\" सैमुएल ने कहा, \"नूह धूर्त है यदि और केवल यदि पेनलोप शूरवीर है।\" क्लोई ने कहा, \"पेनलोप शूरवीर है या पेनलोप धूर्त है।\" \"नूह शूरवीर है यदि और केवल यदि जेम्स धूर्त है,\" अबिगेल ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) पेनलोप एक शूरवीर है  \n(2) जेम्स एक शूरवीर है  \n(3) नूह एक धूर्त है  \n(4) सैमुएल एक शूरवीर है  \n(5) क्लोई एक शूरवीर है  \n(6) अबिगेल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: सैमुएल, ओलिवर, सोफिया, यूसुफ, ओलिविया, और मिया। सैमुएल ने टिप्पणी की, \"यूसुफ एक शूरवीर है और ओलिवर एक धूर्त है\"। ओलिवर के अनुसार, \"अगर यूसुफ एक धूर्त है तो ओलिवर एक शूरवीर है\"। सोफिया ने कहा कि ओलिविया एक शूरवीर है यदि और केवल यदि यूसुफ एक धूर्त है। \"मिया एक शूरवीर है,\" यूसुफ ने दावा किया। ओलिविया ने आपको बताया कि यूसुफ एक शूरवीर है और सैमुएल एक शूरवीर है। मिया के शब्दों में: \"ओलिविया एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक धूर्त है  \n(2) ओलिवर एक शूरवीर है  \n(3) सोफिया एक शूरवीर है  \n(4) यूसुफ एक शूरवीर है  \n(5) ओलिविया एक धूर्त है  \n(6) मिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एवा, डेविड, सोफिया, औरोरा, अमेलिया, और स्कारलेट। \"डेविड एक धूर्त है या स्कारलेट एक शूरवीर है,\" एवा ने कहा। डेविड ने कहा कि अगर डेविड एक शूरवीर है तो अमेलिया एक शूरवीर है। सोफिया को यह कहते हुए सुना गया, \"स्कारलेट एक धूर्त नहीं है\"। औरोरा ने कहा, \"एवा एक धूर्त है और स्कारलेट एक धूर्त है\"। \"सोफिया एक शूरवीर है,\" अमेलिया ने दावा किया। स्कारलेट ने कहा, \"अगर सोफिया एक धूर्त है तो एवा एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक शूरवीर है  \n(2) डेविड एक शूरवीर है  \n(3) सोफिया एक शूरवीर है  \n(4) औरोरा एक धूर्त है  \n(5) अमेलिया एक शूरवीर है  \n(6) स्कारलेट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ल्यूक, एम्मा, एमिली, एवलिन, ऐडन, और लिली। ल्यूक ने कहा, \"ऐडन एक धूर्त है या एमिली एक शूरवीर है\"। एम्मा ने कहा, \"एमिली एक शूरवीर है यदि और केवल यदि ऐडन एक धूर्त है\"। एमिली ने कहा कि ल्यूक एक धूर्त है या एवलिन एक धूर्त है। \"यदि एवलिन एक शूरवीर है तो ल्यूक एक शूरवीर है\" - एवलिन। \"लिली एक धूर्त है या ऐडन एक शूरवीर है\" - ऐडन। \"एमिली एक धूर्त है और एवलिन एक शूरवीर है,\" लिली ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) एम्मा एक धूर्त है  \n(3) एमिली एक धूर्त है  \n(4) एवलिन एक शूरवीर है  \n(5) ऐडन एक धूर्त है  \n(6) लिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एवरी, लोगन, पेनलोप, एलिज़ाबेथ, ज़ोई, और राइली। एवरी ने कहा, \"अगर पेनलोप एक शूरवीर है तो ज़ोई एक शूरवीर है।\" लोगन को यह कहते हुए सुना गया, \"राइली एक धूर्त है यदि और केवल यदि ज़ोई एक शूरवीर है।\" पेनलोप ने कहा, \"ज़ोई एक शूरवीर है यदि और केवल यदि लोगन एक शूरवीर है।\" एलिज़ाबेथ ने कहा, \"ज़ोई एक धूर्त नहीं है।\" \"पेनलोप एक शूरवीर नहीं है,\" ज़ोई ने घोषणा की। राइली के एक बयान में: \"लोगन एक शूरवीर है और ज़ोई एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक धूर्त है  \n(2) लोगन एक धूर्त है  \n(3) पेनलोप एक शूरवीर है  \n(4) एलिज़ाबेथ एक धूर्त है  \n(5) ज़ोई एक धूर्त है  \n(6) राइली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: हार्पर, नूह, जेम्स, मेसन, एवा, और एमिली। \"एमिली एक धूर्त है और नूह एक शूरवीर है,\" हार्पर ने दावा किया। नूह के शब्दों में: \"जेम्स एक धूर्त है यदि और केवल यदि हार्पर एक धूर्त है\"। जेम्स के अनुसार, \"नूह एक धूर्त है यदि और केवल यदि हार्पर एक धूर्त है\"। मेसन के अनुसार, \"जेम्स एक धूर्त नहीं है\"। एवा के शब्दों में: \"एमिली एक शूरवीर है या हार्पर एक शूरवीर है\"। \"जेम्स एक धूर्त नहीं है,\" एमिली ने उल्लेख किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक धूर्त है  \n(2) नूह एक धूर्त है  \n(3) जेम्स एक शूरवीर है  \n(4) मेसन एक शूरवीर है  \n(5) एवा एक शूरवीर है  \n(6) एमिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: जेम्स, जैक, विक्टोरिया, ओलिविया, एम्मा, और सोफिया। जेम्स ने कहा, \"सोफिया एक धूर्त है या विक्टोरिया एक धूर्त है\"। जैक ने कहा, \"एम्मा एक शूरवीर है यदि और केवल यदि सोफिया एक शूरवीर है\"। विक्टोरिया के एक बयान में: \"जेम्स एक शूरवीर है यदि और केवल यदि एम्मा एक धूर्त है\"। \"जैक एक शूरवीर है\" - ओलिविया। एम्मा ने कहा, \"विक्टोरिया एक शूरवीर है और सोफिया एक शूरवीर है\"। सोफिया ने कहा कि ओलिविया एक शूरवीर है और विक्टोरिया एक धूर्त है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) जैक एक शूरवीर है  \n(3) विक्टोरिया एक शूरवीर है  \n(4) ओलिविया एक शूरवीर है  \n(5) एम्मा एक धूर्त है  \n(6) सोफिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: हार्पर, ज़ोई, एवा, विलियम, एम्मा, और ईथन। हार्पर ने कहा: \"विलियम एक धूर्त है या ईथन एक धूर्त है\"। ज़ोई के अनुसार, \"एवा एक शूरवीर है और हार्पर एक शूरवीर है\"। एवा के अनुसार, \"ईथन एक धूर्त है और विलियम एक शूरवीर है\"। \"ईथन एक धूर्त है और ज़ोई एक धूर्त है,\" विलियम ने घोषणा की। एम्मा ने कहा, \"ईथन एक धूर्त है यदि और केवल यदि ज़ोई एक धूर्त है\"। ईथन ने कहा, \"ईथन एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक शूरवीर है  \n(2) ज़ोई एक धूर्त है  \n(3) एवा एक धूर्त है  \n(4) विलियम एक धूर्त है  \n(5) एम्मा एक धूर्त है  \n(6) ईथन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: विक्टोरिया, लुकास, ऐडन, क्लोई, जेम्स, और हार्पर। \"क्लोई एक धूर्त है,\" विक्टोरिया ने घोषणा की। \"अगर हार्पर एक शूरवीर है तो लुकास एक शूरवीर है,\" लुकास ने घोषणा की। ऐडन ने कहा, \"क्लोई एक धूर्त है यदि और केवल यदि जेम्स एक शूरवीर है।\" क्लोई ने कहा कि विक्टोरिया एक धूर्त है या जेम्स एक शूरवीर है। जेम्स के एक बयान में: \"अगर विक्टोरिया एक शूरवीर है तो क्लोई एक धूर्त है।\" हार्पर ने नोट किया, \"जेम्स एक धूर्त है यदि और केवल यदि क्लोई एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विक्टोरिया एक धूर्त है  \n(2) लुकास एक शूरवीर है  \n(3) ऐडन एक धूर्त है  \n(4) क्लोई एक शूरवीर है  \n(5) जेम्स एक शूरवीर है  \n(6) हार्पर एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: सैमुएल, ज़ोई, इसाबेला, लोगन, माइकल, और विलियम। सैमुएल ने कहा, \"इसाबेला एक धूर्त है यदि और केवल यदि माइकल एक शूरवीर है\"। ज़ोई ने आपको बताया कि इसाबेला एक धूर्त है यदि और केवल यदि विलियम एक धूर्त है। इसाबेला ने कहा: \"ज़ोई एक शूरवीर है या सैमुएल एक शूरवीर है\"। लोगन ने कहा कि यदि ज़ोई एक धूर्त है तो लोगन एक शूरवीर है। माइकल के अनुसार, \"इसाबेला एक शूरवीर है और माइकल एक शूरवीर है\"। विलियम ने टिप्पणी की, \"माइकल एक शूरवीर है यदि और केवल यदि विलियम एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक धूर्त है  \n(2) ज़ोई एक शूरवीर है  \n(3) इसाबेला एक शूरवीर है  \n(4) लोगन एक शूरवीर है  \n(5) माइकल एक शूरवीर है  \n(6) विलियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: मैथ्यू, सोफिया, जेम्स, इसाबेला, याकूब, और एवलिन। मैथ्यू ने कहा: \"एवलिन एक शूरवीर है और इसाबेला एक धूर्त है\"। \"जेम्स एक शूरवीर है या जेम्स एक धूर्त है,\" सोफिया ने कहा। जेम्स ने कहा, \"मैथ्यू एक शूरवीर है और याकूब एक शूरवीर है\"। \"अगर याकूब एक धूर्त है तो सोफिया एक धूर्त है,\" इसाबेला ने कहा। याकूब ने आपको बताया कि याकूब एक शूरवीर है। एवलिन ने कहा, \"मैथ्यू एक शूरवीर नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मैथ्यू एक धूर्त है  \n(2) सोफिया एक शूरवीर है  \n(3) जेम्स एक धूर्त है  \n(4) इसाबेला एक शूरवीर है  \n(5) याकूब एक शूरवीर है  \n(6) एवलिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: याकूब, एवा, ओलिवर, विलियम, क्लोई, और डेविड। याकूब ने कहा कि अगर डेविड एक धूर्त है तो एवा एक धूर्त है। एवा ने कहा: \"डेविड एक शूरवीर है और डेविड एक धूर्त है\"। ओलिवर ने कहा, \"अगर विलियम एक धूर्त है तो डेविड एक धूर्त है\"। विलियम ने कहा: \"याकूब एक धूर्त है और ओलिवर एक शूरवीर है\"। क्लोई के अनुसार, \"ओलिवर एक शूरवीर है\"। डेविड ने आपको बताया कि एवा एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) याकूब एक शूरवीर है  \n(2) एवा एक धूर्त है  \n(3) ओलिवर एक धूर्त है  \n(4) विलियम एक धूर्त है  \n(5) क्लोई एक धूर्त है  \n(6) डेविड एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: जेम्स, मेसन, याकूब, पेनलोप, हार्पर, और एम्मा। जेम्स ने टिप्पणी की, \"पेनलोप एक धूर्त है या याकूब एक शूरवीर है\"। मेसन के शब्दों में: \"हार्पर एक शूरवीर है\"। याकूब ने आपको बताया कि अगर मेसन एक धूर्त है तो मेसन एक शूरवीर है। पेनलोप को यह कहते हुए सुना गया, \"हार्पर एक धूर्त है और एम्मा एक धूर्त है\"। हार्पर के अनुसार, \"एम्मा एक शूरवीर है या जेम्स एक शूरवीर है\"। एम्मा ने व्यक्त किया कि अगर हार्पर एक शूरवीर है तो जेम्स एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) मेसन एक शूरवीर है  \n(3) याकूब एक शूरवीर है  \n(4) पेनलोप एक धूर्त है  \n(5) हार्पर एक शूरवीर है  \n(6) एम्मा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ओलिविया, मिया, एवा, ओलिवर, राइली, और जैक्सन। ओलिविया के शब्दों में: \"मिया एक धूर्त है यदि और केवल यदि ओलिवर एक धूर्त है\"। मिया के अनुसार, \"एवा एक शूरवीर है या मिया एक शूरवीर है\"। एवा के अनुसार, \"राइली एक धूर्त है या ओलिवर एक शूरवीर है\"। ओलिवर ने कहा कि मिया एक शूरवीर है या एवा एक शूरवीर है। राइली के बयान में: \"यदि जैक्सन एक धूर्त है तो जैक्सन एक शूरवीर है\"। जैक्सन ने कहा, \"ओलिविया एक शूरवीर है यदि और केवल यदि ओलिविया एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ओलिविया एक शूरवीर है  \n(2) मिया एक शूरवीर है  \n(3) एवा एक शूरवीर है  \n(4) ओलिवर एक शूरवीर है  \n(5) राइली एक धूर्त है  \n(6) जैक्सन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: डेविड, एवा, औरोरा, एला, लोगन, और ल्यूक। डेविड ने आपको बताया कि ल्यूक एक शूरवीर है यदि और केवल यदि एवा एक धूर्त है। \"यदि ल्यूक एक धूर्त है तो लोगन एक शूरवीर है,\" एवा ने कहा। औरोरा ने कहा कि यदि डेविड एक शूरवीर है तो एवा एक शूरवीर है। एला ने कहा कि लोगन एक धूर्त है या ल्यूक एक शूरवीर है। \"एवा एक शूरवीर है या डेविड एक शूरवीर है,\" लोगन ने दावा किया। ल्यूक ने कहा: \"औरोरा एक धूर्त है या लोगन एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक शूरवीर है  \n(2) एवा एक शूरवीर है  \n(3) औरोरा एक शूरवीर है  \n(4) एला एक धूर्त है  \n(5) लोगन एक शूरवीर है  \n(6) ल्यूक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: अबिगेल, आरिया, सेबेस्टियन, हेनरी, एवा, और बेंजामिन। जैसा कि अबिगेल ने कहा, \"आरिया एक शूरवीर है यदि और केवल यदि बेंजामिन एक धूर्त है।\" आरिया ने आपको बताया कि आरिया एक शूरवीर है या बेंजामिन एक धूर्त है। \"एवा एक धूर्त है या हेनरी एक शूरवीर है,\" सेबेस्टियन ने घोषणा की। हेनरी को यह कहते हुए सुना गया, \"एवा एक शूरवीर है और बेंजामिन एक शूरवीर है।\" एवा ने कहा, \"बेंजामिन एक धूर्त है और अबिगेल एक शूरवीर है।\" बेंजामिन ने कहा, \"यदि अबिगेल एक शूरवीर है तो एवा एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अबिगेल एक धूर्त है  \n(2) आरिया एक शूरवीर है  \n(3) सेबेस्टियन एक शूरवीर है  \n(4) हेनरी एक धूर्त है  \n(5) एवा एक धूर्त है  \n(6) बेंजामिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा आबाद है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: सैमुएल, मेसन, बेंजामिन, सोफिया, हार्पर, और आरिया। सैमुएल ने कहा, \"आरिया एक शूरवीर है\"। मेसन ने कहा, \"बेंजामिन एक धूर्त है यदि और केवल यदि आरिया एक शूरवीर है\"। बेंजामिन के अनुसार, \"सैमुएल एक शूरवीर है या सोफिया एक शूरवीर है\"। सोफिया ने टिप्पणी की, \"आरिया एक शूरवीर है या हार्पर एक धूर्त है\"। हार्पर को यह कहते हुए सुना गया, \"हार्पर एक शूरवीर है\"। आरिया को यह कहते हुए सुना गया, \"यदि बेंजामिन एक शूरवीर है तो बेंजामिन एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक धूर्त है  \n(2) मेसन एक शूरवीर है  \n(3) बेंजामिन एक शूरवीर है  \n(4) सोफिया एक शूरवीर है  \n(5) हार्पर एक धूर्त है  \n(6) आरिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: हार्पर, विलियम, आरिया, सैमुएल, लुकास, और मेसन। जैसे हार्पर ने कहा, \"लुकास एक धूर्त है और सैमुएल एक धूर्त है\"। विलियम ने कहा कि मेसन एक धूर्त है और सैमुएल एक शूरवीर है। आरिया ने कहा कि हार्पर एक शूरवीर है और मेसन एक शूरवीर है। सैमुएल ने कहा, \"आरिया एक धूर्त नहीं है\"। लुकास ने कहा कि मेसन एक धूर्त है या विलियम एक धूर्त है। मेसन ने आपको बताया कि हार्पर एक धूर्त नहीं है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक धूर्त है  \n(2) विलियम एक धूर्त है  \n(3) आरिया एक धूर्त है  \n(4) सैमुएल एक धूर्त है  \n(5) लुकास एक शूरवीर है  \n(6) मेसन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: माइकल, एम्मा, क्लोई, ज़ोई, अलेक्जेंडर, और एला। माइकल ने कहा: \"अगर ज़ोई एक शूरवीर है तो क्लोई एक धूर्त है\"। एम्मा ने नोट किया, \"क्लोई एक धूर्त है या ज़ोई एक धूर्त है\"। क्लोई ने आपको बताया कि माइकल एक धूर्त है या एम्मा एक धूर्त है। ज़ोई ने कहा, \"माइकल एक धूर्त नहीं है\"। अलेक्जेंडर ने कहा, \"क्लोई एक धूर्त है\"। एला के अनुसार, \"क्लोई एक शूरवीर है या अलेक्जेंडर एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक शूरवीर है  \n(2) एम्मा एक शूरवीर है  \n(3) क्लोई एक धूर्त है  \n(4) ज़ोई एक शूरवीर है  \n(5) अलेक्जेंडर एक शूरवीर है  \n(6) एला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: मिया, क्लोई, डेविड, शार्लट, एलिज़ाबेथ, और ओलिविया। मिया ने कहा, \"मिया एक शूरवीर है या ओलिविया एक धूर्त है\"। क्लोई ने कहा कि शार्लट एक शूरवीर है। डेविड ने कहा, \"एलिज़ाबेथ एक धूर्त है\"। शार्लट ने कहा, \"क्लोई एक शूरवीर है यदि और केवल यदि मिया एक धूर्त है।\" \"मिया एक शूरवीर है या ओलिविया एक शूरवीर है,\" एलिज़ाबेथ ने घोषणा की। ओलिविया को यह कहते हुए सुना गया, \"शार्लट एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक धूर्त है  \n(2) क्लोई एक शूरवीर है  \n(3) डेविड एक धूर्त है  \n(4) शार्लट एक शूरवीर है  \n(5) एलिज़ाबेथ एक शूरवीर है  \n(6) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ल्यूक, लुकास, डैनियल, स्कारलेट, ग्रेस, और सैमुएल। ल्यूक के अनुसार, \"अगर स्कारलेट एक धूर्त है तो ल्यूक एक शूरवीर है\"। लुकास ने कहा: \"अगर ग्रेस एक शूरवीर है तो स्कारलेट एक धूर्त है\"। डैनियल को यह कहते हुए सुना गया, \"लुकास एक धूर्त है या ल्यूक एक शूरवीर है\"। स्कारलेट ने कहा, \"डैनियल एक धूर्त है\"। ग्रेस के एक बयान में: \"स्कारलेट एक शूरवीर है\"। \"अगर ल्यूक एक शूरवीर है तो डैनियल एक धूर्त है,\" सैमुएल ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) लुकास एक शूरवीर है  \n(3) डैनियल एक शूरवीर है  \n(4) स्कारलेट एक धूर्त है  \n(5) ग्रेस एक धूर्त है  \n(6) सैमुएल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एमिली, ओवेन, मिया, बेंजामिन, मैथ्यू, और इसाबेला। एमिली ने कहा, \"अगर मिया एक धूर्त है तो इसाबेला एक धूर्त है।\" ओवेन ने टिप्पणी की, \"बेंजामिन एक धूर्त है।\" \"ओवेन एक शूरवीर नहीं है,\" मिया ने दावा किया। बेंजामिन के अनुसार, \"मैथ्यू एक धूर्त है या बेंजामिन एक शूरवीर है।\" मैथ्यू ने कहा, \"अगर बेंजामिन एक धूर्त है तो इसाबेला एक शूरवीर है।\" इसाबेला को यह कहते हुए सुना गया, \"अगर ओवेन एक शूरवीर है तो ओवेन एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक शूरवीर है  \n(2) ओवेन एक धूर्त है  \n(3) मिया एक शूरवीर है  \n(4) बेंजामिन एक शूरवीर है  \n(5) मैथ्यू एक शूरवीर है  \n(6) इसाबेला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एमिली, शार्लट, जेम्स, लुकास, एवलिन, और अमेलिया। एमिली के अनुसार, \"अगर अमेलिया एक शूरवीर है तो लुकास एक धूर्त है\"। शार्लट ने कहा: \"अमेलिया एक धूर्त है\"। जेम्स के शब्दों में: \"शार्लट एक शूरवीर नहीं है\"। लुकास ने कहा, \"अमेलिया एक शूरवीर है और शार्लट एक शूरवीर है\"। एवलिन के शब्दों में: \"शार्लट एक शूरवीर है\"। अमेलिया के शब्दों में: \"एमिली एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एमिली एक शूरवीर है  \n(2) शार्लट एक शूरवीर है  \n(3) जेम्स एक धूर्त है  \n(4) लुकास एक धूर्त है  \n(5) एवलिन एक शूरवीर है  \n(6) अमेलिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: यूसुफ, सोफिया, एवा, अमेलिया, अबिगेल, और लियम। यूसुफ के शब्दों में: \"अगर एवा एक शूरवीर है तो यूसुफ एक शूरवीर है\"। सोफिया ने कहा कि अबिगेल एक शूरवीर है या अमेलिया एक धूर्त है। एवा ने कहा कि अबिगेल एक धूर्त है और अमेलिया एक शूरवीर है। अमेलिया ने कहा, \"यूसुफ एक धूर्त है और लियम एक धूर्त है\"। अबिगेल के अनुसार, \"एवा एक धूर्त है यदि और केवल यदि सोफिया एक धूर्त है\"। \"अमेलिया एक धूर्त नहीं है,\" लियम ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) यूसुफ एक शूरवीर है  \n(2) सोफिया एक शूरवीर है  \n(3) एवा एक धूर्त है  \n(4) अमेलिया एक धूर्त है  \n(5) अबिगेल एक धूर्त है  \n(6) लियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ओलिवर, पेनलोप, मिया, लुकास, सोफिया, और माइकल। ओलिवर के अनुसार, \"लुकास एक धूर्त है और पेनलोप एक शूरवीर है\"। पेनलोप ने कहा, \"यदि पेनलोप एक शूरवीर है तो ओलिवर एक शूरवीर है\"। मिया ने कहा: \"लुकास एक शूरवीर नहीं है\"। लुकास ने कहा कि सोफिया एक शूरवीर है और ओलिवर एक शूरवीर है। \"माइकल एक शूरवीर है या सोफिया एक शूरवीर है\" - सोफिया। माइकल ने आपको बताया कि ओलिवर एक शूरवीर है और पेनलोप एक धूर्त है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ओलिवर एक शूरवीर है  \n(2) पेनलोप एक शूरवीर है  \n(3) मिया एक शूरवीर है  \n(4) लुकास एक धूर्त है  \n(5) सोफिया एक धूर्त है  \n(6) माइकल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: अबिगेल, एमिली, लोगन, डैनियल, ऐडन, और एम्मा। \"डैनियल एक धूर्त है यदि और केवल यदि लोगन एक शूरवीर है,\" अबिगेल ने दावा किया। एमिली ने कहा, \"लोगन एक शूरवीर है\"। \"यदि ऐडन एक शूरवीर है तो डैनियल एक धूर्त है\" - लोगन। डैनियल ने कहा, \"लोगन एक शूरवीर नहीं है\"। ऐडन को यह कहते हुए सुना गया, \"अबिगेल एक धूर्त है\"। एम्मा के शब्दों में: \"ऐडन एक धूर्त है और लोगन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अबिगेल एक शूरवीर है  \n(2) एमिली एक शूरवीर है  \n(3) लोगन एक शूरवीर है  \n(4) डैनियल एक धूर्त है  \n(5) ऐडन एक धूर्त है  \n(6) एम्मा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एला, अलेक्जेंडर, सैमुएल, नूह, ल्यूक, और डेविड। एला ने कहा, \"अलेक्जेंडर एक शूरवीर नहीं है\"। अलेक्जेंडर ने टिप्पणी की, \"एला एक शूरवीर है या ल्यूक एक धूर्त है\"। सैमुएल ने कहा, \"ल्यूक एक धूर्त है\"। \"अगर एला एक धूर्त है तो ल्यूक एक धूर्त है,\" नूह ने कहा। \"नूह एक शूरवीर है और सैमुएल एक धूर्त है\" - ल्यूक। \"एला एक धूर्त है और एला एक शूरवीर है,\" डेविड ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक धूर्त है  \n(2) अलेक्जेंडर एक शूरवीर है  \n(3) सैमुएल एक शूरवीर है  \n(4) नूह एक शूरवीर है  \n(5) ल्यूक एक धूर्त है  \n(6) डेविड एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ज़ोई, डैनियल, लुकास, एवा, ओवेन, और अमेलिया। ज़ोई ने कहा, \"अगर अमेलिया एक शूरवीर है तो एवा एक शूरवीर है\"। डैनियल ने आपको बताया कि ओवेन एक धूर्त है या डैनियल एक शूरवीर है। लुकास के शब्दों में: \"डैनियल एक शूरवीर नहीं है\"। एवा ने कहा, \"ज़ोई एक धूर्त है\"। ओवेन के अनुसार, \"ओवेन एक शूरवीर है या ज़ोई एक शूरवीर है\"। अमेलिया के अनुसार, \"डैनियल एक शूरवीर है और ज़ोई एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) ज़ोई एक शूरवीर है  \n(2) डैनियल एक धूर्त है  \n(3) लुकास एक शूरवीर है  \n(4) एवा एक धूर्त है  \n(5) ओवेन एक शूरवीर है  \n(6) अमेलिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: जेम्स, ल्यूक, अबिगेल, मेसन, विक्टोरिया, और ज़ोई। जेम्स के एक बयान में: \"ल्यूक एक शूरवीर है और मेसन एक धूर्त है\"। ल्यूक ने कहा, \"विक्टोरिया एक धूर्त है या अबिगेल एक धूर्त है\"। अबिगेल ने कहा कि अगर विक्टोरिया एक शूरवीर है तो अबिगेल एक शूरवीर है। \"विक्टोरिया एक धूर्त है या जेम्स एक शूरवीर है,\" मेसन ने दावा किया। \"अगर जेम्स एक धूर्त है तो अबिगेल एक शूरवीर है,\" विक्टोरिया ने कहा। \"ल्यूक एक धूर्त है और विक्टोरिया एक धूर्त है\" - ज़ोई। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक धूर्त है  \n(2) ल्यूक एक धूर्त है  \n(3) अबिगेल एक शूरवीर है  \n(4) मेसन एक धूर्त है  \n(5) विक्टोरिया एक शूरवीर है  \n(6) ज़ोई एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: सोफिया, आरिया, ओवेन, एवलिन, बेंजामिन, और एला। सोफिया ने आपको बताया कि सोफिया एक शूरवीर है यदि और केवल यदि एवलिन एक धूर्त है। आरिया के शब्दों में: \"एला एक धूर्त है और आरिया एक शूरवीर है\"। ओवेन ने कहा, \"सोफिया एक शूरवीर है\"। एवलिन के एक बयान में: \"एला एक शूरवीर है\"। बेंजामिन ने कहा: \"सोफिया एक धूर्त नहीं है\"। एला ने व्यक्त किया कि यदि बेंजामिन एक शूरवीर है तो आरिया एक धूर्त है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) आरिया एक शूरवीर है  \n(3) ओवेन एक शूरवीर है  \n(4) एवलिन एक धूर्त है  \n(5) बेंजामिन एक शूरवीर है  \n(6) एला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: अलेक्जेंडर, डैनियल, माइकल, याकूब, आरिया, और बेंजामिन। अलेक्जेंडर ने कहा, \"बेंजामिन एक शूरवीर है और याकूब एक शूरवीर है।\" \"अगर डैनियल एक शूरवीर है तो याकूब एक धूर्त है,\" डैनियल ने घोषणा की। जैसे माइकल ने कहा, \"अगर याकूब एक शूरवीर है तो अलेक्जेंडर एक धूर्त है।\" \"अगर अलेक्जेंडर एक धूर्त है तो डैनियल एक धूर्त है\" - याकूब। आरिया ने टिप्पणी की, \"याकूब एक धूर्त नहीं है।\" बेंजामिन ने नोट किया, \"आरिया एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अलेक्जेंडर एक धूर्त है  \n(2) डैनियल एक शूरवीर है  \n(3) माइकल एक शूरवीर है  \n(4) याकूब एक धूर्त है  \n(5) आरिया एक धूर्त है  \n(6) बेंजामिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: बेंजामिन, क्लोई, विक्टोरिया, इसाबेला, एला, और एमिली। बेंजामिन ने कहा, \"क्लोई एक शूरवीर नहीं है\"। क्लोई को यह कहते हुए सुना गया, \"क्लोई एक शूरवीर है\"। \"क्लोई एक धूर्त है और एमिली एक धूर्त है,\" विक्टोरिया ने घोषणा की। इसाबेला ने आपको बताया कि बेंजामिन एक शूरवीर है। एला ने टिप्पणी की, \"बेंजामिन एक धूर्त नहीं है\"। एमिली ने asserted किया: \"क्लोई एक धूर्त है यदि और केवल यदि विक्टोरिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) बेंजामिन एक धूर्त है  \n(2) क्लोई एक शूरवीर है  \n(3) विक्टोरिया एक धूर्त है  \n(4) इसाबेला एक धूर्त है  \n(5) एला एक धूर्त है  \n(6) एमिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: सोफिया, विलियम, आरिया, एलिज़ाबेथ, ओवेन, और लुकास। \"अगर एलिज़ाबेथ एक धूर्त है तो आरिया एक धूर्त है,\" सोफिया ने दावा किया। \"ओवेन एक शूरवीर है या लुकास एक धूर्त है,\" विलियम ने घोषणा की। आरिया ने टिप्पणी की, \"लुकास एक शूरवीर नहीं है\"। एलिज़ाबेथ ने कहा कि आरिया एक धूर्त नहीं है। ओवेन के शब्दों में: \"सोफिया एक धूर्त है यदि और केवल यदि सोफिया एक शूरवीर है\"। \"ओवेन एक शूरवीर है और लुकास एक शूरवीर है\" - लुकास। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) विलियम एक शूरवीर है  \n(3) आरिया एक शूरवीर है  \n(4) एलिज़ाबेथ एक शूरवीर है  \n(5) ओवेन एक धूर्त है  \n(6) लुकास एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: माइकल, बेंजामिन, सेबेस्टियन, ग्रेस, ईथन, और आरिया। \"ईथन एक धूर्त है या माइकल एक शूरवीर है,\" माइकल ने दावा किया। बेंजामिन ने कहा, \"अगर माइकल एक धूर्त है तो आरिया एक धूर्त है।\" \"बेंजामिन एक शूरवीर है\" - सेबेस्टियन। ग्रेस के अनुसार, \"सेबेस्टियन एक धूर्त है और आरिया एक शूरवीर है।\" ईथन को यह कहते हुए सुना गया, \"माइकल एक शूरवीर है।\" जैसा कि आरिया ने कहा, \"ईथन एक शूरवीर है या बेंजामिन एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक शूरवीर है  \n(2) बेंजामिन एक शूरवीर है  \n(3) सेबेस्टियन एक शूरवीर है  \n(4) ग्रेस एक धूर्त है  \n(5) ईथन एक शूरवीर है  \n(6) आरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: लुकास, ऐडन, सोफिया, अलेक्जेंडर, मिया, और ज़ोई। \"अगर ऐडन एक शूरवीर है तो मिया एक शूरवीर है,\" लुकास ने घोषणा की। ऐडन ने नोट किया, \"सोफिया एक धूर्त है यदि और केवल यदि लुकास एक शूरवीर है।\" सोफिया ने कहा कि अलेक्जेंडर एक शूरवीर है या अलेक्जेंडर एक धूर्त है। अलेक्जेंडर ने कहा, \"मिया एक धूर्त है यदि और केवल यदि सोफिया एक धूर्त है।\" मिया ने remarked किया, \"ज़ोई एक शूरवीर नहीं है।\" ज़ोई ने कहा कि सोफिया एक धूर्त है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) लुकास एक शूरवीर है  \n(2) ऐडन एक धूर्त है  \n(3) सोफिया एक शूरवीर है  \n(4) अलेक्जेंडर एक शूरवीर है  \n(5) मिया एक शूरवीर है  \n(6) ज़ोई एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: अबिगेल, एवा, सोफिया, सोफिया, राइली, और डेविड। \"सोफिया शूरवीर नहीं है,\" अबिगेल ने दावा किया। \"सोफिया एक धूर्त है और एवा एक शूरवीर है,\" एवा ने उल्लेख किया। सोफिया ने कहा कि राइली शूरवीर नहीं है। सोफिया ने नोट किया, \"सोफिया एक धूर्त है या डेविड एक धूर्त है\"। राइली ने asserted किया: \"सोफिया एक शूरवीर है या अबिगेल एक शूरवीर है\"। डेविड ने कहा कि एवा एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अबिगेल एक शूरवीर है  \n(2) एवा एक धूर्त है  \n(3) सोफिया एक धूर्त है  \n(4) सोफिया एक शूरवीर है  \n(5) राइली एक शूरवीर है  \n(6) डेविड एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एला, पेनलोप, लियम, याकूब, ग्रेस, और जेम्स। \"पेनलोप एक धूर्त है या लियम एक धूर्त है,\" एला ने घोषणा की। पेनलोप ने कहा कि लियम एक धूर्त है और जेम्स एक धूर्त है। लियम ने टिप्पणी की, \"पेनलोप एक धूर्त है\"। \"ग्रेस एक शूरवीर है या जेम्स एक शूरवीर है,\" याकूब ने उल्लेख किया। ग्रेस के एक बयान में: \"एला एक शूरवीर है या ग्रेस एक शूरवीर है\"। जेम्स के एक बयान में: \"याकूब एक धूर्त है या याकूब एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक शूरवीर है  \n(2) पेनलोप एक धूर्त है  \n(3) लियम एक शूरवीर है  \n(4) याकूब एक शूरवीर है  \n(5) ग्रेस एक शूरवीर है  \n(6) जेम्स एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: मिया, जेम्स, एम्मा, मेसन, एला, और हार्पर। \"हार्पर शूरवीर नहीं है,\" मिया ने कहा। \"हार्पर शूरवीर है,\" जेम्स ने दावा किया। एम्मा ने asserted किया: \"एम्मा शूरवीर है और मेसन शूरवीर है\"। मेसन ने कहा, \"एम्मा धूर्त है यदि और केवल यदि एला धूर्त है\"। एला ने टिप्पणी की, \"हार्पर शूरवीर नहीं है\"। हार्पर के अनुसार, \"मेसेन शूरवीर है या जेम्स धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मिया एक धूर्त है  \n(2) जेम्स एक शूरवीर है  \n(3) एम्मा एक धूर्त है  \n(4) मेसन एक शूरवीर है  \n(5) एला एक धूर्त है  \n(6) हार्पर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ओवेन, सैमुएल, यूसुफ, सोफिया, ओलिविया, और ज़ोई। ओवेन के अनुसार, \"ओलिविया एक शूरवीर है यदि और केवल यदि ज़ोई एक शूरवीर है\"। सैमुएल ने कहा कि ओलिविया एक धूर्त नहीं है। यूसुफ ने कहा, \"यदि ज़ोई एक शूरवीर है तो सोफिया एक धूर्त है।\" सोफिया ने कहा: \"ओलिविया एक धूर्त है यदि और केवल यदि यूसुफ एक धूर्त है\"। जैसे ओलिविया ने कहा, \"ज़ोई एक धूर्त है\"। ज़ोई ने कहा: \"यूसुफ एक धूर्त है यदि और केवल यदि ओवेन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओवेन एक धूर्त है  \n(2) सैमुएल एक धूर्त है  \n(3) यूसुफ एक शूरवीर है  \n(4) सोफिया एक धूर्त है  \n(5) ओलिविया एक धूर्त है  \n(6) ज़ोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एला, क्लोई, लियम, यूसुफ, डेविड, और एम्मा। एला ने टिप्पणी की, \"एम्मा एक शूरवीर नहीं है\"। क्लोई के अनुसार, \"यूसुफ एक धूर्त है या क्लोई एक शूरवीर है\"। \"यूसुफ एक शूरवीर है और एला एक शूरवीर है,\" लियम ने दावा किया। यूसुफ ने टिप्पणी की, \"क्लोई एक धूर्त नहीं है\"। डेविड ने कहा, \"एम्मा एक शूरवीर है और एला एक शूरवीर है।\" एम्मा ने कहा, \"क्लोई एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक शूरवीर है  \n(2) क्लोई एक शूरवीर है  \n(3) लियम एक शूरवीर है  \n(4) यूसुफ एक शूरवीर है  \n(5) डेविड एक धूर्त है  \n(6) एम्मा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: नूह, एमिली, क्लोई, डेविड, ल्यूक, और ओलिविया। नूह के एक बयान में: \"डेविड एक शूरवीर है यदि और केवल यदि एमिली एक धूर्त है\"। एमिली ने कहा, \"नूह एक धूर्त नहीं है।\" क्लोई ने कहा, \"डेविड एक धूर्त है और एमिली एक शूरवीर है\"। डेविड ने नोट किया, \"नूह एक धूर्त नहीं है\"। ल्यूक ने कहा, \"ओलिविया एक धूर्त है\"। ओलिविया ने कहा, \"क्लोई एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) नूह एक धूर्त है  \n(2) एमिली एक धूर्त है  \n(3) क्लोई एक धूर्त है  \n(4) डेविड एक धूर्त है  \n(5) ल्यूक एक धूर्त है  \n(6) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: इसाबेला, एला, ज़ोई, एमिली, मेसन, और ओलिविया। इसाबेला ने कहा कि एला एक धूर्त है और एमिली एक शूरवीर है। एला ने कहा, \"एला एक शूरवीर है या एमिली एक धूर्त है\"। ज़ोई ने कहा, \"अगर एला एक धूर्त है तो ज़ोई एक शूरवीर है\"। एमिली के एक बयान में: \"मेसन एक धूर्त है यदि और केवल यदि ओलिविया एक धूर्त है\"। मेसन के अनुसार, \"एला एक शूरवीर है और ज़ोई एक धूर्त है\"। ओलिविया के एक बयान में: \"अगर इसाबेला एक धूर्त है तो एला एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक धूर्त है  \n(2) एला एक शूरवीर है  \n(3) ज़ोई एक शूरवीर है  \n(4) एमिली एक शूरवीर है  \n(5) मेसन एक धूर्त है  \n(6) ओलिविया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: सेबेस्टियन, एमिली, एवरी, औरोरा, एवा, और सोफिया। सेबेस्टियन के अनुसार, \"अगर एमिली एक धूर्त है तो एवा एक शूरवीर है\"। एमिली ने कहा कि सोफिया एक शूरवीर है या एवरी एक धूर्त है। एवरी को यह कहते हुए सुना गया, \"एवा एक धूर्त है या औरोरा एक धूर्त है\"। औरोरा के एक बयान में: \"सोफिया एक धूर्त है और औरोरा एक शूरवीर है\"। एवा को यह कहते हुए सुना गया, \"एमिली एक शूरवीर नहीं है\"। सोफिया को यह कहते हुए सुना गया, \"एवरी एक धूर्त है या एवरी एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सेबेस्टियन एक शूरवीर है  \n(2) एमिली एक शूरवीर है  \n(3) एवरी एक शूरवीर है  \n(4) औरोरा एक धूर्त है  \n(5) एवा एक धूर्त है  \n(6) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: विलियम, लियम, ओलिविया, अबिगेल, हेनरी, और लोगन। विलियम ने कहा कि हेनरी एक शूरवीर है यदि और केवल यदि विलियम एक शूरवीर है। लियम के शब्दों में: \"लोगन एक शूरवीर है यदि और केवल यदि ओलिविया एक शूरवीर है\"। \"लोगन एक शूरवीर है या विलियम एक धूर्त है\" - ओलिविया। अबिगेल ने कहा, \"विलियम एक शूरवीर है यदि और केवल यदि ओलिविया एक धूर्त है\"। हेनरी ने कहा कि लियम एक शूरवीर है और विलियम एक शूरवीर है। \"हेनरी एक शूरवीर है या ओलिविया एक शूरवीर है,\" लोगन ने घोषणा की। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) लियम एक शूरवीर है  \n(3) ओलिविया एक शूरवीर है  \n(4) अबिगेल एक धूर्त है  \n(5) हेनरी एक शूरवीर है  \n(6) लोगन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एम्मा, बेंजामिन, यूसुफ, मेसन, एवा, और डेविड। एम्मा ने आपको बताया कि बेंजामिन एक शूरवीर है। बेंजामिन को यह कहते हुए सुना गया, \"डेविड एक शूरवीर है\"। \"यूसुफ एक शूरवीर है या डेविड एक शूरवीर है,\" यूसुफ ने कहा। मेसन के अनुसार, \"बेंजामिन एक शूरवीर है और एम्मा एक धूर्त है\"। \"अगर एवा एक शूरवीर है तो यूसुफ एक धूर्त है,\" एवा ने दावा किया। डेविड ने कहा, \"बेंजामिन एक शूरवीर है और यूसुफ एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एम्मा एक धूर्त है  \n(2) बेंजामिन एक धूर्त है  \n(3) यूसुफ एक धूर्त है  \n(4) मेसन एक धूर्त है  \n(5) एवा एक शूरवीर है  \n(6) डेविड एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: अलेक्जेंडर, मिया, लिली, एवा, इसाबेला, और ऐडन। अलेक्जेंडर ने टिप्पणी की, \"इसाबेला एक धूर्त नहीं है\"। जैसा कि मिया ने कहा, \"अलेक्जेंडर एक शूरवीर है यदि और केवल यदि इसाबेला एक शूरवीर है\"। \"अलेक्जेंडर एक धूर्त है,\" लिली ने कहा। जैसा कि एवा ने कहा, \"यदि ऐडन एक शूरवीर है तो मिया एक धूर्त है\"। \"ऐडन एक शूरवीर है या ऐडन एक धूर्त है,\" इसाबेला ने घोषणा की। ऐडन ने asserted किया: \"मिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अलेक्जेंडर एक शूरवीर है  \n(2) मिया एक शूरवीर है  \n(3) लिली एक धूर्त है  \n(4) एवा एक धूर्त है  \n(5) इसाबेला एक शूरवीर है  \n(6) ऐडन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: लिली, याकूब, ल्यूक, माइकल, ओवेन, और एवरी। लिली के एक बयान में: \"अगर याकूब एक धूर्त है तो एवरी एक धूर्त है\"। याकूब ने कहा, \"लिली एक शूरवीर नहीं है\"। ल्यूक ने कहा, \"माइकल एक शूरवीर है\"। माइकल के शब्दों में: \"लिली एक धूर्त नहीं है\"। ओवेन ने टिप्पणी की, \"एवरी एक शूरवीर है और लिली एक शूरवीर है\"। एवरी ने नोट किया, \"ल्यूक एक धूर्त है यदि और केवल यदि लिली एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लिली एक शूरवीर है  \n(2) याकूब एक धूर्त है  \n(3) ल्यूक एक शूरवीर है  \n(4) माइकल एक शूरवीर है  \n(5) ओवेन एक धूर्त है  \n(6) एवरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ओलिवर, नूह, विक्टोरिया, एला, अमेलिया, और ईथन। ओलिवर ने कहा, \"एला एक धूर्त है या अमेलिया एक शूरवीर है\"। नूह के शब्दों में: \"ओलिवर एक धूर्त नहीं है\"। \"नूह एक धूर्त है यदि और केवल यदि अमेलिया एक धूर्त है,\" विक्टोरिया ने कहा। एला ने कहा, \"विक्टोरिया एक शूरवीर है या एला एक शूरवीर है\"। अमेलिया के एक बयान में: \"ओलिवर एक शूरवीर है और विक्टोरिया एक धूर्त है\"। जैसे ईथन ने कहा, \"विक्टोरिया एक धूर्त है और विक्टोरिया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ओलिवर एक धूर्त है  \n(2) नूह एक धूर्त है  \n(3) विक्टोरिया एक शूरवीर है  \n(4) एला एक शूरवीर है  \n(5) अमेलिया एक धूर्त है  \n(6) ईथन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एवा, शार्लट, एला, जैक्सन, ओवेन, और अमेलिया। एवा ने कहा, \"शार्लट एक धूर्त है और ओवेन एक धूर्त है\"। \"एवा एक धूर्त नहीं है,\" शार्लट ने दावा किया। एला ने कहा, \"अमेलिया एक धूर्त है यदि और केवल यदि जैक्सन एक धूर्त है।\" जैक्सन के अनुसार, \"यदि शार्लट एक शूरवीर है तो ओवेन एक धूर्त है\"। ओवेन ने कहा कि शार्लट एक धूर्त है यदि और केवल यदि एवा एक धूर्त है। अमेलिया ने कहा कि शार्लट एक शूरवीर नहीं है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवा एक धूर्त है  \n(2) शार्लट एक धूर्त है  \n(3) एला एक शूरवीर है  \n(4) जैक्सन एक शूरवीर है  \n(5) ओवेन एक शूरवीर है  \n(6) अमेलिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: विलियम, एलिज़ाबेथ, जैक्सन, एम्मा, अमेलिया, और सेबेस्टियन। विलियम ने कहा कि जैक्सन एक शूरवीर है। एलिज़ाबेथ के शब्दों में: \"अमेलिया एक शूरवीर है या एम्मा एक धूर्त है\"। जैक्सन के शब्दों में: \"सेबेस्टियन एक शूरवीर है या विलियम एक धूर्त है\"। एम्मा के अनुसार, \"एलिज़ाबेथ एक शूरवीर है या सेबेस्टियन एक धूर्त है\"। अमेलिया ने कहा, \"जैक्सन एक शूरवीर है यदि और केवल यदि एम्मा एक शूरवीर है\"। सेबेस्टियन ने कहा, \"एलिज़ाबेथ एक शूरवीर है या एलिज़ाबेथ एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) एलिज़ाबेथ एक शूरवीर है  \n(3) जैक्सन एक शूरवीर है  \n(4) एम्मा एक शूरवीर है  \n(5) अमेलिया एक शूरवीर है  \n(6) सेबेस्टियन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एमिली, बेंजामिन, विक्टोरिया, सोफिया, राइली, और इसाबेला। एमिली ने कहा कि विक्टोरिया एक धूर्त है यदि और केवल यदि बेंजामिन एक शूरवीर है। बेंजामिन के एक बयान में: \"यदि सोफिया एक शूरवीर है तो सोफिया एक धूर्त है\"। विक्टोरिया के अनुसार, \"बेंजामिन एक धूर्त है\"। सोफिया ने asserted किया: \"यदि एमिली एक शूरवीर है तो इसाबेला एक धूर्त है\"। राइली ने कहा, \"यदि एमिली एक शूरवीर है तो विक्टोरिया एक शूरवीर है\"। इसाबेला ने कहा, \"एमिली एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक शूरवीर है  \n(2) बेंजामिन एक शूरवीर है  \n(3) विक्टोरिया एक धूर्त है  \n(4) सोफिया एक धूर्त है  \n(5) राइली एक धूर्त है  \n(6) इसाबेला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ऐडन, इसाबेला, एवरी, ओलिविया, विलियम, और नूह। ऐडन ने कहा, \"नूह एक धूर्त है और एवरी एक धूर्त है।\" इसाबेला के अनुसार, \"ऐडन एक धूर्त है यदि और केवल यदि नूह एक धूर्त है।\" एवरी के शब्दों में: \"नूह एक शूरवीर है।\" ओलिविया ने आपको बताया कि एवरी एक शूरवीर है यदि और केवल यदि नूह एक धूर्त है। विलियम ने कहा: \"यदि एवरी एक धूर्त है तो नूह एक धूर्त है।\" नूह के शब्दों में: \"विलियम एक शूरवीर है और इसाबेला एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक धूर्त है  \n(2) इसाबेला एक धूर्त है  \n(3) एवरी एक शूरवीर है  \n(4) ओलिविया एक धूर्त है  \n(5) विलियम एक शूरवीर है  \n(6) नूह एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: माइकल, इसाबेला, ज़ोई, सोफिया, एवलिन, और सैमुएल। \"ज़ोई एक धूर्त है या ज़ोई एक शूरवीर है,\" माइकल ने दावा किया। इसाबेला ने asserted किया: \"अगर सोफिया एक शूरवीर है तो एवलिन एक धूर्त है\"। ज़ोई के एक बयान में: \"इसाबेला एक शूरवीर है या एवलिन एक धूर्त है\"। सोफिया ने आपको बताया कि एवलिन एक धूर्त है या सैमुएल एक धूर्त है। \"ज़ोई एक शूरवीर नहीं है,\" एवलिन ने घोषित किया। सैमुएल ने asserted किया: \"ज़ोई एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) माइकल एक शूरवीर है  \n(2) इसाबेला एक शूरवीर है  \n(3) ज़ोई एक शूरवीर है  \n(4) सोफिया एक शूरवीर है  \n(5) एवलिन एक धूर्त है  \n(6) सैमुएल एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ग्रेस, सेबेस्टियन, लियम, ऐडन, लिली, और स्कारलेट। ग्रेस ने कहा, \"स्कारलेट एक धूर्त है और स्कारलेट एक शूरवीर है\"। सेबेस्टियन के एक बयान में: \"ऐडन एक शूरवीर है और स्कारलेट एक शूरवीर है\"। लियम ने कहा, \"लियम एक शूरवीर है या लिली एक धूर्त है\"। ऐडन ने आपको बताया कि स्कारलेट एक शूरवीर है या स्कारलेट एक धूर्त है। \"लियम एक शूरवीर है और सेबेस्टियन एक शूरवीर है,\" लिली ने दावा किया। स्कारलेट ने कहा: \"अगर ग्रेस एक धूर्त है तो ऐडन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक धूर्त है  \n(2) सेबेस्टियन एक शूरवीर है  \n(3) लियम एक शूरवीर है  \n(4) ऐडन एक शूरवीर है  \n(5) लिली एक शूरवीर है  \n(6) स्कारलेट एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: मेसन, पेनलोप, बेंजामिन, सेबेस्टियन, राइली, और ओलिविया। मेसन के एक बयान में: \"राइली एक शूरवीर है\"। पेनलोप ने टिप्पणी की, \"अगर राइली एक शूरवीर है तो मेसन एक धूर्त है\"। \"मेसन एक धूर्त है,\" बेंजामिन ने कहा। सेबेस्टियन के अनुसार, \"ओलिविया एक शूरवीर नहीं है\"। राइली ने asserted किया: \"अगर बेंजामिन एक शूरवीर है तो सेबेस्टियन एक शूरवीर है\"। ओलिविया ने remarked किया, \"पेनलोप एक धूर्त है यदि और केवल यदि सेबेस्टियन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) मेसन एक धूर्त है  \n(2) पेनलोप एक शूरवीर है  \n(3) बेंजामिन एक शूरवीर है  \n(4) सेबेस्टियन एक धूर्त है  \n(5) राइली एक धूर्त है  \n(6) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: लिली, हार्पर, एवरी, ओलिविया, मैथ्यू, और अमेलिया। लिली के शब्दों में: \"अगर एवरी एक शूरवीर है तो अमेलिया एक शूरवीर है\"। हार्पर ने आपको बताया कि लिली एक शूरवीर नहीं है। एवरी ने कहा, \"हार्पर एक धूर्त है या ओलिविया एक धूर्त है\"। ओलिविया ने आपको बताया कि अगर लिली एक धूर्त है तो अमेलिया एक शूरवीर है। मैथ्यू ने आपको बताया कि ओलिविया एक शूरवीर है यदि और केवल यदि अमेलिया एक शूरवीर है। अमेलिया ने कहा, \"एवरी एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लिली एक शूरवीर है  \n(2) हार्पर एक धूर्त है  \n(3) एवरी एक शूरवीर है  \n(4) ओलिविया एक शूरवीर है  \n(5) मैथ्यू एक शूरवीर है  \n(6) अमेलिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: आरिया, इसाबेला, ईथन, अमेलिया, मेसन, और विलियम। \"विलियम एक धूर्त है या मेसन एक धूर्त है,\" आरिया ने घोषणा की। \"विलियम एक शूरवीर है,\" इसाबेला ने कहा। ईथन के शब्दों में: \"मेसन एक शूरवीर है\"। \"ईथन एक धूर्त है\" - अमेलिया। \"आरिया एक धूर्त है और विलियम एक धूर्त है\" - मेसन। विलियम ने कहा कि इसाबेला एक धूर्त है या इसाबेला एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) आरिया एक शूरवीर है  \n(2) इसाबेला एक शूरवीर है  \n(3) ईथन एक धूर्त है  \n(4) अमेलिया एक शूरवीर है  \n(5) मेसन एक धूर्त है  \n(6) विलियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: यूसुफ, लियम, ज़ोई, इसाबेला, मेसन, और हेनरी। यूसुफ ने कहा: \"इसाबेला एक शूरवीर है और हेनरी एक धूर्त है\"। लियम के एक बयान में: \"ज़ोई एक शूरवीर है\"। ज़ोई ने कहा, \"इसाबेला एक धूर्त नहीं है\"। \"अगर हेनरी एक शूरवीर है तो मेसन एक शूरवीर है,\" इसाबेला ने कहा। मेसन ने टिप्पणी की, \"यूसुफ एक शूरवीर है\"। हेनरी ने कहा, \"अगर मेसन एक धूर्त है तो लियम एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) यूसुफ एक धूर्त है  \n(2) लियम एक धूर्त है  \n(3) ज़ोई एक धूर्त है  \n(4) इसाबेला एक धूर्त है  \n(5) मेसन एक धूर्त है  \n(6) हेनरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ऐडन, ग्रेस, पेनलोप, माइकल, नूह, और एवलिन। ऐडन ने कहा, \"नूह एक शूरवीर है।\" ग्रेस के एक बयान में: \"नूह एक शूरवीर नहीं है।\" पेनलोप के अनुसार, \"नूह एक धूर्त नहीं है।\" \"पेनलोप एक शूरवीर नहीं है,\" माइकल ने उल्लेख किया। नूह ने कहा कि अगर ऐडन एक शूरवीर है तो पेनलोप एक शूरवीर है। एवलिन को यह कहते हुए सुना गया, \"एवलिन एक शूरवीर है और पेनलोप एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक शूरवीर है  \n(2) ग्रेस एक धूर्त है  \n(3) पेनलोप एक शूरवीर है  \n(4) माइकल एक धूर्त है  \n(5) नूह एक शूरवीर है  \n(6) एवलिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: इसाबेला, अमेलिया, यूसुफ, राइली, विक्टोरिया, और जेम्स। इसाबेला ने आपको बताया कि अगर अमेलिया एक धूर्त है तो यूसुफ एक धूर्त है। अमेलिया को यह कहते हुए सुना गया, \"विक्टोरिया एक धूर्त है\"। यूसुफ ने कहा कि इसाबेला एक शूरवीर है या जेम्स एक शूरवीर है। राइली ने आपको बताया कि इसाबेला एक शूरवीर है और यूसुफ एक शूरवीर है। विक्टोरिया ने टिप्पणी की, \"राइली एक शूरवीर नहीं है\"। जेम्स ने कहा कि अमेलिया एक धूर्त है और इसाबेला एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक शूरवीर है  \n(2) अमेलिया एक शूरवीर है  \n(3) यूसुफ एक शूरवीर है  \n(4) राइली एक शूरवीर है  \n(5) विक्टोरिया एक धूर्त है  \n(6) जेम्स एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: लोगन, एमिली, ओवेन, एला, आरिया, और राइली। जैसे लोगन ने कहा, \"ओवेन एक शूरवीर है\"। \"लोगन एक धूर्त है और लोगन एक शूरवीर है,\" एमिली ने दावा किया। ओवेन के एक बयान में: \"लोगन एक धूर्त है और राइली एक शूरवीर है\"। एला के अनुसार, \"राइली एक शूरवीर है यदि और केवल यदि एमिली एक धूर्त है\"। आरिया ने कहा कि लोगन एक धूर्त नहीं है। राइली ने कहा कि एमिली एक शूरवीर है या राइली एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक धूर्त है  \n(2) एमिली एक धूर्त है  \n(3) ओवेन एक धूर्त है  \n(4) एला एक धूर्त है  \n(5) आरिया एक धूर्त है  \n(6) राइली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ईथन, हेनरी, जैक, याकूब, एवलिन, और बेंजामिन। ईथन ने कहा: \"बेंजामिन एक शूरवीर है और एवलिन एक धूर्त है\"। हेनरी ने नोट किया, \"अगर याकूब एक शूरवीर है तो जैक एक शूरवीर है\"। \"अगर बेंजामिन एक धूर्त है तो हेनरी एक शूरवीर है,\" जैक ने घोषित किया। याकूब को यह कहते हुए सुना गया, \"जैक एक धूर्त है यदि और केवल यदि जैक एक शूरवीर है\"। \"अगर याकूब एक शूरवीर है तो जैक एक शूरवीर है\" - एवलिन। बेंजामिन ने कहा कि अगर जैक एक शूरवीर है तो जैक एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक धूर्त है  \n(2) हेनरी एक शूरवीर है  \n(3) जैक एक शूरवीर है  \n(4) याकूब एक धूर्त है  \n(5) एवलिन एक शूरवीर है  \n(6) बेंजामिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: डैनियल, मिया, ओलिवर, एवरी, माइकल, और ओलिविया। डैनियल ने कहा, \"ओलिविया एक धूर्त है यदि और केवल यदि ओलिविया एक शूरवीर है।\" \"माइकल एक धूर्त है यदि और केवल यदि ओलिविया एक धूर्त है,\" मिया ने कहा। \"ओलिवर एक शूरवीर है,\" ओलिवर ने दावा किया। \"मिया एक धूर्त है\" - एवरी। माइकल ने कहा, \"ओलिवर एक शूरवीर है।\" ओलिविया ने asserted किया: \"एवरी एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक धूर्त है  \n(2) मिया एक धूर्त है  \n(3) ओलिवर एक शूरवीर है  \n(4) एवरी एक शूरवीर है  \n(5) माइकल एक शूरवीर है  \n(6) ओलिविया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ग्रेस, नूह, शार्लट, औरोरा, इसाबेला, और ल्यूक। ग्रेस ने कहा कि शार्लट एक धूर्त है और औरोरा एक शूरवीर है। \"ग्रेस एक शूरवीर है और ग्रेस एक धूर्त है,\" नूह ने घोषणा की। \"औरोरा एक धूर्त है या ल्यूक एक शूरवीर है,\" शार्लट ने दावा किया। औरोरा ने कहा कि शार्लट एक धूर्त है या इसाबेला एक शूरवीर है। \"नूह एक धूर्त है,\" इसाबेला ने घोषणा की। \"इसाबेला एक शूरवीर है\" - ल्यूक। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक धूर्त है  \n(2) नूह एक धूर्त है  \n(3) शार्लट एक शूरवीर है  \n(4) औरोरा एक शूरवीर है  \n(5) इसाबेला एक शूरवीर है  \n(6) ल्यूक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: शार्लट, याकूब, विलियम, हार्पर, अमेलिया, और लियम। शार्लट के एक बयान में: \"अगर लियम एक धूर्त है तो विलियम एक धूर्त है\"। जैसा कि याकूब ने कहा, \"शार्लट एक धूर्त है और लियम एक धूर्त है\"। विलियम ने कहा कि अमेलिया एक धूर्त है या शार्लट एक शूरवीर है। \"विलियम एक शूरवीर नहीं है\" - हार्पर। अमेलिया के एक बयान में: \"विलियम एक धूर्त नहीं है\"। लियम ने कहा कि अगर याकूब एक धूर्त है तो लियम एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक शूरवीर है  \n(2) याकूब एक धूर्त है  \n(3) विलियम एक शूरवीर है  \n(4) हार्पर एक धूर्त है  \n(5) अमेलिया एक शूरवीर है  \n(6) लियम एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: यूसुफ, ज़ोई, सेबेस्टियन, ल्यूक, सोफिया, और नूह। जैसा कि यूसुफ ने कहा, \"सेबेस्टियन एक धूर्त है या ल्यूक एक शूरवीर है\"। ज़ोई के अनुसार, \"अगर नूह एक शूरवीर है तो सोफिया एक धूर्त है\"। सेबेस्टियन ने कहा कि अगर यूसुफ एक शूरवीर है तो ल्यूक एक धूर्त है। ल्यूक ने आपको बताया कि यूसुफ एक शूरवीर है या ज़ोई एक शूरवीर है। सोफिया ने कहा कि ज़ोई एक शूरवीर है और ज़ोई एक धूर्त है। नूह के शब्दों में: \"सोफिया एक शूरवीर है और सेबेस्टियन एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) यूसुफ एक शूरवीर है  \n(2) ज़ोई एक शूरवीर है  \n(3) सेबेस्टियन एक धूर्त है  \n(4) ल्यूक एक शूरवीर है  \n(5) सोफिया एक धूर्त है  \n(6) नूह एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ऐडन, एम्मा, लिली, जैक, डैनियल, और शार्लट। ऐडन ने टिप्पणी की, \"एम्मा एक धूर्त नहीं है।\" एम्मा ने asserted किया: \"ऐडन एक धूर्त है या जैक एक शूरवीर है।\" \"डैनियल एक धूर्त नहीं है,\" लिली ने उल्लेख किया। \"जैक एक शूरवीर है या शार्लट एक शूरवीर है,\" जैक ने घोषित किया। डैनियल ने कहा कि शार्लट एक शूरवीर है यदि और केवल यदि लिली एक धूर्त है। शार्लट ने कहा, \"डैनियल एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक शूरवीर है  \n(2) एम्मा एक शूरवीर है  \n(3) लिली एक शूरवीर है  \n(4) जैक एक शूरवीर है  \n(5) डैनियल एक शूरवीर है  \n(6) शार्लट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ऐडन, क्लोई, एवरी, शार्लट, एमिली, और औरोरा। ऐडन ने कहा, \"एमिली एक शूरवीर नहीं है\"। क्लोई को यह कहते हुए सुना गया, \"औरोरा एक शूरवीर है या ऐडन एक शूरवीर है\"। \"अगर एमिली एक धूर्त है तो एमिली एक शूरवीर है,\" एवरी ने दावा किया। \"औरोरा एक शूरवीर है या ऐडन एक धूर्त है,\" शार्लट ने उल्लेख किया। जैसे कि एमिली ने कहा, \"क्लोई एक धूर्त नहीं है\"। औरोरा ने कहा, \"अगर एवरी एक शूरवीर है तो शार्लट एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक धूर्त है  \n(2) क्लोई एक शूरवीर है  \n(3) एवरी एक शूरवीर है  \n(4) शार्लट एक शूरवीर है  \n(5) एमिली एक शूरवीर है  \n(6) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: जेम्स, लिली, ईथन, सोफिया, सोफिया, और इसाबेला। जैसे जेम्स ने कहा, \"लिली एक धूर्त है\"। \"ईथन एक शूरवीर है,\" लिली ने दावा किया। ईथन ने नोट किया, \"ईथन एक शूरवीर है और इसाबेला एक शूरवीर है\"। \"लिली एक धूर्त है और ईथन एक धूर्त है,\" सोफिया ने घोषित किया। सोफिया के अनुसार, \"ईथन एक धूर्त है\"। \"अगर सोफिया एक धूर्त है तो लिली एक धूर्त है\" - इसाबेला। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) लिली एक धूर्त है  \n(3) ईथन एक धूर्त है  \n(4) सोफिया एक शूरवीर है  \n(5) सोफिया एक शूरवीर है  \n(6) इसाबेला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: जेम्स, सोफिया, यूसुफ, ईथन, एवलिन, और लिली। \"अगर ईथन एक धूर्त है तो यूसुफ एक शूरवीर है,\" जेम्स ने घोषणा की। सोफिया ने asserted किया: \"अगर एवलिन एक शूरवीर है तो लिली एक शूरवीर है\"। यूसुफ को यह कहते हुए सुना गया, \"यूसुफ एक शूरवीर है और सोफिया एक धूर्त है\"। जैसे ईथन ने कहा, \"अगर सोफिया एक शूरवीर है तो सोफिया एक धूर्त है\"। एवलिन ने कहा, \"ईथन एक धूर्त है या लिली एक शूरवीर है\"। लिली ने कहा, \"यूसुफ एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक धूर्त है  \n(2) सोफिया एक शूरवीर है  \n(3) यूसुफ एक धूर्त है  \n(4) ईथन एक धूर्त है  \n(5) एवलिन एक शूरवीर है  \n(6) लिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: इसाबेला, मैथ्यू, सैमुएल, यूसुफ, विलियम, और शार्लट। इसाबेला को यह कहते हुए सुना गया, \"मैथ्यू एक धूर्त है या शार्लट एक शूरवीर है\"। मैथ्यू के शब्दों में: \"सैमुएल एक धूर्त है और यूसुफ एक धूर्त है\"। सैमुएल ने कहा कि इसाबेला एक शूरवीर है या इसाबेला एक धूर्त है। यूसुफ के एक बयान में: \"विलियम एक धूर्त नहीं है\"। \"सैमुएल एक धूर्त है,\" विलियम ने घोषित किया। \"मैथ्यू एक शूरवीर है यदि और केवल यदि सैमुएल एक शूरवीर है,\" शार्लट ने घोषित किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक शूरवीर है  \n(2) मैथ्यू एक धूर्त है  \n(3) सैमुएल एक शूरवीर है  \n(4) यूसुफ एक धूर्त है  \n(5) विलियम एक धूर्त है  \n(6) शार्लट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एला, मेसन, बेंजामिन, औरोरा, लुकास, और याकूब। एला के अनुसार, \"औरोरा एक शूरवीर है या बेंजामिन एक शूरवीर है\"। मेसन ने टिप्पणी की, \"बेंजामिन एक शूरवीर है या लुकास एक शूरवीर है\"। बेंजामिन ने कहा कि मेसन एक शूरवीर है या औरोरा एक शूरवीर है। जैसे औरोरा ने कहा, \"एला एक शूरवीर है या लुकास एक शूरवीर है\"। लुकास ने asserted किया: \"अगर एला एक धूर्त है तो मेसन एक धूर्त है\"। \"औरोरा एक धूर्त है यदि और केवल यदि बेंजामिन एक शूरवीर है,\" याकूब ने उल्लेख किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक शूरवीर है  \n(2) मेसन एक शूरवीर है  \n(3) बेंजामिन एक शूरवीर है  \n(4) औरोरा एक शूरवीर है  \n(5) लुकास एक शूरवीर है  \n(6) याकूब एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: मिया, पेनलोप, विक्टोरिया, अमेलिया, हेनरी, और याकूब। मिया के एक बयान में: \"पेनलोप एक शूरवीर है\"। पेनलोप ने कहा, \"अगर अमेलिया एक शूरवीर है तो विक्टोरिया एक धूर्त है\"। विक्टोरिया ने कहा, \"मिया एक धूर्त है यदि और केवल यदि हेनरी एक धूर्त है\"। \"याकूब एक धूर्त नहीं है\" - अमेलिया। \"याकूब एक धूर्त नहीं है\" - हेनरी। \"विक्टोरिया एक धूर्त नहीं है,\" याकूब ने दावा किया। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) मिया एक शूरवीर है  \n(2) पेनलोप एक शूरवीर है  \n(3) विक्टोरिया एक धूर्त है  \n(4) अमेलिया एक धूर्त है  \n(5) हेनरी एक धूर्त है  \n(6) याकूब एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ऐडन, औरोरा, ल्यूक, बेंजामिन, एमिली, और मेसन। ऐडन के अनुसार, \"अगर मेसन एक धूर्त है तो मेसन एक शूरवीर है\"। औरोरा ने कहा कि बेंजामिन एक शूरवीर है। ल्यूक ने नोट किया, \"मेसन एक शूरवीर है और मेसन एक धूर्त है\"। \"मेसन एक धूर्त है और बेंजामिन एक शूरवीर है,\" बेंजामिन ने दावा किया। जैसे कि एमिली ने कहा, \"अगर मेसन एक धूर्त है तो ल्यूक एक धूर्त है\"। मेसन के शब्दों में: \"औरोरा एक शूरवीर है और ल्यूक एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक धूर्त है  \n(2) औरोरा एक धूर्त है  \n(3) ल्यूक एक धूर्त है  \n(4) बेंजामिन एक धूर्त है  \n(5) एमिली एक शूरवीर है  \n(6) मेसन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: लोगन, जेम्स, स्कारलेट, लुकास, एम्मा, और लिली। \"जेम्स एक धूर्त है यदि और केवल यदि लोगन एक शूरवीर है\" - लोगन। जेम्स को यह कहते हुए सुना गया, \"यदि लुकास एक धूर्त है तो लोगन एक शूरवीर है\"। जैसे कि स्कारलेट ने कहा, \"एम्मा एक धूर्त है और लिली एक शूरवीर है\"। \"स्कारलेट एक शूरवीर है यदि और केवल यदि जेम्स एक धूर्त है\" - लुकास। एम्मा ने कहा, \"यदि लिली एक धूर्त है तो लुकास एक शूरवीर है।\" लिली ने कहा, \"लोगन एक शूरवीर है और लिली एक शूरवीर है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक धूर्त है  \n(2) जेम्स एक धूर्त है  \n(3) स्कारलेट एक धूर्त है  \n(4) लुकास एक धूर्त है  \n(5) एम्मा एक धूर्त है  \n(6) लिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: हार्पर, जैक्सन, स्कारलेट, अबिगेल, ओलिवर, और डैनियल। हार्पर ने कहा, \"स्कारलेट एक शूरवीर है और डैनियल एक शूरवीर है\"। जैक्सन ने नोट किया, \"अबिगेल एक शूरवीर है और अबिगेल एक धूर्त है\"। स्कारलेट के शब्दों में: \"जैक्सन एक शूरवीर नहीं है\"। अबिगेल के अनुसार, \"अगर ओलिवर एक शूरवीर है तो हार्पर एक शूरवीर है\"। ओलिवर के एक बयान में: \"जैक्सन एक धूर्त है और डैनियल एक शूरवीर है\"। डैनियल ने कहा कि स्कारलेट एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) हार्पर एक शूरवीर है  \n(2) जैक्सन एक धूर्त है  \n(3) स्कारलेट एक शूरवीर है  \n(4) अबिगेल एक शूरवीर है  \n(5) ओलिवर एक शूरवीर है  \n(6) डैनियल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: सोफिया, औरोरा, एवा, डेविड, पेनलोप, और विलियम। सोफिया ने कहा, \"विलियम एक धूर्त है\"। औरोरा ने कहा, \"एवा एक शूरवीर है और पेनलोप एक शूरवीर है\"। एवा को यह कहते हुए सुना गया, \"डेविड एक शूरवीर है यदि और केवल यदि डेविड एक धूर्त है\"। डेविड ने कहा: \"यदि विलियम एक धूर्त है तो औरोरा एक शूरवीर है\"। \"सोफिया एक शूरवीर है और औरोरा एक शूरवीर है,\" पेनलोप ने घोषणा की। विलियम ने कहा, \"डेविड एक शूरवीर है और पेनलोप एक शूरवीर है।\" तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) औरोरा एक धूर्त है  \n(3) एवा एक धूर्त है  \n(4) डेविड एक धूर्त है  \n(5) पेनलोप एक धूर्त है  \n(6) विलियम एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: सेबेस्टियन, आरिया, एवा, ओलिविया, बेंजामिन, और शार्लट। सेबेस्टियन ने कहा कि बेंजामिन एक धूर्त है या आरिया एक धूर्त है। आरिया ने कहा कि एवा एक धूर्त है। एवा को यह कहते हुए सुना गया, \"शार्लट एक शूरवीर है यदि और केवल यदि बेंजामिन एक शूरवीर है\"। ओलिविया ने आपको बताया कि आरिया एक धूर्त है यदि और केवल यदि आरिया एक शूरवीर है। \"शार्लट एक शूरवीर नहीं है,\" बेंजामिन ने दावा किया। शार्लट ने कहा कि ओलिविया एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सेबेस्टियन एक धूर्त है  \n(2) आरिया एक शूरवीर है  \n(3) एवा एक धूर्त है  \n(4) ओलिविया एक धूर्त है  \n(5) बेंजामिन एक शूरवीर है  \n(6) शार्लट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ग्रेस, ओलिवर, औरोरा, सोफिया, सेबेस्टियन, और ओलिविया। ग्रेस के अनुसार, \"यदि ग्रेस एक शूरवीर है तो औरोरा एक धूर्त है\"। ओलिवर के अनुसार, \"औरोरा एक धूर्त है\"। औरोरा ने कहा, \"औरोरा एक शूरवीर है यदि और केवल यदि सेबेस्टियन एक शूरवीर है\"। \"ओलिवर एक धूर्त है\" - सोफिया। \"औरोरा एक धूर्त है या औरोरा एक शूरवीर है,\" सेबेस्टियन ने कहा। ओलिविया ने कहा, \"सेबेस्टियन एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक शूरवीर है  \n(2) ओलिवर एक शूरवीर है  \n(3) औरोरा एक धूर्त है  \n(4) सोफिया एक धूर्त है  \n(5) सेबेस्टियन एक शूरवीर है  \n(6) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एम्मा, एवलिन, आरिया, ऐडन, सोफिया, और एवरी। एम्मा को यह कहते हुए सुना गया, \"एवलिन एक धूर्त है यदि और केवल यदि एवरी एक शूरवीर है\"। \"एवरी एक शूरवीर है या एवरी एक धूर्त है,\" एवलिन ने दावा किया। आरिया ने कहा कि एम्मा एक धूर्त है और एवलिन एक शूरवीर है। ऐडन ने टिप्पणी की, \"सोफिया एक शूरवीर है और एवरी एक धूर्त है\"। सोफिया के एक बयान में: \"आरिया एक धूर्त नहीं है\"। एवरी ने व्यक्त किया कि सोफिया एक धूर्त है और एवरी एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एम्मा एक शूरवीर है  \n(2) एवलिन एक शूरवीर है  \n(3) आरिया एक धूर्त है  \n(4) ऐडन एक धूर्त है  \n(5) सोफिया एक धूर्त है  \n(6) एवरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: डैनियल, आरिया, ओवेन, ईथन, अलेक्जेंडर, और बेंजामिन। डैनियल ने कहा, \"ओवेन शूरवीर नहीं है\"। आरिया ने कहा, \"अगर ओवेन धूर्त है तो बेंजामिन धूर्त है\"। ओवेन के शब्दों में: \"बेंजामिन धूर्त है\"। ईथन ने कहा, \"ओवेन शूरवीर है\"। \"आरिया शूरवीर है यदि और केवल यदि आरिया धूर्त है,\" अलेक्जेंडर ने कहा। बेंजामिन के शब्दों में: \"ईथन शूरवीर है या ओवेन धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक शूरवीर है  \n(2) आरिया एक धूर्त है  \n(3) ओवेन एक धूर्त है  \n(4) ईथन एक धूर्त है  \n(5) अलेक्जेंडर एक धूर्त है  \n(6) बेंजामिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: बेंजामिन, एवा, विलियम, लुकास, राइली, और लिली। बेंजामिन को यह कहते हुए सुना गया, \"लिली एक शूरवीर है यदि और केवल यदि एवा एक शूरवीर है\"। एवा के शब्दों में: \"लुकास एक शूरवीर है या लिली एक धूर्त है\"। विलियम ने कहा: \"लुकास एक शूरवीर है यदि और केवल यदि राइली एक धूर्त है\"। लुकास ने कहा, \"राइली एक धूर्त है और राइली एक शूरवीर है\"। राइली ने कहा, \"लिली एक धूर्त नहीं है\"। लिली ने कहा कि विलियम एक धूर्त है और विलियम एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) बेंजामिन एक धूर्त है  \n(2) एवा एक शूरवीर है  \n(3) विलियम एक धूर्त है  \n(4) लुकास एक धूर्त है  \n(5) राइली एक धूर्त है  \n(6) लिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: विलियम, लिली, हार्पर, डैनियल, शार्लट, और एलिज़ाबेथ। विलियम ने आपको बताया कि शार्लट एक शूरवीर है। लिली को यह कहते हुए सुना गया, \"विलियम एक शूरवीर है\"। हार्पर ने कहा, \"एलिज़ाबेथ एक धूर्त है और शार्लट एक शूरवीर है।\" जैसा कि डैनियल ने कहा, \"अगर डैनियल एक शूरवीर है तो विलियम एक धूर्त है।\" \"शार्लट एक शूरवीर है और एलिज़ाबेथ एक शूरवीर है,\" शार्लट ने घोषणा की। \"हार्पर एक धूर्त है या हार्पर एक शूरवीर है,\" एलिज़ाबेथ ने घोषणा की। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक धूर्त है  \n(2) लिली एक धूर्त है  \n(3) हार्पर एक धूर्त है  \n(4) डैनियल एक शूरवीर है  \n(5) शार्लट एक धूर्त है  \n(6) एलिज़ाबेथ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: सोफिया, पेनलोप, एमिली, ऐडन, डेविड, और आरिया। सोफिया के एक बयान में: \"पेनलोप एक धूर्त है\"। पेनलोप ने कहा, \"पेनलोप एक शूरवीर है और डेविड एक शूरवीर है\"। एमिली ने आपको बताया कि डेविड एक शूरवीर है। ऐडन ने कहा, \"पेनलोप एक शूरवीर है या आरिया एक धूर्त है\"। डेविड ने कहा, \"ऐडन एक धूर्त है और ऐडन एक शूरवीर है\"। आरिया के अनुसार, \"सोफिया एक शूरवीर है और डेविड एक धूर्त है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) पेनलोप एक धूर्त है  \n(3) एमिली एक धूर्त है  \n(4) ऐडन एक धूर्त है  \n(5) डेविड एक धूर्त है  \n(6) आरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एवलिन, डैनियल, मेसन, सोफिया, ज़ोई, और एवरी। \"ज़ोई एक धूर्त है और एवलिन एक शूरवीर है\" - एवलिन। डैनियल के शब्दों में: \"अगर ज़ोई एक धूर्त है तो सोफिया एक धूर्त है\"। मेसन के अनुसार, \"एवलिन एक शूरवीर है\"। सोफिया के अनुसार, \"एवरी एक धूर्त है या ज़ोई एक शूरवीर है\"। \"मेसन एक धूर्त नहीं है,\" ज़ोई ने घोषणा की। \"ज़ोई एक धूर्त है या डैनियल एक धूर्त है,\" एवरी ने उल्लेख किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक धूर्त है  \n(2) डैनियल एक शूरवीर है  \n(3) मेसन एक धूर्त है  \n(4) सोफिया एक धूर्त है  \n(5) ज़ोई एक धूर्त है  \n(6) एवरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: सोफिया, अलेक्जेंडर, याकूब, हार्पर, स्कारलेट, और हेनरी। सोफिया के अनुसार, \"याकूब एक शूरवीर है और स्कारलेट एक शूरवीर है\"। अलेक्जेंडर के अनुसार, \"हार्पर एक धूर्त है और याकूब एक धूर्त है\"। याकूब ने आपको बताया कि हेनरी एक शूरवीर है। \"सोफिया एक शूरवीर है यदि और केवल यदि अलेक्जेंडर एक शूरवीर है\" - हार्पर। \"हेनरी एक शूरवीर है या याकूब एक शूरवीर है,\" स्कारलेट ने घोषणा की। हेनरी के अनुसार, \"सोफिया एक धूर्त है या अलेक्जेंडर एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक शूरवीर है  \n(2) अलेक्जेंडर एक धूर्त है  \n(3) याकूब एक शूरवीर है  \n(4) हार्पर एक धूर्त है  \n(5) स्कारलेट एक शूरवीर है  \n(6) हेनरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: लोगन, बेंजामिन, मैथ्यू, विलियम, मिया, और ग्रेस। लोगन ने टिप्पणी की, \"अगर बेंजामिन एक धूर्त है तो मैथ्यू एक शूरवीर है।\" \"ग्रेस एक धूर्त है या लोगन एक शूरवीर है,\" बेंजामिन ने घोषित किया। मैथ्यू ने कहा, \"मिया एक धूर्त है यदि और केवल यदि ग्रेस एक धूर्त है।\" विलियम ने कहा, \"अगर बेंजामिन एक धूर्त है तो ग्रेस एक धूर्त है।\" मिया ने asserted किया: \"विलियम एक धूर्त है।\" ग्रेस ने remarked किया, \"बेंजामिन एक शूरवीर नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लोगन एक शूरवीर है  \n(2) बेंजामिन एक शूरवीर है  \n(3) मैथ्यू एक शूरवीर है  \n(4) विलियम एक शूरवीर है  \n(5) मिया एक धूर्त है  \n(6) ग्रेस एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: अमेलिया, आरिया, हेनरी, ओलिवर, सोफिया, और यूसुफ। अमेलिया ने कहा, \"अगर ओलिवर एक शूरवीर है तो आरिया एक शूरवीर है\"। आरिया ने कहा, \"हेनरी एक धूर्त है और ओलिवर एक शूरवीर है\"। हेनरी ने कहा, \"अगर सोफिया एक धूर्त है तो यूसुफ एक शूरवीर है\"। ओलिवर ने कहा कि हेनरी एक शूरवीर है यदि और केवल यदि सोफिया एक धूर्त है। सोफिया ने आपको बताया कि अगर ओलिवर एक शूरवीर है तो हेनरी एक शूरवीर है। यूसुफ ने कहा: \"ओलिवर एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक शूरवीर है  \n(2) आरिया एक धूर्त है  \n(3) हेनरी एक शूरवीर है  \n(4) ओलिवर एक धूर्त है  \n(5) सोफिया एक शूरवीर है  \n(6) यूसुफ एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: विक्टोरिया, एवरी, जैक्सन, सोफिया, ग्रेस, और सैमुएल। विक्टोरिया ने कहा कि सोफिया एक शूरवीर नहीं है। एवरी ने कहा कि विक्टोरिया एक शूरवीर नहीं है। जैक्सन ने आपको बताया कि एवरी एक धूर्त है और सोफिया एक धूर्त है। सोफिया ने कहा, \"एवरी एक धूर्त है और ग्रेस एक शूरवीर है\"। जैसे ग्रेस ने कहा, \"एवरी एक शूरवीर है\"। सैमुएल ने कहा कि ग्रेस एक धूर्त है यदि और केवल यदि जैक्सन एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विक्टोरिया एक शूरवीर है  \n(2) एवरी एक धूर्त है  \n(3) जैक्सन एक शूरवीर है  \n(4) सोफिया एक धूर्त है  \n(5) ग्रेस एक धूर्त है  \n(6) सैमुएल एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: डेविड, ज़ोई, ईथन, लिली, हार्पर, और एम्मा। डेविड ने आपको बताया कि लिली एक धूर्त है यदि और केवल यदि डेविड एक शूरवीर है। ज़ोई के अनुसार, \"एम्मा एक शूरवीर है या डेविड एक धूर्त है\"। ईथन ने कहा कि हार्पर एक शूरवीर नहीं है। लिली के शब्दों में: \"यदि डेविड एक शूरवीर है तो लिली एक शूरवीर है\"। हार्पर ने कहा, \"लिली एक धूर्त नहीं है\"। एम्मा को यह कहते हुए सुना गया, \"लिली एक शूरवीर है यदि और केवल यदि डेविड एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डेविड एक शूरवीर है  \n(2) ज़ोई एक धूर्त है  \n(3) ईथन एक शूरवीर है  \n(4) लिली एक धूर्त है  \n(5) हार्पर एक धूर्त है  \n(6) एम्मा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एवलिन, औरोरा, एला, शार्लट, अबिगेल, और इसाबेला। एवलिन के अनुसार, \"अबिगेल एक शूरवीर है और शार्लट एक शूरवीर है\"। औरोरा ने कहा, \"इसाबेला एक शूरवीर नहीं है\"। एला ने कहा, \"एवलिन एक धूर्त है और अबिगेल एक शूरवीर है\"। शार्लट के शब्दों में: \"एला एक धूर्त नहीं है\"। अबिगेल के एक बयान में: \"एला एक शूरवीर है या औरोरा एक शूरवीर है\"। इसाबेला ने आपको बताया कि एवलिन एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक धूर्त है  \n(2) औरोरा एक धूर्त है  \n(3) एला एक धूर्त है  \n(4) शार्लट एक धूर्त है  \n(5) अबिगेल एक धूर्त है  \n(6) इसाबेला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एलिज़ाबेथ, मैथ्यू, ओलिवर, एवा, लोगन, और नूह। एलिज़ाबेथ को यह कहते हुए सुना गया, \"अगर ओलिवर एक शूरवीर है तो एवा एक शूरवीर है\"। मैथ्यू को यह कहते हुए सुना गया, \"एवा एक धूर्त है यदि और केवल यदि एलिज़ाबेथ एक धूर्त है\"। ओलिवर के शब्दों में: \"एलिज़ाबेथ एक शूरवीर है\"। एवा के एक बयान में: \"लोगन एक शूरवीर है और एवा एक शूरवीर है\"। लोगन ने कहा, \"एवा एक धूर्त है यदि और केवल यदि ओलिवर एक धूर्त है\"। \"मैथ्यू एक धूर्त नहीं है,\" नूह ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक शूरवीर है  \n(2) मैथ्यू एक शूरवीर है  \n(3) ओलिवर एक शूरवीर है  \n(4) एवा एक शूरवीर है  \n(5) लोगन एक शूरवीर है  \n(6) नूह एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: सेबेस्टियन, जैक, ईथन, पेनलोप, सोफिया, और ल्यूक। सेबेस्टियन के एक बयान में: \"जैक एक शूरवीर है यदि और केवल यदि ईथन एक धूर्त है\"। \"पेनलोप एक शूरवीर है यदि और केवल यदि पेनलोप एक धूर्त है,\" जैक ने घोषित किया। ईथन ने remarked किया, \"पेनलोप एक धूर्त है\"। पेनलोप ने noted किया, \"जैक एक धूर्त है और सोफिया एक धूर्त है\"। जैसे सोफिया ने कहा, \"सेबेस्टियन एक धूर्त है या ल्यूक एक शूरवीर है\"। \"पेनलोप एक धूर्त है या जैक एक धूर्त है,\" ल्यूक ने दावा किया। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सेबेस्टियन एक शूरवीर है  \n(2) जैक एक धूर्त है  \n(3) ईथन एक शूरवीर है  \n(4) पेनलोप एक धूर्त है  \n(5) सोफिया एक शूरवीर है  \n(6) ल्यूक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ईथन, विलियम, एम्मा, बेंजामिन, इसाबेला, और मिया। ईथन ने कहा, \"बेंजामिन एक धूर्त है या विलियम एक धूर्त है\"। विलियम ने asserted किया: \"मिया एक शूरवीर है यदि और केवल यदि इसाबेला एक शूरवीर है\"। \"मिया एक धूर्त है और इसाबेला एक शूरवीर है,\" एम्मा ने दावा किया। बेंजामिन ने टिप्पणी की, \"विलियम एक शूरवीर है और मिया एक शूरवीर है\"। इसाबेला ने टिप्पणी की, \"यदि बेंजामिन एक शूरवीर है तो एम्मा एक धूर्त है\"। मिया ने आपको बताया कि इसाबेला एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक धूर्त है  \n(2) विलियम एक शूरवीर है  \n(3) एम्मा एक धूर्त है  \n(4) बेंजामिन एक शूरवीर है  \n(5) इसाबेला एक शूरवीर है  \n(6) मिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: लोगन, ओलिविया, ऐडन, शार्लट, याकूब, और ज़ोई। लोगन ने कहा, \"याकूब एक शूरवीर है\"। ओलिविया ने कहा, \"ऐडन एक शूरवीर है या ज़ोई एक धूर्त है\"। \"अगर लोगन एक शूरवीर है तो ओलिविया एक शूरवीर है\" - ऐडन। शार्लट ने कहा, \"ज़ोई एक शूरवीर है या ओलिविया एक शूरवीर है\"। जैसा कि याकूब ने कहा, \"ऐडन एक धूर्त है या शार्लट एक धूर्त है\"। ज़ोई के अनुसार, \"याकूब एक धूर्त है यदि और केवल यदि लोगन एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) लोगन एक धूर्त है  \n(2) ओलिविया एक शूरवीर है  \n(3) ऐडन एक शूरवीर है  \n(4) शार्लट एक शूरवीर है  \n(5) याकूब एक धूर्त है  \n(6) ज़ोई एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: शार्लट, बेंजामिन, सेबेस्टियन, डैनियल, जेम्स, और मिया। \"अगर जेम्स एक शूरवीर है तो सेबेस्टियन एक धूर्त है,\" शार्लट ने घोषणा की। बेंजामिन ने asserted किया: \"सेबेस्टियन एक धूर्त है\"। सेबेस्टियन ने कहा, \"जेम्स एक शूरवीर है\"। डैनियल ने remarked किया, \"मिया एक धूर्त है यदि और केवल यदि सेबेस्टियन एक शूरवीर है\"। जेम्स ने stated किया, \"मिया एक शूरवीर है\"। मिया को यह कहते हुए सुना गया, \"डैनियल एक धूर्त है या जेम्स एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक धूर्त है  \n(2) बेंजामिन एक धूर्त है  \n(3) सेबेस्टियन एक शूरवीर है  \n(4) डैनियल एक धूर्त है  \n(5) जेम्स एक शूरवीर है  \n(6) मिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: जेम्स, सोफिया, राइली, जैक्सन, जैक, और बेंजामिन। जेम्स ने आपको बताया कि अगर जैक्सन एक धूर्त है तो राइली एक धूर्त है। जैसे सोफिया ने कहा, \"राइली एक धूर्त है यदि और केवल यदि जेम्स एक धूर्त है\"। राइली के एक बयान में: \"बेंजामिन एक धूर्त है या बेंजामिन एक शूरवीर है\"। जैक्सन ने कहा कि बेंजामिन एक धूर्त है या बेंजामिन एक शूरवीर है। जैक ने कहा कि जेम्स एक शूरवीर नहीं है। बेंजामिन ने नोट किया, \"अगर सोफिया एक शूरवीर है तो जैक एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जेम्स एक शूरवीर है  \n(2) सोफिया एक शूरवीर है  \n(3) राइली एक शूरवीर है  \n(4) जैक्सन एक शूरवीर है  \n(5) जैक एक धूर्त है  \n(6) बेंजामिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ग्रेस, मिया, अमेलिया, अबिगेल, स्कारलेट, और औरोरा। ग्रेस के शब्दों में: \"स्कारलेट एक धूर्त है या औरोरा एक शूरवीर है\"। मिया के एक बयान में: \"स्कारलेट एक शूरवीर है यदि और केवल यदि अबिगेल एक शूरवीर है\"। अमेलिया ने कहा, \"अबिगेल एक धूर्त है या ग्रेस एक धूर्त है\"। \"ग्रेस एक धूर्त है और औरोरा एक शूरवीर है,\" अबिगेल ने दावा किया। स्कारलेट ने नोट किया, \"औरोरा एक धूर्त है और ग्रेस एक शूरवीर है\"। \"अबिगेल एक धूर्त है\" - औरोरा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ग्रेस एक शूरवीर है  \n(2) मिया एक शूरवीर है  \n(3) अमेलिया एक शूरवीर है  \n(4) अबिगेल एक धूर्त है  \n(5) स्कारलेट एक धूर्त है  \n(6) औरोरा एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: सोफिया, राइली, लुकास, लियम, जैक्सन, और स्कारलेट। \"लियम शूरवीर नहीं है\" - सोफिया। \"सोफिया धूर्त है या लुकास धूर्त है,\" राइली ने घोषणा की। लुकास ने कहा कि अगर जैक्सन शूरवीर है तो स्कारलेट शूरवीर है। लियम को यह कहते हुए सुना गया, \"स्कारलेट धूर्त है\"। जैक्सन ने कहा, \"अगर लियम धूर्त है तो राइली शूरवीर है\"। स्कारलेट के अनुसार, \"लुकास धूर्त है यदि और केवल यदि सोफिया शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) राइली एक शूरवीर है  \n(3) लुकास एक धूर्त है  \n(4) लियम एक शूरवीर है  \n(5) जैक्सन एक शूरवीर है  \n(6) स्कारलेट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: याकूब, क्लोई, डैनियल, एवा, आरिया, और पेनलोप। याकूब ने टिप्पणी की, \"डैनियल एक शूरवीर है यदि और केवल यदि याकूब एक शूरवीर है\"। क्लोई को यह कहते हुए सुना गया, \"यदि पेनलोप एक शूरवीर है तो याकूब एक धूर्त है\"। डैनियल को यह कहते हुए सुना गया, \"यदि याकूब एक धूर्त है तो क्लोई एक धूर्त है\"। एवा ने कहा, \"डैनियल एक शूरवीर है और क्लोई एक धूर्त है\"। जैसे आरिया ने कहा, \"पेनलोप एक धूर्त है और पेनलोप एक शूरवीर है\"। पेनलोप ने कहा, \"पेनलोप एक शूरवीर है यदि और केवल यदि एवा एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) याकूब एक शूरवीर है  \n(2) क्लोई एक धूर्त है  \n(3) डैनियल एक शूरवीर है  \n(4) एवा एक शूरवीर है  \n(5) आरिया एक धूर्त है  \n(6) पेनलोप एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: याकूब, जैक, एलिज़ाबेथ, मिया, ज़ोई, और मेसन। याकूब ने कहा, \"जैक एक धूर्त नहीं है\"। जैक को यह कहते हुए सुना गया, \"ज़ोई एक धूर्त है और याकूब एक धूर्त है\"। \"मिया एक धूर्त है,\" एलिज़ाबेथ ने दावा किया। मिया के एक बयान में: \"ज़ोई एक शूरवीर नहीं है\"। ज़ोई को यह कहते हुए सुना गया, \"एलिज़ाबेथ एक शूरवीर है\"। मेसन ने कहा: \"ज़ोई एक शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) याकूब एक धूर्त है  \n(2) जैक एक धूर्त है  \n(3) एलिज़ाबेथ एक शूरवीर है  \n(4) मिया एक धूर्त है  \n(5) ज़ोई एक शूरवीर है  \n(6) मेसन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एमिली, ओलिवर, स्कारलेट, एला, इसाबेला, और एवा। \"स्कारलेट एक शूरवीर है यदि और केवल यदि ओलिवर एक शूरवीर है,\" एमिली ने दावा किया। जैसा कि ओलिवर ने कहा, \"इसाबेला एक शूरवीर है यदि और केवल यदि एवा एक शूरवीर है\"। स्कारलेट ने नोट किया, \"ओलिवर एक शूरवीर है यदि और केवल यदि इसाबेला एक शूरवीर है\"। एला ने नोट किया, \"एमिली एक शूरवीर है और एला एक शूरवीर है\"। जैसा कि इसाबेला ने कहा, \"ओलिवर एक धूर्त है या एला एक शूरवीर है\"। \"स्कारलेट एक धूर्त है यदि और केवल यदि इसाबेला एक शूरवीर है\" - एवा। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एमिली एक धूर्त है  \n(2) ओलिवर एक शूरवीर है  \n(3) स्कारलेट एक धूर्त है  \n(4) एला एक धूर्त है  \n(5) इसाबेला एक धूर्त है  \n(6) एवा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: शार्लट, एला, अलेक्जेंडर, ऐडन, जैक्सन, और यूसुफ। शार्लट ने कहा: \"जैक्सन एक शूरवीर है या एला एक शूरवीर है\"। एला ने कहा, \"शार्लट एक शूरवीर नहीं है\"। अलेक्जेंडर ने टिप्पणी की, \"जैक्सन एक धूर्त है यदि और केवल यदि ऐडन एक धूर्त है\"। ऐडन ने नोट किया, \"अलेक्जेंडर एक धूर्त नहीं है\"। जैक्सन के शब्दों में: \"अलेक्जेंडर एक शूरवीर है\"। यूसुफ ने कहा, \"एला एक धूर्त नहीं है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) शार्लट एक शूरवीर है  \n(2) एला एक धूर्त है  \n(3) अलेक्जेंडर एक शूरवीर है  \n(4) ऐडन एक शूरवीर है  \n(5) जैक्सन एक शूरवीर है  \n(6) यूसुफ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एवलिन, हेनरी, लोगन, एवरी, डैनियल, और ऐडन। एवलिन ने कहा कि डैनियल एक धूर्त है और लोगन एक शूरवीर है। हेनरी ने आपको बताया कि लोगन एक शूरवीर है यदि और केवल यदि ऐडन एक धूर्त है। \"डैनियल एक शूरवीर है,\" लोगन ने दावा किया। एवरी को यह कहते हुए सुना गया, \"हेनरी एक धूर्त नहीं है\"। \"हेनरी एक धूर्त नहीं है\" - डैनियल। ऐडन के शब्दों में: \"हेनरी एक धूर्त नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवलिन एक धूर्त है  \n(2) हेनरी एक धूर्त है  \n(3) लोगन एक धूर्त है  \n(4) एवरी एक धूर्त है  \n(5) डैनियल एक धूर्त है  \n(6) ऐडन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: याकूब, विलियम, विक्टोरिया, मेसन, ग्रेस, और अमेलिया। याकूब ने कहा: \"मेसन एक शूरवीर है\"। विलियम के शब्दों में: \"विलियम एक शूरवीर है और याकूब एक शूरवीर है\"। \"याकूब एक शूरवीर है यदि और केवल यदि याकूब एक धूर्त है\" - विक्टोरिया। मेसन ने कहा, \"विलियम एक धूर्त है\"। ग्रेस ने कहा कि ग्रेस एक शूरवीर है और विलियम एक शूरवीर है। \"मेसन एक धूर्त है और अमेलिया एक शूरवीर है,\" अमेलिया ने कहा। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) याकूब एक शूरवीर है  \n(2) विलियम एक धूर्त है  \n(3) विक्टोरिया एक धूर्त है  \n(4) मेसन एक शूरवीर है  \n(5) ग्रेस एक धूर्त है  \n(6) अमेलिया एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एमिली, ओलिविया, सैमुएल, लियम, एवलिन, और मेसन। एमिली ने आपको बताया कि एवलिन एक धूर्त नहीं है। ओलिविया ने कहा, \"मेसेन एक शूरवीर है और लियम एक शूरवीर है।\" \"लियम एक धूर्त है,\" सैमुएल ने दावा किया। लियम ने कहा, \"ओलिविया एक धूर्त नहीं है।\" एवलिन के शब्दों में: \"मेसेन एक धूर्त है या लियम एक धूर्त है।\" \"लियम एक धूर्त है और लियम एक शूरवीर है\" - मेसन। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एमिली एक शूरवीर है  \n(2) ओलिविया एक धूर्त है  \n(3) सैमुएल एक शूरवीर है  \n(4) लियम एक धूर्त है  \n(5) एवलिन एक शूरवीर है  \n(6) मेसन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: मेसन, सैमुएल, एमिली, शार्लट, विक्टोरिया, और हार्पर। मेसन ने कहा: \"यदि सैमुएल एक शूरवीर है तो एमिली एक धूर्त है।\" सैमुएल ने कहा, \"हार्पर एक शूरवीर नहीं है।\" \"सैमुएल एक धूर्त है यदि और केवल यदि मेसन एक धूर्त है\" - एमिली। शार्लट ने कहा कि एमिली एक शूरवीर नहीं है। विक्टोरिया ने टिप्पणी की, \"शार्लट एक शूरवीर है या सैमुएल एक शूरवीर है।\" \"विक्टोरिया एक शूरवीर है यदि और केवल यदि हार्पर एक शूरवीर है,\" हार्पर ने घोषणा की। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) मेसन एक शूरवीर है  \n(2) सैमुएल एक धूर्त है  \n(3) एमिली एक धूर्त है  \n(4) शार्लट एक शूरवीर है  \n(5) विक्टोरिया एक शूरवीर है  \n(6) हार्पर एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: डैनियल, ओलिवर, एवा, विक्टोरिया, ज़ोई, और ओलिविया। डैनियल ने कहा: \"ओलिविया एक धूर्त है या ओलिवर एक शूरवीर है\"। ओलिवर ने टिप्पणी की, \"ज़ोई एक धूर्त है और एवा एक धूर्त है\"। एवा ने कहा: \"ओलिविया एक धूर्त है\"। विक्टोरिया ने आपको बताया कि ओलिविया एक शूरवीर है यदि और केवल यदि डैनियल एक शूरवीर है। ज़ोई के अनुसार, \"ओलिविया एक शूरवीर नहीं है\"। जैसे ओलिविया ने कहा, \"डैनियल एक शूरवीर है या ओलिविया एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) डैनियल एक शूरवीर है  \n(2) ओलिवर एक शूरवीर है  \n(3) एवा एक धूर्त है  \n(4) विक्टोरिया एक शूरवीर है  \n(5) ज़ोई एक धूर्त है  \n(6) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: अबिगेल, मेसन, ज़ोई, अलेक्जेंडर, ल्यूक, और लिली। अबिगेल के अनुसार, \"मेसन एक शूरवीर है यदि और केवल यदि ल्यूक एक धूर्त है\"। मेसन ने कहा, \"लिली एक शूरवीर है और ज़ोई एक धूर्त है।\" \"यदि ज़ोई एक शूरवीर है तो ल्यूक एक शूरवीर है,\" ज़ोई ने दावा किया। \"यदि मेसन एक शूरवीर है तो ल्यूक एक शूरवीर है,\" अलेक्जेंडर ने घोषणा की। ल्यूक ने टिप्पणी की, \"ज़ोई एक धूर्त है यदि और केवल यदि अलेक्जेंडर एक धूर्त है\"। \"अबिगेल एक धूर्त है या मेसन एक शूरवीर है,\" लिली ने उल्लेख किया। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) अबिगेल एक शूरवीर है  \n(2) मेसन एक धूर्त है  \n(3) ज़ोई एक शूरवीर है  \n(4) अलेक्जेंडर एक शूरवीर है  \n(5) ल्यूक एक शूरवीर है  \n(6) लिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एवरी, लोगन, लिली, सोफिया, ईथन, और एला। \"सोफिया एक धूर्त है या लिली एक शूरवीर है,\" एवरी ने दावा किया। लोगन ने कहा कि सोफिया एक धूर्त है यदि और केवल यदि ईथन एक धूर्त है। लिली ने remarked किया, \"एला एक शूरवीर है और ईथन एक शूरवीर है\"। सोफिया ने remarked किया, \"यदि ईथन एक धूर्त है तो ईथन एक शूरवीर है\"। ईथन ने टिप्पणी की, \"एवरी एक शूरवीर है या लिली एक धूर्त है\"। \"लोगन एक धूर्त है और सोफिया एक धूर्त है\" - एला। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एवरी एक धूर्त है  \n(2) लोगन एक शूरवीर है  \n(3) लिली एक धूर्त है  \n(4) सोफिया एक शूरवीर है  \n(5) ईथन एक शूरवीर है  \n(6) एला एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: विलियम, यूसुफ, एमिली, जेम्स, सेबेस्टियन, और एवा। विलियम को यह कहते हुए सुना गया, \"सेबेस्टियन एक धूर्त है या एवा एक शूरवीर है\"। यूसुफ ने कहा, \"विलियम एक धूर्त है यदि और केवल यदि एवा एक धूर्त है\"। एमिली के एक बयान में: \"एवा एक शूरवीर है यदि और केवल यदि यूसुफ एक शूरवीर है\"। जेम्स ने कहा, \"सेबेस्टियन एक शूरवीर नहीं है\"। \"यदि यूसुफ एक शूरवीर है तो एवा एक धूर्त है,\" सेबेस्टियन ने घोषणा की। एवा ने कहा, \"विलियम एक शूरवीर है और यूसुफ एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक धूर्त है  \n(2) यूसुफ एक शूरवीर है  \n(3) एमिली एक धूर्त है  \n(4) जेम्स एक धूर्त है  \n(5) सेबेस्टियन एक शूरवीर है  \n(6) एवा एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एलिज़ाबेथ, ऐडन, डैनियल, लोगन, ओलिवर, और सेबेस्टियन। एलिज़ाबेथ ने कहा: \"ऐडन शूरवीर नहीं है\"। ऐडन को यह कहते हुए सुना गया, \"सेबेस्टियन धूर्त है यदि और केवल यदि सेबेस्टियन शूरवीर है\"। डैनियल के अनुसार, \"लोगन शूरवीर नहीं है\"। लोगन ने कहा: \"ऐडन शूरवीर नहीं है\"। ओलिवर ने आपको बताया कि सेबेस्टियन धूर्त नहीं है। सेबेस्टियन के शब्दों में: \"ऐडन शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक शूरवीर है  \n(2) ऐडन एक धूर्त है  \n(3) डैनियल एक धूर्त है  \n(4) लोगन एक शूरवीर है  \n(5) ओलिवर एक शूरवीर है  \n(6) सेबेस्टियन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एवरी, शार्लट, लुकास, लिली, सोफिया, और विक्टोरिया। \"शार्लट शूरवीर नहीं है,\" एवरी ने कहा। शार्लट को यह कहते हुए सुना गया, \"विक्टोरिया एक धूर्त है\"। \"अगर लिली शूरवीर है तो सोफिया एक धूर्त है,\" लुकास ने कहा। लिली ने टिप्पणी की, \"लुकास शूरवीर नहीं है\"। सोफिया ने कहा: \"विक्टोरिया एक धूर्त है यदि और केवल यदि विक्टोरिया एक शूरवीर है\"। विक्टोरिया ने कहा, \"अगर लुकास एक धूर्त है तो सोफिया एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एवरी एक शूरवीर है  \n(2) शार्लट एक धूर्त है  \n(3) लुकास एक शूरवीर है  \n(4) लिली एक धूर्त है  \n(5) सोफिया एक धूर्त है  \n(6) विक्टोरिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: लुकास, ओलिवर, जैक्सन, बेंजामिन, नूह, और ल्यूक। लुकास ने कहा कि ल्यूक एक शूरवीर है। ओलिवर के एक बयान में: \"नूह एक धूर्त है\"। जैक्सन को यह कहते हुए सुना गया, \"अगर ल्यूक एक धूर्त है तो बेंजामिन एक धूर्त है\"। बेंजामिन के अनुसार, \"ल्यूक एक धूर्त है और लुकास एक धूर्त है\"। नूह ने कहा कि ओलिवर एक धूर्त है और नूह एक शूरवीर है। ल्यूक के एक बयान में: \"लुकास एक धूर्त है और नूह एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक धूर्त है  \n(2) ओलिवर एक शूरवीर है  \n(3) जैक्सन एक धूर्त है  \n(4) बेंजामिन एक शूरवीर है  \n(5) नूह एक धूर्त है  \n(6) ल्यूक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: जैक, ऐडन, सैमुएल, सोफिया, एवलिन, और एवरी। जैक के शब्दों में: \"अगर जैक एक शूरवीर है तो एवरी एक धूर्त है\"। ऐडन ने टिप्पणी की, \"जैक एक शूरवीर है\"। सैमुएल ने कहा, \"एवलिन एक शूरवीर है और ऐडन एक धूर्त है।\" सोफिया ने कहा, \"जैक एक धूर्त नहीं है।\" एवलिन के एक बयान में: \"सैमुएल एक धूर्त है और सोफिया एक धूर्त है\"। एवरी ने व्यक्त किया कि सैमुएल एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक एक शूरवीर है  \n(2) ऐडन एक शूरवीर है  \n(3) सैमुएल एक धूर्त है  \n(4) सोफिया एक शूरवीर है  \n(5) एवलिन एक धूर्त है  \n(6) एवरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: लुकास, विलियम, सेबेस्टियन, डैनियल, एम्मा, और ओलिविया। लुकास ने कहा कि सेबेस्टियन एक शूरवीर है। विलियम ने कहा, \"लुकास एक शूरवीर नहीं है\"। सेबेस्टियन ने कहा, \"ओलिविया एक धूर्त है।\" डैनियल ने कहा, \"एम्मा एक शूरवीर है और सेबेस्टियन एक धूर्त है।\" एम्मा ने कहा, \"लुकास एक शूरवीर है।\" ओलिविया ने टिप्पणी की, \"सेबेस्टियन एक शूरवीर है या लुकास एक धूर्त है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) लुकास एक धूर्त है  \n(2) विलियम एक शूरवीर है  \n(3) सेबेस्टियन एक धूर्त है  \n(4) डैनियल एक धूर्त है  \n(5) एम्मा एक धूर्त है  \n(6) ओलिविया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: विलियम, ऐडन, स्कारलेट, एवरी, एवा, और बेंजामिन। विलियम ने कहा, \"अगर स्कारलेट एक शूरवीर है तो एवा एक धूर्त है।\" ऐडन ने कहा कि अगर बेंजामिन एक धूर्त है तो बेंजामिन एक शूरवीर है। स्कारलेट के एक बयान में: \"विलियम एक शूरवीर नहीं है।\" एवरी ने कहा, \"ऐडन एक धूर्त है।\" एवा ने कहा, \"स्कारलेट एक शूरवीर है।\" बेंजामिन ने कहा कि एवा एक शूरवीर है और एवरी एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) ऐडन एक धूर्त है  \n(3) स्कारलेट एक धूर्त है  \n(4) एवरी एक शूरवीर है  \n(5) एवा एक धूर्त है  \n(6) बेंजामिन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा आबाद है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: जैक्सन, हेनरी, डैनियल, ल्यूक, सैमुएल, और क्लोई। \"डैनियल एक धूर्त है\" - जैक्सन। हेनरी ने कहा, \"अगर सैमुएल एक शूरवीर है तो क्लोई एक शूरवीर है\"। डैनियल ने कहा कि ल्यूक एक शूरवीर है। \"क्लोई एक शूरवीर नहीं है,\" ल्यूक ने घोषणा की। \"हेनरी एक धूर्त नहीं है,\" सैमुएल ने उल्लेख किया। क्लोई को यह कहते हुए सुना गया, \"ल्यूक एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक शूरवीर है  \n(2) हेनरी एक शूरवीर है  \n(3) डैनियल एक धूर्त है  \n(4) ल्यूक एक धूर्त है  \n(5) सैमुएल एक शूरवीर है  \n(6) क्लोई एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: जैक्सन, सोफिया, इसाबेला, एलिज़ाबेथ, एवा, और लिली। जैक्सन के एक बयान में: \"एवा एक शूरवीर है यदि और केवल यदि एवा एक धूर्त है\"। सोफिया के अनुसार, \"एवा एक धूर्त है और इसाबेला एक धूर्त है\"। \"यदि एवा एक शूरवीर है तो एवा एक धूर्त है,\" इसाबेला ने दावा किया। एलिज़ाबेथ ने कहा, \"एवा एक धूर्त है यदि और केवल यदि सोफिया एक धूर्त है\"। एवा के अनुसार, \"इसाबेला एक शूरवीर है या सोफिया एक धूर्त है\"। लिली के शब्दों में: \"एलिज़ाबेथ एक शूरवीर है और एवा एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) जैक्सन एक धूर्त है  \n(2) सोफिया एक धूर्त है  \n(3) इसाबेला एक धूर्त है  \n(4) एलिज़ाबेथ एक धूर्त है  \n(5) एवा एक शूरवीर है  \n(6) लिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: सैमुएल, लिली, आरिया, एवरी, अबिगेल, और बेंजामिन। सैमुएल ने कहा, \"लिली एक शूरवीर है और आरिया एक शूरवीर है\"। लिली ने कहा, \"सैमुएल एक शूरवीर है।\" आरिया ने आपको बताया कि अबिगेल एक शूरवीर है। एवरी के एक बयान में: \"यदि बेंजामिन एक शूरवीर है तो बेंजामिन एक धूर्त है\"। अबिगेल के शब्दों में: \"एवरी एक धूर्त है और लिली एक धूर्त है\"। बेंजामिन ने कहा, \"अबिगेल एक शूरवीर है या लिली एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सैमुएल एक धूर्त है  \n(2) लिली एक धूर्त है  \n(3) आरिया एक शूरवीर है  \n(4) एवरी एक धूर्त है  \n(5) अबिगेल एक शूरवीर है  \n(6) बेंजामिन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: इसाबेला, सोफिया, एला, जैक्सन, ल्यूक, और हेनरी। इसाबेला ने कहा, \"अगर जैक्सन एक शूरवीर है तो एला एक शूरवीर है\"। सोफिया ने नोट किया, \"इसाबेला एक धूर्त नहीं है\"। एला ने टिप्पणी की, \"हेनरी एक शूरवीर है और इसाबेला एक धूर्त है\"। जैक्सन ने asserted किया: \"ल्यूक एक शूरवीर नहीं है\"। ल्यूक ने asserted किया: \"अगर इसाबेला एक धूर्त है तो सोफिया एक शूरवीर है\"। जैसे हेनरी ने कहा, \"ल्यूक एक शूरवीर है या ल्यूक एक धूर्त है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) इसाबेला एक शूरवीर है  \n(2) सोफिया एक शूरवीर है  \n(3) एला एक धूर्त है  \n(4) जैक्सन एक धूर्त है  \n(5) ल्यूक एक शूरवीर है  \n(6) हेनरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: शार्लट, हेनरी, एलिज़ाबेथ, औरोरा, यूसुफ, और जैक्सन। शार्लट के शब्दों में: \"यूसुफ एक शूरवीर है और औरोरा एक धूर्त है\"। हेनरी के अनुसार, \"यूसुफ एक धूर्त है यदि और केवल यदि जैक्सन एक शूरवीर है\"। एलिज़ाबेथ ने आपको बताया कि औरोरा एक धूर्त नहीं है। \"एलिज़ाबेथ एक धूर्त है या एलिज़ाबेथ एक शूरवीर है,\" औरोरा ने दावा किया। \"औरोरा एक धूर्त है यदि और केवल यदि शार्लट एक धूर्त है,\" यूसुफ ने घोषित किया। जैक्सन ने आपको बताया कि शार्लट एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) शार्लट एक धूर्त है  \n(2) हेनरी एक धूर्त है  \n(3) एलिज़ाबेथ एक शूरवीर है  \n(4) औरोरा एक शूरवीर है  \n(5) यूसुफ एक धूर्त है  \n(6) जैक्सन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एम्मा, लोगन, जैक्सन, डैनियल, आरिया, और हेनरी। \"एम्मा एक शूरवीर है यदि और केवल यदि आरिया एक धूर्त है,\" एम्मा ने घोषित किया। लोगन ने आपको बताया कि एम्मा एक शूरवीर है यदि और केवल यदि डैनियल एक शूरवीर है। जैक्सन के अनुसार, \"आरिया एक धूर्त है यदि और केवल यदि हेनरी एक धूर्त है\"। डैनियल के एक बयान में: \"आरिया एक शूरवीर नहीं है\"। आरिया ने नोट किया, \"डैनियल एक शूरवीर है यदि और केवल यदि हेनरी एक धूर्त है\"। हेनरी ने टिप्पणी की, \"एम्मा एक शूरवीर है या जैक्सन एक शूरवीर है\"। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एम्मा एक शूरवीर है  \n(2) लोगन एक शूरवीर है  \n(3) जैक्सन एक धूर्त है  \n(4) डैनियल एक शूरवीर है  \n(5) आरिया एक धूर्त है  \n(6) हेनरी एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एलिज़ाबेथ, सोफिया, विक्टोरिया, अबिगेल, ग्रेस, और ल्यूक। \"सोफिया एक शूरवीर है यदि और केवल यदि ल्यूक एक धूर्त है\" - एलिज़ाबेथ। सोफिया ने कहा, \"एलिज़ाबेथ एक शूरवीर है या ग्रेस एक शूरवीर है\"। विक्टोरिया ने कहा, \"ग्रेस एक धूर्त है और अबिगेल एक शूरवीर है\"। अबिगेल ने कहा, \"विक्टोरिया एक धूर्त है या सोफिया एक शूरवीर है।\" ग्रेस ने कहा, \"ल्यूक एक धूर्त है और एलिज़ाबेथ एक शूरवीर है।\" ल्यूक ने आपको बताया कि सोफिया एक शूरवीर है और अबिगेल एक धूर्त है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) एलिज़ाबेथ एक शूरवीर है  \n(2) सोफिया एक शूरवीर है  \n(3) विक्टोरिया एक धूर्त है  \n(4) अबिगेल एक शूरवीर है  \n(5) ग्रेस एक शूरवीर है  \n(6) ल्यूक एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: लिली, इसाबेला, एला, जेम्स, एलिज़ाबेथ, और सेबेस्टियन। लिली ने कहा, \"जेम्स एक शूरवीर नहीं है।\" इसाबेला ने कहा, \"एला एक शूरवीर है या एला एक धूर्त है।\" एला ने कहा, \"लिली एक धूर्त है और लिली एक शूरवीर है।\" जेम्स ने कहा: \"एलिज़ाबेथ एक धूर्त है या एला एक शूरवीर है।\" एलिज़ाबेथ के अनुसार, \"अगर एला एक धूर्त है तो इसाबेला एक धूर्त है।\" सेबेस्टियन के शब्दों में: \"लिली एक शूरवीर है और एलिज़ाबेथ एक शूरवीर है।\" तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) लिली एक धूर्त है  \n(2) इसाबेला एक शूरवीर है  \n(3) एला एक धूर्त है  \n(4) जेम्स एक शूरवीर है  \n(5) एलिज़ाबेथ एक धूर्त है  \n(6) सेबेस्टियन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: विलियम, ईथन, औरोरा, एवरी, अबिगेल, और लुकास। विलियम ने कहा: \"अगर अबिगेल एक धूर्त है तो लुकास एक धूर्त है\"। ईथन ने कहा, \"एवरी एक धूर्त है या लुकास एक धूर्त है\"। औरोरा के एक बयान में: \"अबिगेल एक शूरवीर है यदि और केवल यदि लुकास एक शूरवीर है\"। एवरी के शब्दों में: \"अगर लुकास एक शूरवीर है तो ईथन एक धूर्त है\"। अबिगेल ने कहा कि अगर लुकास एक शूरवीर है तो ईथन एक धूर्त है। लुकास ने आपको बताया कि अबिगेल एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) विलियम एक शूरवीर है  \n(2) ईथन एक धूर्त है  \n(3) औरोरा एक शूरवीर है  \n(4) एवरी एक शूरवीर है  \n(5) अबिगेल एक शूरवीर है  \n(6) लुकास एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: राइली, ईथन, हेनरी, अलेक्जेंडर, एम्मा, और इसाबेला। राइली ने कहा कि एम्मा एक धूर्त नहीं है। ईथन ने कहा: \"राइली एक धूर्त है या इसाबेला एक शूरवीर है\"। हेनरी के अनुसार, \"राइली एक धूर्त है और एम्मा एक धूर्त है\"। अलेक्जेंडर ने टिप्पणी की, \"ईथन एक धूर्त है और हेनरी एक शूरवीर है\"। एम्मा के शब्दों में: \"ईथन एक धूर्त नहीं है\"। इसाबेला ने टिप्पणी की, \"अगर एम्मा एक धूर्त है तो राइली एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) राइली एक शूरवीर है  \n(2) ईथन एक शूरवीर है  \n(3) हेनरी एक धूर्त है  \n(4) अलेक्जेंडर एक धूर्त है  \n(5) एम्मा एक शूरवीर है  \n(6) इसाबेला एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: अमेलिया, एवा, ओलिविया, ओलिवर, जैक, और एवरी। \"एवरी एक धूर्त है और ओलिवर एक शूरवीर है,\" अमेलिया ने कहा। एवा के शब्दों में: \"जैक एक शूरवीर है\"। ओलिविया ने कहा, \"ओलिवर एक शूरवीर है या अमेलिया एक शूरवीर है।\" ओलिवर ने कहा, \"एवा एक धूर्त है या ओलिविया एक धूर्त है।\" जैक ने आपको बताया कि ओलिवर एक शूरवीर नहीं है। एवरी ने आपको बताया कि एवा एक शूरवीर है या ओलिविया एक धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अमेलिया एक शूरवीर है  \n(2) एवा एक धूर्त है  \n(3) ओलिविया एक शूरवीर है  \n(4) ओलिवर एक शूरवीर है  \n(5) जैक एक धूर्त है  \n(6) एवरी एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: अलेक्जेंडर, एला, औरोरा, हार्पर, एवा, और एमिली। अलेक्जेंडर ने कहा: \"एला एक शूरवीर है या एमिली एक धूर्त है\"। \"हार्पर एक शूरवीर है और औरोरा एक धूर्त है,\" एला ने घोषित किया। औरोरा ने कहा कि एमिली एक शूरवीर है। \"एवा एक शूरवीर नहीं है\" - हार्पर। \"एमिली एक धूर्त है और औरोरा एक धूर्त है,\" एवा ने दावा किया। \"एमिली एक शूरवीर है या औरोरा एक धूर्त है,\" एमिली ने उल्लेख किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) अलेक्जेंडर एक धूर्त है  \n(2) एला एक धूर्त है  \n(3) औरोरा एक शूरवीर है  \n(4) हार्पर एक शूरवीर है  \n(5) एवा एक धूर्त है  \n(6) एमिली एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: क्लोई, जैक, एवरी, माइकल, सेबेस्टियन, और एलिज़ाबेथ। \"एलिज़ाबेथ शूरवीर नहीं है\" - क्लोई। जैक ने कहा, \"सेबेस्टियन शूरवीर है यदि और केवल यदि एलिज़ाबेथ शूरवीर है\"। एवरी को यह कहते हुए सुना गया, \"एवरी शूरवीर है और सेबेस्टियन धूर्त है\"। माइकल के शब्दों में: \"जैक धूर्त नहीं है\"। सेबेस्टियन को यह कहते हुए सुना गया, \"जैक धूर्त है\"। एलिज़ाबेथ ने नोट किया, \"सेबेस्टियन शूरवीर नहीं है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) क्लोई एक शूरवीर है  \n(2) जैक एक धूर्त है  \n(3) एवरी एक धूर्त है  \n(4) माइकल एक धूर्त है  \n(5) सेबेस्टियन एक शूरवीर है  \n(6) एलिज़ाबेथ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ईथन, अबिगेल, सोफिया, याकूब, एवलिन, और पेनलोप। \"सोफिया धूर्त नहीं है,\" ईथन ने घोषणा की। अबिगेल ने कहा, \"पेनलोप धूर्त नहीं है\"। सोफिया ने आपको बताया कि पेनलोप एक शूरवीर है या ईथन एक धूर्त है। जैसा कि याकूब ने कहा, \"ईथन एक धूर्त है या ईथन एक शूरवीर है\"। एवलिन ने व्यक्त किया कि ईथन एक धूर्त है या पेनलोप एक धूर्त है। पेनलोप के एक बयान में: \"ईथन एक शूरवीर है या एवलिन एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक शूरवीर है  \n(2) अबिगेल एक शूरवीर है  \n(3) सोफिया एक शूरवीर है  \n(4) याकूब एक शूरवीर है  \n(5) एवलिन एक धूर्त है  \n(6) पेनलोप एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: यूसुफ, याकूब, स्कारलेट, पेनलोप, लुकास, और लोगन। यूसुफ के अनुसार, \"स्कारलेट एक धूर्त है और पेनलोप एक शूरवीर है\"। याकूब को यह कहते हुए सुना गया, \"लुकास एक शूरवीर है\"। स्कारलेट ने कहा कि यूसुफ एक शूरवीर है और पेनलोप एक धूर्त है। \"लुकास एक शूरवीर है या यूसुफ एक शूरवीर है\" - पेनलोप। लुकास ने कहा कि यूसुफ एक शूरवीर नहीं है। लोगन ने कहा, \"स्कारलेट एक धूर्त नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) यूसुफ एक शूरवीर है  \n(2) याकूब एक धूर्त है  \n(3) स्कारलेट एक धूर्त है  \n(4) पेनलोप एक शूरवीर है  \n(5) लुकास एक धूर्त है  \n(6) लोगन एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: लोगन, ज़ोई, नूह, ल्यूक, सोफिया, और अमेलिया। लोगन को यह कहते हुए सुना गया, \"सोफिया एक धूर्त है यदि और केवल यदि नूह एक धूर्त है\"। ज़ोई के अनुसार, \"लोगन एक धूर्त है और ल्यूक एक शूरवीर है\"। नूह के एक बयान में: \"लोगन एक धूर्त है\"। ल्यूक ने टिप्पणी की, \"यदि सोफिया एक शूरवीर है तो सोफिया एक धूर्त है\"। सोफिया के शब्दों में: \"ज़ोई एक धूर्त है या अमेलिया एक धूर्त है\"। अमेलिया ने कहा, \"अमेलिया एक शूरवीर है या सोफिया एक शूरवीर है।\" तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) लोगन एक धूर्त है  \n(2) ज़ोई एक शूरवीर है  \n(3) नूह एक शूरवीर है  \n(4) ल्यूक एक शूरवीर है  \n(5) सोफिया एक धूर्त है  \n(6) अमेलिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: हार्पर, नूह, इसाबेला, एवा, सैमुएल, और जैक्सन। \"अगर इसाबेला एक शूरवीर है तो इसाबेला एक धूर्त है,\" हार्पर ने कहा। नूह ने कहा, \"अगर हार्पर एक शूरवीर है तो इसाबेला एक शूरवीर है।\" इसाबेला ने कहा: \"जैक्सन एक धूर्त है यदि और केवल यदि हार्पर एक शूरवीर है।\" एवा के शब्दों में: \"जैक्सन एक शूरवीर है।\" सैमुएल ने कहा, \"अगर इसाबेला एक शूरवीर है तो नूह एक शूरवीर है।\" \"नूह एक शूरवीर है या सैमुएल एक धूर्त है,\" जैक्सन ने दावा किया। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) हार्पर एक धूर्त है  \n(2) नूह एक शूरवीर है  \n(3) इसाबेला एक शूरवीर है  \n(4) एवा एक शूरवीर है  \n(5) सैमुएल एक शूरवीर है  \n(6) जैक्सन एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: सोफिया, इसाबेला, लिली, एम्मा, सैमुएल, और एलिज़ाबेथ। सोफिया ने कहा, \"इसाबेला एक शूरवीर है और सैमुएल एक शूरवीर है\"। \"एलिज़ाबेथ एक शूरवीर है,\" इसाबेला ने घोषित किया। लिली ने टिप्पणी की, \"एम्मा एक शूरवीर है और सैमुएल एक शूरवीर है\"। एम्मा ने remarked किया, \"सोफिया एक धूर्त है या एलिज़ाबेथ एक शूरवीर है\"। सैमुएल ने टिप्पणी की, \"अगर सोफिया एक शूरवीर है तो एलिज़ाबेथ एक शूरवीर है\"। एलिज़ाबेथ ने कहा कि लिली एक धूर्त है और इसाबेला एक शूरवीर है। तो कौन शूरवीर है और कौन धूर्त है?",
        "solution_text_format": "(1) सोफिया एक धूर्त है  \n(2) इसाबेला एक धूर्त है  \n(3) लिली एक शूरवीर है  \n(4) एम्मा एक शूरवीर है  \n(5) सैमुएल एक शूरवीर है  \n(6) एलिज़ाबेथ एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ईथन, ल्यूक, ओवेन, ओलिवर, एला, और सोफिया। ईथन के एक बयान में: \"ओलिवर एक धूर्त नहीं है\"। ल्यूक ने कहा, \"अगर सोफिया एक धूर्त है तो ल्यूक एक शूरवीर है।\" \"ल्यूक एक धूर्त है,\" ओवेन ने दावा किया। ओलिवर ने कहा, \"अगर एला एक शूरवीर है तो ओवेन एक धूर्त है।\" एला ने कहा कि ओवेन एक शूरवीर है और एला एक शूरवीर है। \"ओवेन एक शूरवीर है या एला एक धूर्त है,\" सोफिया ने दावा किया। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ईथन एक शूरवीर है  \n(2) ल्यूक एक शूरवीर है  \n(3) ओवेन एक धूर्त है  \n(4) ओलिवर एक शूरवीर है  \n(5) एला एक धूर्त है  \n(6) सोफिया एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: एला, बेंजामिन, पेनलोप, हार्पर, मिया, और एमिली। \"बेंजामिन धूर्त नहीं है,\" एला ने कहा। \"अगर हार्पर शूरवीर है तो बेंजामिन शूरवीर है,\" बेंजामिन ने दावा किया। पेनलोप ने कहा, \"एला धूर्त नहीं है।\" हार्पर के अनुसार, \"पेनलोप शूरवीर है या एला शूरवीर है।\" \"एमिली शूरवीर है या एला शूरवीर है,\" मिया ने दावा किया। एमिली ने कहा कि हार्पर धूर्त है या एला धूर्त है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) एला एक शूरवीर है  \n(2) बेंजामिन एक शूरवीर है  \n(3) पेनलोप एक शूरवीर है  \n(4) हार्पर एक शूरवीर है  \n(5) मिया एक शूरवीर है  \n(6) एमिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ल्यूक, अमेलिया, एमिली, एम्मा, हार्पर, और स्कारलेट। ल्यूक ने टिप्पणी की, \"एमिली एक धूर्त है यदि और केवल यदि ल्यूक एक शूरवीर है\"। अमेलिया के शब्दों में: \"ल्यूक एक शूरवीर नहीं है\"। एमिली के एक बयान में: \"यदि स्कारलेट एक धूर्त है तो अमेलिया एक शूरवीर है\"। एम्मा को यह कहते हुए सुना गया, \"ल्यूक एक शूरवीर नहीं है\"। हार्पर ने आपको बताया कि ल्यूक एक शूरवीर है या स्कारलेट एक शूरवीर है। स्कारलेट ने कहा, \"हार्पर एक धूर्त है या एमिली एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ल्यूक एक शूरवीर है  \n(2) अमेलिया एक धूर्त है  \n(3) एमिली एक धूर्त है  \n(4) एम्मा एक धूर्त है  \n(5) हार्पर एक शूरवीर है  \n(6) स्कारलेट एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: हार्पर, ईथन, एम्मा, लोगन, ओवेन, और ल्यूक। हार्पर के अनुसार, \"एम्मा एक धूर्त है यदि और केवल यदि लोगन एक शूरवीर है\"। ईथन के एक बयान में: \"यदि लोगन एक धूर्त है तो ओवेन एक धूर्त है\"। एम्मा ने कहा: \"यदि ल्यूक एक शूरवीर है तो ओवेन एक धूर्त है\"। लोगन के एक बयान में: \"हार्पर एक धूर्त है यदि और केवल यदि लोगन एक शूरवीर है\"। \"ल्यूक एक धूर्त है और हार्पर एक शूरवीर है,\" ओवेन ने घोषणा की। ल्यूक के शब्दों में: \"एम्मा एक शूरवीर है या ल्यूक एक शूरवीर है\"। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) हार्पर एक धूर्त है  \n(2) ईथन एक शूरवीर है  \n(3) एम्मा एक शूरवीर है  \n(4) लोगन एक शूरवीर है  \n(5) ओवेन एक धूर्त है  \n(6) ल्यूक एक शूरवीर है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: ऐडन, ओलिवर, क्लोई, मेसन, लियम, और लिली। ऐडन ने कहा: \"लियम शूरवीर नहीं है\"। ओलिवर ने कहा, \"ऐडन धूर्त नहीं है\"। क्लोई ने कहा कि मेसन शूरवीर नहीं है। \"ऐडन एक शूरवीर है और क्लोई एक शूरवीर है,\" मेसन ने कहा। लियम के अनुसार, \"ऐडन एक धूर्त है और लिली एक धूर्त है\"। लिली ने कहा कि मेसन एक धूर्त है और मेसन एक शूरवीर है। तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) ऐडन एक धूर्त है  \n(2) ओलिवर एक धूर्त है  \n(3) क्लोई एक शूरवीर है  \n(4) मेसन एक धूर्त है  \n(5) लियम एक शूरवीर है  \n(6) लिली एक धूर्त है"
    },
    {
        "quiz": "एक बहुत खास द्वीप है जो केवल शूरवीरों और धूर्तों द्वारा बसा हुआ है। शूरवीर हमेशा सच बोलते हैं, और धूर्त हमेशा झूठ बोलते हैं। आप 6 निवासियों से मिलते हैं: सेबेस्टियन, जेम्स, डैनियल, ओलिविया, मेसन, और सोफिया। \"यदि जेम्स एक शूरवीर है तो मेसन एक धूर्त है,\" सेबेस्टियन ने कहा। जेम्स ने कहा कि सेबेस्टियन एक धूर्त है यदि और केवल यदि ओलिविया एक शूरवीर है। डैनियल ने कहा, \"मेसन एक धूर्त है और सोफिया एक शूरवीर है।\" ओलिविया ने कहा कि सेबेस्टियन एक धूर्त है या मेसन एक धूर्त है। मेसन ने कहा: \"मेसन एक शूरवीर है या सोफिया एक शूरवीर है।\" सोफिया ने कहा: \"डैनियल एक शूरवीर नहीं है।\" तो शूरवीर कौन है और धूर्त कौन है?",
        "solution_text_format": "(1) सेबेस्टियन एक धूर्त है  \n(2) जेम्स एक शूरवीर है  \n(3) डैनियल एक धूर्त है  \n(4) ओलिविया एक शूरवीर है  \n(5) मेसन एक शूरवीर है  \n(6) सोफिया एक शूरवीर है"
    }
]